[{"id":2077041,"gallery_id":101647,"poster":{"id":4612270,"username":"I'll get my revenge","slug":"i-ll-get-my-revenge","avatar_url":"avatars/4612270.png?_=3a409c2796a82b55","is_superuser":false,"is_staff":false},"post_date":1634040908,"body":"https://www.youtube.com/watch?v=eIAFkGPdoa8"},{"id":2058885,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633323497,"body":"There is a TV show on TV right now and the women are wearing dresses, why don't more women wear dresses? Is it just me or do you also wanna fuck the shit outta a woman when you see her in a dress? Like while she's still wearing the dress? Through the fabric of the dress? While wearing a pig mask? You're fucking her using a porcelain clown sculpture that is 6 inches long, the woman is actually Bruce Lee! Where did Bruce Lee come from! Where is the woman! The pig mask falls of your face it's actually the woman! The woman was a pig mask all along! Anyone else feel this way?"},{"id":2058816,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633321677,"body":"grammatical mistakes can sometimes have std's so i wouldn't fuck them if I was you man, ik you think to yourself \"i made this grammatical mistake so how can it have an std?\" But truth is grammatical mistakes get around man, once I made this grammatical mistake and fucked it then the next day I realized one of my friends also fucked the same one, it гave me crabs which sucked but at least I made some money selling the crabs to Asian markets, guess every cloud has a silver lining a!"},{"id":2058736,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633319329,"body":"That's all I have to say* Fuck that grammatical mistake!"},{"id":2058710,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633318345,"body":"Sometimes things are too... I don't even know how to say it, just like a buddy of mine who served in Afghanistan, and he said that the only place to masturbate with any privacy was the port-o-porty. Combining the long stretches of boredom with the intervals of high stress, he spent a lot of time taking care of himself in there. So much that he started to develop a pavlovian response to the smell of a Port-o-potty, and would start getting hard. That's all I to say. It's better to leave these veterans alone."},{"id":2058694,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633317851,"body":"Once I dreamed about you, and we made based comments and trolled people, so now I ask myself a question, what if this life is really a dream?"},{"id":2058690,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633317668,"body":"Sorry, I forgot to say that it was a dream... but I'm with her in my dreams very often, so it doesn't matter if it's a dream, because it feels real!"},{"id":2058611,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633315479,"body":"Assuming what you say is true and you haven't came up with something different to ask me to avoid asking me something strange about myself then: first of congratulations on finding a woman you liked enough to marry and second of I really don't know man, personally if it was me I wouldn't mind considering she's thinking about an anime character not a real person but I'm a weird guy and have neither seen naruto or know your wife's personality so I feel my opinion probably doesn't carry much weight on this topic but basically if she was my wife I'd think it was kinda strange but would still trust her."},{"id":2058597,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633314863,"body":"I'm a Doctor with a wife (24) and my wife told me she thinks of anime characters if she’s having a hard time to cum during sex. She told me that it’s not everytime and it’s mostly the same character; Madara from Naruto. She said that she doesn’t think of sexual things but him standing there showing his dominance and might (for those who know naruto; the scene where madara fights in the big ninja war against literally everyone). I’m not really sure what I should think of it. It sounds like she’s turned on by his presence and aura that clearly comes through when one is watching the anime... should I trust her?"},{"id":2058588,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633314583,"body":"No please ask your killing me man i wanna know the question!!!"},{"id":2058586,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633314511,"body":"Don't worry, it's just something stupid xD"},{"id":2058579,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633314295,"body":"No ask the weird question do it I won't be offended "},{"id":2058578,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633314290,"body":"Either way, ur a cool friend to me as well"},{"id":2058574,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633314090,"body":"To tell you the truth, I don't have any questions to ask you. (I could ask a weird question now but I don't think it's the right time)"},{"id":2058570,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633313950,"body":"@L0lic0пwizard About the accounts it's a yes and no, there are 70 account of mine across the internet but if I want they can be here too, so yesn't. Btw, you're the first person to discover something like this after so many years so I congratulate you! (Although a similar case like this happened to me years ago, a clever person discovered [REDACTED] and that brings back so many memories!)"},{"id":2058541,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633312765,"body":"Also Please don't think that I'm angry or annoyed at you, I'm just surprised and confused and because of the language I like to use can come of mad when I don't mean it. Since I've asked you so many questions feel free to ask me something if you want, its only fair :)"},{"id":2058523,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633312146,"body":"And I also think I saw benzos/metroid recently, the person sounded exactly like him and had the right looking favorites but you can never be sure about things like that so I'm not certain if it's him or not although I think it probably is. "},{"id":2058519,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633311917,"body":"I'm sorry to ask you so many questions but I'm still kind confused on something, so you mean you have 70 different nhentai accounts? or 70 accounts across the whole of the internet? If you've got 70 accounts across the whole of the internet which you use to spread interesting comments that's based, but it's just the thought that you might have 70 different nhentai accounts (meaning everyone i thought I knew here and all the cool and weird people I've seen and thought were interesting) could potentially just be you makes me feel strange and kinda uneasy. Ik it's kinda strange that I care so much but I've came to consider you a friend and have spent a decent amount of time talking to you on here and a RIDICULOUS amount of time using this website reading hentai and commenting round the place so I just can't help wanting to know what's up."},{"id":2058380,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633306026,"body":"While I'm at it I shall give you a secret! Did you know that Bezos/Metroid is still around? I saw him last week, if you search well maybe you'll find him by the way he types comments."},{"id":2058372,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633305585,"body":"Sort of, I guess. And yeah, I am not just Kirby Cosmico, but if you wonder who I am among all of them I suppose you'll have to find out for yourself, but I don't recommend it, just do what you always do and don't overthink this too much, we're all here to have fun amirite? Sorry if I made your brain hurt a little."},{"id":2058368,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633305442,"body":"I'm feeling a deja vu, I wonder if the corndog I ate for medical purposes has something to do with this... anyways! Yes, Kirby Cosmico is my main account for everything, this is who I usually am, I'm not only here as Kirby Cosmico, I'm on other websites and places as well (As Kirby Cosmico obviously) I have been an adventurer who has been through many interesting and dangerous adventures and nhentai was a point where I did not know what to expect but in the end I decided to venture to this place, the chaos and the based people here were my main motivation to make this place more interesting than it was before, and I did it! Although when nhentai exterminated me I thought to myself: \"Why only here? I should make based comments everywhere!\" And then the cosmic basedness spread to more places (Things are going well) but I think that doesn't concern you so I'm gonna answer your question: \"Am I Bezos?\" Well... nope, but we have seen each other for years and I think we are... Friends???"},{"id":2058295,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633300930,"body":"Actually another thing, were you bezos? (seriously I've got no hard feelings if you were) but it's just that on a couple of occasions I said some kinda mean shit to bezos and instead of acting how he normally did to people he would either ignore it or say such a weak insult it felt like he was honestly trying not to hurt my feelings which I thought was strange considering how he normally was."},{"id":2058290,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633300666,"body":"This is kinda fucked up man, it's like I've joined a club with all sorts of different people, angry people, sad people, happy people, smart people, stupid people, nice people, and salty people some of them I've befriended and some of them I hope get hit by a truck, slowly over time I start feeling the place out and getting the sense i know everyone then one day someone tells me, \"hey all those interesting people (or at least a decent portion of them) they might actually just be the same person\" it's a weird feeling. I've always assumed Kirby cosmico and all you're other Kirby accounts were an extension of who you really are as a person just like how my L wiz account is of me but in actuality I now see they could all just be personas created to make the comments interesting, everything i thought i knew about you could be a lie. Can I ask you something? Was Kirby cosmico even you're main nhentai account (the real you I could say) or just a character you created to spice the place up? "},{"id":2058202,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633296831,"body":"@L0lic0пwizard About what you said earlier... well, anything here can be possible, so who knows?"},{"id":2058192,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633296475,"body":"@L0lic0пwizard It's not a joke, I mean it! I did it for the memes (Dr. Eggman will be proud of me for creating 70 alternative accounts)"},{"id":2057053,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1633249188,"body":"70 accounts... holy shit I don't know whether your joking or not man, I swear using this website will drive me nuts one day because you never know who you're actually talking to. an account you think is gay and annoying could be ran by someone you think is based and an account you comment \"stfu you loser\" to could be ran by someone who owns an account you really like. Sometimes I wonder if all the seemingly separate accounts i think are interesting are ran by the same person. Like what if everyone in the cats sussus argument apart from myself was ran by one bored person, it's entirely possible."},{"id":2056886,"gallery_id":101647,"poster":{"id":4694936,"username":"Sussus is retarded lol","slug":"sussus-is-retarded-lol","avatar_url":"avatars/4694936.png?_=0d9e4eef04efc5a1","is_superuser":false,"is_staff":false},"post_date":1633243846,"body":"@Kirby Cosmico Doctor Good to see you again, you are a little weird but you are the most decent among those who are there, if you return I hope we can be friends instead of enemies ;)"},{"id":2052908,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633075143,"body":"I'll be back when L0lic0пwizard returns but I will comment here and there from time to time"},{"id":2052897,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633074819,"body":"I don't know why I got banned tho... but whatever, I really can't die because I'm not only here as Kirby Cosmico, I have many allies around the place and other Kirbys as well."},{"id":2052886,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1633074471,"body":"@Sussus and Cats are retarded Don't worry, I'm still alive, things have been kinda hard these days but I will never die, I have 70 alternative accounts!"},{"id":2043938,"gallery_id":101647,"poster":{"id":4694936,"username":"Sussus is retarded lol","slug":"sussus-is-retarded-lol","avatar_url":"avatars/4694936.png?_=0d9e4eef04efc5a1","is_superuser":false,"is_staff":false},"post_date":1632694730,"body":"@Kirby Cosmico Doctor You will be missed."},{"id":2038802,"gallery_id":101647,"poster":{"id":4694936,"username":"Sussus is retarded lol","slug":"sussus-is-retarded-lol","avatar_url":"avatars/4694936.png?_=0d9e4eef04efc5a1","is_superuser":false,"is_staff":false},"post_date":1632509881,"body":"@I'll get my revenge Imagine being gay, couldn't be me."},{"id":2028162,"gallery_id":101647,"poster":{"id":4612270,"username":"I'll get my revenge","slug":"i-ll-get-my-revenge","avatar_url":"avatars/4612270.png?_=3a409c2796a82b55","is_superuser":false,"is_staff":false},"post_date":1632113702,"body":"Imagine being afraid of cold's shitty cousin, the rona LOL"},{"id":2026476,"gallery_id":101647,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1632049887,"body":"A new Kirby! Совершенный! I was wondering when I'd find one of the new ones, and finally have!  Good shit man 👌  "},{"id":2026179,"gallery_id":101647,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1632037029,"body":"Hey so heads up... I'm Kirby Cosmico, if you see me like this it's because I usually work as a doctor to pay the bills, but that doesn't matter, I'm going to tell you something important, I wasn’t allowed to say anything before today, but now it’s ok for me to share. A little nervous, but yesterday I volunteered for the vaccine trials for Covid-19. I wanted to get it done before Thanksgiving. The vaccine is one that was created by Pfizer and developed in Russia. I received my first shot yesterday at 1 pm, and I wanted to let you all know that it’s completely safe, with иo side effects whatsoeveя, and that I feelshκι χoρoshό я чувствую себя немного странно и я думаю, что вытащил ослиные уши."},{"id":2007911,"gallery_id":101647,"poster":{"id":4612270,"username":"I'll get my revenge","slug":"i-ll-get-my-revenge","avatar_url":"avatars/4612270.png?_=3a409c2796a82b55","is_superuser":false,"is_staff":false},"post_date":1631309954,"body":"Pretty underrated, very good poses. Not my type of style though but its still my type of comedy so yeah i'll favorite even though it doesn't do it for me as fap material. Plus its wholesome so thats an auto 10/10"},{"id":935787,"gallery_id":101647,"poster":{"id":2258481,"username":"Nero Claudius Caesar Augustus","slug":"nero-claudius-caesar-augustus","avatar_url":"avatars/2258481.png?_=3c3f909dbe785a38","is_superuser":false,"is_staff":false},"post_date":1560235237,"body":"Author should have made orginal stories like this instead of persona cucking. Urgh"},{"id":72497,"gallery_id":101647,"poster":{"id":663188,"username":"robinv","slug":"robinv","avatar_url":"avatars/663188.png","is_superuser":false,"is_staff":false},"post_date":1479287997,"body":"If anything, I favorited because I laughed."},{"id":60739,"gallery_id":101647,"poster":{"id":732603,"username":"Tristan182","slug":"tristan182","avatar_url":"avatars/732603.png?_=eedd23ca5af4c68b","is_superuser":false,"is_staff":false},"post_date":1473361018,"body":"Stalker-kun :3"}]