[{"id":2141727,"gallery_id":102315,"poster":{"id":4131879,"username":"hentaimitah","slug":"hentaimitah","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636831417,"body":"You guys simply don’t understand the shame culture in Japan. It is basically social suicide to have your pictures on the internet in an indecent way. Your family members, your neighbors, and the greater community now would have seen your private parts. And you will be enter shamed or embarrassed for doing so. It doesn’t take a genius to consider just how coercive that is within context."},{"id":1993444,"gallery_id":102315,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1630758923,"body":"ya know I never got the whole telling the husband thing cus you're asking to be broke with a dumb bitch in this sitatuion with all that compensation shit they'll have to give (thought I guess they just whore out the bitch in some cases)"},{"id":1283008,"gallery_id":102315,"poster":{"id":1699643,"username":"Gley","slug":"gley","avatar_url":"avatars/1699643.png?_=d59deb26456b7a3c","is_superuser":false,"is_staff":false},"post_date":1603192501,"body":"Well, the whole point is that she doesn't want her husband to know, so going to the police is kinda..."},{"id":920726,"gallery_id":102315,"poster":{"id":1329638,"username":"rabrob","slug":"rabrob","avatar_url":"avatars/1329638.png?_=bf6161dca8bb1b1b","is_superuser":false,"is_staff":false},"post_date":1559175488,"body":"I love how almost every blackmailing in hentai could easily be solved by the victim just going to the police. \"Hey, this guy is blackmailing me into having sex with him thru taking creepshots of me when I was unaware! And he's got the evidence on his phone!\" Is it really that hard?"},{"id":59750,"gallery_id":102315,"poster":{"id":189041,"username":"lovehentai5567","slug":"lovehentai5567","avatar_url":"avatars/189041.png","is_superuser":false,"is_staff":false},"post_date":1472817841,"body":"This is not really an ntr, the husband's face isn't shown and his story isn't told, so, just rape and cheating."}]