[{"id":1584439,"gallery_id":103335,"poster":{"id":1810824,"username":"keiradeadgirl","slug":"keiradeadgirl","avatar_url":"avatars/1810824.png?_=7338c51599a85876","is_superuser":false,"is_staff":false},"post_date":1614191635,"body":"I know it’s the point of the story, but I need to know if it really happened and if it’s his baby or not, I’d love to see a 6 years later epilogue, it was the brother’s baby, they got a divorce she lives the brother, he has great job, they’re raising their kid and fucking like rabbits at every possible time and they probably have second kid and she is pregnant with the third... well that’s is how it is in my head cannon lol"},{"id":949381,"gallery_id":103335,"poster":{"id":783370,"username":"dragonseller","slug":"dragonseller","avatar_url":"avatars/783370.png","is_superuser":false,"is_staff":false},"post_date":1561229089,"body":"Idiot NTRed himself with his own dirty imagination. Not once is it stated that Shu has designs on Nozomi and as far as the baby's concerned, he is not a clone, of course it won't look exactly like him (they don't always do). Idiot."},{"id":146286,"gallery_id":103335,"poster":{"id":682267,"username":"cocozin","slug":"cocozin","avatar_url":"avatars/682267.png","is_superuser":false,"is_staff":false},"post_date":1501289961,"body":"esse autor é doente o cara tem fetiche por traição "},{"id":61392,"gallery_id":103335,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1473647631,"body":"I think it is not possible to know in full details if the wife is cheating on her husband or not... We know the wife is behaving perfectly properly in public, however the husband imagines her doing all sorts of dirty things, and in the end, the husband wonders if it's normal that his (fugly) baby doesn't resemble him entirely."},{"id":47768,"gallery_id":103335,"poster":{"id":30317,"username":"est430","slug":"est430","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1465257042,"body":"i bet his work is hentai artist his imagination is unbelievable."}]