[{"id":310273,"gallery_id":111723,"poster":{"id":798009,"username":"Darkwatcher10","slug":"darkwatcher10","avatar_url":"avatars/798009.png","is_superuser":false,"is_staff":false},"post_date":1507995190,"body":"AND THAT IS WHY IF YOU ASK FOR TRANSLATIONS YOU WILL DIE. Unappreciative Twats. For Reference, try searching this entire list by Eye: \"www.japanese-lesson.com/characters/kanji/index.html\". OH LOOK, I MADE A MISTAKE WHILE TRANSLATING. It's actually Me not Ma on the first word. Great. Regardless, have this for anyone that needs it: \"www.saiga-jp.com/kanji_dictionary.html\", if you click 'open panel' you can search for Kanji by the pieces they're made of. My mind is blown all over the floor. In conclusion, with a little google translate help: \"Meru(ko)no On(Kaesu)shi\" Obviously I'm guessing on the Kanji because Kanji. But based on pages 37-38, I think its safe to say the slug came back as a girl to repay him for not killing her with that spray bottle. I'm going to curl up in a ball and cry now instead of having a fap. Someone better get some use out of this."},{"id":310262,"gallery_id":111723,"poster":{"id":798009,"username":"Darkwatcher10","slug":"darkwatcher10","avatar_url":"avatars/798009.png","is_superuser":false,"is_staff":false},"post_date":1507993446,"body":"Oo, I recognize most of these! Okay lets see...Horitomo is clearly the first, with \"Have you seen my body\"...Then we've got Kuroshiki with \"Tokimeki Sabbath\", and then that leaves Majoccoid with... I don't recognize this one. Hm.\nMa'ru'_'no _'_'shi.\nGreat. It's a buncha farking Kanji. Alright, whatever, I'm studying Japanese anyway. time to grind my face on the pavement.\nGot lucky, a Japanese 'used daily list' of kanji on a website that actually had copy-paste compatible characters. One Kanji dictionary later:\nMa'ru'(ko/shi/tsu)'no. Yes, there are apparently three ways to read that ONE FUCKING KANJI, yay kanji.\nThat second one literally has two complex kanji side by side. Fuck ma life. Okay, brute forced it, found the first one in the 'used daily list' of Japanese kanji, put it in a dictionary for kanji, IT ONLY HAS ONE READING PRASE THE JESUS. \"on\". One..character..left. HELL YES MY GOOGLE-FU IS THE BEST, FOUND SOMETHING THAT SEARCHES KANJI IN PIECES. On'(hen/kaeru/kaetsu)'shi. DONE."}]