[{"id":2265271,"gallery_id":115908,"poster":{"id":4979577,"username":"NHentaku","slug":"nhentaku","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1642204116,"body":"As a scientist I can confirm that you can never have enough data.\n\nAs it appears here the teacher is timing some students with and some students without a swimsuit he will probably calculate the average speed of both groups to determine the effect of the swimsuit. However since the groups are so small the uncertainties would be quite high therefore it would be hard to conclude anything from the collected data.\n\nIn order to improve the accuracy of the results and determine the differences between swimsuits and swim shorts without being biased by the difference between girls and boys each student should be measured with a swimsuit, with swim shorts and naked.\n\nThen instead of taking the average of each group i propose to determine the increase in swimming speed for each student separately while using their naked time as a baseline."},{"id":2265267,"gallery_id":115908,"poster":{"id":4979577,"username":"NHentaku","slug":"nhentaku","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1642203920,"body":"In order to reduce the effects of strain in the measured data it would be beneficial to measure the students one at a time ensuring that the resting students get their optimal amount of rest by sitting at the side of the pool without any physical activity while watching the other students swim to prevent boredom.\n\nTo further eliminate the effects for each student it should be randomly chosen whether they start with a swimsuit, swim shorts or naked. Then when the measurements are repeated on different days the starting configuration should be cycled.\n\nIt is absolutely necessary to ensure that the students don't take part in any sexual activities during the resting periods as this would further increase exhaustion instead of reducing it. After the measurements are done for the day the students should be allowed to act freely in order to deal with any stress that might have built up during the tests. "}]