[{"id":2501464,"gallery_id":121261,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1651655270,"body":"@ogelevil259 You skipped over my comment pointing out that the likelihood his little amount of money/pay far surpasses anything the mother is making and of course \"his potential\" is how they will make it! He's a teacher now yeah, but with a family and baby on the way! He'll be pushing to get better paying work in his career! What the mother wanted was \"a young up and comer who will grow in his career in time, but also is making a decent amount and get her and her daughter out of that run down shack they live in currently\" She's not expecting a mansion or penthouse! Just better living then previously for her and her daughter! Helps daughter likes teacher already and so does she, hence the baby trapping! It would be a plot hole that she and her daughter bagged a much richer man even if mom's hot then one who was easier to access like the teacher, good in the shack, and has a sense of responsibility so the baby trap and pushing him to better his career for better living conditions works!)"},{"id":2019935,"gallery_id":121261,"poster":{"id":3894717,"username":"mailforporn","slug":"mailforporn","avatar_url":"avatars/3894717.png?_=e366df25822169ab","is_superuser":false,"is_staff":false},"post_date":1631788087,"body":"the contrast between those sparkly innocent eyes and the sexy nude bottom... is this what \"gap moe\" means?"},{"id":1816482,"gallery_id":121261,"poster":{"id":2663378,"username":"ogelevil259","slug":"ogelevil259","avatar_url":"avatars/2663378.png","is_superuser":false,"is_staff":false},"post_date":1624087275,"body":"This is actually surprisingly good storytelling. Well, besides the obvious plot hole of expecting a high school teacher to actually have money."},{"id":1444698,"gallery_id":121261,"poster":{"id":3204428,"username":"HolidayMan","slug":"holidayman","avatar_url":"avatars/3204428.png?_=ce36e0cef185f21c","is_superuser":false,"is_staff":false},"post_date":1609310797,"body":"@LordCellofEarth9 Fire explanation, gotta respect you on this one\n"},{"id":877711,"gallery_id":121261,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1555538541,"body":"@Dolaver to be fair, seeing where they lived, what he'll make will be enough to live FAR more decently then what shack their living in. And now having the motivation to take care of \"his new family\" (Wife, Child on the way, and Stepdaughter), he'll be pushing to move up in his career as much and as fast as possible to make more money to support them. It's the whole \"seed growing\" thing which the mother is thinking of (Yeah his pay grade now is low...likely MUCH better then what she and her daughter are \"getting by on\", but he's young and looks like he'll grow in his career as a teacher as time passes, remember that the pay teachers in another country make can be completely different then what it is here in the states). Which was why they targeted him (Daughter looked like she liked him as her teacher, and wouldn't mind him as her \"stepfather with benefits\"). MILF's not going for child support like you're likely thinking."},{"id":737647,"gallery_id":121261,"poster":{"id":1723058,"username":"Dolaver","slug":"dolaver","avatar_url":"avatars/1723058.png","is_superuser":false,"is_staff":false},"post_date":1542737500,"body":"\"money\" from a young teacher. Lol they are dumb"},{"id":528645,"gallery_id":121261,"poster":{"id":1343863,"username":"Jabby","slug":"jabby","avatar_url":"avatars/1343863.png","is_superuser":false,"is_staff":false},"post_date":1528258558,"body":"Hey they’re pretty smart"},{"id":70363,"gallery_id":121261,"poster":{"id":759740,"username":"KaynemPro","slug":"kaynempro","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1478264622,"body":"he fell on their trap haha, it was very obvious when the daughter didn't let him cum on her.\r\nat least mc get to have sex with daughter afterwards while mother has to breastfeed the baby. lol"},{"id":67588,"gallery_id":121261,"poster":{"id":514439,"username":"Gabriel=D","slug":"gabriel-d","avatar_url":"avatars/514439.png","is_superuser":false,"is_staff":false},"post_date":1476753778,"body":"haahahahahah thats great, that cheap woman having sex with him just to get his money hahahahah hilarious."},{"id":46618,"gallery_id":121261,"poster":{"id":560946,"username":"DanteΩ","slug":"danteo","avatar_url":"avatars/560946.png","is_superuser":false,"is_staff":false},"post_date":1464385737,"body":"Poor woman has sex with teacher=pregnancy=child support $$"}]