[{"id":2532427,"gallery_id":134179,"poster":{"id":5197653,"username":"CionniRea","slug":"cionnirea","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652824769,"body":"Oh, that's how they passed from the Z4 to the AMG"},{"id":1940351,"gallery_id":134179,"poster":{"id":1990793,"username":"Quattro Bajeena","slug":"quattro-bajeena","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628780817,"body":"The fuck is that advanced autism down below? "},{"id":124580,"gallery_id":134179,"poster":{"id":747023,"username":"OrewaRapeMan","slug":"orewarapeman","avatar_url":"avatars/747023.png","is_superuser":false,"is_staff":false},"post_date":1496162453,"body":"Calm down Satan    v"},{"id":56656,"gallery_id":134179,"poster":{"id":687355,"username":"?h7M0iqA3","slug":"h7m0iqa3","avatar_url":"avatars/687355.png","is_superuser":false,"is_staff":false},"post_date":1470805302,"body":"Its interesting how despite how depraved this manga and his creator are they somehow managed to portray a woman who despite her well-based insecurities still has the courage to dump a garbage male ruler at the end."},{"id":56653,"gallery_id":134179,"poster":{"id":687355,"username":"?h7M0iqA3","slug":"h7m0iqa3","avatar_url":"avatars/687355.png","is_superuser":false,"is_staff":false},"post_date":1470805102,"body":"The little human-looking roach here wants his mucuses to be highly respected and all swallowed up by a an entity that he recognizes as strikingly beautiful, this being part of a degradation that she highly enjoys somehow.  Next the  roach who created this manga, doujinshi or whatever claims to be a fan of her, Hatsune Miku. How about porn where men swallow women menstruation \"juices\" and blood clots? A bloody stuff spread all over your repulsive faces. You should enjoy it as much as women in porn/hentai enjoy being urinated. I must be really damn original since I don't see this feature anywhere.\r\n\r\nHow is it that you guys who create and/or enjoy this garbage don't realize how deep your depravity and self-degradation has reached? Please heal your hatred and fear of women and sex and wipe yourselves off from this poor world."}]