[{"id":1384244,"gallery_id":137457,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1607133289,"body":"The worst thing is that there are people who masturbate on hentai of this type and even on the \"fictitious\" rape of the heroines they say they love, it disgusts me ! The place of exacerbated perverts in your genre is in the hell of the pigs. Where you will be fucked and tortured for eternity by hideous demons worthy of you. Author I invite you to go buy yourself a rope and a stool to hang yourself by the head, it will make our society safer. It pleases you to degrade the image that people have of their favorite characters and well I wish you all the misfortune of the world. Farewell."},{"id":1384237,"gallery_id":137457,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1607133133,"body":"You really have to be a sleeping criminal to create such an atrocity! A kind of victim who was mistreated by others in his youth and who, out of weakness, attacks someone weaker than himself to regain his miserable cowardly manhood without any genuine pride. Play as much as you want with your muscles and your big cock, alpha males are sub-men after all. They are unbridled cattle with a dick in place of a brain, enslaved by their hormones and not even having the strength to control their primary impulses, so dependent on their testosterone are these mangy dogs. In short, you're no better than those who excite you to imitate animals. And there is nothing more rewarding than to turn a common ox like you into a frightened virgin, you who think you are so strong. Your real face is pathetic."},{"id":1297190,"gallery_id":137457,"poster":{"id":1610581,"username":"Mrs.Lolicon-san","slug":"mrs-lolicon-san","avatar_url":"avatars/1610581.png?_=5aa289764655f7b4","is_superuser":false,"is_staff":false},"post_date":1603767243,"body":"Ah yes, rape and ntr but with no guilty feeling because of the trash anime it based off, nise."},{"id":481562,"gallery_id":137457,"poster":{"id":1488874,"username":"ŤĀØ","slug":"tao","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1526283136,"body":"Waiting for english versiin\n"},{"id":4885,"gallery_id":137457,"poster":{"id":34199,"username":"NullHorizon","slug":"nullhorizon","avatar_url":"avatars/34199.png","is_superuser":false,"is_staff":false},"post_date":1435873807,"body":"lol ikr? I was waiting for SOMEONE to do works involving girls other than Hestia. (...I'm still waiting...) I mean, Hestia is really nice, but the other women deserve some appreciation too, y'know?"},{"id":4737,"gallery_id":137457,"poster":{"id":127578,"username":"rando","slug":"rando","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1435286049,"body":"There are other girls besides Hestia in Danmachi??"}]