[{"id":1562783,"gallery_id":145223,"poster":{"id":2435927,"username":"TheBlondofParakeetKey","slug":"theblondofparakeetkey","avatar_url":"avatars/2435927.png?_=506c4102075162c4","is_superuser":false,"is_staff":false},"post_date":1613232097,"body":"The Spy-cicle is a community-created melee weapon for the Spy. It is a long, translucent, light blue icicle. The weapon gives off mist in third-person view.\n\nWhilst having the same damage and speed capabilities as the Knife, victims will turn into solid ice when backstabbed, similar to the golden statue effect from Australium-infused weapons. Enemies will not turn into ice statues if killed via a standard melee swing.\n\nWhen backstabbed, a unique sound of ice freezing will be produced, allowing alert players to notice the presence of the Spy. Unlike other Knives, enemies killed with a backstab from this weapon will always perform their unique backstab death animation, causing them to freeze in a pose (unless they are killed in midair).\n\nIf the Spy is hit by fire with the weapon active, the Spy-cicle will melt and instantly extinguish the Spy while rendering him immune to any further fire for 1 second, and afterburn for 10 seconds. The effect is fast enough that a Cloaked Spy will remain"},{"id":445129,"gallery_id":145223,"poster":{"id":314769,"username":"Doujin_Man","slug":"doujin_man","avatar_url":"avatars/314769.png?_=4b44e2ede5581a01","is_superuser":false,"is_staff":false},"post_date":1526087232,"body":"Couldn't fap to it, since I'm not into traps, but man it was kinda nice. If only it were a girl..."},{"id":146607,"gallery_id":145223,"poster":{"id":755058,"username":"FOAMgiant","slug":"foamgiant","avatar_url":"avatars/755058.png","is_superuser":false,"is_staff":false},"post_date":1501383641,"body":"The first true AI is created, and we ask it \"What is the meaning of life to you?\"\nIt does not hesitate, and responds with \"Traps\""},{"id":25198,"gallery_id":145223,"poster":{"id":34933,"username":"connorscott53","slug":"connorscott53","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1443463551,"body":"lolicat85 your thinking of tomboy thats a girl but tomgirl is a boy"},{"id":25184,"gallery_id":145223,"poster":{"id":46469,"username":"lolicat85","slug":"lolicat85","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1443420864,"body":"tomgirl? where's the girl?"}]