[{"id":948608,"gallery_id":146862,"poster":{"id":2530067,"username":"hgfdfcv8","slug":"hgfdfcv8","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561173188,"body":"Her thighs wrapped around his waist, Moving up and down, her butt hitting zastin's dick, her belly pushed against him,and shoving zastin's head towards her breasts. With riko now infatuated with him, nemesis still being watched over, riko permanently a girl, and always wanting a sexy schoolgirl to bang and eventually get married to, zastin then grabs riko's bottom and starts to pound her, then grabbing her by the legs and drive into her, getting used to his new life."},{"id":948592,"gallery_id":146862,"poster":{"id":2530067,"username":"hgfdfcv8","slug":"hgfdfcv8","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561172627,"body":"Falls unconscious on top of riko. After waking up, zastin finds himself in his bed, wondering if what happened was nothing more than a dream. He wakes up to find riko dressed up in an open button up shirt which concealed her boobs and white panties (like momo's pajamas). Riko's thighs, butt, crotch (all covered by her panties), and belly button were above zastin's face, her body covered with sweat, licking zastin's penis while also feeling his abs. Zastin jumped out of bed, wondering why riko was still here and why she was doing this. Nemesis then pops out of riko's belly button, telling zastin that his semen didnt turn riko back to normal or set nemesis free, rather it made riko permantly a girl, gave her the personality of both momo and an immature schoolgirl, and made her fall in love with him. Zastin tries to beg nemesis to undo everything so that he can go back to writing his manga, but she goes back inside riko's body. Riko proceeds to sit on zastins lap, stretching her legs out,"},{"id":948578,"gallery_id":146862,"poster":{"id":2530067,"username":"hgfdfcv8","slug":"hgfdfcv8","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561171546,"body":"Zastin continues to remove his clothes, becoming butt naked in front of riko. He then prepares them both for sex in order to release nemesis from riko. Riko then unstraps her bra, letting her boobs jiggle and be free. Once zastin saw her breasts, he lunged toward riko, falling over on her back. Riko's breasts were now pressed against zastin's hard chest, her soft belly and belly button pushed against zastin's, her panties being rubbed by zastin's dick, and her butt being on the cold floor. Zastin proceeds to tease riko himself, by rubbing her boobs, licking her belly button, and removing her panties to lick her pussy. Riko, now developing romantic feelings, decided to also make zastin good by giving him a boob job, a blow job, a butt job, and licking his nipples. Zastin then bangs riko several times, each in various positions. Nemesis felt amazed at the couple's energy, thinking of zastin as the perfect husband for riko. After around 6 hours of nothing but love making, zastin then"},{"id":948561,"gallery_id":146862,"poster":{"id":2530067,"username":"hgfdfcv8","slug":"hgfdfcv8","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561170312,"body":"Im gonna continue this cause its pretty funny, only that riko should wear white panties. him and zastins hands on riko's waist, riko above zastin with her boobs swaying above zastin's face and his knee digging into her crotch, riko sitting on zastin's lap and wrapping her legs around him while his head is under her shirt, riko boobs being on top of zastin's head, and so many other lewd acts. After a while, zastin realizes that riko is doing this to dustract him from writing his manga because nemisis is making her act like a realschoolgirl. . Once riko lifts her shirt up, revealing her bra in order to get his attention, zastin grabs her and engages in a passionate kiss. Riko blushes, now feeling horny thanks to nemesis's influence, zastin's kiss, and all the lewd acts. While kissing, zastin pulls down riko's skirt, showing her white panties. He also continues to lift up her shirt, fully revealing her bra. Now that riko was acting as a schoolgirl, he could now have sex with a schoolgirl."},{"id":948491,"gallery_id":146862,"poster":{"id":2529891,"username":"6uhvxs59","slug":"6uhvxs59","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561164167,"body":"In the next visit, riko brings nemesis, who still rests within riko's body. In order to set riko free, she asks for zastin to have sex with her so that she can feel both the pleasure of a woman and be able to see a dick. When zastin refuses, riko strips down to her bra and panties. Nemesis then suddenly clothes riko with a schoolgirl uniform, only that riko's shirt was shorter which meant that her entire stomach and belly button, her underboob was noticable, and her skirt was shorter which revealed her panties and thighs. Nemesis, in order to seduce zastin, made riko very clumsy by running into zastin. This creates a bunch of lewd acts, including riko landing her butt on zastins face while also placing her hands on zastin's pants, zastins face and hands being close to riko's front, zastin licking riko's belly button while also grobing her boobs and butt, zastin lifting riko's skirt up which revealed her bright pink panties, zastin's head being shoved at riko's boobs and riko hugging "}]