[{"id":2178538,"gallery_id":148330,"poster":{"id":4712770,"username":"Kirby Cosmico Mexicano","slug":"kirby-cosmico-mexicano","avatar_url":"avatars/4712770.png?_=be4d8df6b32ff5a9","is_superuser":false,"is_staff":false},"post_date":1638571687,"body":"I saw the argument and I gotta say that it was very entertaining ngl, but damn... it had to be a Danganronpa fan! I've met some of them and sometimes they are quite toxic and annoying so I'm not surprised in the slightest, at least 2hou enjoyers are pretty chill and it's one of the few fandoms I'm proud to be a part of"},{"id":2177641,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638528747,"body":"Well regardless of weather or not they're yours I'm not gonna fight with them. Anyway, Cheers to a long and furtfull future of us making the comments more entertaining! I've had a lot of fun talking with your many accounts here"},{"id":2177633,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638528423,"body":"Btw if you are behind the Metroid accounts i want you to know I'm gonna leave them alone as long as they leave me alone, I've fucked with them once or twice before but I'm not gonna do it anymore out of respect for the considerable power you have here. "},{"id":2177629,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638528024,"body":"351461 the fight with underwear faggot is here you'll probably find it entertaining I'm over it now but he pissed me of real bad at the time haha "},{"id":2177619,"gallery_id":148330,"poster":{"id":4712770,"username":"Kirby Cosmico Mexicano","slug":"kirby-cosmico-mexicano","avatar_url":"avatars/4712770.png?_=be4d8df6b32ff5a9","is_superuser":false,"is_staff":false},"post_date":1638527264,"body":"And thanks for your advice toaster man, I'll keep that in mind!"},{"id":2177612,"gallery_id":148330,"poster":{"id":4712770,"username":"Kirby Cosmico Mexicano","slug":"kirby-cosmico-mexicano","avatar_url":"avatars/4712770.png?_=be4d8df6b32ff5a9","is_superuser":false,"is_staff":false},"post_date":1638527012,"body":"The good thing is that now we have experience in these environments and we know how to act in those situations"},{"id":2177608,"gallery_id":148330,"poster":{"id":4712770,"username":"Kirby Cosmico Mexicano","slug":"kirby-cosmico-mexicano","avatar_url":"avatars/4712770.png?_=be4d8df6b32ff5a9","is_superuser":false,"is_staff":false},"post_date":1638526877,"body":"That story about that underwear faggot is interesting, it tells us how crazy this website can be, I wonder if that person is still trolling somewhere"},{"id":2177604,"gallery_id":148330,"poster":{"id":4712770,"username":"Kirby Cosmico Mexicano","slug":"kirby-cosmico-mexicano","avatar_url":"avatars/4712770.png?_=be4d8df6b32ff5a9","is_superuser":false,"is_staff":false},"post_date":1638526448,"body":"I love to hear your theories about stuff like that, and that's why I love this place, because anything here goes as you said back then, and speaking about Metroid... well, who knows! I'm usually a kind person to everyone but I can also get serious and not so friendly if someone deserves it. So it's up to you to make your own conclusions, although I think I would do something like what Metroid does in my spare time if I was bored xD"},{"id":2177598,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638526010,"body":"One thing I am nearly certain of though is that the underwear faggot I got in a fight with when I was new here was someone's alt account which is interesting for me to think about now that I'm more wise in the ways of this place."},{"id":2177594,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638525686,"body":"But as with everything here nothing is for certain, that's something I didn't fully grasp the true extent of when I first came here."},{"id":2177590,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638525448,"body":"Yeah it would be pointless if you didn't change your personality at a bit a. to be honest I'm still not sure weather or not your the person behind Metroid and his accounts, if you are I've really gotta hand it to ya you've done well changing your personality grammar and time frames which your different accounts are active in. The main thing that keeps me from thinking that your him is with all your accounts i spot you seem like a nice person but there is a lot of anger in most of his accounts."},{"id":2177587,"gallery_id":148330,"poster":{"id":4712770,"username":"Kirby Cosmico Mexicano","slug":"kirby-cosmico-mexicano","avatar_url":"avatars/4712770.png?_=be4d8df6b32ff5a9","is_superuser":false,"is_staff":false},"post_date":1638525342,"body":"It's interesting to hear what you said about Metroid, I think I found some of them too but I won't say anything either, because it's thanks to people like him that this place is more interesting! "},{"id":2177583,"gallery_id":148330,"poster":{"id":4712770,"username":"Kirby Cosmico Mexicano","slug":"kirby-cosmico-mexicano","avatar_url":"avatars/4712770.png?_=be4d8df6b32ff5a9","is_superuser":false,"is_staff":false},"post_date":1638525050,"body":"That's impressive, you sure are quite talented to have found them if you did, taking into account that it's not so easy at first glance to know who I am because I tend to change my personality a little in those accounts."},{"id":2177550,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638523454,"body":"Oh btw I've been paying more attention to the accounts here and I've actually found a couple of your secret ones kirby which is cool, don't worry though, i won't spill the beans. I've also discovered some of Metroids secret accounts which is interesting but I won't spill the beans on him either, doing that would be kinda gay lol."},{"id":2177535,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638522945,"body":"Hmm now that you mention it that would work toaster man but most humans don't have cosmic toasters so they probably couldn't really do that. Kirbys approach is a good method any sigma male can use without too much fuss. "},{"id":2177531,"gallery_id":148330,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1638522714,"body":"Put them in the toaster it never fails. It's a foolproof way of dealing with annoying kids."},{"id":2177527,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638522514,"body":"Hahaha nice! a poggers tale of adventure hardship and triumph! What i hate the most is when you're walking behind a larg group of fucking annoying 12-13 year old boys going in the same direction as them and you either have to walk behind them at normal speed listening to all their shitty shit that kids talk about or you've gotta turbo walk past them real fast to overtake them but if you do that they will usually challenge you to battle which is annoying. Last time I was challenged I just didn't have the time or energy for it so I used a level 5 summoning spell and summoned a gay eyes white shotacon dragon but I don't think I'll do that again... what happened wasn't pretty 😬"},{"id":2177492,"gallery_id":148330,"poster":{"id":4704207,"username":"Kirby Cosmico's Stories","slug":"kirby-cosmico-s-stories","avatar_url":"avatars/4704207.png?_=744166d1cfdf69bc","is_superuser":false,"is_staff":false},"post_date":1638520472,"body":"As I suddenly felt an attraction to Dream, I knew it was the end... I thought there was no escape and I was doomed, but then I remembered that I was a Sigma Male and I beat the shit out of the kid with my bare cosmic hands, that will teach him not to mess with me!"},{"id":2177489,"gallery_id":148330,"poster":{"id":4704207,"username":"Kirby Cosmico's Stories","slug":"kirby-cosmico-s-stories","avatar_url":"avatars/4704207.png?_=744166d1cfdf69bc","is_superuser":false,"is_staff":false},"post_date":1638520340,"body":"Today I was taking a power walk for 20 minutes (I am a Sigma Male) and I saw something straight out of my worst nightmare. Another kid, ANOTHER KID, about 12M was walking toward me with a Dream hoodie. I've dealt with children who have tried to attack me in the past but this was even worse. He stared at me with an evil grin, and the smile on his hoodie was terrifying. I broke into a sweat and began to run as fast as I could to the other way. I looked back and he was still right there chasing me, gaining speed. I started praying for God to save my soul. He was getting closer. But I had finally reached my house, still ready to keep running (I am a Sigma Male). I stood at my desk (Sitting is for Betas). I turned on my computer and was horrified to see Dream's YouTube page opened up, with my subscription added. As I looked behind me I saw him. The kid (12M) was right there. He began chanting Dreamphilic quotes and poems. I had lost the fight and he was going to make me into a Dream stan."},{"id":2177432,"gallery_id":148330,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638517211,"body":"Cum dumpster loli."},{"id":1315375,"gallery_id":148330,"poster":{"id":1376713,"username":"MrHowd","slug":"mrhowd","avatar_url":"avatars/1376713.png","is_superuser":false,"is_staff":false},"post_date":1604512852,"body":"He just straight up stole her from the other guys"},{"id":26388,"gallery_id":148330,"poster":{"id":170176,"username":"asashio","slug":"asashio","avatar_url":"avatars/170176.png","is_superuser":false,"is_staff":false},"post_date":1446823600,"body":"lolis are not good in multiplayer.\r\n\r\n>oniichans preferred"}]