[{"id":2175314,"gallery_id":148795,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1638406641,"body":"Btw I agree kirby, your right man. "},{"id":2175311,"gallery_id":148795,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1638406461,"body":"\"Once you start peaking lay down with some music playing and enjoy the closed eye visuals\" said the the said said said the tsaid sathe idthsaid the said said said the pineapple takes a long drag of the caustic smoke looks out at the blue sea! The? Cat# is; on@ a¥ dragon$ is))) what€ the% old\"\" cactus said. Mmmmm K . "},{"id":2175306,"gallery_id":148795,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1638406274,"body":"That's what the spider in my stomach said anyway, it was never digested. so don't worry if I remember once on my journey and on a higher does of a chimp pulling apart an apache attack helicopter with a mm M230 chain gun in a way so you guys can see things others can't see anything wrong with masturbation regular masturbation regular masturbation regular masturbation regular healthy foods masturbating on the table the vegetables cum on the table and the table said \"Surely God is my salvation; I will trust and not be afraid. The LORD, the LORD himself, is my strength and my defense ; he has become my salvation.” but the vegetables were masturbation so they couldn't hear the table. True story nigga."},{"id":2175302,"gallery_id":148795,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1638406133,"body":"6th grade in a regular health care system is a true filtered vitamin substance that can really be used for a second Asian women but black and green tobacco leaf or rustle the grass at all these comments are not a tomato or any other plant in the dark places which made it hard to imagine cocane in a small shabby bar shela nervously checks her watch for the fifteenth time and time again and when she comes home she walks up to her mom and says she is here for you so hmu if that's the case and you like being bottom 😏 and then we'll have a baby."},{"id":2172555,"gallery_id":148795,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1638263606,"body":"I hope something like this doesn't happen again..."},{"id":2172551,"gallery_id":148795,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1638263446,"body":"The wheels are starting to fidget rapidly. They are shaking and spinning like a ballerina. One by one they pop off until you are essentially in one big sled coasting down the freeway. At this point we’re at 150mph. Up ahead there is a massive inferno and you can only look in terror as it’s the only thing that you see. You close your eyes and come to a screeching halt just meters in front of the deathly hell. That’s when Christmas break comes in and literally carries you on its back like a firefighter. You're saved."},{"id":2172549,"gallery_id":148795,"poster":{"id":4703049,"username":"Kirby Cosmico Doctor","slug":"kirby-cosmico-doctor","avatar_url":"avatars/4703049.png?_=d386d9d981784d4c","is_superuser":false,"is_staff":false},"post_date":1638263313,"body":"Y’all does anyone else feel like this is legit the worst time of the year? The millisecond that thanksgiving break ends it’s a nonstop nightmare until Christmas break. Without fail there seems to be one thousand things to do. It’s like earlier in the semester, I was going like 40mph, but now I’m at 100mph and the cosmic car is swerving and I’m almost hitting things and I have my whole family in the car and they are screaming and so am I. Being a doctor sometimes is difficult but this is even worse... And there is also a blizzard going on and I can’t see and the radio is really loud and all the window and doors have flown off the car and we’re sitting and shivering. I try to press down the brakes but they are locked up and I feel us skidding and doing like 35 360 degree turns. It’s spinning so fast like you’re gonna throw up and you do. Then you are covered in it and you are just praying to any deity above to spare you."},{"id":2170798,"gallery_id":148795,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1638184305,"body":"Good shit man 👌."},{"id":1067950,"gallery_id":148795,"poster":{"id":2279493,"username":"DragonGoddessLover","slug":"dragongoddesslover","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594343333,"body":"So sexy she is sexy i wish I was him"},{"id":919536,"gallery_id":148795,"poster":{"id":1923629,"username":"nopor27","slug":"nopor27","avatar_url":"avatars/1923629.png?_=566ad211bc26427d","is_superuser":false,"is_staff":false},"post_date":1559077262,"body":"https://nhentai.net/g/91227/ another"},{"id":806871,"gallery_id":148795,"poster":{"id":1577991,"username":"Legendlawliet","slug":"legendlawliet","avatar_url":"avatars/1577991.png","is_superuser":false,"is_staff":false},"post_date":1549218085,"body":"It would be nice to have a second one."}]