[{"id":1594012,"gallery_id":150227,"poster":{"id":455040,"username":"kcjpunk","slug":"kcjpunk","avatar_url":"avatars/455040.png","is_superuser":false,"is_staff":false},"post_date":1614659006,"body":"this is netorase so after this guy pretty much fuck her brains out since it said the english version that no matter how many times guy fapped he can't get his dick calm down to her and they kissed each other and said they love each other after that they pretty much fucked but Aiue won't draw that since his major selling point is netorare, blackmail , mind brake so if he draw that his fans would be mad af and his sales would go down. I got curious so I check Aiue twitter he hinted that in there  "},{"id":1551010,"gallery_id":150227,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1612709182,"body":"WARNING: CONTAINS NTR (netorase in this case) so if you are weak-hearted, you can ignore my comment. If you are looking for the EN-TL'd version of this one, read it here: https://hentai.cafe/hc.fyi/894 #### Now there seems to have a prelude to this one, for the sake of reference, read here: https://hentai.cafe/hc.fyi/221 #### For those (like I was) wondering what the previous commenters were talking about, here is 'Moonflower': https://hitomi.la/manga/moonflower-english-1631798.html ##### and raw is here: https://nhentai.net/g/148912/ #### (COMIC X-EROS #35) #### Unrelated, also check out this artist in hentai.cafe, it has a lot of his work TL'd that aren't even in this site but are worthwhile reads."},{"id":905994,"gallery_id":150227,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1557925953,"body":"While the guy can't get enough of watching her have sex with other men. It's never explained or shown if the two of them ever really have sex themselves or the dude is quite literately obsessed with fapping while watching his girlfriend sleep with other guys. I find it pretty clear that the girl is probably imagining she's sleeping with her boyfriend since it is always shown that when she feels really good or is about to cum she always smiles and looks into the camera instead of her partner. "},{"id":905991,"gallery_id":150227,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1557925746,"body":"@Daily_fapper way late but it's not that he can't get it up, this is chapter 2 in the story, the one before is called girlfriend next door. Basically the girlfriend and the boyfriend have been together since forever and frankly they both love each other but when the girl tries to \"hit on\" him and hint that she wants to sleep with him. The guy get's embarrassed and say's he could never ever get a boner for her and never thought of her in a sexual way. The girl get's hurt and for some reason get's the great idea that she would have sex with another guy film it and then send it to the guy to show of how sexy she is. The guy get's the video and almost instantly starts to fap to it, the girl on the other hand stands outside and get's really horny from him fapping to her vid and then enters when he has blown his load. After that this chapter follows and it clearly shows that the girl pretty much is willing to do anything for the guy (and also is a pervert)  "},{"id":91584,"gallery_id":150227,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1486848274,"body":"ı have read the moonflower and the rest"},{"id":66929,"gallery_id":150227,"poster":{"id":32719,"username":"erozone","slug":"erozone","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1476436242,"body":"Fakku has chapter 1 &2 translated. Wish i could read moon so i could read the whole tank"},{"id":66434,"gallery_id":150227,"poster":{"id":572666,"username":"devil_arm","slug":"devil_arm","avatar_url":"avatars/572666.png","is_superuser":false,"is_staff":false},"post_date":1476187391,"body":"i feel like i've been reading a translated version of this somewhere..."},{"id":46589,"gallery_id":150227,"poster":{"id":566594,"username":"Daily_Fapper","slug":"daily_fapper","avatar_url":"avatars/566594.png","is_superuser":false,"is_staff":false},"post_date":1464357764,"body":"If I can't get it up then I'll fuck my with with a stick but never let any other man touch her"}]