[{"id":2136224,"gallery_id":150850,"poster":{"id":2331015,"username":"NotBot","slug":"notbot","avatar_url":"avatars/2331015.png?_=dfdf08035c5686ac","is_superuser":false,"is_staff":false},"post_date":1636571470,"body":"Dude below went absolutely ham with his keyboard. Anyway ty for the rec of Tatoeba Haha Ga as it's really similar to this one, although art's not as good as in this one but the story's better."},{"id":2068839,"gallery_id":150850,"poster":{"id":98017,"username":"meieru","slug":"meieru","avatar_url":"avatars/98017.png?_=58d43fdfd4e6a2f6","is_superuser":false,"is_staff":false},"post_date":1633715209,"body":"stfu with your post-nut clarity. I do recommend Tatoeba Haha Ga too tho. Shits good."},{"id":2025879,"gallery_id":150850,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1632025587,"body":"If Takasugi sensei either decided to expand this story more into a third volume with all these additions or at least cut out the excess from the second and added some of these things in, it would have been a much more satisfying ending in my personal opinion. An author who did a similar work like this in a much more expanded, and better way I believe was Tsuya-Tsuya's \"Tatoeba Haha Ga\", which has 6 volumes and many extra chapters. But again, Takasugi sensei really shines in this story with some of the character development mostly from Misako in being more assertive in what she wants and Satoshi's treatment of his lover by realizing the damage his relationship it could have had on her family, and even Kuroki who was getting some character depth. And the art is stellar as per usual since Takasugi sensei is truly an amazing artist of milfs and incest stories, so excellent art as always. The story was decent and ended somewhat how I wanted, but it could have definitely been better!"},{"id":2025862,"gallery_id":150850,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1632025160,"body":"The other two co workers from the market were interesting additions to the story since one revealed Satoshi's hidden desire for his mother, but I still felt that we needed to explore his sexual love for his mother a bit more as to why it got there. Then we have the other one who was with Kuroki before Misako and how she was the end result of what Misako became at the end of the story, just wanting an interesting sex life, but their removal from the story felt a bit too abrupt. I think this story did a good job setting up in the first volume and the first 60 to 70 pages up until the confrontation between Misako and her son Satoshi. It was at this point that I feel we should have delved into Satoshi's situation more alongside Kuroki's, have Kuroki's scene with Misako's outrage right after and there move forward with 70 or so pages of Misako and her son's relationship, and how it also fulfills the husband's ntr fetish by his own son. Kind of a win win situation. "},{"id":2025847,"gallery_id":150850,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1632024876,"body":"As we started to explore Kuroki's past, it seemed to give lots of explanation to his current behavior, and trying to take Misako for himself now seems to make sense since he saw how cruel it was for her husband to use her for husband's NTR fetish, but if this was all he was going to be, a catalyst for Misako's sexual transformation, we could've gotten this revelation earlier in this book and move into her relationship with her son and how she elevates her desire for sexual pleasure to new heights. The good twist that this book introduced was Misako turning Kuroki down and really coming to terms with what she wanted, and that was a heightened and active sexual life. A bit different from the usual stories like these where the women just usually give in to the dick, she just flipped her switch and raged when she did not get what she wanted. It was a really interesting and surprising twist. Which then leads to her finally being with her son and most likely continuing this relationship."},{"id":2025827,"gallery_id":150850,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1632024219,"body":"After having read the 1st and 2nd part, I have to say that I have mixed feelings about this work. The set up that was made in the 1st book was pretty interesting and well-done. And the way it ended with the son also having a similar relationship was the perfect cliffhanger and set up for this book. However, I feel Takasugi sensei thought that they had too many characters in the story and decided to cut them out one by one and rushed a lot of loose plot threads in the final few pages where it all just falls flat on it face. Now, it was the ending I was somewhat looking forward to, but now the way we arrived to it. Takasugi sensei is well-known for their incest stories but this work just felt like it was trying to explain many things at once and failed to explain all of them at the same time. "},{"id":2022742,"gallery_id":150850,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1631901009,"body":"so in the end she never fucked her son, i would like to see them fuck"},{"id":1873934,"gallery_id":150850,"poster":{"id":4123038,"username":"jeje1989","slug":"jeje1989","avatar_url":"avatars/4123038.png?_=5485d1df18fbfef4","is_superuser":false,"is_staff":false},"post_date":1626351810,"body":"Was there ever a part three to this?\n"},{"id":1670747,"gallery_id":150850,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1618035304,"body":"Nice. It was different. I liked how she shot down a relationship with him and just wanted him to fuck her. She was totally crazy by that point. Loved it."},{"id":1646573,"gallery_id":150850,"poster":{"id":3271884,"username":"Ishtar123","slug":"ishtar123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1616979918,"body":"i read this not like something to fap but a story... oh jeez what the actual fuck, i felt so bad for the boy, he liked his whore mother, but was the father all behind this, so what was the point of breaking up with the bitch market?  i don´t know but why that whore didn´  t wanted some relationship?\nwell, she belongs the streets"},{"id":1441575,"gallery_id":150850,"poster":{"id":537421,"username":"Gυts","slug":"guts","avatar_url":"avatars/537421.png?_=d551a39ee563c230","is_superuser":false,"is_staff":false},"post_date":1609229110,"body":"Where the hell is part 3? "},{"id":908598,"gallery_id":150850,"poster":{"id":2197291,"username":"idkm9","slug":"idkm9","avatar_url":"avatars/2197291.png","is_superuser":false,"is_staff":false},"post_date":1558168218,"body":"Yea this ones not my style had to stop reading part way through just went straight up soft ...hate submissive women"},{"id":889105,"gallery_id":150850,"poster":{"id":2085189,"username":"explicit_desire","slug":"explicit_desire","avatar_url":"avatars/2085189.png","is_superuser":false,"is_staff":false},"post_date":1556539046,"body":"This isn't an incest dammit.\nDon't mislead the tag, seriously."},{"id":774916,"gallery_id":150850,"poster":{"id":2126224,"username":"HaremOverlord","slug":"haremoverlord","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1546519452,"body":"Son Got Cuaght up in the crossfire Scumbag Father, Slut Mother"},{"id":167132,"gallery_id":150850,"poster":{"id":1350133,"username":"spartanxx1","slug":"spartanxx1","avatar_url":"avatars/1350133.png?_=f4b34a095f63623d","is_superuser":false,"is_staff":false},"post_date":1505798936,"body":" story of a mom thats a slut and her son likes her but they dont bang  umm yeah no thanks "},{"id":106229,"gallery_id":150850,"poster":{"id":974622,"username":"Kurt Wolf","slug":"kurt-wolf","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1491027358,"body":"I hope there's more"},{"id":53761,"gallery_id":150850,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1469007278,"body":"well that was an ending. Also it kind of implies they do bang, just not where we see it."},{"id":49799,"gallery_id":150850,"poster":{"id":33724,"username":"chefscoccer","slug":"chefscoccer","avatar_url":"avatars/33724.png","is_superuser":false,"is_staff":false},"post_date":1466731144,"body":"what `? thats it?"},{"id":27809,"gallery_id":150850,"poster":{"id":199064,"username":"Brighton92","slug":"brighton92","avatar_url":"avatars/199064.png","is_superuser":false,"is_staff":false},"post_date":1449890771,"body":"is there more? he never fucked his mom"},{"id":27806,"gallery_id":150850,"poster":{"id":263256,"username":"Dejavuu","slug":"dejavuu","avatar_url":"avatars/263256.png","is_superuser":false,"is_staff":false},"post_date":1449889567,"body":"What!!!? What is with the plot twist. And why she didn't bang her son??"}]