[{"id":324023,"gallery_id":158698,"poster":{"id":93477,"username":"apokolypes","slug":"apokolypes","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1510927753,"body":"what a shitty protagonist, i hope something horrible happens to him"},{"id":40234,"gallery_id":158698,"poster":{"id":462843,"username":"Integrity","slug":"integrity","avatar_url":"avatars/462843.png?_=f7fcf8194d5b5322","is_superuser":false,"is_staff":false},"post_date":1457832192,"body":"another thought..... what if those elfs that died turned into zombies? or some kind of monsters???\r\ni mean everyone their looks very young... where's the old geezers?"},{"id":40212,"gallery_id":158698,"poster":{"id":261860,"username":"osumaniac","slug":"osumaniac","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1457804005,"body":"lol this just like discovery of America."},{"id":40131,"gallery_id":158698,"poster":{"id":462843,"username":"Integrity","slug":"integrity","avatar_url":"avatars/462843.png?_=f7fcf8194d5b5322","is_superuser":false,"is_staff":false},"post_date":1457748879,"body":"my god it's been a very very long time since i found something as good as this... hope they dont drop or stop making this manga?? (i forgot the KR name for these kinds of drawings)   \r\n\r\n i saw the raw chap 14 and I'm angry the MC is going to destroy that wonder place (those cute fluffy things QWQ) ...... I'm also very interested in that Black face on the right side of the cover (will he be some kind of hero and fight back against a monster?)"},{"id":40118,"gallery_id":158698,"poster":{"id":416495,"username":"rema","slug":"rema","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1457734700,"body":"According to my opinion the miserable guy act like an \"average\" human to me. He claims always for more and can never obtain statisfaction. We want property, adventures, recognition, sex, drugs, might, emotions and many other things/desires. Thats what we are. A superior race with a \"conscious mind\" or are we just a laughable species? Mother nature dont care. \r\nI think the \"conscious mind\" is useful for two things. Increasing our survival chance (medicine) and satisfy our desire by telling stories. And i like this story of the immature Korean world ruler who is controlled by his desires.\r\n\r\nThe main problem is the evil censoreship again. Damn, thats an ugly censorship.\r\n\r\nbtw: my current mental state want see his death body because i cant stand watching this dangerous human. :)"},{"id":40061,"gallery_id":158698,"poster":{"id":437047,"username":"Kane00","slug":"kane00","avatar_url":"avatars/437047.png","is_superuser":false,"is_staff":false},"post_date":1457672499,"body":"What a miserable guy. Can't make it in the real world, flips out and brings misery to a primitive utopia, and starts murdering innocent, barely-sentient beings who treated him with kindness...even if that nerd isn't much better, this guy deserves every bad thing that happens to him and worse. I hate NTR situations where the guy just takes it, or cries and jerks off, but this immature Korean prick deserves to be hated more than any other character we've seen so far."}]