[{"id":43717,"gallery_id":159298,"poster":{"id":370351,"username":"yaoihappy","slug":"yaoihappy","avatar_url":"avatars/370351.png","is_superuser":false,"is_staff":false},"post_date":1461973932,"body":"1. Love this artist's work right now!!!! :3\r\n2. from the moment I saw the first picture, I can tell something bad is going to happen.\r\n3. Love the natives &lt;3!!!!\r\n4. As soon I he punch the native, I knew he was going to kill the native at some point, sucks that he killed two natives even though the first one wanted to make peace with the main character and the second one discovered the first one...\r\n5. NOOOOO! NOT THE ANIMALS!!!! &gt;:3\r\n6. Love how the story is going at the moment, just that I hate that the main character overall. Like seriously, WTF! I mean, sure I would get so jealous that I want to beat the crap out of somebody if he was having sex with my girl, but I wouldn't kill them! Plus he's in unknown territory, he doesn't know the people around him, has no clue about the natives culture and he just goes off and fucks everything up! I mean, just judging around the surroundings, the people, animals, and the plant life, anybody can tell it's a peaceful environment!"},{"id":41077,"gallery_id":159298,"poster":{"id":487239,"username":"Raven45","slug":"raven45","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1459193446,"body":"Killing all those cute, fuzzy, adorable, loving, kind, &amp; friendly animals is just sickening!! &gt;:-( I'd like to have one of those as pets!!"},{"id":40932,"gallery_id":159298,"poster":{"id":294399,"username":"wafflecookee","slug":"wafflecookee","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1458964657,"body":"I know right. Girls are hot, but this guy worst than a piece of shit. You're basically in paradise and you can't get over yourself and killed two people who are completely harmless because you got a little jealous?"},{"id":40881,"gallery_id":159298,"poster":{"id":459011,"username":"Roht","slug":"roht","avatar_url":"avatars/459011.png?_=a4a6f69b0c70b629","is_superuser":false,"is_staff":false},"post_date":1458888889,"body":"I feel bad for the natives this guy is such a dick"}]