[{"id":2557996,"gallery_id":161083,"poster":{"id":4113945,"username":"tillallaregone","slug":"tillallaregone","avatar_url":"avatars/4113945.png?_=bfdb46764c6bea41","is_superuser":false,"is_staff":false},"post_date":1653849526,"body":"I feel like this NTR is really more of a cautionary tale with communication being at the center of it all. It's made pretty clear that Irena isn't bothered by the prospect of losing the temple, as long as she was with him, it didn't matter; a conclusion that Tachi makes much too late. Tachi understandably felt the weight of his parent's legacy and wanted to do anything and everything he could to save the temple. However, his desperation would cost him greatly. By being so focused on saving the temple, he negated listening to Irena, something he does often throughout the doujinshi. Irena was probably the only good person who understood him and was willing to believe in him regardless. Likewise, Lord Morozov recognized Tachi's struggles as well, uses them to exploit him and Irena. Tachi believed that happiness would be achieved after he had saved the temple, after he became a man, , after he was wed, when in reality, happiness was right beside him in Irena. "},{"id":2557991,"gallery_id":161083,"poster":{"id":4113945,"username":"tillallaregone","slug":"tillallaregone","avatar_url":"avatars/4113945.png?_=bfdb46764c6bea41","is_superuser":false,"is_staff":false},"post_date":1653849402,"body":"Perhaps he knew this fact and assumed that she would always be there for him, taking her for granted. If there is anything to be learned from this doujinshi, is that you cannot wait for happiness to appear. \"Your Life in 4 Panels\" by Merryweather Comics is a great example of waiting and assuming that happiness will show up. Happiness is not a reward gained from a promotion, it is something that comes from within and the people you love. When you prioritize something above being happy, that is where you will fall. Tachi wanted Irena to be happy after he had fixed everything, waiting until happiness came to him. So, to any who read this far, don't wait for happiness to fall from the sky get out there and look for it. Do NOT take shortcuts, you may have to step out of your comfort zone but will find it. Never forget to talk with your partner, the simple act of two-way communication can make all the difference. Also, read the fine print of anything you sign. "},{"id":1412683,"gallery_id":161083,"poster":{"id":1596627,"username":"dragonsnightmare","slug":"dragonsnightmare","avatar_url":"avatars/1596627.png","is_superuser":false,"is_staff":false},"post_date":1608212536,"body":"Honestly like why my guy....FUCKING READ THE GODDAMN FINE PRINT!!! Like for fuck sakes ntr protagonists sure got it coming."},{"id":1194072,"gallery_id":161083,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1599342345,"body":"@Domagonic Nope"},{"id":974218,"gallery_id":161083,"poster":{"id":1922437,"username":"Domagonic","slug":"domagonic","avatar_url":"avatars/1922437.png?_=69c4ae8b3a67deed","is_superuser":false,"is_staff":false},"post_date":1563097616,"body":"Just like in real life, people have no sympathy for men. It's dumb to expect anything different in fiction. "},{"id":694839,"gallery_id":161083,"poster":{"id":1924963,"username":"radslam","slug":"radslam","avatar_url":"avatars/1924963.png","is_superuser":false,"is_staff":false},"post_date":1537732730,"body":"What a brainlet, signing things without looking at the fine print. He deserved it."},{"id":368048,"gallery_id":161083,"poster":{"id":1259477,"username":"seraphimz","slug":"seraphimz","avatar_url":"avatars/1259477.png?_=c780d0b26446eef9","is_superuser":false,"is_staff":false},"post_date":1518896430,"body":"He brought that upon himself for being a dumbass so no simpathy from me"},{"id":324610,"gallery_id":161083,"poster":{"id":1435265,"username":"Big Boss Shaun","slug":"big-boss-shaun","avatar_url":"avatars/1435265.png?_=36d43101b2b73caf","is_superuser":false,"is_staff":false},"post_date":1511075320,"body":"True happiness comes at a price. Sometimes, you lose more than you have when you take a loan. In the end, love be it in need of or have plenty of, should be all that matters than wanting someone to be happy. I really loved this comic. I hope there is a 2nd part to this. "},{"id":109629,"gallery_id":161083,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1491969040,"body":"Now you realized that you could've just done away with the church and just live with her? Too little, too late. And you believed and hoped that happiness is just around the corner? Even when you were on \"borrowed time\" of said hope and happiness? If one was able to provide you with happiness, then they could also easily take it away, too. True happiness is something you work, earn, and realize for yourself, not just thrown your way b/c that's called entitlement/privilege. You deserved what happened to you. Especially when you were going to \"borrow\" again to pay back that loan... Btw 20% = Jabba the Hut"},{"id":97012,"gallery_id":161083,"poster":{"id":269739,"username":"AngryZombie88","slug":"angryzombie88","avatar_url":"avatars/269739.png","is_superuser":false,"is_staff":false},"post_date":1488811466,"body":"Extra story: after that Morozov will eat those eggs lol"},{"id":42332,"gallery_id":161083,"poster":{"id":40543,"username":"Rance-sama","slug":"rance-sama","avatar_url":"avatars/40543.png","is_superuser":false,"is_staff":false},"post_date":1460549491,"body":"lol what a cuck"}]