[{"id":2440071,"gallery_id":161944,"poster":{"id":5077448,"username":"powanker","slug":"powanker","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649175794,"body":"Couldve shown dronesec footage of the others fucking around or just his images from the top of his Fomo even laughing at his expenses for not banging Maya sempai or Midori and the newbies.\nJust 2 spice it up in 5 issues, but no, they had to resort 2 that loli loser crap of hypno app and found out of them writers asses maybe?\nThats the kind of stuff thats not only a turn off but which would make ya the laughing stock of even a jock buxom buddy of yours.\nSo you fap 4 jap comix about a nerdy loser who found not made a hypno app in his cell?\nGive us a break!!"},{"id":2440050,"gallery_id":161944,"poster":{"id":5077448,"username":"powanker","slug":"powanker","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649175282,"body":"Thats why most prefer unsub djs just 4 faps.\nSorry fellas but i couldnt let that one recap translate pass.\nSo you want us to accept that a virgin geek the likes of kensuke despite nicknamed aida / love, horny and frustrated like hell for decades having watche kaji bang misato and probably original Asuka too cuz this is Eva Rebuild which is missing on the tag.\nThis Nerdy genius hung up on Nerv Seile tek and military props couldnt build a saiminhypno device of his own?\nJust fell on his lap out of the blue?Moon perhaps?\nGimme a break.\nThats so moronic as the whole isekai smartphone series shit.\nThats the kind of plot that not only makes Japs the laughing stock of the planet but also dupes of all of us.\nBig turn off that not even gorgeous draws of Kaietai cant make us hard once we get soflimsy.\nA real turn on would be his crafting the darn thing while flashbacks of shinji and rei and misato plus suzuhara and sakura and horaki all had sex with him left out of the party.\nCould show dronesec "},{"id":1555834,"gallery_id":161944,"poster":{"id":3092411,"username":"Zenou","slug":"zenou","avatar_url":"avatars/3092411.png?_=aae361dce83507a0","is_superuser":false,"is_staff":false},"post_date":1612906168,"body":"This made me so harddddd 😍😍😍 the blowjob was so hot 😍😍😍❤❤❤❤"}]