[{"id":1758398,"gallery_id":162113,"poster":{"id":4159682,"username":"hentaimemes69","slug":"hentaimemes69","avatar_url":"avatars/4159682.png?_=be646e4c415e2622","is_superuser":false,"is_staff":false},"post_date":1621792421,"body":"that world is too pure for that guy. hope they kill him "},{"id":43786,"gallery_id":162113,"poster":{"id":207637,"username":"saru_chan","slug":"saru_chan","avatar_url":"avatars/207637.png","is_superuser":false,"is_staff":false},"post_date":1462050179,"body":"I seriously hope this guy dies, like he fucked it up the peaceful life of the natives.."},{"id":43718,"gallery_id":162113,"poster":{"id":370351,"username":"yaoihappy","slug":"yaoihappy","avatar_url":"avatars/370351.png","is_superuser":false,"is_staff":false},"post_date":1461974532,"body":"1. Love this artist's work right now! 2. from the moment I saw the first picture, I can tell something bad is going to happen. 3. Love the natives &lt;3!!!! 4. As soon I he punch the native, I knew he was going to kill the native at some point, sucks that he killed two natives even though the first one wanted to make peace with the main character and the second one discovered the first one... 5. NOOOOO! NOT THE ANIMALS!!!! &gt;:3 6. Love how the story is going at the moment, just that I hate that the main character overall. Like seriously, WTF! I mean, sure I would get so jealous that I want to beat the crap out of somebody if he was having sex with my girl, but I wouldn't kill them! Plus he's in unknown territory, he doesn't know the people around him, has no clue about the natives culture and he just goes off and fucks everything up! I mean, just judging around the surroundings, the people, animals, and the plant life, anybody can tell it's a peaceful environment!"},{"id":43445,"gallery_id":162113,"poster":{"id":244630,"username":"djb0623","slug":"djb0623","avatar_url":"avatars/244630.png","is_superuser":false,"is_staff":false},"post_date":1461645528,"body":"i was waiting for this to be uploaded to this website lol"}]