[{"id":2318283,"gallery_id":163361,"poster":{"id":4069849,"username":"6ixnin9","slug":"6ixnin9","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1644267446,"body":"This is real art, getting your message out there. Deep"},{"id":2193153,"gallery_id":163361,"poster":{"id":3328571,"username":"tataskyhd4470","slug":"tataskyhd4470","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639240593,"body":"@purple-spectrum. I am sure that in the doujin Cannibal Teacher, there was a boy named Kancil as well. Maybe this is more bigger of a story than it actually is?\n"},{"id":2076656,"gallery_id":163361,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1634022181,"body":"Dam these are deep... fucked up but deep. Fantastic art though."},{"id":1217639,"gallery_id":163361,"poster":{"id":3089192,"username":"shotaspaghetti","slug":"shotaspaghetti","avatar_url":"avatars/3089192.png?_=e446c0e6d9989cc0","is_superuser":false,"is_staff":false},"post_date":1600412885,"body":"kancil is so perfect... goddamn, thank you jati for making this amazing weirdo shit "},{"id":1095774,"gallery_id":163361,"poster":{"id":1007159,"username":"purple-spectrum","slug":"purple-spectrum","avatar_url":"avatars/1007159.png","is_superuser":false,"is_staff":false},"post_date":1595452949,"body":"In Kancil 4, following Comment Part 4.\nEnding listless after masturbating to his reflection as a female at the end of the chapter.\nThere are no daydreams in this chapter as there is no transgression towards Kancil, we can only perceive that the isolation and loneliness he feels its ropturing his self image, he dresses up trying to mimic the joyfull females in his circle, only to fall in the practice of autoeroticism as he sees a female version of himself in the mirror, after the orgasm the trance breaks and he falls languid, he has tainted himself, he has no identity besides perversion, his experimetation on himself brings him no joy. \nIn Kancil 4, Kancil drags himself emotionless towards his house on the empty streets, as he gets there he pass his older and younger sister whom dont notice his presence as he carries a trash bag, when his mother takes notice of him she recriminates him where is he going, for which he responds that he is on his way to throw the bag Comment Part 5"},{"id":1095589,"gallery_id":163361,"poster":{"id":1007159,"username":"purple-spectrum","slug":"purple-spectrum","avatar_url":"avatars/1007159.png","is_superuser":false,"is_staff":false},"post_date":1595445891,"body":"In Kancil 3, following Comment Part 2.\nAs he orders his sister to be quiet, we can deduce it was a rape, and not a incestuous relationship. This marks why the daydream was not his murder, but he comitting suicide.\nThis time he doesnt gets hurt by others, he is the one to hurt others, so he is the one to kill himself on the daydream.\nThe suicide by immolation represents the burning lust, and the fetal position of the corpse, the form of the victim, a child.\nIn Kancil 4, Kancil stay still as his mother exits the house along with his sister, his little sister being joyful as she waves her farewell to a emotionless Kancil, leaving Kancil alone in the house full of sorrow and emptiness. Next scene we see Kancil putting makeup on himself and dressing up as a girl, looking astonished by this female reflection, he gets arraused and masturbates to his reflection in the mirror, after reaching orgasm, he kneels listless with an empty look on his face.\nComment Part 4\n"},{"id":1095559,"gallery_id":163361,"poster":{"id":1007159,"username":"purple-spectrum","slug":"purple-spectrum","avatar_url":"avatars/1007159.png","is_superuser":false,"is_staff":false},"post_date":1595444702,"body":"In Kancil 3, we see him go to a Hole, entering it, pouring gasoline on himself, lighting a match and immolating himself. Next scene we see him observing his little sister play with an infant then kissing the baby, next page he spies his older sister having sex. We see Kancil commiting incest with his younger sister. In the last page we see his mother and sister observing the feverish and death eye look on the little sister, being the last panel Kancil tapping her heel with his foot.\nI found this more complicated to interpret, this time Kancil its not killed, he comitts suicide in his daydream. The kissing of an infant by his little sister, and the voyeurism towards his older sister, awakes the Perversion of incest for Kancil. The little sister being the victim of the rape as he see her molesting an infant, as a form of invitation. As he mimics the sexual act of her older sister. As he taps his little sister on the heel, its him ordering the little sister to stay quite. Comment Part 3"},{"id":1095530,"gallery_id":163361,"poster":{"id":1007159,"username":"purple-spectrum","slug":"purple-spectrum","avatar_url":"avatars/1007159.png","is_superuser":false,"is_staff":false},"post_date":1595443460,"body":"In Kancil 2, we see kancil naked in an open camp, then he gets assaulted and get his penis cut off, raped and finally killed by a strike on the head, his corpse left to rot in the open wild. Next scene we see in first person how Kancil is trying to reach a girl in an agrassive way, the girl feeling assaulted procedes to hit him in the head, pleads to him to never get near her. Next scene we see Kancil at home playing with mutillated toys alone in a garage, his sister interrups him while he puts away the toys on a box. Finally holding a doll similar to the girl he tried to grab forcefully, which he breaks its head. Last panel its him watching the girl play happily, hidden.\nHe fells emasculated after the rejection, and the daydream refletcs his actions upon the girl in a more violent way, he fells he is rotting on full display in reality, ignores by everyone.\nComment Part 2\n"},{"id":1095484,"gallery_id":163361,"poster":{"id":1007159,"username":"purple-spectrum","slug":"purple-spectrum","avatar_url":"avatars/1007159.png","is_superuser":false,"is_staff":false},"post_date":1595441958,"body":"I interpreted it in the following way.  Kancil fantasizes his own death and torture to detach himself from his reality.  His home and school cause him great anxiety, which by repressing it, it encourages him to a path of \"Perversion\". Most likely, he have had a real strong traumatic experience that is not seen in this series but may be related to his daydreams.\nIn Kancil 1, he gets his tongue cut while being handcuffed, and its forced to perform a fellatio, and finally gets sttabed in the eye to death. The following scene shows him being bullied by his peers, trying to fight back in a way, being ignored and left alone.\nHe fells powerless and unable to speak up, he feels humiliated and violated by his peers, cannot see beyond desolation.\nComment Part 1"},{"id":866372,"gallery_id":163361,"poster":{"id":919504,"username":"zeph tinder","slug":"zeph-tinder","avatar_url":"avatars/919504.png?_=c99ba03cb444ff1d","is_superuser":false,"is_staff":false},"post_date":1554501495,"body":"To, maybe, understand this story, read angry meatbag comment."},{"id":359777,"gallery_id":163361,"poster":{"id":1534335,"username":"CreamyGoodness","slug":"creamygoodness","avatar_url":"avatars/1534335.png","is_superuser":false,"is_staff":false},"post_date":1517536453,"body":"Meatbag sad face : ("},{"id":143578,"gallery_id":163361,"poster":{"id":201731,"username":"tyciol","slug":"tyciol","avatar_url":"avatars/201731.png","is_superuser":false,"is_staff":false},"post_date":1500711840,"body":"He did all that digging a hole and filling it in, all for nothing, and now he has to dig it back up again and fill it back in again? That seems like a LOT OF WORK. No wonder he is upset. Digging is hard."},{"id":108446,"gallery_id":163361,"poster":{"id":329529,"username":"LifeProTips","slug":"lifeprotips","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1491675165,"body":"I dunno what the fuck this thing is but I can't stop reading it now"},{"id":108107,"gallery_id":163361,"poster":{"id":1060934,"username":"Graviton","slug":"graviton","avatar_url":"avatars/1060934.png","is_superuser":false,"is_staff":false},"post_date":1491593753,"body":"The toys represent himself. You see how his sister said he's always breaking his toys? He was burying his toys, maybe as trying to bury himself. \n\nI think Angry Meatbag down here got it right with the social phobia analysis, and as an additional view, Kancil can't give others his toys because they are broken, as well as he can't \"give\" himself to others because he is also broken. So he is burying himself and dying.\n\nThis comic was so memorable."},{"id":81363,"gallery_id":163361,"poster":{"id":419465,"username":"devilstroyermaycry","slug":"devilstroyermaycry","avatar_url":"avatars/419465.png","is_superuser":false,"is_staff":false},"post_date":1483138258,"body":"I'm sorry for you, Angry Meatbag. Hope you're doing well! :( And for the other ones who are bitching I say : no one is forcing you to click on this. Seriously, you are rising a ruckus only for an invented story. Good storytelling tho"},{"id":79940,"gallery_id":163361,"poster":{"id":894045,"username":"Angry Meatbag","slug":"angry-meatbag","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1482557910,"body":"Hey there person reading the comments, chances are you havent really got what this series is about so let me break it down to you.\r\n\r\nThis chapter may seem nonsensical to you, but it hits hard on me, because ive been thru the same thing, Ive suffered from social phobia my whole life and only got diagnosed and started a treatment Around two years ago at 25yo, so my childhood was a pretty miserable period most of the time, no thanks to shitheaded doctors treating me for depression.\r\n\r\nWhat happened here was a social interaction too sudden and strong for the boy to handle, I know it makes no sense but happened to me on 2 or 3 ocasions as a child and teen, Having someone show kindness or interes on you can be the scariest and most shocking thing in the world for no good reason if youre affected by this illness.\r\n\r\nThis Kharisma guy apparently uses gore as a way to express feelings that cant really be explained to healty people, but this is just my take on it."},{"id":78610,"gallery_id":163361,"poster":{"id":842752,"username":"Anczar","slug":"anczar","avatar_url":"avatars/842752.png?_=a590080fe2c958d2","is_superuser":false,"is_staff":false},"post_date":1481942585,"body":"Wtf happen? Whaaaaa? Input pliz"},{"id":45972,"gallery_id":163361,"poster":{"id":165708,"username":"Desmonddickens","slug":"desmonddickens","avatar_url":"avatars/165708.png","is_superuser":false,"is_staff":false},"post_date":1463936872,"body":"@Mein\r\nNot much older than Kancil."},{"id":45428,"gallery_id":163361,"poster":{"id":557121,"username":"jiggly374","slug":"jiggly374","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1463469220,"body":"lol guys this just 1 chapter, try starting with chapter 1"},{"id":44838,"gallery_id":163361,"poster":{"id":165708,"username":"Desmonddickens","slug":"desmonddickens","avatar_url":"avatars/165708.png","is_superuser":false,"is_staff":false},"post_date":1463023613,"body":"No one's tongue got cut. No one's dick got cut. No one got burned to death. No transfag selfcest bullshit. No fetus got killed. WTF is wrong Kharisma?! He used to make ok stuff, but that's too much. He crossed the line of morality with this one. I was expecting a grand finale for Kancil and his happy every day life, not this perverted piece of shit filled with nudes. Also, notice how little censorship there is on this doujinshi. So fucking unbelievable! I'm pretty sure this chapter has caused legal issues to Kharisma in his lovely and open minded country that Indonesia is. But still, the main plot is easily understandable for every member of the family with no twists at all as Kharisma is well known to keep the same setting between every chapters of Kancil. Finally, I would rate this entire work a mediocre grade of 4/20, which is really disappointing, because my original perception was more around 9/11. My best regards and Kappa, Top Kek, Allahu Akbar."},{"id":44681,"gallery_id":163361,"poster":{"id":325845,"username":"Twillij","slug":"twillij","avatar_url":"avatars/325845.png","is_superuser":false,"is_staff":false},"post_date":1462877445,"body":"I'm not usually one to criticise other people's work for no reason, but this isn't an appropriate post for a HENTAI website. Where are the eros and the nudes? Not to mention the other works are also kind of distasteful involving murder and whatnot. I feel like the artist's works don't really belong on this website, but that's just my two cents."},{"id":44652,"gallery_id":163361,"poster":{"id":220888,"username":"sazankaz","slug":"sazankaz","avatar_url":"avatars/220888.png","is_superuser":false,"is_staff":false},"post_date":1462850905,"body":"Why this is not hentai muslim just fuck off will you post this on indonesian not on this website jilbab muslim isis stupid"},{"id":44640,"gallery_id":163361,"poster":{"id":411585,"username":"TruePsylent","slug":"truepsylent","avatar_url":"avatars/411585.png","is_superuser":false,"is_staff":false},"post_date":1462844511,"body":"uh.... ok something is lose here please HELP!"},{"id":44635,"gallery_id":163361,"poster":{"id":65618,"username":"sni1","slug":"sni1","avatar_url":"avatars/65618.png","is_superuser":false,"is_staff":false},"post_date":1462841565,"body":"why is this even on this site............."},{"id":44633,"gallery_id":163361,"poster":{"id":25571,"username":"Frozzy","slug":"frozzy","avatar_url":"avatars/25571.png?_=738fe647d8f406fe","is_superuser":false,"is_staff":false},"post_date":1462840505,"body":"I think he might be a ghost."},{"id":44630,"gallery_id":163361,"poster":{"id":73642,"username":"Fix your website, lazy admin","slug":"fix-your-website-lazy-admin","avatar_url":"avatars/73642.png?_=6294bf803e66a9e1","is_superuser":false,"is_staff":false},"post_date":1462838802,"body":"Why is this on a hentai website?"},{"id":44625,"gallery_id":163361,"poster":{"id":259873,"username":"||||||||","slug":"_","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1462832708,"body":"I dont even classify this as a series"},{"id":44616,"gallery_id":163361,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1462828188,"body":"I *think* no one died this time, but its always been hard figuring out whats going on in this series..."}]