[{"id":880469,"gallery_id":167010,"poster":{"id":1935447,"username":"adlananime","slug":"adlananime","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555784677,"body":"@Esdeathtatsumi i Agree 100% this is a Happy ending Mc and Candy girl both are really perfect for each other and i think they both will still continue there relationship and live life to the fullest together"},{"id":880456,"gallery_id":167010,"poster":{"id":1935447,"username":"adlananime","slug":"adlananime","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555783593,"body":"I Like the ending that he decided not to kill her and she hug him and what i think happen afterwards is that they both know that they share the same feeling of despair and so i think they still want to continue there relationship because that's the only thing they both know that they can still look forward to and they both tried to live life to the fullest together"},{"id":50656,"gallery_id":167010,"poster":{"id":580230,"username":"mangamasterxxx","slug":"mangamasterxxx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1467306961,"body":"WELL, cant really see how they could get together in the first place, it would have been kinda cheesy that the guy says sry and they get together. Seems a fine ending, no happy no sad.. just mixed feelings like what life would be.  Sadly the ending didnt have a final love scene but with the length of this thing, it will have to do."},{"id":49791,"gallery_id":167010,"poster":{"id":611054,"username":"Esdeathtatsumi","slug":"esdeathtatsumi","avatar_url":"avatars/611054.png","is_superuser":false,"is_staff":false},"post_date":1466722028,"body":"Honestly this could sort of be considered a happy ending as you could get with these characters. MC and candy girl are really perfect for each other and the wife will continue living a lie pretending she is okay and happy. Only her partner has changed. Hers is the only real \"bad end\" if you think she still is in love with the MC.\r\nThe MC decides to embrace who he is and stop trying to pretend he is something that he isn't. Ironically he will probably end up happier once the emotional outpouring from the last chapter runs its course. The wife however doubles down on her tactic of not talking about or acknowledging how she really feels. While these aren't positive responses they are genuine. Not everyone can come out the other side of a bad situation for the better.\r\n\r\nthe author promised a surprise for the day 30th"},{"id":49442,"gallery_id":167010,"poster":{"id":410630,"username":"ExplainLikeImForeign","slug":"explainlikeimforeign","avatar_url":"avatars/410630.png","is_superuser":false,"is_staff":false},"post_date":1466493401,"body":"*SPOILER* So the chick he cheated with had a raped by daddy issue when she was younger. Thus, she became different and killed him in a 'car accident.' The main guy realizes this and pisses his pants as usual. Just looking at him struggling this entire time is pathetic.\r\nHe and his wife are in a shitty relationship. Honestly, they needed to separate. Their relationship wasn't going to build back up. Especially when the retarded guy can't get his penis erect enough for her. She has to do work for him. He also became different after marriage which fucked her over and she hated him (Common divorce situation).\r\nHis employee (horny bitch) destroyed him in the end which satisfied her vengeance. \r\nThe manhwa(proper way of saying it for korean comics) is a 9.5/10 for me. Mostly because there wasn't a whole lot more scenes added to his wife fucking the younger guy. Really needed more to flip the guy off. He deserved to lose everything and he managed to go with the girl he loves."},{"id":49396,"gallery_id":167010,"poster":{"id":469914,"username":"natsuyoshi","slug":"natsuyoshi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1466472217,"body":"Guys, it's a happy ending, look at the end, she's alive :)"},{"id":49349,"gallery_id":167010,"poster":{"id":396856,"username":"wrysaber","slug":"wrysaber","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1466434480,"body":"so that was it huh.."},{"id":49329,"gallery_id":167010,"poster":{"id":283201,"username":"crosskun","slug":"crosskun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1466417256,"body":"Guess it's finally over, freaking stupid ass ending though... pretty so yeul-ah had an electra complex and sees the guy as his father (fuck me daddy issue), married couple didn't have proper closure, wife just  left to fuck the other guy again and be all happy and shit (husband kinda deserved it though). leaving a deep scar that ain't gonna heal."},{"id":49328,"gallery_id":167010,"poster":{"id":410630,"username":"ExplainLikeImForeign","slug":"explainlikeimforeign","avatar_url":"avatars/410630.png","is_superuser":false,"is_staff":false},"post_date":1466416671,"body":"I am not sure what everyones problem is. Do happy endings make you sleep better at night? I knew ever since the guy started cheating this would happen. Other side finds out and everything blows up. They seperate and fall into their real love hands.\r\n\r\nI loved this story. It was intense, situational, and erotic."},{"id":49325,"gallery_id":167010,"poster":{"id":380365,"username":"Winella","slug":"winella","avatar_url":"avatars/380365.png","is_superuser":false,"is_staff":false},"post_date":1466414131,"body":"Yeul-Ah was an interesting character... I did adore her but an ending in which the married couple survived and the struggles somehow revitalized their love for one another would have made it so much nicer... Yeul-Ah was a main character.. but it should have kept to her trying to help the main character with his marriage... Awful ending for me..... Was expecting something much nicer rather than an ambiguous/sad ending."},{"id":49324,"gallery_id":167010,"poster":{"id":238125,"username":"orgaee17","slug":"orgaee17","avatar_url":"avatars/238125.png","is_superuser":false,"is_staff":false},"post_date":1466412291,"body":"BAD MANGA EVER ^^"},{"id":49320,"gallery_id":167010,"poster":{"id":587928,"username":"kusashi","slug":"kusashi","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1466407394,"body":"this is the type of ending that most fictional drug addicts end up with. the kind that the high and low of the drug is over but left ambiguous cause of one simple question. Is the drug addiction over or is it still there?"},{"id":49307,"gallery_id":167010,"poster":{"id":289526,"username":"zerva","slug":"zerva","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1466399542,"body":"Is this a Happy ending ?"},{"id":49274,"gallery_id":167010,"poster":{"id":29708,"username":"ZEERO44","slug":"zeero44","avatar_url":"avatars/29708.png","is_superuser":false,"is_staff":false},"post_date":1466380296,"body":"wtf what kind of ending is that"}]