[{"id":2349825,"gallery_id":168165,"poster":{"id":4187491,"username":"Uoy","slug":"uoy","avatar_url":"avatars/4187491.png?_=51e1b52bd71e22b0","is_superuser":false,"is_staff":false},"post_date":1645360204,"body":"I haven't  read it yet but if u recommend it comments before me, I will read it myself "},{"id":2020663,"gallery_id":168165,"poster":{"id":4294347,"username":"HEN_400_HEN","slug":"hen_400_hen","avatar_url":"avatars/4294347.png?_=b7eeb03d7f76f01d","is_superuser":false,"is_staff":false},"post_date":1631815958,"body":"Damn That was to deep for me to like "},{"id":1562267,"gallery_id":168165,"poster":{"id":3916718,"username":"IlikeRobotsand?","slug":"ilikerobotsand","avatar_url":"avatars/3916718.png?_=52f2fcde0405018e","is_superuser":false,"is_staff":false},"post_date":1613212391,"body":"If you'd try to explain to me what would happen at the end of these 13 hundred pages, I would tell you to stop, and ask for a different recommendation, however after the nearly 4 hours of reading, and time spent contemplating, I have come to realize that this has one of the most detailed storylines, of a hentai, I have ever read. The ending especially is what took the most out of me: A man having his entire world collapse in an instant, and both the reader, and the main character can't do anything but listen to the hollow voices of the people around him. For his wife, it really wasn't her fault, she didn't deserve the treatment she was given, and had her trust betrayed. As for Yura, she was the driving point for everything in the story, though its because of her all these terrible things happen, but I can't deny her being there to help Kim get through his sadness may have helped a small bit to get him back together with Seonghee. Overall I really enjoyed the hentai."},{"id":1544384,"gallery_id":168165,"poster":{"id":3843847,"username":"Gunna🅿️","slug":"gunna","avatar_url":"avatars/3843847.png?_=0da495ccd261e3a7","is_superuser":false,"is_staff":false},"post_date":1612415255,"body":"I really just spent over 2 hours reading this, and I don't regret it one bit. Amazing story"},{"id":1340885,"gallery_id":168165,"poster":{"id":1022889,"username":"marshmallowAAV","slug":"marshmallowaav","avatar_url":"avatars/1022889.png","is_superuser":false,"is_staff":false},"post_date":1605528994,"body":"better plot than most non adult stories really good ending"},{"id":1068561,"gallery_id":168165,"poster":{"id":1077136,"username":"adrienette","slug":"adrienette","avatar_url":"avatars/1077136.png","is_superuser":false,"is_staff":false},"post_date":1594359986,"body":"She didn't even die you see that in page 1348 looks like there relationship will continue"},{"id":1032717,"gallery_id":168165,"poster":{"id":3392325,"username":"yuri766","slug":"yuri766","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593038631,"body":"Best webtoon I have ever read "},{"id":976781,"gallery_id":168165,"poster":{"id":2586546,"username":"AmMar Śąma","slug":"ammar-sama","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1563299375,"body":"Why did the higher-ups fire him? The relationships between the employees are none of their business."},{"id":927078,"gallery_id":168165,"poster":{"id":1092067,"username":"usaid9","slug":"usaid9","avatar_url":"avatars/1092067.png?_=60f2bd1b379df66e","is_superuser":false,"is_staff":false},"post_date":1559585505,"body":"She was weird.....wait she was crazy lmao xD"},{"id":903596,"gallery_id":168165,"poster":{"id":2448765,"username":"Xeus","slug":"xeus","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1557727735,"body":"Came here for you know what.... but dam this was amazing!\nThank you to those who made/published/translate this manga.\nSpoiler. She lives in the end (b4 end of chap 45 she is upwards)\nStory: “Guy” got big house, great career, hot wife, exp car, tries to maintain order, he hides his emotions to look strong. Meets Yeul ah, a girl who openly express herself, she doesn’t have much and she has has trouble past. It’s like total opposite. She teaches him to express himself, he falls for her, she plays along cuz it’s fun but later on she falls for him even nearly killing herself protecting “guy” from her ex. “Guy” found out her past, got scared so her cuts it off with her. Yeul ah gets sad and gets revenge destroying his job and his wife TOTALLY exposing everything. Mets Yeul ah at beach, tries to kill her but relies his finally free from being perfect. Yeul ah finally confess she is sorry that she killed her dad when she is about to die. Both are finally free to live life without guilt tgth"},{"id":902935,"gallery_id":168165,"poster":{"id":2350915,"username":"Knightmare666","slug":"knightmare666","avatar_url":"avatars/2350915.png","is_superuser":false,"is_staff":false},"post_date":1557678940,"body":"We gentlemen come here for porn,not mainly for scenes,right?"},{"id":886969,"gallery_id":168165,"poster":{"id":1621284,"username":"Thump Bumper","slug":"thump-bumper","avatar_url":"avatars/1621284.png","is_superuser":false,"is_staff":false},"post_date":1556355743,"body":"I hated every second of it, that being said it was fantastic.\n\nThe emotion I felt, nearly brought me to tears, nearly made me shout in pure rage. The raw real, UNBRIDLED emotion that exudes from this comic was intense and it was damn near painful... \n\nMessage to The Man Who Wrote This: Thank you so very much, for the experience of witnessing this comic"},{"id":880431,"gallery_id":168165,"poster":{"id":1935447,"username":"adlananime","slug":"adlananime","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555782265,"body":"Ok this is what i think happen he decided not to kill her because he thinks she's and him both share the same feeling of despair and so i think they both would want to continue there relationship because that's the only thing they both can look forward to and so they both tried to keep on living life to the fullest together!!!"},{"id":879850,"gallery_id":168165,"poster":{"id":2398361,"username":"Idon'tknow?maybe","slug":"idon-tknow-maybe","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555734226,"body":"Legit just made an account to say this. \nI hate all NTR shit or cheating shit mainly because I can't stop myself from putting myself in a position on the dude being cheated on. I can't explain it very well but it's like a tightening feeling in my chest and I felt like shit throughout this entire story. I hate how rug man and the wife fucked the most. "},{"id":758461,"gallery_id":168165,"poster":{"id":2107336,"username":"maxrocko","slug":"maxrocko","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1545025685,"body":"God dam, there was a couple silly (not dying from a car crash twice....) things, overall though this was great. Made an account just to favourite."},{"id":729596,"gallery_id":168165,"poster":{"id":1321053,"username":"Slathor","slug":"slathor","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1541769632,"body":"this one really leaves a stain in my heart. one of the first if not two if you include emergence that makes me stop reading hentai for a month. yes the husband really did deserve that for cheating but the company that cause it and still continue to operate like nothing happen really makes sad for this. also the wife that is being fuck by that boy are more depressing than this. i don't know but i just feel sad for that wife or more like pity"},{"id":716668,"gallery_id":168165,"poster":{"id":1838823,"username":"Bob Lee","slug":"bob-lee","avatar_url":"avatars/1838823.png","is_superuser":false,"is_staff":false},"post_date":1540195483,"body":"Candy girl is still alive. On page 1347 and 1348 she hugged the main guy."},{"id":709161,"gallery_id":168165,"poster":{"id":1552591,"username":"Akari_DaPyon","slug":"akari_dapyon","avatar_url":"avatars/1552591.png","is_superuser":false,"is_staff":false},"post_date":1539328589,"body":"Ah the classic End of Evangelion ending lmao but no I'm actually really surprised I ended up reading this whole thing and I gotta say I'm kinda glad I did. It was good! More or less. Shows what happens when you give a handful of sociopaths the ability to fuck each other lol. I see a lot of people trying to interpret the ending so here's my take: I think he DID kill her and I think he ended up killing himself afterwards. I mean his life is practically over at that point, he lost everything and realized that he's the lowest of the low. I don't think there's any bouncing back from that :'/"},{"id":670236,"gallery_id":168165,"poster":{"id":1230299,"username":"ItsAtlas","slug":"itsatlas","avatar_url":"avatars/1230299.png?_=17a96b9c3a1d3145","is_superuser":false,"is_staff":false},"post_date":1535512763,"body":"after she did it with rug boy i though to my self i hope everyone dies itwould be more conclusive if the mc killed everyone because theres still that high chance of what ifs and whats gonna happen after @PornTroller i thought tit was korea gg  check mate i wanna die LUL if this happened to me i would be like hey i fcked some one else im sorry and probably prepare a gun to my fore head"},{"id":412023,"gallery_id":168165,"poster":{"id":1530712,"username":"victor218","slug":"victor218","avatar_url":"avatars/1530712.png?_=f8b110571ca1cd50","is_superuser":false,"is_staff":false},"post_date":1522802086,"body":"It is super sad, when his wife being fucked by that little boy."},{"id":338018,"gallery_id":168165,"poster":{"id":742085,"username":"cachoron","slug":"cachoron","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1513975781,"body":"I no like they end :("},{"id":162628,"gallery_id":168165,"poster":{"id":1208769,"username":"Smiling Old Man","slug":"smiling-old-man","avatar_url":"avatars/1208769.png","is_superuser":false,"is_staff":false},"post_date":1504871688,"body":"DID SHE JUST SAY \" DADDY I'M SORRY\"????????"},{"id":146139,"gallery_id":168165,"poster":{"id":856263,"username":"PornTroller","slug":"porntroller","avatar_url":"avatars/856263.png","is_superuser":false,"is_staff":false},"post_date":1501248611,"body":"Wow, I was not expecting that outcome at the end but it sure was entertaining. With that open ending, my imagination likes to think he didn't kill her and let her go. Deciding to live a new life far away on the other side of japan to get away from his past with a reinvigorated attitude. Where he finds a new girlfriend where this time he uses his previous faults to make it a successful marriage. Then he gets back into business where his new company outshines his old company flipping them off. Then his ex wife gets butthurt cause he be balling up in this bitch. So she tries to get with him but he a changed man he aint with that ho shit anymore. So she goes back to her fuckboy rug maker and lives her life working as a teacher not making as much money as my boy. There you go that's the conclusion to it all."},{"id":142180,"gallery_id":168165,"poster":{"id":287943,"username":"johan8989","slug":"johan8989","avatar_url":"avatars/287943.png","is_superuser":false,"is_staff":false},"post_date":1500428700,"body":"she didnt die? or she die?"},{"id":98109,"gallery_id":168165,"poster":{"id":944063,"username":"LuvDemTentacles","slug":"luvdemtentacles","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1489225202,"body":"I honestly really enjoyed this! I'm usually not into NTR, but this story was really fucking good! And at the ending I actually thought the manager killed Yeul-Ah, but then hugged her and in the after credits she hugged him back! I am still a little conflicted and kinda said inside, but I REALLY wanna see what both relationships turned out like in the end, like a bonus chapter to make up for the incredibly heart breaking and bitter sweet ending."},{"id":96070,"gallery_id":168165,"poster":{"id":439089,"username":"J3eaty","slug":"j3eaty","avatar_url":"avatars/439089.png","is_superuser":false,"is_staff":false},"post_date":1488484715,"body":"Can someone write   a  short story  for me? readed the coments and  looked  a  little through ... i dont like ntr stuff thats why  wont  read  but want to know  the storry^^"},{"id":79918,"gallery_id":168165,"poster":{"id":494509,"username":"LazyGuy35","slug":"lazyguy35","avatar_url":"avatars/494509.png?_=694241f0dfb62ecb","is_superuser":false,"is_staff":false},"post_date":1482550879,"body":"Man, what a coward,i would have killed that psychotic bitch."},{"id":78707,"gallery_id":168165,"poster":{"id":864559,"username":"RiceNPie","slug":"ricenpie","avatar_url":"avatars/864559.png","is_superuser":false,"is_staff":false},"post_date":1482007903,"body":"I really liked this! Man, I want a yandere chick. But, these situations are so lame in real life though. If you don't like someone, just leave them. It's easy, \"Nothing bad will come of it.\" :) I mean especially if you're going to cheat. You've already disregarded the cheated person's feelings! Haha! They weren't even havin sex anymore so he gained nothing from his wife.\r\n\r\nSPOILER:\r\n\r\n\r\nI wish Yeul-ah killed the wife and the shop kid. The class mate he was seeing before was a better choice. He's trash for going after a married woman, at least Yeul-ah was a sociopath."},{"id":78548,"gallery_id":168165,"poster":{"id":882857,"username":"just_someone","slug":"just_someone","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481905787,"body":"You know, usually I'm just a lurker and don't even start writing comments - yet have an account xD\r\n\r\nAfter (mis)-reading the manga at first - I WAS SO FURIOUS - I literally thought, that she was a goner. I really had to hit something (my desk) to calm down again and even then the rage was still there. And I am a really calm person, you really have to do something significant to even upset me...\r\nI was tremendously unsure of how to see this manga - either total genius because of the really well plot - or just angry since even in a manga, in which I learned to deeply care for the characters, they get treated like trash in the end.\r\n\r\nWhile reading this manga, it really helped me to heal some of my old wounds, you know the psychological ones.  You can imagine my shock as soon as I read the ending.\r\n\r\nThank god that I reread it several times to really make sure what actually happened. And I am more then relieved right now. This manga is a real treasure and I will always appreciate it :)"},{"id":77918,"gallery_id":168165,"poster":{"id":878379,"username":"pusseh69","slug":"pusseh69","avatar_url":"avatars/878379.png","is_superuser":false,"is_staff":false},"post_date":1481633499,"body":"Whaddis fucked up ending \r\nLike most of the part but ze fking ending boi , idk what to feel xD"},{"id":51210,"gallery_id":168165,"poster":{"id":580230,"username":"mangamasterxxx","slug":"mangamasterxxx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1467700202,"body":"wonder what other versions it could have been. in NTR style maybe the guy gets both girls cause hes just so good but they made the kid also be some what decent. really want to see/know whats going through the wife's mind, feels that shes still not happy with the way things are and is in denial."},{"id":50998,"gallery_id":168165,"poster":{"id":286148,"username":"Redo","slug":"redo","avatar_url":"avatars/286148.png","is_superuser":false,"is_staff":false},"post_date":1467569266,"body":"What a fucking ending, Not good neither bad. Idk what to say."}]