[{"id":437564,"gallery_id":169432,"poster":{"id":1176143,"username":"Cemb77","slug":"cemb77","avatar_url":"avatars/1176143.png?_=104a35d195e85a6c","is_superuser":false,"is_staff":false},"post_date":1525068796,"body":"But Ricky surely you must see that the Delivery guy is a beta male though, he signed himself a bad end route ticket when he banged the wife of professional hitman. Personally I couldn't bring myself to cheer on any of the characters, they're all bad people in some way but part of what makes things interesting imo. This is fully translated else where, I've read till the end, I won't spoil to much but between the hitman Husband, his manipulative sex crazed wife, and the delivery guy none of them really come out on top,  the kind of lies and deception going on in this story generally don't lead to happy endings. I was very pleased with how it all concluded, mostly because everybody got burned by their bad deeds. Sadly Ricky I don't think you'll like how it all ends, but only you can really be the judge of that."},{"id":54803,"gallery_id":169432,"poster":{"id":669413,"username":"RickyRexIbarra","slug":"rickyrexibarra","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1469554588,"body":"I literally ready all 857 pages and have never read one all the way to current... I'm rooting delivery boy all the way but I already feel like it's gonna be cheesy and assassin is gonna change. I'll bet on it."},{"id":54802,"gallery_id":169432,"poster":{"id":669413,"username":"RickyRexIbarra","slug":"rickyrexibarra","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1469554454,"body":"Please, please don't let assassin win his wife over... I'll hate this so fucking much. Please don't let this one be a disappointment. Delivery Boy!"},{"id":54193,"gallery_id":169432,"poster":{"id":278257,"username":"animetiddies","slug":"animetiddies","avatar_url":"avatars/278257.png?_=e0a4b933604bb3b5","is_superuser":false,"is_staff":false},"post_date":1469247354,"body":"This is so good!!"},{"id":53921,"gallery_id":169432,"poster":{"id":576850,"username":"Tusk","slug":"tusk","avatar_url":"avatars/576850.png","is_superuser":false,"is_staff":false},"post_date":1469096044,"body":"Assassin huh nice!!!!!!"}]