[{"id":1042777,"gallery_id":173306,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593429168,"body":"@AkitoH Actually, we see from a flashback that the first one to make her any sort of feminine was Gin when he had her start wearing the hairpin. The fact that she never tried to be more feminine for him before the Sensei idiot got to her is pretty telling, though... :/"},{"id":1042772,"gallery_id":173306,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593429048,"body":"\"She never really did anything wrong until the very end.\" lolwut? She fucked up the moment she didn't go to Gin to help her...she messed up by not having any trust in him to help her like he promised. She broke their promise right from the beginning. Morever, she did wrong when she started to enjoy the creeps \"affections\" and lying to Gin."},{"id":1042757,"gallery_id":173306,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593428369,"body":"@nma2mia Wut? No...this is just the weakness of a weak minded idiot."},{"id":70916,"gallery_id":173306,"poster":{"id":792911,"username":"That Guy 319","slug":"that-guy-319","avatar_url":"avatars/792911.png?_=230a595efe04ec92","is_superuser":false,"is_staff":false},"post_date":1478518220,"body":"What an idiot...she honestly got what she deserved."},{"id":68223,"gallery_id":173306,"poster":{"id":778138,"username":"nma2mia","slug":"nma2mia","avatar_url":"avatars/778138.png","is_superuser":false,"is_staff":false},"post_date":1477059956,"body":"I feel sorry for her. When a weakness of a lady 😢"},{"id":67254,"gallery_id":173306,"poster":{"id":507349,"username":"BusKota","slug":"buskota","avatar_url":"avatars/507349.png","is_superuser":false,"is_staff":false},"post_date":1476582236,"body":"i dont know.how many good fap this series has gave to me,\r\ni hope there will be sequel, since in the end of chapter 1 i believe our beloved heroin doesnt have happy cute face rather confused \"what the.fuck should i do\" face when she accepted gin love. i think maybe she either (or both lol)\r\n1. confused how to tell gin chan that she is pregnant by their fucking teacher.\r\n\r\n2. how to stop her healty activity with her teacher ( there is no strong hint that she stop her activity with that mamals, so its safe to assume that she still doing that).\r\n \r\noh i kinda agree That her smile wheen she knew she was pregnant is \"i am fucked\" smile, maybe just maybe, she want to marry her teacher since, well she pregnant and she assume gin chan is gone since that cute girl confess to him.\r\n\r\nin the end i feel sorry for you gin chan. \r\nand myself for my poor grammar."},{"id":66896,"gallery_id":173306,"poster":{"id":455597,"username":"ethan2111","slug":"ethan2111","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1476424123,"body":"(TOT) NOOOOOOOOOOO!!!!!!!"},{"id":66862,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1476411263,"body":"@ethan2111 - Calm down dude, one thing that you have to understand is that this is a work of fiction. Second they are not dating if you saw and read chapter one you can see that she is in disbelief she thought he was dating the other girl and when Gin confirmed that she was the only one for him she literally and figuratively crumbles… she is regretful about all the ordeal with the scumbag teacher... But if you interpret the last panels of that chapter she is far away from Gin and her words accompanied with her shaking from her shame can be interpreted as saying a farewell to Gin."},{"id":66343,"gallery_id":173306,"poster":{"id":785131,"username":"Rintaro","slug":"rintaro","avatar_url":"avatars/785131.png","is_superuser":false,"is_staff":false},"post_date":1476139845,"body":"filthy disgusting mucky hideous nasty loathsome it series"},{"id":65923,"gallery_id":173306,"poster":{"id":455597,"username":"ethan2111","slug":"ethan2111","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1475938282,"body":"If it was a 1 night stand, then setsuna probably wanted a memory of gin before she goes back to being with the sensei. Call it a memento or whatever, for the time of which they spent having a unrequited mutual love for each other. But if they actually got together in chap 1 then chances are she'll get an abortion to have a fresh start with gin."},{"id":65922,"gallery_id":173306,"poster":{"id":455597,"username":"ethan2111","slug":"ethan2111","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1475937889,"body":"@metroid Your right, sorry about the earlier comment I thought this was based on a series but it was actually an original  ('=') But I can't still get over the chapter one being a closing chapter, I mean can't really put my finger on the whole \"was it a give up smile or I'm so happy smile she made on this chap and in chap 1\" maybe its because the lack of conveying expressions or whatever. I just want to know if they actually got together in chap 1 or was it a 1 night stand."},{"id":65805,"gallery_id":173306,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1475867232,"body":"@ethan2111 This is manga u moron not a doujin and if u cant still undersdtand the story u are more stupid than I thought"},{"id":65660,"gallery_id":173306,"poster":{"id":455597,"username":"ethan2111","slug":"ethan2111","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1475761071,"body":"Sorry guys, but I need some confirmation on this one. They got together in Chapter 1 right? They started going out in Chapter 1 and had sex right? What happened in chapter 1 wasn't just a 1 night stand right? NTR doujin really is like poison to the mind, for some reason or another I feel like I Can't settle down, I really want to kill that sensei and take setsuna because I cant bring myself to hate this character. Guys I really can't settle down, does this kind of thing happen in real life? I mean really masturbating from a dirty shirt and getting blackmailed for it, does that even happen? Would a girl really let that happen? I think at best most girls would refuse and create a ruckus at school and get the sensei in trouble right? (I'm a guy with no romance exp. so I can't really say anything for the women in the world). Well I've read this and now my life's been ruined (first time reading NTR). pls reply anyone."},{"id":63955,"gallery_id":173306,"poster":{"id":755753,"username":"sirflim","slug":"sirflim","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1474807453,"body":"You know, it's annoying. She never really did anything wrong until the very end. (I'm naturally assuming she will not reveal the pregnancy belonging to sensei) -- Even when she got the pregnancy confirmation, she didn't know he liked her yet, and was prepared to actually get together with the teacher. Her smile was her resignation that this was just how things were going to work. It's a pretty sat twist of fate that he confessed to her right when it was too late, but honestly we all know she's never going to reveal the truth and protag is going to be stuck raising a bastard."},{"id":62898,"gallery_id":173306,"poster":{"id":698415,"username":"Feronen","slug":"feronen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1474325568,"body":"...and like any woman, she will lie to Gin that the child is his, just so that she can protect herself. Well played, Yuzuki. Well played."},{"id":62884,"gallery_id":173306,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1474317082,"body":"He is my favorite hentai artist but for his stories rather than his art which is not bad  at all"},{"id":62840,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1474305198,"body":"@metroid - I don’t know how to describe it but I’m a big sucker for Tsuyatsuya art style I like that old school feel and the way he draws mature women, Yummy!"},{"id":62784,"gallery_id":173306,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1474285989,"body":"Tbh I have little interest in this story so it doesnt really maetr to me if it gets an epilogue or whatever. Now if only the remaining chapters of  Monokage no İris are translated...."},{"id":62671,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1474228329,"body":"@metroid - Lol! the comment system doesn’t allow me to post in one single post... By the way the October 7 manga supposedly have a 4 page only sequel..."},{"id":62630,"gallery_id":173306,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1474209863,"body":"Four posts in a row. Wow, you  are in a roll."},{"id":62545,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1474164302,"body":"@kaitoan - The problem is as soon as that panel showed Setsuna positive pregnant test it practically sentences Gin to be stuck with a child that it not his unless she miscarries or have an abortion (assuming Yuzuki cover this route in the paperback in October) but this story left much to be desire (not sinking enough in the mindset of characters, left sub plots hanging and many more things) and if the story doesn’t give a conclusive ending be it bad or good one (to me open ending like this one are a cop out) that is why I feel this is Yuzuki weakest work at the moment It possible that I may change my opinion in October when the manga with all the chapters and maybe an epilogue or extra chapter come out…"},{"id":62544,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1474163935,"body":"@kaitoan - Again I can’t believe that Setsuna by not trying to seek help and repot the bastard will make more victims (sensei loose in high school) potentially have more girls feeling the same way and experience the same hell as she did… Now being sorry for her and wanting her happiness doesn’t mean that I want her happiness at the cost of Gin-chan (raising a child that it not his and being reminded by that innocent creature every day that it doesn’t have his own blood) you can say if Setsuna was giving him some kind of hints maybe you said that is the price for him not noticing sooner, but she never did that (until this chapter we never had a Gin-chan POV). So I want Gin to help her but I want Setsuna to let him go paying the price/consequences for her nativity but not losing his friend."},{"id":62543,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1474163293,"body":"@kaitoan - Back to this story I feel sorry for Setsuna (Yes, I know she is dumb as f*ck) she practically got what she deserved by not seeking help from Gin-chan and by not asking him about his relationship with Tomoe and seeking sensei d*ck for consolation. Looking at the images in this chapters we can interpret by looking at the flashback that Gin was trying to make her feel like a girl (giving her hair pin and protecting her)... That is why I don’t understand why she didn’t seek his help (of course is Mnagaka-san who wanted this direction) they were so close but she chooses to be a total stranger to him by not interacting the same way a couple of months contradicting herself (remember that she endured the blackmail to keep all the things the same between her and Gin)..."},{"id":62542,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1474162510,"body":"@kaitoan - I'm going to tell you a secret I don’t FAP to H-manga that doesn’t mean I don’t get aroused by looking at the art but I like to read H-manga for the story... Taking in consideration the over used route of boy/husband/boyfriend get stuck with a whore/slut that backstab him in the back or the masturbating while crying ending (this remind me of Call Of Duty &amp; Guitar Hero oversaturation) I can understand your statement but not all NTR have bad story telling (Yeah, Hentai logic I know, Lol!) there are a few gems out there and I’m not talking the ones that only have good ending (The few ones that have supposedly a good ending only reward the whore/slut at the end) they are ones that have bad ending and the story is decent, of course there are ones that have good ending and have a great story as well as bittersweet ones… Also different people have different fetish (They also have the right to feel good? don’t they...) So don’t give up on this great hobby."},{"id":62530,"gallery_id":173306,"poster":{"id":744728,"username":"kaitoan","slug":"kaitoan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1474144318,"body":"satisfied... yeah.. to the point that I will never want to read hentai again... \r\nnow i see why people said ntr is some kind poison. and for some people it is their drunks... they are must be a M. \r\nI agree some for people opinion. that dumb girl got what she wanted... at prices, the boy mental scars ( trauma )\r\nor maybe ntr purpose only to made reader feel burn by jealous? wow ntr really scary shit..."},{"id":61577,"gallery_id":173306,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1473726757,"body":"yet another satisfied ntr reader lol"},{"id":61572,"gallery_id":173306,"poster":{"id":744728,"username":"kaitoan","slug":"kaitoan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473724917,"body":"i got feeling that dumb girl not happy when she know she is pregnant.. it almost like \"it is what I deserve for what happened\" . and when gin confessed her. she denied to believe it is the truth.. and when she touches her belly and came to tears.. it feels like \" what have I done all this times and I don't deserve to be with gin \" also I got feeling that gin know that the dumb girl having relationship with someone and when she come to tears.. he got feeling that the dumb girl have done something that can't be undone... so he forced his way and tell her she the only one for me... \r\n\r\nso even gin and that dumb girl ended together the scars will be remain for ever... and no one telling will they keeping that cursed sensei child or not... and clearly it only bring bad memory... and no one can be sure that cursed sensei will come to that dumb girl one day and blackmail her again...\r\n\r\nbtw no retribution come to that cursed sensei ? this world is not fair.\r\nreading this really piss me off."},{"id":61571,"gallery_id":173306,"poster":{"id":744728,"username":"kaitoan","slug":"kaitoan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473724785,"body":"god... this story really really really make me nut.... i made this account only to comment this trashy (not because the story is bad but because I hate it ). I really regret why I read this story... fvk\r\nok... let me say my unimportant comments if not... i can't live peacefully\r\n\r\nthat dumb girl really idiot for not telling that gin boy her problem from the start... but if not for that cursed sensei ntred that that dumb girl. gin will never realized that he love that dumb girl... at ch 1 it clearly stated that gin just realized that he love that dumb girl after that cursed sensei tamed her.  her femininity come from fucking with that cursed sensei... \r\nto many regret in this story. that dumb girl clearly accept that cursed sensei as he keeping their forbidden relationship till the graduation day and he get pregnant."},{"id":61228,"gallery_id":173306,"poster":{"id":613925,"username":"EatAssDay","slug":"eatassday","avatar_url":"avatars/613925.png?_=d9c2ea8e6cd82b3f","is_superuser":false,"is_staff":false},"post_date":1473587577,"body":"I just realized that chapter \"1\" is actually chapter 8... fuck you author. Now I don't know what to think anymore. I wanna know what happens..."},{"id":60820,"gallery_id":173306,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1473389858,"body":"Seriously this is one of the  weaker ntr stories right here. It doesnt even make me rage  since its pretty tame . Gin still could get together with Tomoe and might dump Setsuan after learninig about teh pregnancy. Sure it might hurt him but in the long run he is bettter off without teh dumb slut . This is also a first for Yuzuki as it is the first tiem she used the pregnancy route in her ntr work. Well Im glad it has ended it dragged too long and it got boring tbh. Now its tiem to wait for translation to make a healthier interpretation of the ending. I sugegst you do the same before u raise a shitstorm."},{"id":60649,"gallery_id":173306,"poster":{"id":720485,"username":"Kronos3111","slug":"kronos3111","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473311196,"body":"I think teacher an dstudent stay together and actually live happy life, the other guy moves on and dates that other girl"},{"id":60627,"gallery_id":173306,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1473298988,"body":"@Troncol that's definitely the question. That's why I'm mostly fine with the ending. I can fill in those questions on my own to satisfy my own curiosity. I personally believe Gin and setsuna will be fine and I believe they can find a comprimise on the matter. I'm mostly just happy that it worked out somehow in the end. Does she want to keep it? She smiled when she found out so I'm sure she became attached to the Sensei. Honestly it'd make for a good sequel to show how she and Gin handles this but i almost dont want that Caz I feel like Yuzuki would just screw with my feelings with more ntr. They've been together for a good portion of their adolescence so I think they can work it out. But for that to happen I believe setsuna would have to be completely open and sorry about what happened.  Of course she could always abort it in secret . There are girls out there who keep deep dark secrets from their man to this day (sometimes that's best. Ignorance is bliss). This is no different."},{"id":60624,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1473298000,"body":"@edgyfaggot &amp; @AkitoH - I concur with some of your opinions regarding how dumb the Heroine was and how kind the male childhood friend is given this story a ray of hope but the question is... is Setsuna willing to abort the baby? and if yes is Gin is going to let her abort the baby? assuming this has the bittersweet ending that you reference in your comments...."},{"id":60623,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1473297777,"body":"@edgyfaggot - \"gin,im prego with your puto\" you are killing my sides... ^_^"},{"id":60620,"gallery_id":173306,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1473295311,"body":"@edgyfaggot i choose to look at the brighter side Caz yuzuki described this chapter as \"when love and friendship connect\" in the previous chapter. In other typical ntr the relationship is already established but the guy gets cucked because of a better dick. This one the relationship wasn't exactly established. They were friends who liked each other. They found their way to each other, just at a price. What she did was idiotic when she went and started fucking the Sensei before hearing Gin's feelings. That was her idiotic mistake, but she just gave up because she was too insecure about her appearance and how he saw her. She liked the sensei's dick, only natural honestly. If it feels good it feels good. Can't deny it forever. But she also loved Gin's dick as well and we didn't get some typical \"sensei's dick is better than my love's\" bullshit. The flashback was used to show that Gin will accept her I believe from the looks of it. So I'm just looking at the best case scenario here."},{"id":60619,"gallery_id":173306,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1473294738,"body":"@edgyfaggot ntr stories piss me off so much. It stays in my head all day. Tbh I don't really know how I feel about her. I'm more bittersweet about her. I like her, but hate what she went through and what she's become as a result. It's typical ntr plot. She likes Gin but didn't think he liked her. When it was too late she had so many regrets and that fuck's with me.  She did have regrets too Caz she wouldn't have cried and thought about the child if not. But it since it's open ended I choose to look at the brighter side of things where everything is happy in the end. It calms the rage of the cuck for me. Even so idk. It's very bittersweet with a capital BITTER.  A part of me thinks Gin would support her because they've known each other forever. Apart of me thinks she'll abort the baby because she wants to be with Gin. Another part of me also knows that she accepted the Sensei and the child with it because she jumped to conclusions about Gin loving Tomoe. That much was idiotic of her."},{"id":60618,"gallery_id":173306,"poster":{"id":737514,"username":"edgyfaggot","slug":"edgyfaggot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473293532,"body":"It's fucking 7 am here and I cant sleep,so excuse my typos and grammar mistakes."},{"id":60617,"gallery_id":173306,"poster":{"id":737514,"username":"edgyfaggot","slug":"edgyfaggot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473293370,"body":"@AkitoH and man,I mean i'm cool with that. If she had sex with the teacher before going out with gin i'd be all like \"yeah that's fine, all in the past now\" but,issue here is,she's not going to tell him. She didn't tell him a thing,not one bit. Even when he confessed to her,alot of chances of her telling what happened to him,I know it's doujin logic. But still,she's know pregnant and is all like \"everything will be fine\" and that look like she regretted nothing. I mean,what the fuck? imagine if you were gin. imagine if she suddenly tells you that after you just had a spicy intercourse. now imagine her telling all of the back-stories mixed with lies. chances are even if she tells him everything. she's going to lie about like half of it. And to add. i'm also annoyed she turned into a fucking sluy and eventually enjoys it. and what the fuck lol,she doesn't deserve gin after being such a cuck."},{"id":60616,"gallery_id":173306,"poster":{"id":737514,"username":"edgyfaggot","slug":"edgyfaggot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473292901,"body":"@AkitoH can we at least agree on her being a fucking idiot? I mean i'm only pissed of about one thing. That face she made at chapter 1's last page. she's not planning to tell him anytime soon. chances are she'll say something like \"gin,im prego with your puto\" and when the baby is born black she'll be all like \"tis puto is your child ok?\" only reason i'm made is because overly used doujin plot, \"Dense guy,dumb cuck of a girl,some guy for ntr\" I mean you can't blame the guy for being dense and not realising,but this fucking typical female main pisses me off so harf,because I've seen this kind of fucking plot used so many times. And the ending tbh,was dissapointing. he basically made it a bad-ending but it's more like a cliffhanger"},{"id":60615,"gallery_id":173306,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1473292088,"body":"@edgyfaggot yeah I know. I was just in a moment because they were together in the end.  Tbh, the teacher is before Gin's time. It's the equivalent to her fucking someone else that wasn't Gin. Say like in a regular relationship. Chances are she had sex before meeting him (I'm just talking in general situations). Like me going out with a girl who's not a virgin. It's before my time. Sure I can be mad and frustrated about it, but at the end of the day it's mine now. Same thing here. It's over so the true ending is left for interpretation. You can envision it as her getting an abortion and beginning anew with Gin. Or you can envision it as Gin losing his shit over the situation. Both are pretty plausible to me. In any case I do agree the ending isn't really \"happy\". More so bitter sweet because she finally got what she wanted when she came to accept the life she was forced to live."},{"id":60614,"gallery_id":173306,"poster":{"id":737514,"username":"edgyfaggot","slug":"edgyfaggot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473291560,"body":"fuck why did I read this\r\nI cant sleep now.\r\ncan't fucking stop thinking of the possibilities of what's going to happen after this fucking mess."},{"id":60611,"gallery_id":173306,"poster":{"id":737514,"username":"edgyfaggot","slug":"edgyfaggot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473290815,"body":"My heart is aching because of how unlucky gin is."},{"id":60610,"gallery_id":173306,"poster":{"id":737514,"username":"edgyfaggot","slug":"edgyfaggot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473290626,"body":"But tbh for yuzuki this is quite a brutal ntr story-arc he made here. and wow the ending too,lmao. I would've killed the teacher if I was gin."},{"id":60609,"gallery_id":173306,"poster":{"id":737514,"username":"edgyfaggot","slug":"edgyfaggot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473290502,"body":"and wow @AkitoH quite the maniac aren't you. It's not a happy ending. Worst possible ending for gin. She's literally a used meat-toilet. Teacher's used property. And is pregnant with the teacher's child. gin may be kind. but what the fuck,lol. if it were me i'd say \"Abort that mistake or i'm fucking out,you slut\" You do realize she liked being fucking raped,right? well it's doujin logic,but still."},{"id":60608,"gallery_id":173306,"poster":{"id":737514,"username":"edgyfaggot","slug":"edgyfaggot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473290312,"body":"Okay,so. This is basically the conclusion: She's a dumb cunt,got pregnant with sensei's child. Now read chapter 1 again(if you read it already) it's technically the actual last chapter,and oh boy oh booooooy. I wonder how she's going to tell gin that she's prego with another man's child. Gin, you're one poor,unlucky fellow."},{"id":60606,"gallery_id":173306,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1473287119,"body":"Yeah, so I just confirmed that chapter 1 is the last chapter. I read the japanese version of the 2 and the sound effect when she hits Gin with the diploma are the same characters and what the person (Gin) says are the same thing. \"That hurts\" in that panel. I feel so much more at ease now :D Happy endings...happy endings everywhere. Yuzuki you clever fuck you xD. The ntr still hurt though."},{"id":60601,"gallery_id":173306,"poster":{"id":732603,"username":"Tristan182","slug":"tristan182","avatar_url":"avatars/732603.png?_=eedd23ca5af4c68b","is_superuser":false,"is_staff":false},"post_date":1473285450,"body":"Chapter 1 is basically the last chapter. But I wonder what she would say to Gin because she's pregnant."},{"id":60600,"gallery_id":173306,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1473285355,"body":"When I said bit cheaper I meant bitch* fuck auto spelling 😑"},{"id":60599,"gallery_id":173306,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1473285226,"body":"When I said Virginia I meant virgin*. I'm on my phone and this autospelling  is a bit cheaper xD"},{"id":60598,"gallery_id":173306,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1473285088,"body":"I looked at the ending as bad at first but now I actually see it differently. The first chapter is what happened after this chapter so in the end, they actually got together. \r\n\r\nChapter 1 was the \"prologue\" but also the continuation of chapter 7. It's confusing but makes sense when you take everything into consideration, especially when the graduation scene looks so similar to chapter 1 and when I see what Pierrot said. In chapter 1, she didn't act like a Virginia. When she ran to the \"person\" in this chapter, it mirrors the approach to Gin in chapter 1, but we're made to assume that she ran to the teacher. Very fucking clever yuzuki n dash.  Very fucking clever. The teacher made her more feminine in appearance. Whether it was intentional or not Gin ended up realizing her femininity because of what the teacher did. Still an ass hole for the ntr shit but yeah I think I get the ending now. At least this is what I hope is the case. I don't want the translated version to prove me wrong"},{"id":60566,"gallery_id":173306,"poster":{"id":737172,"username":"pierrot","slug":"pierrot","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473266317,"body":"i think she decided to stop seeing that teacher after finding out that she got pregnant. (she wore normal underwear, instead the slutty one on graduation day)."},{"id":60554,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1473259418,"body":"- continuation - 2.(chapter 1 &amp; 7) Gin telling Setsuna to tell him if she one day get in trouble (those 3 pages at the end) that he could help her maybe this flashback is happening at the same time that Setsuna is telling (after chapter 1) all that happened to her to Gin (seeking his help) there is a small window for a conclusion to this title in the October release..."},{"id":60553,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1473259288,"body":"Well full circle ending the thing is the backstory in my opinion was introduce too late in the story... With this kind of ending (no shown conclusion) the ending is for interpretation and it varies per person... for me I got two possible scenarios going by what we are shown here 1.(chapter7) Taking in consideration this chapter only the disgust in her face followed by her senile smile (In the panel when she discovers when she was pregnant if you look closely her mouth is giving a distaste gesture then she smiled unnaturally...) (Give up) when she found out about being pregnant and maybe the final page (when she is holding Gin hand as a child) is like a frozen moment in time for the two of them because in the present they would never be together (becuase Setsuna idiocy &amp; choices {not seeking help, not confronting her problems, not using protection, etc.)  continue -"},{"id":60551,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1473258711,"body":"@KuriYokan - I agree with you..."},{"id":60550,"gallery_id":173306,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1473258514,"body":"@Enoch  - NTR isn't just between established couples when it comes to hentai and such...it also pertains to strongly potential couples...ie...a couple that WOULD have ended up together if the douche didn't come out of nowhere and literally rape the girl away from the guy."},{"id":60549,"gallery_id":173306,"poster":{"id":35594,"username":"4rcane","slug":"4rcane","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1473257992,"body":"tomoe (friend of setsuna) confesses to gin, setsuna ran off without listening to gin's response\r\nSetsuna end up getting raped by teacher, have lots of sex \r\nSetsuna end up pregnant before graduation\r\nGin confesses to Setsuna at graduation and have sex after Setsuna already found out she was pregant with teacher"},{"id":60540,"gallery_id":173306,"poster":{"id":90990,"username":"KuriYokan","slug":"kuriyokan","avatar_url":"avatars/90990.png","is_superuser":false,"is_staff":false},"post_date":1473250440,"body":"I think that smile is not that \"she doesn't regret\", it's the \"I fucking give up\" smile. The kind when you're so exasperated, lost and have no idea what to do."},{"id":60538,"gallery_id":173306,"poster":{"id":736866,"username":"Enoch","slug":"enoch","avatar_url":"avatars/736866.png","is_superuser":false,"is_staff":false},"post_date":1473249469,"body":"We all know from the first chapter, that she was pregnant , so it safe to assume that we all knew this outcome would happen and it is not NTR because they are not together For your information."},{"id":60537,"gallery_id":173306,"poster":{"id":736866,"username":"Enoch","slug":"enoch","avatar_url":"avatars/736866.png","is_superuser":false,"is_staff":false},"post_date":1473249056,"body":"Let Me see if I got this right: right after that tomoe confessed her love to gin, that whore of a girl ran off to have sex with that son of bitch teacher. Why didn't she stay to listen to the rest? and sometime after that, she continued her forbidden relationship with that man and got pregnant. When she smiled after seeing the pregnancy test turn out to be positive, I can already tell she is not regretting what she did one bit. And it is really sad to think if Gin found out she was knocked up with a another guy's child, their relationship would take a dramatic turn. And also sad to think that she acts likes everything is going to be okay, oh if the story continued for one or two more chapters, I thinks things changed if gin found out."},{"id":60529,"gallery_id":173306,"poster":{"id":196028,"username":"Akazar","slug":"akazar","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1473245926,"body":"wow so she got  pregnent?"}]