[{"id":1664406,"gallery_id":177299,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1617742797,"body":"(u know the usual retarded mc who want to have a pure love even if she had gangbangs for her three meals!) retarded mc trying to deny it! but face says something else. (yup he still wants the nympho slut) so good slut interrupt him and says. hey wanna go out! in my opinion she will NOT ruin him instead make a man out f him, even if she didn't stays... so yeah every rerated mc needs a good slut! and it can be only slut that cuz she won't be fooled and knows everything fmc will do before even she turns...  btw at page 8 good slut says. ''look at the good side. u get to know her other side before u confessed'' so she probably knew this her outer appearance is only to fool others. and mc is sooo one of them. so she had to do it! idk wt it is. but i really wanted to admire that good slut. even though she's a slut(gal or wtever same thing right).. xd!"},{"id":1664385,"gallery_id":177299,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1617741965,"body":"as u see story is shit! at the first page mc going to confess her on her birthday but she says she got something important to do and leave (politely) so mc lost her chance. and the whole thing was seen by the other girl. she encourage him to do it today and confess her. then they found out that she was nyampho slut! it was a shady sex club and she was in hurry cuz she want to have her biggest birthday gift! (yep the gangbang) even other girl first time seeing this club. before only heard it. well u know the rest mc got into shock but he's hard and he's cursing himself for that so the good slut says it's perfectly normal and let me give u a head. well they end up having sex. even good slut thinks she might fall for him. btw it's mc's first time. u know the usual. xd well after this at the last page good slut ask him are u still on that.? says just drop it she's trouble and ur only asking for it! (to the next comment)"},{"id":561256,"gallery_id":177299,"poster":{"id":788348,"username":"Zam666","slug":"zam666","avatar_url":"avatars/788348.png","is_superuser":false,"is_staff":false},"post_date":1530290067,"body":"There is an English translation on Tsumino."},{"id":68543,"gallery_id":177299,"poster":{"id":35911,"username":"lastipo","slug":"lastipo","avatar_url":"avatars/35911.png?_=e168c4779ed04343","is_superuser":false,"is_staff":false},"post_date":1477253737,"body":"metroid, thanks for info..."},{"id":68375,"gallery_id":177299,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1477151550,"body":"In case anyone wodners there is already an ENglsih translted version of this manga yet yo ucan only download it from torrent because of fakku's money grabber jewish boss"}]