[{"id":669351,"gallery_id":178970,"poster":{"id":1825383,"username":"Throat-fucking lucy's face","slug":"throat-fucking-lucy-s-face","avatar_url":"avatars/1825383.png","is_superuser":false,"is_staff":false},"post_date":1535416201,"body":"with you dick stuffing it and her eyes watching seeing the pleasure u get as you use her just like a mere oral onahole as she begs for the moment when you come in her throat and she swallows just to end her degrading humiliation."},{"id":669347,"gallery_id":178970,"poster":{"id":1825383,"username":"Throat-fucking lucy's face","slug":"throat-fucking-lucy-s-face","avatar_url":"avatars/1825383.png","is_superuser":false,"is_staff":false},"post_date":1535416043,"body":"uh the way she offers the delicious tray of chest meat with me cock deep inside it and her hands around to squeeze it and carry it. I would still choose to be that man who had her on all fours kneeling forward to him where he is looking down on her and can see her ample chest swinging, her big round ass pushed up and the humiliated look on her face looking up at him seeing his dick right infront of her as she looks up and relealizes how this looks from his point of view. Then having to kiss, lick and suck his dirty thing until he decides to grab her head and treat her like a sex toy , and she knew it was coming,  Until finally taking full reign, surrounding her head completely with your fingers, giving her no room for escape, pulling her forwards towards you making her look like a bitch with her thighs spread, her ass pointing up at you and her arms on the ground while her eyes water as you drive your dick in a dn out as hard as you can with her only having her mouth completely agape "},{"id":669321,"gallery_id":178970,"poster":{"id":1825383,"username":"Throat-fucking lucy's face","slug":"throat-fucking-lucy-s-face","avatar_url":"avatars/1825383.png","is_superuser":false,"is_staff":false},"post_date":1535413122,"body":"Omg they really used her well. The guy fucking her deep from behind while squeezing her tits as he likes. The one who had his dick engulfed in her big fat tits looking from above at her while she is humiliated by feeling it throb between her tits and seeing the head coming in and out of her beloved chest while forced to use her hands to squeeze his dick as hard as possible to make him feel good on the expense of her dignity only to finally look up at him with pleading eyes while he covers her face with his seed. so submissive that she is still looking at him with those eyes after he finished plastering her face with his dick still between her buxom chest, and how that cock looked hotdogged in her ass."},{"id":72469,"gallery_id":178970,"poster":{"id":52357,"username":"Pegasus80","slug":"pegasus80","avatar_url":"avatars/52357.png","is_superuser":false,"is_staff":false},"post_date":1479272809,"body":"Muy bueno, ojala traduzcan los siguientes capítulos, ya que están salteados."}]