[{"id":719869,"gallery_id":179201,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540602396,"body":"@Saunic Tsumino has this in English. Here's the link hope it helps \"http://www.tsumino.com/Book/Info/25979/push-me-fakku\". \"Iexpectedbetter\" is right that this artist DOES have NTR, but his ratio of Non-NTR over NTR is higher on the Non-NTR side as he only has like one or two NTR compared to the rest. His stories plots can be silly, but their entertaining none the less (minus the NTR which are BADLY written to it \"relies\" on \"hentai logic\" to even work. And if pure stupidity is need to make the \"Diablos ex Machina\" that is a NTR happen, then it's the \"worst\" of the worst as it looks like the writer wanted to do something else. Fucked it up and/or forgot by the point the NTR in the story is suppose to happen, so they make up a \"stupid reason\" to cause it, usually making the girl take a \"Huge Level\" in uncharacterized\" stupidity just to make it happen. As Mind control or corruption doesn't happen in those type of stories. It's hard to ignore as the plot falls apart)."},{"id":719858,"gallery_id":179201,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540601683,"body":"@Iexpectedbetter Not \"all\" of his works are NTR and even the few NTR are so poorly written that their a \"non-entity. Read one of his where the \"cuck\" CF MC actually \"fucked back\" his stolen childhood friend and love interest from the BBM that stole her, rather then just sit there and take her \"friendzone constellation prize blowjob\" despite her protest, he even noted when he took her first kiss, despite her protests then, she still stayed around him, showing she was indecisive and his \"raping her\" ended up being the \"right move\" as the end of the story had her \"grabbing onto to him\" like she did during the \"First kiss flashback\" saying she \"hated him\"...like she did in the flashback showing he won and averted his \"cuck friendzone\" fate. \"Your right \"Sunic\", the girl had her love interest 'swiped' from under her, and the \"otaku' who saved her from committing suicide ended up \"winning\" her as his girlfriend (symbolized with her discarding her old picture and her appearance change).  "},{"id":714055,"gallery_id":179201,"poster":{"id":902196,"username":"nutitcles","slug":"nutitcles","avatar_url":"avatars/902196.png?_=a63bcd6bd8d31e2f","is_superuser":false,"is_staff":false},"post_date":1539914830,"body":"4. 55s and shot him"},{"id":72919,"gallery_id":179201,"poster":{"id":42880,"username":"Saunic","slug":"saunic","avatar_url":"avatars/42880.png?_=914676a3a8d6d47c","is_superuser":false,"is_staff":false},"post_date":1479466934,"body":"At first it seemed like NTR, but then there was some sweetness and realism. It's well written and I'll be keeping an eye on this author."},{"id":72709,"gallery_id":179201,"poster":{"id":378817,"username":"remos18","slug":"remos18","avatar_url":"avatars/378817.png","is_superuser":false,"is_staff":false},"post_date":1479382251,"body":"holy shit. this is interesting"}]