[{"id":829403,"gallery_id":179767,"poster":{"id":2282270,"username":"Eli123","slug":"eli123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1551163335,"body":"Donde lo encontraste"},{"id":746205,"gallery_id":179767,"poster":{"id":2076775,"username":"asgdsdgasdg","slug":"asgdsdgasdg","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1543664502,"body":"Did they take screenshots of the anime and make it a manga? \n\nhttps://hanime.tv/hentai-videos/kanojo-ga-mimai-ni-konai-wake-1"},{"id":576789,"gallery_id":179767,"poster":{"id":1351236,"username":"CloudHunter7","slug":"cloudhunter7","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1532115041,"body":"It I was that dude in that situation, all those other guys would be dead. "},{"id":95209,"gallery_id":179767,"poster":{"id":1007919,"username":"nickshadow5","slug":"nickshadow5","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1488170667,"body":"And Tsutomu in the hospital while seiji was sleeping. Seiji is shock, angry and sad because ai keep a secret from him, but still refuse to go back being with shouko. She start to abuse, rape and tried to choke him to death but the other nurse, the his neighbor from his apartment, another co-worker from his shop and his older sisters rushed in to save him from his ex. After that, he show pictures of ai with tsumtomu, they sorry for seiji and they'll doing anything for him...... anything, will seiji get over ai and move on?"},{"id":95203,"gallery_id":179767,"poster":{"id":1007919,"username":"nickshadow5","slug":"nickshadow5","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1488169500,"body":"After his girlfriend, Ai, dumped him for his co-worker, Tsutomu. Seiji is still in the hospital, sad and upset because ai broke his promise for not able to visit him anymore.The another nurse who take care of seiji came to check on him, she ask him what's wrong? seiji told her that his girlfriend left for one of my co-workers..... \" You deserved better theirs plenty of beautiful women out there, someday you'll find someone who's kind,faithful and deserve you and then you will forget about that slut.\" Nurse say it buy seiji is ready to move on.... yet, he thought thing didn't get any worse well it get worse, his despicable ex-girlfriend, Shouko, who was a nurse tries to talk to him and ask him for another chance, but he refuse because he never forgive her for what she did. Here the flashback about how they used to be couples and how that happen?, so that night, she tie seiji up but this time she him on her phone pictures of ai having sex with other men in the the club."},{"id":95196,"gallery_id":179767,"poster":{"id":1007919,"username":"nickshadow5","slug":"nickshadow5","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1488166318,"body":"They better make next season or game"},{"id":75350,"gallery_id":179767,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1480536816,"body":"No netorare tag seriously?"}]