[{"id":1241177,"gallery_id":179891,"poster":{"id":3361267,"username":"Queenslayer","slug":"queenslayer","avatar_url":"avatars/3361267.png?_=30e4e2e1879b4253","is_superuser":false,"is_staff":false},"post_date":1601322694,"body":"Get cucked, Inoue! Your ending sucks"},{"id":1163766,"gallery_id":179891,"poster":{"id":2885229,"username":"SilentJ","slug":"silentj","avatar_url":"avatars/2885229.png","is_superuser":false,"is_staff":false},"post_date":1598073899,"body":"The Soul Society arc wrote a check that the rest of the series couldn't cash. I love discussion on old doujin like this."},{"id":856230,"gallery_id":179891,"poster":{"id":1501587,"username":"ashondo","slug":"ashondo","avatar_url":"avatars/1501587.png","is_superuser":false,"is_staff":false},"post_date":1553566190,"body":"Can everyone shut up about the ships, save it for Twitter not fapping"},{"id":796010,"gallery_id":179891,"poster":{"id":952084,"username":"XSegaTeamPhilosophyX","slug":"xsegateamphilosophyx","avatar_url":"avatars/952084.png?_=f10b24d4d6e7098b","is_superuser":false,"is_staff":false},"post_date":1548232550,"body":"Who was the person that Ichigo was talking to on the phone?"},{"id":560006,"gallery_id":179891,"poster":{"id":1605957,"username":"BigNutBuss64","slug":"bignutbuss64","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530144297,"body":"If we’re talking about the last arc how was Rukia a useless side character? While she wasn’t always that powerful, I thought Kubo did a good job of at least making her seem important throughout the series, even if it was just emotional support, she was Ichigos rock for most of the series, whenever he was going through shit she’d be there for him. She killed an Espada &amp; in 1000 year bw she unlocked bankai &amp; defeated imo one of the stronger sternritter who had just molested big bro. 10 years later my sweet snow queen is a captain "},{"id":427840,"gallery_id":179891,"poster":{"id":215971,"username":"robypoo","slug":"robypoo","avatar_url":"avatars/215971.png","is_superuser":false,"is_staff":false},"post_date":1523566857,"body":"Meanwhile, in reality, fans of the canon ships had moved on long ago while the condescending fans of the \"better\" ships that were so sure they'd be canon are still crying in their corners of anal devastation whilst trying t convince themselves that since the end of the book wasn't very good it invalidates the actual canon pairings. I've learned the hard way it's better to just stay away from shipping altogether unless you just want practice for dealing with stupid people."},{"id":346945,"gallery_id":179891,"poster":{"id":374722,"username":"flognaw","slug":"flognaw","avatar_url":"avatars/374722.png","is_superuser":false,"is_staff":false},"post_date":1515454441,"body":"\nflognaw 59 seconds ago\n\nHow was Rukia degraded to \"useless side character\"?! She became captain, achieved Bankai got married started family and STILL remains close FRIENDS with Ichigo seems pretty eventful to me your more transparent about \"muh shipping\" than any IchiHime fan! \"it would have made more since if she ended up with Chad\" Orihmie's feelings for Ichigo being acknowledged and encouraged by Chad, Yoruichi Kisuke, Rangiku, Tatsuki and just about everyone else including Rukia herself right?"},{"id":346938,"gallery_id":179891,"poster":{"id":374722,"username":"flognaw","slug":"flognaw","avatar_url":"avatars/374722.png","is_superuser":false,"is_staff":false},"post_date":1515453852,"body":"Woah @frank111 your  only mad your shit didn't become canon Orihmie's feelings were never shallows and @a-babi so basically yeah Kubo admitted he rushed things but if anyone is under the impression \"the couples ended up being RenRuki and IchiHime\" has only been paying attention to freaking colorspreads and \"Sun and Moon essays\""},{"id":308710,"gallery_id":179891,"poster":{"id":1338536,"username":"CufiL","slug":"cufil","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1507670577,"body":"This isnt right, the book is scrambled"},{"id":74371,"gallery_id":179891,"poster":{"id":852905,"username":"a-baibl","slug":"a-baibl","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1480141726,"body":"A lot of fans things and ideas now better than end of Bleach. Not only because of goddarm couples. Many questions remain unanswered. Members of Zero Squad were suck. Soul King was lame. And so on. I think a couple of stuffed in the end on purpose, so ichihime and renruki fans can attacked at all dissatisfied with cries like: It's a canon, bitches! You're all fucking ichiruki's scums!\r\nIt's working first two weeks but now everyone is pay attention and recognize the end of Bleach is lame. Except OURCANONWON fans of course.\r\nMan that suck and sad at the same time."},{"id":74112,"gallery_id":179891,"poster":{"id":696384,"username":"frak111","slug":"frak111","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1480050773,"body":"@hithummah - Right? The entire last arc was disappointing. The biggest flaw Bleach had was turning Rukia into such a pointless side character. Frankly, it would have made more sense if Rukia and Ichigo ended up together. Yeah her and Renji had history, but their chemistry sucked. Orihime's \"love\" for Ichigo was nothing more than a shallow crush. It would have made more sense if she ended up with Chad."},{"id":74070,"gallery_id":179891,"poster":{"id":48826,"username":"hithummah","slug":"hithummah","avatar_url":"avatars/48826.png","is_superuser":false,"is_staff":false},"post_date":1480032897,"body":"Better than the real ending"}]