[{"id":1597115,"gallery_id":180879,"poster":{"id":2723215,"username":"marioforever97","slug":"marioforever97","avatar_url":"avatars/2723215.png?_=b25d7ad9404bd540","is_superuser":false,"is_staff":false},"post_date":1614806735,"body":"Well I'm neutral to those NTR things, but extreme femdom scenes are so hot! (i.e. marking balls with stigma). Other things I like are: 1. When Moka successfully catch him with locking his thumb fingers and tie him under the table, that hot when I think real girls can realistically do it too irl! 2. The loli at the end chapter initially was an ordinary innocent loli that become a sadistic in just 2 weeks (after found out that smacking balls can make the man stop cumming)"},{"id":1410644,"gallery_id":180879,"poster":{"id":3917278,"username":"chinchin_13cm","slug":"chinchin_13cm","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608134143,"body":"I'm japanese and it is the best hentai I ever read. It is the sad fact that the author no longer draw hentai. He write  general comic now.If you like the author, I recommend you read \"wondance\";it is story of high school dance club. "},{"id":1310978,"gallery_id":180879,"poster":{"id":2268073,"username":"TH3NOOB3L","slug":"th3noob3l","avatar_url":"avatars/2268073.png?_=791f6e620789729a","is_superuser":false,"is_staff":false},"post_date":1604326201,"body":"After all this time trying to found it back... It's finally here. Damn i missed that first part."},{"id":952799,"gallery_id":180879,"poster":{"id":291582,"username":"Zyzz unleashed","slug":"zyzz-unleashed","avatar_url":"avatars/291582.png?_=b50e4ae362765482","is_superuser":false,"is_staff":false},"post_date":1561484587,"body":"When i see this doujin i dont know why but it makes me want to shred a woman to many pieces."},{"id":854710,"gallery_id":180879,"poster":{"id":2339275,"username":"JackTheBaby","slug":"jackthebaby","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1553432924,"body":"Do y’all know any cuckold hentai?"},{"id":809945,"gallery_id":180879,"poster":{"id":2047122,"username":"Milf.Master69","slug":"milf-master69","avatar_url":"avatars/2047122.png?_=6e7df6b1464e46a1","is_superuser":false,"is_staff":false},"post_date":1549501586,"body":"V.V kill all cucks."},{"id":409697,"gallery_id":180879,"poster":{"id":1549115,"username":"Vequil","slug":"vequil","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1522479804,"body":"man, i read this shit til the end... don't even had a single boner, but the plot is in a morbid way interesting, is like the feeling that you have when you are watching a horror movie, i don't  think i will sleep well tonight...."},{"id":306422,"gallery_id":180879,"poster":{"id":894259,"username":"Kirbin all day","slug":"kirbin-all-day","avatar_url":"avatars/894259.png","is_superuser":false,"is_staff":false},"post_date":1507186218,"body":"I loved this, really brutal, but I like it.👍"},{"id":141286,"gallery_id":180879,"poster":{"id":326122,"username":"GreywolfNight","slug":"greywolfnight","avatar_url":"avatars/326122.png","is_superuser":false,"is_staff":false},"post_date":1500211305,"body":"Mame is the god of cbt hentai. Love how merciless his girls are. Never fails to get me off, wish there were more of his stuff.\n"},{"id":114827,"gallery_id":180879,"poster":{"id":421356,"username":"Buer Stinger","slug":"buer-stinger","avatar_url":"avatars/421356.png","is_superuser":false,"is_staff":false},"post_date":1493334888,"body":"One can dream right? Pretty nice read"},{"id":91866,"gallery_id":180879,"poster":{"id":950435,"username":"Rabbit_Lights","slug":"rabbit_lights","avatar_url":"avatars/950435.png","is_superuser":false,"is_staff":false},"post_date":1486957587,"body":"It's really obvious that it's fiction. That's why you have a group of whiny pissbabies in the comment thread right? :) It's not the hentai that's the issue, it's the people who read it. If everyone understood that everything in this work of fiction is fake, an illustrated work (just as you do you incredible genius you) nobody would give a shit unless they wanted to read it for jerk-off purposes."},{"id":91485,"gallery_id":180879,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1486818693,"body":"@Rabbit: it was discussed and properly explained as a work of fiction you twat. I do have the fetish ergo explained it. Its really fucking obvious its fiction, you know, its drawn. that said, they want it, the story shows in and out and proper progression, you're ranting about people \"not getting it\". Its a story and it has things that can be taken from it, some people don't speak english natively, it doesn't help this isn't english in origin, so simplified explanations and discussions are necessary. Its way better than the traditional comments of \"LOL, fuck that shit, if it was me I'd rape her\" those people obviously don't understand or respect the fetish."},{"id":87550,"gallery_id":180879,"poster":{"id":493354,"username":"bubbletehh","slug":"bubbletehh","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1485297255,"body":"Alright I admit to being slightly too harsh on my critique. I neglected that like many fetishes, NTR can't be understood by everyone. After a re-read of chapters 1-3 I realise that I was also wrong about the no precursor to NTR. It was stated very blatantly at the end of chapter 3 that girl 2 would have sex with any man. There was also the overall setting which states that the plot is in a female dominated world with females having multiple husbands."},{"id":87377,"gallery_id":180879,"poster":{"id":950435,"username":"Rabbit_Lights","slug":"rabbit_lights","avatar_url":"avatars/950435.png","is_superuser":false,"is_staff":false},"post_date":1485234930,"body":"I see a lot of conflict on the whole \"netorare\" issue as well. And that's a conflict originating from you trying to analyze a fetish that you don't possess. In this particular hentai manga, it should be fairly obvious that the two discussed terms and \"safe words\" before the activity occurred. Of course in this manga it's not as obvious. Firstly, it's fiction. Secondly, it's because in a submissive's mind; an \"scene\" where there are no ways out or to fight is ideal. (Usually until they get to the actually \"doing\" of course. That's why you use safe words.) I'm not really sure if you've caught this as well, but the male S is aroused by the events unfolding before his eyes, even if he does not express it as such. A gigantic aspect of the BDSM community is achieving pleasure/pain from flesh, but the mental torment as well. Again, that sort of play is not understood by individual's who do not engage in such activities. So read the tags and lay off the shit for those who want to read."},{"id":87376,"gallery_id":180879,"poster":{"id":950435,"username":"Rabbit_Lights","slug":"rabbit_lights","avatar_url":"avatars/950435.png","is_superuser":false,"is_staff":false},"post_date":1485234573,"body":"LOL, wow OK, this comment thread is a fucking trainwreck. I'm gunna to split my rebuttal into two pieces and address two issues that you guys have gotten seriously twisted or wrong. Let's first go with the overall treatment of the male submissives:\r\n\r\nThis is a work of fiction. Fiction means exaggerated and unrealistic perceptions of true events. This was illustrated by a male author that clearly knows what his wants are, and what his desired audience wants. If you guys think that crushing a man's testicles or keeping him as a slave is ethical or anywhere near reality, you need the ultimate bitchslap of truth.\r\nThis entire manga takes place within the \"scene\": an artificial reality/play where the author illustrates his ideal utopia. If this is an fetish that an submissive possesses, then who the fuck are the rest of you to judge him/her and the doms they place within this scene? If none of you possess a \"love-them-use-them\" fetish then it's stupid and pointless to try and understand."},{"id":87167,"gallery_id":180879,"poster":{"id":493354,"username":"bubbletehh","slug":"bubbletehh","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1485156400,"body":"I realise the ntr would turn some people on and all but it was really quite unnecessary, I've never felt this way (disgust at the female lead) about a femdom hentai before so I guess the author gets a plus for that. If the story was going to have ntr I would have liked for him to make it clear much earlier. I recommend only reading the first 3 chapters the fourth is quite confronting if you're heavily against cheating like myself."},{"id":79068,"gallery_id":180879,"poster":{"id":36120,"username":"Bena1","slug":"bena1","avatar_url":"avatars/36120.png","is_superuser":false,"is_staff":false},"post_date":1482188575,"body":"This is one of the most depressing fucking shit I have ever burnt, peirced hacked and ghost pepper salted my eyes with.\r\n\r\nI want to congratulate you, you won, my cold heart dropped low, i suppose you achived your goal.\r\nBut my inner me sinserly hope you burn"},{"id":78582,"gallery_id":180879,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1481925324,"body":"@Ruffy I know right? there is a fine line between that \"freaking hot!\" and \"freaking horrible!\" ...this stuff is just tragic. I love that femdom/viciousness but when its tinged with affection or love, but these \"throw away\" femdoms that treat like trash I just can't like..."},{"id":77547,"gallery_id":180879,"poster":{"id":26392,"username":"gendalf","slug":"gendalf","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481504128,"body":"add footjob to the tags"},{"id":77077,"gallery_id":180879,"poster":{"id":871561,"username":"Futanari123","slug":"futanari123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481280490,"body":"@Ravenleaf thanks for all the explanation. :)"},{"id":77067,"gallery_id":180879,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1481272902,"body":"that...is really up in the air. her disposition is that she says those things and how much she loves the butler, but she may be saying it only just to say it. You have to remember, the guy has an \"out\" she agreed that if he ever uses the out signal, she'd stop and go back to how things were, but she likes saying the cruel things because it makes him suffer. He is happy because he knows it makes her happy. I can't say she really loves the butler, because the last two pages are him expressing his insecurity, and her confirming she still loves him"},{"id":77063,"gallery_id":180879,"poster":{"id":871561,"username":"Futanari123","slug":"futanari123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481271388,"body":"@Ravenleaf i feel you dude. My heart aches when he agreed to that. Is the girl satesfied with his boyfriend. I mean that he can make her happy. But why the fuck do the girl still fucking agreed to that. Did she like getting Fucked by her butler. Plsss. Thsi is my last question. Thanks"},{"id":77039,"gallery_id":180879,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1481264294,"body":"@Futanari thats why I said, it hurts my heart, but I don't dislike this actually. Its sweet in its very weird/twisted way. I wouldn't want it, but they found happiness this way"},{"id":77017,"gallery_id":180879,"poster":{"id":871561,"username":"Futanari123","slug":"futanari123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481258490,"body":"@Ravenleaf That is Super crazy. And amazing in the sametime. That guy took it all just to make her happy. Thanks for the info"},{"id":77007,"gallery_id":180879,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1481255521,"body":"@Futanari yes, and he did agree to it. In the end, his happiness was her being happy, and her happiness was seeing him hurt as she fucked the other guy. So they still love each other, but this is how they chose to express it"},{"id":76953,"gallery_id":180879,"poster":{"id":871561,"username":"Futanari123","slug":"futanari123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481237666,"body":"@Ravenleaf so the girl still loves him and the boy Still loves her too. Pls answer"},{"id":76952,"gallery_id":180879,"poster":{"id":871561,"username":"Futanari123","slug":"futanari123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481237460,"body":"So it means That she Love his Boyfriend But why The NTR. Why His boyfriend agreed To that ?."},{"id":76901,"gallery_id":180879,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1481213157,"body":"@Futanari123 foot stomping or double S? I am going to assume you mean double S. The quick summary is he fell in love with her, she really fell in love with him, but shes a super sadist and he derived joy from her being happy, even though the first 3 chapters is him trying to figure out how to get her love (and not get taken by the other girl who likes to peg people) the 4th chapter, he realized she would only be truly happy while he is suffering, so he allowed himself to be NTR'd, as cruel as she is to him, its hinted that she does it out of love (which is why I have very mix feelings) ultimately the end is supposed to show you she really truly cares about him, but thats why he suffers so that she can keep enjoying it more and more"},{"id":76884,"gallery_id":180879,"poster":{"id":871561,"username":"Futanari123","slug":"futanari123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481207119,"body":"Tell me Wtf happen in The first arc of this hentai manga. Plsss someone Im begging"},{"id":76875,"gallery_id":180879,"poster":{"id":186765,"username":"usofa","slug":"usofa","avatar_url":"avatars/186765.png","is_superuser":false,"is_staff":false},"post_date":1481202476,"body":"Ugh, why do i read stuff that breaks my heart."},{"id":76796,"gallery_id":180879,"poster":{"id":25587,"username":"pincher","slug":"pincher","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1481166704,"body":"Haven't seen much Mame work lately did he quit or on hiatus."},{"id":76668,"gallery_id":180879,"poster":{"id":72054,"username":"EcchiBunny","slug":"ecchibunny","avatar_url":"avatars/72054.png?_=5fc35fe35d5051f2","is_superuser":false,"is_staff":false},"post_date":1481112393,"body":"O god i cant read this....  This is just sad in every way."},{"id":76620,"gallery_id":180879,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1481086363,"body":"double s and stigma both hurt my heart. I feel so bad for them. While extreme femdom turns me on, being tossed away and treated like trash makes me sad. (also how does this not get a netorare tag, double S has some pretty extreme ntr, even if she hints she does it because she loves him)"}]