[{"id":2468587,"gallery_id":182053,"poster":{"id":3358609,"username":"Zoey Le","slug":"zoey-le","avatar_url":"avatars/3358609.png?_=906dc2ba3570e1ea","is_superuser":false,"is_staff":false},"post_date":1650345526,"body":"Bruh! I honestly want a happy ending of the coach and Setsuna. I mean she likes him too. "},{"id":2416639,"gallery_id":182053,"poster":{"id":1129007,"username":"animan095","slug":"animan095","avatar_url":"avatars/1129007.png","is_superuser":false,"is_staff":false},"post_date":1648197017,"body":"This is such a masterpiece!"},{"id":2403965,"gallery_id":182053,"poster":{"id":2492878,"username":"weidenfeller","slug":"weidenfeller","avatar_url":"avatars/2492878.png?_=974e29a10785b192","is_superuser":false,"is_staff":false},"post_date":1647705787,"body":"Ehh nice ending"},{"id":2329184,"gallery_id":182053,"poster":{"id":4286588,"username":"buzzlightyearsupergamer","slug":"buzzlightyearsupergamer","avatar_url":"avatars/4286588.png?_=9ba055738828d6c9","is_superuser":false,"is_staff":false},"post_date":1644707402,"body":"@Chrissus bro literally half the people are saying it's chronological, and the other half are saying its a separate scenario/open ending, and somehow im the retard 🤡🗿"},{"id":2325561,"gallery_id":182053,"poster":{"id":3397735,"username":"<3DarkSkinGyaruLover<3","slug":"3darkskingyarulover-3","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1644566448,"body":"The easy way or the hard way: Confess ur feeling or be mentally broken and still have to confess ur feelings"},{"id":2295704,"gallery_id":182053,"poster":{"id":2266960,"username":"BebeHillz","slug":"bebehillz","avatar_url":"avatars/2266960.png","is_superuser":false,"is_staff":false},"post_date":1643392155,"body":"Sometimes im honestly glad i wasnt born a girl....\nLike seriously the fact that there are girls with so few braincells to actually allow shit like this to happen is legitimate nightmare fuel."},{"id":2294978,"gallery_id":182053,"poster":{"id":3045412,"username":"GigaHorni","slug":"gigahorni","avatar_url":"avatars/3045412.png?_=21eb32ebe98b95d8","is_superuser":false,"is_staff":false},"post_date":1643356783,"body":"Jesus Christ dude, this is fucked up. I hope the coach's ass got pierced by 155mm howitzer shell"},{"id":2293428,"gallery_id":182053,"poster":{"id":4576752,"username":"Chrissus","slug":"chrissus","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1643292805,"body":"@bukkakebitchh read the fucking comments bellow you. Retard"},{"id":2270181,"gallery_id":182053,"poster":{"id":4286588,"username":"buzzlightyearsupergamer","slug":"buzzlightyearsupergamer","avatar_url":"avatars/4286588.png?_=9ba055738828d6c9","is_superuser":false,"is_staff":false},"post_date":1642418940,"body":"whats with the beginning tho where they fucked after grad, is that supposed to be a different type of ending than the other one? cause if it is then i prefer the one at the last chapter instead. the first one is just straight ass cheeks my boy gin fucked setsuna without knowing shes been doing all that shit with the teacher and that shes pregnant yikes "},{"id":2249188,"gallery_id":182053,"poster":{"id":4930323,"username":"TheBLACKDahlia","slug":"theblackdahlia","avatar_url":"avatars/4930323.png?_=120898c531bff33d","is_superuser":false,"is_staff":false},"post_date":1641567245,"body":"How come all of these h-mangas have the same stupid blackmail plot? An adult films a video of a student rubbing herself, and therefore she allows him to continuously rape him over and over??? BLACKMAIL. DOESN'T. WORK THAT WAY!"},{"id":2173342,"gallery_id":182053,"poster":{"id":2833521,"username":"daddy13733","slug":"daddy13733","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638305056,"body":"God damn it I'm here to fap not to feels"},{"id":2169519,"gallery_id":182053,"poster":{"id":4806355,"username":"Kronos730","slug":"kronos730","avatar_url":"avatars/4806355.png?_=7d496391143574e4","is_superuser":false,"is_staff":false},"post_date":1638127842,"body":"I dont urdestand why nhentai.net  dont make two tags one ntr and another netori with this we can Block onli this shit"},{"id":2151953,"gallery_id":182053,"poster":{"id":3514626,"username":"ShowerTime!!","slug":"showertime","avatar_url":"avatars/3514626.png?_=85d067c965a1f3fd","is_superuser":false,"is_staff":false},"post_date":1637331222,"body":"There's no shame in asking for help. For of god stop trying this \"bear the burden\" crap and reach out for some GODDAMN HELP!!! YOUR FUTURE IS RUINED NOW BECAUSE YOU'RE A FUCKING IDIOT!!! SEEK HELP NO MATTER WHAT!!!😤😡"},{"id":2122472,"gallery_id":182053,"poster":{"id":1459506,"username":"Katul","slug":"katul","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635959151,"body":"Katul50 seconds ago In the epilougue she regrets that she never talked to him that coach is blackmailing her. If she had her future could've been brighter & more fulfilling. Also although i always like a clear conclusion but author left it so people can imagine whatever they want after it. That she met with him & got married with him or guy's feeling didn't change he always liked her or the guy moved over her & now looking for new love or he already have a gf & they will stay friends but never will be together even if they liked each other since childhood. Both scenario exist & doesn't at the same time. Personally i will go with the second scenario bc she was facing the consequences of her own dumb actions & didn't seek help when their was time & she chose this end for herself."},{"id":2122426,"gallery_id":182053,"poster":{"id":1459506,"username":"Katul","slug":"katul","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635957775,"body":"If i see things from the guy perspective he will think he actually forced her into sex after confessing to her & she let him do it bc they were childhood friend & she doesn't want him to regret anything. She went her separate way & left that as her final memory bc their feeling weren't mutual when she said \"she liked him\" it didn't mean she likes him right now she never said to continue this relationship bc she didn't want to so she left & cut his contact with him. From fmc perspective after she did it with him. He have feelings for her although it feels like a dream she can't stay with him she can't abandon this kid after going this far if she wants to be with him she will have to tell everything & abort the kid their is a chance he will accept but anyperson will not she can keep quiet & can say she got pregnant after we had sex but she can't bc keeping him in the dark & using him to raise a kid who isn't his without telling him for her own happiness will be too cruel & heartless."},{"id":2122388,"gallery_id":182053,"poster":{"id":1459506,"username":"Katul","slug":"katul","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635956490,"body":"Fmc did pretty dumb shit she took every shit her coach threw at him she believed his every word the dumbest thing was to get pregnant willingly to get married did she forgot that scumbag raped him if he doesn't marries her she can't get married to any other guy every door will be closed for her she will have to face hardship & remain single mother bc she is already pregnant. She can't even get married her childhood friend even if he loved her. First she never trusted her that he can save him second she will have to tell everything after that even her c. Friend will realize that she have feelings for coach & she doesn't like him anymore bc she chose to get pregnant to get married. "},{"id":2103375,"gallery_id":182053,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1635127753,"body":"@zikakuto the first chapter takes place right after the graduation, which implies that she wanted to use the MC to take care of the coach's baby. She wasn't a good person and only after finding out that the man raped her wasn't really a good guy, I'm sorry she belongs in the streets and I hope MC got himself a better girl."},{"id":2065663,"gallery_id":182053,"poster":{"id":2883805,"username":"F̶̠͕͗̒͊l̶͈̊̌͠e̴͕̎̀â̶ͅͅk̶͍̱̽̌̂","slug":"f-l-e-a-k","avatar_url":"avatars/2883805.png?_=655cdbb47800fc4d","is_superuser":false,"is_staff":false},"post_date":1633595634,"body":"What a whore. Naive fucker as always. "},{"id":1966164,"gallery_id":182053,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629675599,"body":"Im glad she feels regret and remorse, realises that the teacher never loved her, and that she fucked up; and Im glad it implies shell find the childhood friend (mc) and probably end up with him, knowing hes better than the teacher -- I wish theyd actually show that though instead of just the start of it. Mc owes the other girl big time though since shes the one that tracked the FMC down, Or maybe he doesnt since he probably wouldve been better off without that thot."},{"id":1950899,"gallery_id":182053,"poster":{"id":1055644,"username":"forgottenn21","slug":"forgottenn21","avatar_url":"avatars/1055644.png?_=10429b5ea0587603","is_superuser":false,"is_staff":false},"post_date":1629148330,"body":"@Zoey Le, ah yes, the teacher commiting crime by having sex with children. He got what he deserves, unless the sentence was light, should be extremely harsh tbh."},{"id":1938524,"gallery_id":182053,"poster":{"id":2075139,"username":"Xson","slug":"xson","avatar_url":"avatars/2075139.png","is_superuser":false,"is_staff":false},"post_date":1628711205,"body":"@Zoey Le Dumb bitch"},{"id":1930443,"gallery_id":182053,"poster":{"id":4442043,"username":"kenway211","slug":"kenway211","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628389184,"body":"This is most unfortunate for my mental health"},{"id":1899017,"gallery_id":182053,"poster":{"id":3358609,"username":"Zoey Le","slug":"zoey-le","avatar_url":"avatars/3358609.png?_=906dc2ba3570e1ea","is_superuser":false,"is_staff":false},"post_date":1627286281,"body":"Personally, I want sensei to get a happy ending with Setsuna. Yeah, Setsuna afterward is beautiful but it is sensei that makes her that way. Buying pretty clothes, giving her sweet words that Gin dude can never do until graduation. Over all the story is good, but I want to see her and sensei raise the kid together and keep having sex more."},{"id":1888055,"gallery_id":182053,"poster":{"id":1076875,"username":"CVNT","slug":"cvnt","avatar_url":"avatars/1076875.png?_=529ab8ac565f88c0","is_superuser":false,"is_staff":false},"post_date":1626887831,"body":"Ironic how this happens:\nWoman find a dude he thinks he loves\nGets pregnant with dude but get left or abused\nFind a better dude after getting pregnant"},{"id":1851766,"gallery_id":182053,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1625440958,"body":"also i never realized cause when i first read this i didmy know chapter 1 was supposed to read last but now that i do know and re reading the first chapter i just cant help but think how fucked up Setsuna felt when Gin finally said he loved her and at the end when he said hes always liked her"},{"id":1851639,"gallery_id":182053,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1625435954,"body":"im confused how much time has passed in the epilogue? i guess this was a decent story first off it shows how when ur young you are dumb and scared to do the right thing. Thats why it shows at the end when she was older she realized what had happened to her and her mistake. Also its good cause Gin doesnt know anything so he didnt suffer like most NTRs and i guess would probably give him the chance to move on. Finally its an open ending. One can interpret how you want for example you can think when she goes talk to Gin she will see how hes moved on and already has a partner or you can interpret where She tells Gin they work out everything and be happy together "},{"id":1832877,"gallery_id":182053,"poster":{"id":1615313,"username":"georoe","slug":"georoe","avatar_url":"avatars/1615313.png?_=107df36b5b5ebf73","is_superuser":false,"is_staff":false},"post_date":1624698067,"body":"In a strict sense, it's not a real NTR story by definition de facto for Setsuna is just Ginta's \"Osananajimi\" but not going with him even hadn't been dating with him once. Imagine, there the girl who you've been carrying a torch for gets married, maybe you'd feel sad but never consider that you're NTRed. Thus I even don't think Ginta is the MC. The plot is somehow common to «The Another World» that Setsuna is the real protagonist, and it's a story about how Setsuna's been \"coached\" by the hentai teacher as well as being lewd gradually, even becoming to enjoy having sex with that pervert by herself, eventually. The last episode that by knowing the pleasure of sex, Setsuna turns to be sophisticated and full of sex appeal -- completely different from the tomboy character she'd been -- is very impressed as well as showing the high aptitude of Yuzuki N Dash for composing story arc works. That's why I love her works so much."},{"id":1801869,"gallery_id":182053,"poster":{"id":1408774,"username":"Onizuka_kun99","slug":"onizuka_kun99","avatar_url":"avatars/1408774.png?_=cca18a5eeb5ceb0c","is_superuser":false,"is_staff":false},"post_date":1623485769,"body":"just pretend to be the alpha and you r good. I enjoy this since im 24 (related and closer to be dilf than a stundent)"},{"id":1765446,"gallery_id":182053,"poster":{"id":2991329,"username":"Forsaken Aris","slug":"forsaken-aris","avatar_url":"avatars/2991329.png?_=f629bcaef5f3f525","is_superuser":false,"is_staff":false},"post_date":1622069248,"body":"Women doing NTR sure does a wonderful job if they wanted to make beta nerds like me want to commit suicide. I hate myself, I wanna die."},{"id":1765445,"gallery_id":182053,"poster":{"id":2991329,"username":"Forsaken Aris","slug":"forsaken-aris","avatar_url":"avatars/2991329.png?_=f629bcaef5f3f525","is_superuser":false,"is_staff":false},"post_date":1622069111,"body":"What the heck is wrong with the author?\nShe is a FEMALE and likes drawing NTR and rape stuff. Damn, crazy motherfucker stupid girl, my heart and my faith in love and humanity nerver had be in pieces like right now since I read \"A Promise With Him\" from Nakajima Yuka. "},{"id":1716186,"gallery_id":182053,"poster":{"id":1571575,"username":"Aldyn","slug":"aldyn","avatar_url":"avatars/1571575.png?_=6b1988a6df0a01d5","is_superuser":false,"is_staff":false},"post_date":1620108865,"body":"To the people who say that it wasn't her fault, I both agree and disagree. This is hentai. The age of the characters don't matter because not even the authors take that into consideration when writing conclusions and justifications. If this happened in real life, yes, I would absolutely never blame the teenager who simply doesn't know better. That being said, this isn't real life. If in the end Tomoe told FMC something along the lines of, \"You were just a kid being blackmailed and manipulated,\" then I would immediately change my mind and realize that the author was indeed going for that. Well, that didn't happen because it never does. Never. If that's your interpretation, sure, that's fair and valid. Doesn't mean it's objectively correct, though. Regardless of age, if FMC has brain cells, then there's no NTR."},{"id":1714552,"gallery_id":182053,"poster":{"id":2031475,"username":"Tway72202","slug":"tway72202","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620043202,"body":"lol typical women, make bad decisions and then find a 'nice guy' to raise chad's baby"},{"id":1713667,"gallery_id":182053,"poster":{"id":4263351,"username":"otakuuuuuuh","slug":"otakuuuuuuh","avatar_url":"avatars/4263351.png?_=a34f400665fa0c39","is_superuser":false,"is_staff":false},"post_date":1620004175,"body":"I feel like if this story continue if the sensei got out of jail she would go with him"},{"id":1649585,"gallery_id":182053,"poster":{"id":3033867,"username":"unfxrseen","slug":"unfxrseen","avatar_url":"avatars/3033867.png?_=771e65182f8b73d7","is_superuser":false,"is_staff":false},"post_date":1617091983,"body":"my heart is in great pain."},{"id":1635094,"gallery_id":182053,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1616490621,"body":"I don't think anyone should be blaming FMC in this series. She was blackmailed, raped, gaslighted, manipulated while she was still a kid, far far from graduation. I mean there's a whole age progression to show how much she changes. And the ending is when she's an adult and has her own baby and realises what happened to her. Also, she assumed MC didn't like her, they weren't together either. It sucks that she still went with the sensei after being with MC, but she did it because she was already pregnant. I mean look how happy she is to be with Ginta in the first chapter. Although I'd like to have seen more in terms of ending, I can also see how the author leaves it up to us how we'd like to see things conclude. Personally, I think reconciliation and moving on as friends would be the best. "},{"id":1612345,"gallery_id":182053,"poster":{"id":3580603,"username":"Habib Rizqie Shahaq","slug":"habib-rizqie-shahaq","avatar_url":"avatars/3580603.png?_=66034ca20d550bfb","is_superuser":false,"is_staff":false},"post_date":1615467239,"body":"@sekaij yes real world is even more fucked up, including, blackmail for money till the other become poor ,torture and also killing"},{"id":1609023,"gallery_id":182053,"poster":{"id":3380232,"username":"Reyas","slug":"reyas","avatar_url":"avatars/3380232.png?_=49fb02bd9376c1cd","is_superuser":false,"is_staff":false},"post_date":1615321423,"body":"Ah, I'd almost forgotten. This is one of the earliest cases I remember of \"lying POS female lead\". Setsuna had a 100% valid grievance the first time because it was actual rape. Every other time though, that's not rape. It becomes more and more apparent that she was complicit in what was happening or said another way: She's a horrible person and deserves what she got, if not worse"},{"id":1594124,"gallery_id":182053,"poster":{"id":3888377,"username":"Sekaij","slug":"sekaij","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1614665011,"body":"Good, that people aren't that stupid in real life."},{"id":1540635,"gallery_id":182053,"poster":{"id":2284098,"username":"Eat68","slug":"eat68","avatar_url":"avatars/2284098.png?_=0fa2f171841e2663","is_superuser":false,"is_staff":false},"post_date":1612256182,"body":"But then I have this question, what \"purpose\" logically wise does chapter 1 serve? Does Setsuna just want to take Gin out for a spin before she went with Sensei wherever? She at least seemed to enjoy Gin, at least that's what it shows."},{"id":1540625,"gallery_id":182053,"poster":{"id":2284098,"username":"Eat68","slug":"eat68","avatar_url":"avatars/2284098.png?_=0fa2f171841e2663","is_superuser":false,"is_staff":false},"post_date":1612255806,"body":"@user_A_exist yeah I should've thought about dense MCs lol. Didn't help at some points he still treated her like a guy whereas sensei treated her like a woman and it shows the progression.  I think this story sticks with readers more because it isn't the usual cheap NTR trick with big dick winning. This has psychological-like grooming/conditioning, stockholm syndrome like FMC sticking with sensei, and FMC being not fully mature. At least, in the end, she seems to recognize she dun fucked up and should have went to Gin (hair piece & childhood promise). "},{"id":1532600,"gallery_id":182053,"poster":{"id":2075139,"username":"Xson","slug":"xson","avatar_url":"avatars/2075139.png","is_superuser":false,"is_staff":false},"post_date":1611889556,"body":"I'm utterly disgusted, Setsuna should've killed hersefl, stupid fucking whore"},{"id":1532586,"gallery_id":182053,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1611889179,"body":"Wow what a rollercoaster read on this, and I felt sympathetic for FMC (Setsuna). Oof, I'm a bit sad now but yea, kill all rapists and motherfuckers like the sensei lol, there, now I feel better :D Another favorite!"},{"id":1530220,"gallery_id":182053,"poster":{"id":3186953,"username":"suci&polos","slug":"suci-polos","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611782616,"body":"fuck, ntr hadehh"},{"id":1529429,"gallery_id":182053,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1611747835,"body":"Adding on the fanfic continuation: Gin, losing contact with Setsuna, keeps in contact with the les, content that he at least confessed his feelings and does not seek her out despite Tomoe initially wanting help, he moves on to an extent and dates around, building up his experiences and learning not to accidentally create complexes and the like. Tomoe forces the three of them to meet up, feelings are shared, emotions happen, and they bang, they spend more time together, also banging, and Gin decides he does in fact love Setsuna(who is not NTRHentai levels addicted to sex as proven here) and wants to raise a family with her, and also wants Tomoe to join in because they’ve bonded a lot since graduation. "},{"id":1529421,"gallery_id":182053,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1611747441,"body":"How fucking insecure are you guys that “oh, she has the kid of the guy who raped her” is instant cuck or beta material? And how is it not obvious that the lesfriend opens FeMc up to her OG love interest for her sake? Continuation ending would probably be Gin getting with both the Yuri girl and the FeMC, with him impregnating both girls at least once"},{"id":1508941,"gallery_id":182053,"poster":{"id":2406259,"username":"AnimeFanatic11","slug":"animefanatic11","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1610904967,"body":"Did he become a simp? Was it correct going back to her?\n\nI get she’s the Victim but she fell in love with her perpetrator and stayed a very long time.. I guess not everyone has wisdom. She could had stopped it after the first assault!! "},{"id":1473549,"gallery_id":182053,"poster":{"id":3494003,"username":"TsuneTori","slug":"tsunetori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610146114,"body":"Those who are complaining about the heroine must have forgotten that she was a minor when all that shit happened, because you think people are really only considered able to make choices in full wisdom at 18. Before that they know how to say what is good and what is bad, but they cannot understand the magnitude of the consequences that bad choices have.\nIf she knew well what she was doing she wouldn't even be masturbating there in the first place, and even if she was, she could threaten the teacher back by claiming he wanted to rape her."},{"id":1463600,"gallery_id":182053,"poster":{"id":3423516,"username":"user_A_exist","slug":"user_a_exist","avatar_url":"avatars/3423516.png?_=abb022accdee2e90","is_superuser":false,"is_staff":false},"post_date":1609831258,"body":"@eat68 Well, it's your usually diamond (in term of density) headed NTR'd MC, you can't really expect anything. Also i don't think she framed that bastard sensei cause in epilogue she is clearly going with him."},{"id":1459572,"gallery_id":182053,"poster":{"id":2284098,"username":"Eat68","slug":"eat68","avatar_url":"avatars/2284098.png?_=0fa2f171841e2663","is_superuser":false,"is_staff":false},"post_date":1609735366,"body":"Just curious, how did the MC and FMC \"separate\"? Usually in high school, everyone is like, \"I'm going to do this after I graduate\" (college) usually. So, did she just lie for that (probably). And also, with the pregnancy test, she smiled because she'd be able to \"marry\" sensei, not possibly frame/trap Gin? Weirdly more interested in the story lol. And agree largely with @mumbad119 about the manipulation and also, MC kinda wasn't too helpful on that front as well."},{"id":1423052,"gallery_id":182053,"poster":{"id":3180468,"username":"Kyle dungo","slug":"kyle-dungo","avatar_url":"avatars/3180468.png?_=e5cdc7f85ed95b14","is_superuser":false,"is_staff":false},"post_date":1608622701,"body":"This is just sad "},{"id":1404090,"gallery_id":182053,"poster":{"id":3909269,"username":"salt1155","slug":"salt1155","avatar_url":"avatars/3909269.png?_=f39a5fc53662b190","is_superuser":false,"is_staff":false},"post_date":1607901335,"body":"@jorreez you need some fucking help"},{"id":1388161,"gallery_id":182053,"poster":{"id":3806825,"username":"jorreez","slug":"jorreez","avatar_url":"avatars/3806825.png?_=0cfad7d0fd203995","is_superuser":false,"is_staff":false},"post_date":1607279289,"body":"I hate my crippling addiction to NTR. But this is so fucking good I can't divert my eyes from it. And yeah, the ending and my post nut clarity is taking me to the depths of depression."},{"id":1326423,"gallery_id":182053,"poster":{"id":3372617,"username":"M9049","slug":"m9049","avatar_url":"avatars/3372617.png?_=5ac2f014c5f385db","is_superuser":false,"is_staff":false},"post_date":1604955479,"body":"Wow so the mc now have to raise someone else's child? And he is gonna end up with a woman who carried someone else's kid when she was in love with him? \nShe regrets not letting him know what happened early? I hope the mc has moved on and is now happy living with someone else rn"},{"id":1302863,"gallery_id":182053,"poster":{"id":1058160,"username":"NelleJuan","slug":"nellejuan","avatar_url":"avatars/1058160.png","is_superuser":false,"is_staff":false},"post_date":1603992814,"body":"for those who are angry she was with the MC at the end, the beginning of the story is her epilogue with the MC, because the final scene at school is the next scene at the beginning of the story"},{"id":1251148,"gallery_id":182053,"poster":{"id":735217,"username":"mumbad119","slug":"mumbad119","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601777961,"body":"I understand lots of people don't like this, but imo it is a really good story about mental and sexual manipulation. The teacher used weapons like blackmail, false choices, flattery, and attacks on self-esteem to get into the heroine's head. Eventually the heroine, like real life victims and thinks she deserves this and allows the abuse to continue. The epilouge also highlights how victims of abuse and gaslighting often feel: even after being rescued from the situation, victims are still emotionally ruined and oftentimes continue to blame themselves, wondering if they were not worthy of being saved and not taking steps to avoid it. Lots of rape hentai deal with similar themes but the tankoubon format really helps flesh out these themes.  It's not a happy story, but it is a very good and very realistic one."},{"id":1218570,"gallery_id":182053,"poster":{"id":1677226,"username":"amerikanfutoboru","slug":"amerikanfutoboru","avatar_url":"avatars/1677226.png?_=c595ca166f187423","is_superuser":false,"is_staff":false},"post_date":1600460228,"body":"i don't really understand with the ending, so the girl had a child with that teacher who finally get arrest, and not end up with her childhood friend? "},{"id":1217081,"gallery_id":182053,"poster":{"id":2085763,"username":"6P70","slug":"6p70","avatar_url":"avatars/2085763.png?_=eaf630f9b693c79d","is_superuser":false,"is_staff":false},"post_date":1600393260,"body":"So from what I understood from the comment, it's not a happy ending ? Good fap tho"},{"id":1189999,"gallery_id":182053,"poster":{"id":1649066,"username":"LettuceZ","slug":"lettucez","avatar_url":"avatars/1649066.png?_=89001055fe6888e7","is_superuser":false,"is_staff":false},"post_date":1599162914,"body":"I finally realized why this urks me. I had to sit here reading this boring shit while Tomoe the baddest bitch went without one fucking scene. \nWHAT.THE.FUCK! What kind of monster puts Tomoe in the epilogue just to summarize the events with the femc and give her no sauce?! Fucking Blasphemous  "},{"id":1189984,"gallery_id":182053,"poster":{"id":1649066,"username":"LettuceZ","slug":"lettucez","avatar_url":"avatars/1649066.png?_=89001055fe6888e7","is_superuser":false,"is_staff":false},"post_date":1599162309,"body":"I'm confused what was I supposed to feel while reading this? Boredom? Cuz it didn't read like an ntr, felt like the author was hesitant to go the full mile and kept trying to backtrack to make the situation read more like a dramatic vanilla.  \n\nThat epilogue was super weird too, why was the friend so set on reuniting the two after all that and cucking herself?! The hells goin on here?! "},{"id":1183798,"gallery_id":182053,"poster":{"id":2623608,"username":"Fetuz","slug":"fetuz","avatar_url":"avatars/2623608.png?_=685ed828b64cd45a","is_superuser":false,"is_staff":false},"post_date":1598906673,"body":"The art just so good but, the genre makes some struggle in my mind..\nI also about a little bit confused about the end of story, like did MC know what happen with FMC? Did FMC leave the MC after what they did after graduation & following that scum teacher until he get arrested? Why she do that even the MC had confess his feeling to her? Cuz she already promise with that scum that impregnate her? \nWell I'm a bit regret read this doujin actually"},{"id":1166171,"gallery_id":182053,"poster":{"id":543604,"username":"Random Choice","slug":"random-choice","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598160569,"body":"This is an interesting story. It's pretty creative that the first chapter is the last one in terms of chronology. It gives the illusion of NTR when it technically doesn't happen, and it provides the hook to learn why she was filled with so much regret. "},{"id":1143064,"gallery_id":182053,"poster":{"id":3533037,"username":"SirRobin‏‏‎ ‎","slug":"sirrobin","avatar_url":"avatars/3533037.png?_=36fb1d10b5335960","is_superuser":false,"is_staff":false},"post_date":1597319089,"body":"@Imagine12 No can do butthurt incel vanillafag  and @asef713 is yet another simping delusional snowflake retard ."},{"id":1113770,"gallery_id":182053,"poster":{"id":2935606,"username":"Imagine12","slug":"imagine12","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596130244,"body":"Because yuri NTR is much better than some random ugly bastard of a scum teacher NTR"},{"id":1113762,"gallery_id":182053,"poster":{"id":2935606,"username":"Imagine12","slug":"imagine12","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596129867,"body":"Can the author remake this but the teacher got arrested after the first rape and the NTR is done by the yuri friend instead?"},{"id":1077992,"gallery_id":182053,"poster":{"id":1991354,"username":"asef713","slug":"asef713","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594733763,"body":"@Kami Nana the MC hasn't been seen since the graduation part, however the lez friend does mention that she hasn't told him where FMC is in the epilogue so they are keeping in touch at the very least. It's only been around a year after graduation so them still talking is very likely.\n\nI will also say that I'm not excusing that what she did is wrong, but given how things played out its not entirely her fault. She does take blame for her compliance, and the teacher obviously for being the main culprit. But MC did indirectly cause her insecurity that lead to her further falling in to the teacher's traps along with nobody clearing up the confession misunderstanding.\n\nAt the end, it's just an unfortunate situation that I hope ends if and when the MCs get together since I believe that she learned and bettered herself after all she's been through. Teenagers do make stupid mistakes, even more if they're emotional and insecure like she was at the start."},{"id":1062955,"gallery_id":182053,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1594177108,"body":"THe boy just got phased out. "},{"id":1061713,"gallery_id":182053,"poster":{"id":2041350,"username":"automachinehead","slug":"automachinehead","avatar_url":"avatars/2041350.png","is_superuser":false,"is_staff":false},"post_date":1594136617,"body":"The hentai lacks the emotions present here"},{"id":1061597,"gallery_id":182053,"poster":{"id":2743996,"username":"@doujin.heaven on ig","slug":"doujin-heaven-on-ig","avatar_url":"avatars/2743996.png?_=3469d3105c3ec48a","is_superuser":false,"is_staff":false},"post_date":1594132451,"body":"Wow, this was just bruh. Ntr and a happy ending, didn’t know this would work but yeah my feelings are wild rn LMAO"},{"id":1058373,"gallery_id":182053,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1594023485,"body":"kind of wish there was an ep for them to make amends. oh well."},{"id":1054304,"gallery_id":182053,"poster":{"id":2181037,"username":"otomono","slug":"otomono","avatar_url":"avatars/2181037.png","is_superuser":false,"is_staff":false},"post_date":1593872657,"body":"that was a nice read although i skimmed through the most part...So basically putting someone under cognitive dissonance by physical assault in this case rape...There are several real world instances...\nWell as an epilogue she needs treatment ,prolonged psychiatric treatment before she tries to connect with anybody...They (the guy and the this girl) should avoid any form of connection imo bcz that would trigger the past trauma..."},{"id":1042641,"gallery_id":182053,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593424188,"body":"(continued) It's not just the girl that's being stolen away...but also their obvious future together that would have come to fruition IF the douchebag didn't rape/molest and mindbreak her into not caring about her original \"love\"."},{"id":1042634,"gallery_id":182053,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593423978,"body":"@loan You people don't actually understand what NTR is if you think the SENSEI, of all people, was NTR'd. If it was supposed to be the Sensei...then it would have been from his point of view. Also, we see him stealing FMC from MC first...and no, they DON'T have to be in a relationship. So many idiots don't seem to get that last part... :/ All it needs is for the MC to have a romantic connection with the FMC that's getting stolen away from him. Why do you think the Japanese, themselves...the AUTHORS, themselves, call this kind of set-up NTR? If a romantic partner or POTENTIAL(the part most people who say this kind of thing isn't NTR doesn't get) partner is stolen away, then it's NTR, simple as that. Why do you think so many NTR stories(which usually fucking have NTR in the title) are about childhood friends that are clearly in love with each other but not actually together yet?"},{"id":1042622,"gallery_id":182053,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593423530,"body":"@asef713 You must be new to these kind of stories. This isn't a happy feel good story. Also, there's no information about the MC after ho FMC left with the teacher. For all we know, les friend might not even speak to him. We just don't know. So it's possible he's dating someone else, moved away...or who knows what. A GOOD ending to this shit would be him just moving on. The slut FMC already ruined any chance of a happy ending with them together with her betrayal. And don't sugarcoat what she did... :/"},{"id":1042616,"gallery_id":182053,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593423285,"body":"A better ending would be her trying to meet with Gin-chan...only to find he's already settled down with a good woman and wants nothing to do with her anymore."},{"id":1037101,"gallery_id":182053,"poster":{"id":3207778,"username":"username4200","slug":"username4200","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593208263,"body":"I'm suprised by the amount of people that actually pay attention to the story in this"},{"id":972562,"gallery_id":182053,"poster":{"id":2531821,"username":"WanderA","slug":"wandera","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1562963882,"body":"this manga is like a korean webtoon drama, it's no longer a just to fap kind of NTR. The way yuzuki build MC as a kind boy(he's not a cuck) that willing to protect/save FMC , yet yuzuki made FMC a complete total opposite. Worst thing is, he might end up with her not knowing all the \"it's feel so good \" stuffs with sensei  make me sick."},{"id":926235,"gallery_id":182053,"poster":{"id":2004844,"username":"ComicalColony","slug":"comicalcolony","avatar_url":"avatars/2004844.png","is_superuser":false,"is_staff":false},"post_date":1559535435,"body":"I BLAME SENSEI CAUSED THIS"},{"id":887794,"gallery_id":182053,"poster":{"id":2306869,"username":"Numberone31","slug":"numberone31","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1556426947,"body":"I think they should have been left alone, and have Gin a nice girl that its not a hou"},{"id":863229,"gallery_id":182053,"poster":{"id":21867,"username":"SaintJimmy379","slug":"saintjimmy379","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1554202193,"body":"After reading the comments and story (Thanks Ioan/Loan for the reading order) I gather that she basically cucks her friend and sensei... This really doesn't make it better for me (although I guess sensei got what he deserved) I still feel poorly for Gin though so an ideal sequel would involve him screwing some high school girl while she takes care of the baby at home. Granted it isn't a happy ending idea but it's the ending I feel it deserved"},{"id":825420,"gallery_id":182053,"poster":{"id":602020,"username":"SeiZui","slug":"seizui","avatar_url":"avatars/602020.png","is_superuser":false,"is_staff":false},"post_date":1550886034,"body":"welp just raging hormones FMC. Gin is also at fault even though unwillingly also lots of plot holes (who cares its hentai). She let Gin fuck her to make it seem like Gin-san impregnated her, Gin didn't even wonder if she was still a virgin. . .figures raging hormones. Hmmm, Tomoe should better fck off and let Gin move on(or too high of a hurdle for him atm) and find someone else. . .but like Akon sings, doesn't matter had sex. Man teens are really susceptible to deceit, maybe that's why a lot of old people target certain young age groups for sex.\n\nIf there's an afterstory i'll gladly read it, to see some bridges renewed and wounds mended even for just a little. I don't want an afterstory where they got together and Gin chose to be cuckold. . .now that's nasty!! Good read !! "},{"id":816901,"gallery_id":182053,"poster":{"id":142792,"username":"RedEyesPsychopathicLoli","slug":"redeyespsychopathicloli","avatar_url":"avatars/142792.png","is_superuser":false,"is_staff":false},"post_date":1550118189,"body":"Damn I'm dying for an after story!"},{"id":788010,"gallery_id":182053,"poster":{"id":749604,"username":"yero19","slug":"yero19","avatar_url":"avatars/749604.png?_=14593e2a36b3dd30","is_superuser":false,"is_staff":false},"post_date":1547559162,"body":"And what kind of btch friend is Tomoe, wanting to Gin and the stupid whore protagonist to meet again, let the poor guy find a normal girl and be happy."},{"id":787995,"gallery_id":182053,"poster":{"id":749604,"username":"yero19","slug":"yero19","avatar_url":"avatars/749604.png?_=14593e2a36b3dd30","is_superuser":false,"is_staff":false},"post_date":1547558636,"body":"Ok so The first chapter is after the graduation, when she was already \"in love\" with the sensei (even already preg) and still she went to fuck with the other boy?? So she cheated both, the sense and the boy? And the whole \"I don't want to look bad in front of the boy I like, so I will let this other guy rape\" is to stupid and way to much used for this kind of story"},{"id":777421,"gallery_id":182053,"poster":{"id":287446,"username":"loismark05","slug":"loismark05","avatar_url":"avatars/287446.png","is_superuser":false,"is_staff":false},"post_date":1546706797,"body":"read chapter 2 first till last chapter but dont read last 7 page then read chapter 1 and proceed to the remaining last 7 page thank me later ( sorry for the terrible grammar ) !!\n"},{"id":713696,"gallery_id":182053,"poster":{"id":1991354,"username":"asef713","slug":"asef713","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1539876208,"body":"[Continuation...] Seeing as how the entire story is about how Gin and Setsuna feel for each other I believe that he'll be able to forgive and get together with Setsuna. Tomoe doesn't mention or hint at anyone being married or with someone else so its likely that he's still single a year after graduating and couldn't simply forget about Setsuna. So that's what my ending for this story is ahappy end with them both married to each other.\n\nThe only way that Yuzuki can redeem herself and this story is to show the Gin and Setsuna happily married together after their meeting or have an alternate true route where Gin and Setsuna concrete their feelings, views, or relationship for each other early on and Setsuna immediately fights and reports the teacher when he first makes a move on her back in school and then show the best ending for them both married with their own baby.\n\nThis ends my stupidly long ass review. Now I can finally move on from this fucking bittersweet story and get some sleep."},{"id":713691,"gallery_id":182053,"poster":{"id":1991354,"username":"asef713","slug":"asef713","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1539875158,"body":"[Conclusion] I can't fault Setsuna completely for her decisions back then. I noticed that Gin helped her develop an insecurity for her feminine charms by always comparing her to a brother and denying that she had any womanly traits. He indirectly caused her insecurity and the teacher used that against her by always complimenting her looks, beauty and body. There's plenty of panels where thats made obvious, and because of that she didn't report him and even gave into him after mistaking the Tomoe's confession to Gin. Gin always complimented Tomoe and thought he liked her so after the fake confession, she probably used her marriage proposal with the teacher to forget and move on from Gin. But I didn't see a ring on Setsuna's hands so its likely that she was only living with the teacher during her pregnancy until he changed jobs and had sex with other girls. She also maybe never even liked the teacher she only liked that he was the only one who saw her as a woman and she went with that."},{"id":713680,"gallery_id":182053,"poster":{"id":1991354,"username":"asef713","slug":"asef713","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1539873803,"body":"(Continuation...) This means that Setsuna was having sex anywhere from 6-10 months if we take extremes into account. (June-March or Oct-March)\n\nThen the epilogue takes place years after and Setsuna's child has been born and judging from how old he is I'd say he's anywhere from 1-6 months old. So the epilogue takes place about 9-12 months after their graduation so it would be around Jan-March of the following year."},{"id":713664,"gallery_id":182053,"poster":{"id":1991354,"username":"asef713","slug":"asef713","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1539871859,"body":"(Continuation...) One of the Setsuna's kouhai talks about the interhigh competition for swimming in the beginning of the story, unfortunately I don't know when exactly Japanese Highschools have their swim meets so I'm gonna guess with sometime between late July and early August so it coincides with their summer break. We can conclude that the first 3 sex scenes happen before that so sometime in June-July over the span of around 3 days. (On a Fri-Sat-Sun)\n\nTomoe's misunderstood confession comes supposedly the following Monday morning though an unspecified amount of time before Oct is also viable. Next the time jumps to after the change back to the Winter uniforms but Setsuna has longer hair so I'll land the 4th and 5th sex scenes anywhere from December to March respectively with the 1st sex scene in Late March-Early May. (Continued...)"},{"id":713646,"gallery_id":182053,"poster":{"id":1991354,"username":"asef713","slug":"asef713","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1539868681,"body":"Ok so I'm just gonna give my opinion and a sort of analysis (but mostly rambling) on what I think of the story as well as the conclusion so I can finally have some damn peace.\n\nTimeline: (I'll exclude the childhood flashbacks since the exact year they happened won't change anything.)\n\nThe story takes place in their senior year, as stated by Tomoe and Ginta during one of their conversations.  Now school for them starts in early April, with them debuting in their winter uniforms (like in one of their minor flashbacks). Then in early June they switch to the Summer uniforms where most of the story takes place in. Starting in early October they switch to their Winter Uniforms again for the remainder of the school year.\n\nNow most of their early school year was pretty uneventful until sometime after or during June when the story starts... (Continued...)"},{"id":698170,"gallery_id":182053,"poster":{"id":588297,"username":"fakku8","slug":"fakku8","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1538067825,"body":"Garbage content"},{"id":688003,"gallery_id":182053,"poster":{"id":1756248,"username":"EpicGamerBrad69","slug":"epicgamerbrad69","avatar_url":"avatars/1756248.png","is_superuser":false,"is_staff":false},"post_date":1537026897,"body":"so much deppresion"},{"id":670183,"gallery_id":182053,"poster":{"id":1783519,"username":"Negativeee1","slug":"negativeee1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1535506074,"body":"Holy fuck this is fucking depressing."},{"id":669642,"gallery_id":182053,"poster":{"id":1686621,"username":"macbook","slug":"macbook","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1535447201,"body":"i love this manga \n\n"},{"id":662702,"gallery_id":182053,"poster":{"id":1838823,"username":"Bob Lee","slug":"bob-lee","avatar_url":"avatars/1838823.png","is_superuser":false,"is_staff":false},"post_date":1534761894,"body":"You guys need to read page 203-206 lol.\n It seem like many of you guys missed those page.\nThe teacher was arrested and she ended up with the main guy."},{"id":577448,"gallery_id":182053,"poster":{"id":1777075,"username":"KekUser","slug":"kekuser","avatar_url":"avatars/1777075.png","is_superuser":false,"is_staff":false},"post_date":1532196556,"body":"welp...fate decide's everthing.."},{"id":514509,"gallery_id":182053,"poster":{"id":1093564,"username":"loan","slug":"loan","avatar_url":"avatars/1093564.png","is_superuser":false,"is_staff":false},"post_date":1526747768,"body":"Plus if you put it into perspective, It would look like 2 guys going for the same girl, just that the sensei was ahead of gin. Now lets reverse their gender. (gin & sensei as women and setsuna as a man) Would you still call this NTR? "},{"id":505726,"gallery_id":182053,"poster":{"id":1093564,"username":"loan","slug":"loan","avatar_url":"avatars/1093564.png","is_superuser":false,"is_staff":false},"post_date":1526382993,"body":"Seeing all the rage comments, most of them didn't get the story. If you read it in this order [Chapter 2 (pg30) through Chapter 7 (pg199 ignoring the flashback) then back to Chapter 1 and lastly the Epilogue] the guy who gets NTR'd was Sensei. But of course, you can never call this NTR since neither GIN nor Tomoe knew what was happening. But you can never call this Cheating as well since none of them are in a relationship. Its just rape. "},{"id":505698,"gallery_id":182053,"poster":{"id":1093564,"username":"loan","slug":"loan","avatar_url":"avatars/1093564.png","is_superuser":false,"is_staff":false},"post_date":1526380455,"body":"Well at least she gets to live a peaceful life unlike my baby SAKI T-T (from Metamorphosis/Emergence/Henshin) https://nhentai.net/g/177013/"},{"id":489094,"gallery_id":182053,"poster":{"id":794520,"username":"REROREROman","slug":"reroreroman","avatar_url":"avatars/794520.png","is_superuser":false,"is_staff":false},"post_date":1526310826,"body":"It's a good thing that this human piece of garbage didn't end up with Gin. What a worm like creature"},{"id":438058,"gallery_id":182053,"poster":{"id":1088192,"username":"rain13245","slug":"rain13245","avatar_url":"avatars/1088192.png?_=8edbc0d9d5e741fd","is_superuser":false,"is_staff":false},"post_date":1525147587,"body":"I went to the other chapters comments to get the story and read chapter one and the epoligue and she's actually retarded why didn't she ever talk to gin about this hopefully gin doesn't get with the whore"},{"id":432072,"gallery_id":182053,"poster":{"id":1076875,"username":"CVNT","slug":"cvnt","avatar_url":"avatars/1076875.png?_=529ab8ac565f88c0","is_superuser":false,"is_staff":false},"post_date":1524162272,"body":"The slut enjoyed it, infatuate my ass, you were raped and you knew from the start it's rape, you knew he doesn't fucking care about you."},{"id":432064,"gallery_id":182053,"poster":{"id":1076875,"username":"CVNT","slug":"cvnt","avatar_url":"avatars/1076875.png?_=529ab8ac565f88c0","is_superuser":false,"is_staff":false},"post_date":1524161924,"body":"You were fucking raped retard, you could tell the fucking police. You just sniffed a guys towel and masturbated, what's more fucked up, letting a cunt fuck you over and over again despite he's not your lover and that he fucking left you with a baby or masturbating."},{"id":411586,"gallery_id":182053,"poster":{"id":189041,"username":"lovehentai5567","slug":"lovehentai5567","avatar_url":"avatars/189041.png","is_superuser":false,"is_staff":false},"post_date":1522737913,"body":"Welp, this again, well at least we don't know what happen to that guy Gin, he may have moved on and lead a happy life with another girl, while the slut has to raise the baby on her own, her tears on the last page is laughable tho, since seeking help from Gin is just the thing she should've done."},{"id":363567,"gallery_id":182053,"poster":{"id":1055192,"username":"Shinsei Mylon","slug":"shinsei-mylon","avatar_url":"avatars/1055192.png?_=8cd972eec16d691f","is_superuser":false,"is_staff":false},"post_date":1518152316,"body":"This shit right here, this is why I blacklist certain tags. I took a single look at this shit and just by looking at it I could already tell it was fucked. This artist took a turn for the worst with this one. And this manga had so much potential, it could've been something amazing but instead we get this. In all honesty the female character in this manga was shown to be strong in the prequel and I'm just here asking myself, where the fuck did your courage go?!?! Seriously though, reading this gives me a sense of disgust in the sense that someone would actually be okay writing something like this. If anyone else out there needs to recover from this god awful manga drawn by one of the best artists read this it has similar characters(being female student x male student) without any rape. https://nhentai.net/g/24843/ and to those who enjoy this what the fuck is wrong with you?"},{"id":357486,"gallery_id":182053,"poster":{"id":122403,"username":"cold0","slug":"cold0","avatar_url":"avatars/122403.png?_=4230d2e42388751b","is_superuser":false,"is_staff":false},"post_date":1517140365,"body":"if you're stressed just watch tom and jerry"},{"id":346025,"gallery_id":182053,"poster":{"id":1501467,"username":"Gakuto","slug":"gakuto","avatar_url":"avatars/1501467.png","is_superuser":false,"is_staff":false},"post_date":1515351306,"body":"If she was going for this kind of ending why Yuzuki didn’t make her seek help? If she as an author acknowledge that in the story, by making MH regret her actions in the flashback why half-ass the ending like that?  In NTR I either like the heroine going full slut until the end or vindicate herself, for diversity in the genre and with this ending it felt like the author was indecisive as to what outcome she was going to decide for this girl."},{"id":155111,"gallery_id":182053,"poster":{"id":645718,"username":"Serrakura","slug":"serrakura","avatar_url":"avatars/645718.png","is_superuser":false,"is_staff":false},"post_date":1503246806,"body":"that ending so fucked up.... just go die. go run away ginnnn"},{"id":135449,"gallery_id":182053,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1498890683,"body":"Rest in peace, she's messed up in the head"},{"id":120754,"gallery_id":182053,"poster":{"id":995971,"username":"InmortalLucia","slug":"inmortallucia","avatar_url":"avatars/995971.png","is_superuser":false,"is_staff":false},"post_date":1495171754,"body":"I came to read this after watching the animation. Not sure what the author wanted me to feel, They weren't in a relationship  before...and she seemed to liked it. so I don't get the usual NTR Depressing feeling."},{"id":112544,"gallery_id":182053,"poster":{"id":794323,"username":"SenpaisDickOishi","slug":"senpaisdickoishi","avatar_url":"avatars/794323.png","is_superuser":false,"is_staff":false},"post_date":1492783527,"body":"WHAT THE FUCK IS THAT ENDING? DANG SHES A FUCKING WHORE. THERES SOMETHING CALLED A POLICE YOU KNOW."},{"id":112297,"gallery_id":182053,"poster":{"id":22346,"username":"Maverickx","slug":"maverickx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1492712481,"body":"First episode just came out...."},{"id":110148,"gallery_id":182053,"poster":{"id":64217,"username":"mktc","slug":"mktc","avatar_url":"avatars/64217.png","is_superuser":false,"is_staff":false},"post_date":1492118541,"body":"to some extent this is way to real..."},{"id":101616,"gallery_id":182053,"poster":{"id":856739,"username":"Kingslayer19","slug":"kingslayer19","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1490389287,"body":"God Dammit,Yuzuki's stories are usually so good,did the author want to try something else or something? T_T\nI want more like OneKore or Anekyun. This will be hard to stomach in anime if I ever watch."},{"id":94955,"gallery_id":182053,"poster":{"id":350988,"username":"kh_lightning","slug":"kh_lightning","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1488086518,"body":"what the fuck with this story ? -.-"},{"id":94827,"gallery_id":182053,"poster":{"id":86612,"username":"kyokou","slug":"kyokou","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1488039479,"body":"Pururin already back guys :D"},{"id":93927,"gallery_id":182053,"poster":{"id":295480,"username":"Jman11289","slug":"jman11289","avatar_url":"avatars/295480.png","is_superuser":false,"is_staff":false},"post_date":1487667760,"body":"ok everyone its official this crappy Series is getting an hentai anime in march"},{"id":82903,"gallery_id":182053,"poster":{"id":34632,"username":"Lucio","slug":"lucio","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1483633910,"body":"Mooreee....i want mooreee :)"},{"id":82799,"gallery_id":182053,"poster":{"id":291582,"username":"namelesshero","slug":"namelesshero","avatar_url":"avatars/291582.png","is_superuser":false,"is_staff":false},"post_date":1483600615,"body":"What is tge moral again?"},{"id":80022,"gallery_id":182053,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1482593804,"body":"Hat trick is achieved."},{"id":79982,"gallery_id":182053,"poster":{"id":519200,"username":"Hilldog","slug":"hilldog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1482573509,"body":"THREE.  THREE FUCKING TIMES THIS HAS BEEN UPLOADED.  IF THIS SITE EVER BEGS FOR MONEY FOR SEVER SPACE, REMEMBER THIS.  THREE TIMES, 209 PAGES.  GOOD GRIEF."},{"id":79927,"gallery_id":182053,"poster":{"id":842069,"username":"luuull","slug":"luuull","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1482555988,"body":"wtf again this?"},{"id":79924,"gallery_id":182053,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1482554890,"body":"Are we trying to go for a record number of uploads for this?"}]