[{"id":1236108,"gallery_id":185583,"poster":{"id":3367461,"username":"Panties in Black","slug":"panties-in-black","avatar_url":"avatars/3367461.png?_=7919c787774ba56f","is_superuser":false,"is_staff":false},"post_date":1601141992,"body":"A webtoon hentai with a plot... I don't wanna read this:/"},{"id":89173,"gallery_id":185583,"poster":{"id":769254,"username":"definitionofinsanity","slug":"definitionofinsanity","avatar_url":"avatars/769254.png","is_superuser":false,"is_staff":false},"post_date":1485949564,"body":"It's hard to feel any sympathy for her after what she did to her teacher. Guy was legitimately trying to help her (albeit he did so in a naive way), and she falsely accused him of rape. That's beyond fucked up."},{"id":87052,"gallery_id":185583,"poster":{"id":231316,"username":"oldkei","slug":"oldkei","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1485119889,"body":"@troncol she its not 100% bad, childhood trauma, abuse, we don't know how the \"good guy\" story. yeah about the teacher that was a bitch moment and she deserve it, but the last guy was a beta and he was the problem. i'm just waiting for that oldman story for judge her. but the last guy arc was awful."},{"id":86864,"gallery_id":185583,"poster":{"id":424512,"username":"Zyldark","slug":"zyldark","avatar_url":"avatars/424512.png","is_superuser":false,"is_staff":false},"post_date":1485067786,"body":"This pornhwa is cringeworthy, holy shit even knowing that most manhwas about sex are like this, there are just cucks and this shit girl, everyone deserve their shit here"},{"id":86862,"gallery_id":185583,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1485067545,"body":"That guy is seriously thinking with his penis that because she is cute she is pure or something (you could argue that people deserve a second chance [but how many chances did this girl have?]). Part of me wishes he fails saving her, because that's what he is going to do. But on the other hand, I want him to save her so she can \"pay\" him like she did to the other people who tried helping her, like the teacher so he can join the Atonement Club. Imagine the irony..."}]