[{"id":755883,"gallery_id":188660,"poster":{"id":1980369,"username":"貧乳大好き！","slug":"pin-ru-da-hao-ki","avatar_url":"avatars/1980369.png","is_superuser":false,"is_staff":false},"post_date":1544755894,"body":"The ending of Owari no Nikkichou is beautiful, as always. Hopefully she died because that will be the best ending for me. Like I always said, bad endings are great, but bad ending where someone dies is just on a whole different level. "},{"id":316680,"gallery_id":188660,"poster":{"id":1408219,"username":"袖付き袖付きガイコッツ","slug":"xiu-fu-kixiu-fu-kigaikotsutsu","avatar_url":"avatars/1408219.png","is_superuser":false,"is_staff":false},"post_date":1509341118,"body":"Minato's girls survive worse. I'll assume she and her offspring survived."},{"id":95489,"gallery_id":188660,"poster":{"id":755753,"username":"sirflim","slug":"sirflim","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1488271591,"body":"The ending to Owari no Nikkichou is pretty heartbreaking. I've been waiting to stumble across the conclusion to that for some time now, wondering if it would ever come since I wanted to see how Satoru would react with Sakura and his brother. I'm a bit bummed out how much Sakura seemed to be enjoying getting messed with in front of him despite how against it she was verbally. I mean unless you're a well and truly broken person, that sort of shit just doens't happen. You're not screaming \"ah ah ah\" in pleasure when you're effectively being raped, nor returning kisses. Satoru takes it as anyone else would, questioning whether she really was deceiving him all along. But I digress. I really do love this author. Sakura's fate, well... I'm going to assume she's dead. The big brother is well and truly fucked and that's really the one solace you can take from the story. His life should pretty much be over."},{"id":94282,"gallery_id":188660,"poster":{"id":127578,"username":"rando","slug":"rando","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1487823268,"body":"so basically, this is just a commercial tank of a bunch of her old doujins."}]