[{"id":1956662,"gallery_id":190468,"poster":{"id":889788,"username":"zolinha","slug":"zolinha","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629336465,"body":"... Vira. She's completely obsessed with Katalina, so she opening up to Gran and doing all that is unthinkable unless her affection for him was really strong and she loved him. There's no way she would do that with Gran with the obsession she has for Katalina unless she started to love him because she wouldn't just be pleasuring someone and then evolve it to straight up sex since there's no way she would do that with someone she doesn't love. I think putting it in better words would be - it doesn't make sense Vira wanting to have sex with someone when she's obsessed with Katalina, unless she started to love that someone. To me the story ended in the first part and Gran and Vira stayed together in this one."},{"id":1956646,"gallery_id":190468,"poster":{"id":889788,"username":"zolinha","slug":"zolinha","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629335903,"body":"Several years later and you have another person disappointed right here. Don't get me wrong. I don't have anything against harems. Quite the contrary, but I hate how it was done with this one. In the 1st part we see Vira and Gran's relationship evolving as we can see how she opened up to him and how they were progressively going further with their sexual relationship. It seemed like they were starting to love each other, specially how Vira was already calling out to Gran at the end of the 1st part and specially when we LITERALLY have Vira scolding Gran for getting horny looking at the other crewmembers. Why would she be upset at him to get horny for other crewmembers if it was just a sexual relationship and why wouldn't she be upset now for doing sex with another crewmember!? As if all this wasn't already enough, this would already make a good argument for people not liking how it turned out to be if it was almost any other character in the franchise, but it's even worse because it's.."},{"id":931444,"gallery_id":190468,"poster":{"id":1923629,"username":"nopor27","slug":"nopor27","avatar_url":"avatars/1923629.png?_=566ad211bc26427d","is_superuser":false,"is_staff":false},"post_date":1559918122,"body":"https://nhentai.net/g/189523/ part 1\nhttps://nhentai.net/g/192388/ part 3"},{"id":99879,"gallery_id":190468,"poster":{"id":975926,"username":"Naird","slug":"naird","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1489844277,"body":"Kinda dissapointed :/"},{"id":99524,"gallery_id":190468,"poster":{"id":792911,"username":"That Guy 319","slug":"that-guy-319","avatar_url":"avatars/792911.png?_=230a595efe04ec92","is_superuser":false,"is_staff":false},"post_date":1489713301,"body":"Yes...that was hot."},{"id":99508,"gallery_id":190468,"poster":{"id":1007159,"username":"purple-spectrum","slug":"purple-spectrum","avatar_url":"avatars/1007159.png","is_superuser":false,"is_staff":false},"post_date":1489706842,"body":"Wow that dude's dick wasn't even necessary, they both had a lot of fun just by themselves. Damn this here is good AF"}]