[{"id":2509748,"gallery_id":193300,"poster":{"id":4792140,"username":"amphy","slug":"amphy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651965833,"body":"I was curious about this series when I saw the synopsis for volume 1 but I didn't expect this to get so fucked up. No more netorase for me, fuck that."},{"id":2387342,"gallery_id":193300,"poster":{"id":3338444,"username":"ZozoNinja","slug":"zozoninja","avatar_url":"avatars/3338444.png?_=1528f66d6d1f9b3f","is_superuser":false,"is_staff":false},"post_date":1646940982,"body":"i love this sudden plot twists"},{"id":2347005,"gallery_id":193300,"poster":{"id":3426402,"username":"netorarasaur","slug":"netorarasaur","avatar_url":"avatars/3426402.png?_=2d626a8bffac9864","is_superuser":false,"is_staff":false},"post_date":1645259800,"body":"The landmark ntr of the genre here. I remember when this was still being worked on and it seemed like EVERYONE was bitching bitching bitching and whining about how \"she should've stayed with sensei why didn't she stay with sensei waaaahhh!!!\" LMAO that part of the story was always the most boring! I'm so glad it moved away from that, made it infinitely better as a result."},{"id":2305185,"gallery_id":193300,"poster":{"id":4995714,"username":"BEGONE ntr","slug":"begone-ntr","avatar_url":"avatars/4995714.png?_=b88fdbdc8243f24e","is_superuser":false,"is_staff":false},"post_date":1643745574,"body":"So at the end he accept to being a cuckhold and it wife's fault for taking pills when he wants a child,and that the path of their relationship for being have a secret and not to consult to her husband that she is not ready to be a mother."},{"id":2290571,"gallery_id":193300,"poster":{"id":1827550,"username":"щшщшщш","slug":"shchshshchshshchsh","avatar_url":"avatars/1827550.png?_=e12afb89e682c8e5","is_superuser":false,"is_staff":false},"post_date":1643194501,"body":"Ummm what?"},{"id":2256495,"gallery_id":193300,"poster":{"id":4930323,"username":"TheBLACKDahlia","slug":"theblackdahlia","avatar_url":"avatars/4930323.png?_=120898c531bff33d","is_superuser":false,"is_staff":false},"post_date":1641876435,"body":"TBH.... this must be the most intriguing take on NTR that I've EVER seen before. The story made me GENUINELY interested in these characters, their motivations, and why they're doing what they're doing. Kudos to the author!"},{"id":2244183,"gallery_id":193300,"poster":{"id":3386010,"username":"Negev_chan","slug":"negev_chan","avatar_url":"avatars/3386010.png?_=b8fe1ed7e87f8c3e","is_superuser":false,"is_staff":false},"post_date":1641372438,"body":"Imo he should've murdered Them both I the First go Kill her and that Tramp I do not take lightly to Cheating in my household to cheat Is to Betray Thy trust and that Must be punished By either Blood or Money"},{"id":2224944,"gallery_id":193300,"poster":{"id":1592971,"username":"echiron","slug":"echiron","avatar_url":"avatars/1592971.png?_=e979988a18378786","is_superuser":false,"is_staff":false},"post_date":1640627275,"body":"I can honestly say with all that I am that I would not have fought to keep her. I wouldn’t care about why she did it or how she was afterwards. I wouldn’t want anything to do with her. She can rot."},{"id":2151942,"gallery_id":193300,"poster":{"id":3724507,"username":"horn e","slug":"horn-e","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637330678,"body":"2 is peak for good material and fucked up-ness, this one is just plain fucked up. Man is so messed up he's willing to be divorced in his wife parents eyes"},{"id":2127816,"gallery_id":193300,"poster":{"id":140656,"username":"weaboo911","slug":"weaboo911","avatar_url":"avatars/140656.png","is_superuser":false,"is_staff":false},"post_date":1636200477,"body":"vanilla really sweet and all but you also need some spices as well, especially when consuming a fictional works(again, fictional works)\nwhat vanilla fans don't understand is they often self insert as the mc who got cucked rather than just enjoying the arts and have a good chuckle here and there since NTR story occasionally really stupid/dumb\nlesson is, don't self insert yourself in a fiction works, its dangerous"},{"id":2082280,"gallery_id":193300,"poster":{"id":4735295,"username":"Taking a peak","slug":"taking-a-peak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634266003,"body":"Wow the ending surprised me.this is the most interesting NTR story I've seen I didn't beat my meat at all to this, it felt more like a soap opera with adult scenes."},{"id":2067514,"gallery_id":193300,"poster":{"id":4282848,"username":"Michael Oxlong.","slug":"michael-oxlong","avatar_url":"avatars/4282848.png?_=4ac006c90e3cac46","is_superuser":false,"is_staff":false},"post_date":1633666186,"body":"for vanilla fans who can't stand NTR, try reading this shit, i've once hated NTR, even thinking about it disgusted me, but after reading this shit completely, i've been immune to it, somehow, i don't deliberately seek Netorare, but if there's NTR in some hentai I'm reading, it doesn't really bothers me anymore, Heck, if the story or the artstyle's good i even favorited them.........but i still can't accept lightsaber censored dicks, i didn't pop a single boner Reading this shit, even after re-reading this, still no boner, because of the censored Peepees"},{"id":2037968,"gallery_id":193300,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1632470632,"body":"she is one time cheating with childhood fri\nshe is bitch "},{"id":1936382,"gallery_id":193300,"poster":{"id":4206471,"username":"traditional_weeb","slug":"traditional_weeb","avatar_url":"avatars/4206471.png?_=7a3f53e452f9143e","is_superuser":false,"is_staff":false},"post_date":1628624406,"body":"Couldn’t my boy just pop a Viagra and all this would have never happened or does Viagra not work like that ?"},{"id":1929436,"gallery_id":193300,"poster":{"id":1553631,"username":"slutsonly","slug":"slutsonly","avatar_url":"avatars/1553631.png?_=7821c3a084605c4b","is_superuser":false,"is_staff":false},"post_date":1628352210,"body":"MC is a tard for ruining Haruka lmao"},{"id":1882182,"gallery_id":193300,"poster":{"id":3545782,"username":"Quick Silver","slug":"quick-silver","avatar_url":"avatars/3545782.png?_=1a358b8b75123850","is_superuser":false,"is_staff":false},"post_date":1626653200,"body":"This is out of control yoo"},{"id":1850168,"gallery_id":193300,"poster":{"id":2334433,"username":"rexdrom","slug":"rexdrom","avatar_url":"avatars/2334433.png?_=fb75ec676626e43d","is_superuser":false,"is_staff":false},"post_date":1625379685,"body":"This has ruined me. Nothing can hurt me anymore."},{"id":1831795,"gallery_id":193300,"poster":{"id":1607881,"username":"kasaibobop","slug":"kasaibobop","avatar_url":"avatars/1607881.png?_=f997a4c006a9dd4d","is_superuser":false,"is_staff":false},"post_date":1624651351,"body":"Bruh it's 3 am and i have a doctor's appointment tomorrow morning why am i binging this"},{"id":1818489,"gallery_id":193300,"poster":{"id":1693671,"username":"veltio sami","slug":"veltio-sami","avatar_url":"avatars/1693671.png","is_superuser":false,"is_staff":false},"post_date":1624164357,"body":"you forget to put tag comedy in here"},{"id":1806990,"gallery_id":193300,"poster":{"id":4295726,"username":"lowlifepos","slug":"lowlifepos","avatar_url":"avatars/4295726.png?_=c2454847ee3b10ca","is_superuser":false,"is_staff":false},"post_date":1623696393,"body":"I'm just gonna ramble from this point on. No, she did not fuck with all the omiai she met. She does tease Shou, pretending that she did but then she steps on his dick and calls him a pervert. The only normal characters in this series that I feel sorry for is Haruka's father and that senpai guy. This series also made me laugh with how Shou's father was pretty much the only one who put up much of a fight to refuse the whole thing. I love Shou-chan's traumatised expressions along with the hot sex scenes. I love how Haruka actually became more aggressive and deviant despite the whole thing starting because of her inability to say no. I love how Shou-chan got more normal and more fucked up at the same time with him realising his love for Haruka yet still desiring a higher level of NTR bringing even his own father into it. So yeah this is a 10/10 and I like @joejava's analysis even if i find that it's slightly wrong. 2/2"},{"id":1806954,"gallery_id":193300,"poster":{"id":4295726,"username":"lowlifepos","slug":"lowlifepos","avatar_url":"avatars/4295726.png?_=c2454847ee3b10ca","is_superuser":false,"is_staff":false},"post_date":1623695103,"body":"it isn't really all Haruka's fault because before she mentions being on the pill, she states \"I only wanted to have sex with you. I wanted to have your baby but then...\" which clearly shows that she didn't intend to cause Shou's weird fetish/anxiety. She then reveals how she was on the pill whenever she had sex with Shou which is where the misconception comes in. However, she says right after \" I wanted to be sure I wouldn't get pregnant. By you, that is.\" where we can assume by the last sentence that she started going on the pill once Shou's demands were too much for her. Furthermore, the reason why Haruka went on the pill wasn't only because of how she hates Shou, she also went on the pill as she knew her mental state was definitely not ready for a child. Also, her love for Shou was genuine, as was his love for her. Saying Haruka is some sadist bitch who wanted Shou to suffer just leaves a bad taste in my mouth. Haruka is more complex than that. 1/2"},{"id":1770567,"gallery_id":193300,"poster":{"id":3212796,"username":"mkoyz19","slug":"mkoyz19","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622301387,"body":"@Hentai Boi You guys are dumb.. Haruka clearly said she wanted a normal life and wanted to have his baby but after the fucker husband requested such an absurd thing sleeping with other men etc. she decided to take a pill and not wanting to be pregnant because she's not confident to be a mother anymore (thats why she fucking hates him) but still knew she wants to be a mother (all this look at page 169) but because of all those fukery her mind got corrupted and cant live a normal life anymore thats when she realize she cant go back to being normal and stays with her fucker husband."},{"id":1755660,"gallery_id":193300,"poster":{"id":1459253,"username":"chanman789","slug":"chanman789","avatar_url":"avatars/1459253.png","is_superuser":false,"is_staff":false},"post_date":1621679423,"body":"They don't do plot like this no more"},{"id":1665778,"gallery_id":193300,"poster":{"id":3900953,"username":"lantoy44","slug":"lantoy44","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617804145,"body":"woah I have read a similar plot but it was manhwa porn its called For your happiness but both stories have different ending but that manhwa ending is just more cruel than this plot have."},{"id":1549827,"gallery_id":193300,"poster":{"id":1427084,"username":"Hentai Boi","slug":"hentai-boi","avatar_url":"avatars/1427084.png?_=d19d75678db07859","is_superuser":false,"is_staff":false},"post_date":1612665199,"body":"One more thing tho.. is haruka fuck all those omiai she met ? I can't process that"},{"id":1549822,"gallery_id":193300,"poster":{"id":1427084,"username":"Hentai Boi","slug":"hentai-boi","avatar_url":"avatars/1427084.png?_=d19d75678db07859","is_superuser":false,"is_staff":false},"post_date":1612665079,"body":"Fr Haruka is the one who really need to seek help. I praised her at start but I keep shiver when she finally reveal the true herself piece by piece through the story. from oc the twisted pills thing, how she enjoyed shuus pain, how she even have a thought to threaten shuus father with the panty incident and all. man try to look at her eyes when shit happen, looks beautifully innocent but also hiding a mangekyou sharingan inside.. with that mind of her I think whoever she married problems will always come.\n\nBut what I dont understand is she still have some kind of affection to shuu, I dont know what kind of affection is that. (2/2)"},{"id":1549814,"gallery_id":193300,"poster":{"id":1427084,"username":"Hentai Boi","slug":"hentai-boi","avatar_url":"avatars/1427084.png?_=d19d75678db07859","is_superuser":false,"is_staff":false},"post_date":1612664802,"body":"Yeah this is the most uniquely written fucked up thing I've ever read.\n\nHeres my thought,\nBoth are maniac at this point but haruka is the one who cause this all. First of all Haruka didnt even know she wanted to marry shuu or not it looks like she just agree when they disscused to get married without consider anything or even talk what is in her mind. just like shuu said haruka was kind of giga over obedient girl who say yes to everything. In result she feel regret marrying him and decided to take pills forever to make sure she didn't get pregnant by shuu (instead of just talk things out or just simply ask divorce). Thats exactly what makes shuus growing anxiety and have thoose illness. (1/2)"},{"id":1518090,"gallery_id":193300,"poster":{"id":3569931,"username":"norec777","slug":"norec777","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611261626,"body":"None of any other NTR can reach this level. The art and the story 9/10. Some people didn't like the story, but this manga is best for those who have a beta-loser cuck kink. Other NTR manga with \"ugly-bastard\" tag just ruin the true essence of cuckolding and more into cheating n rape. "},{"id":1516885,"gallery_id":193300,"poster":{"id":3279234,"username":"brucucked","slug":"brucucked","avatar_url":"avatars/3279234.png?_=99f2385fca8c29f2","is_superuser":false,"is_staff":false},"post_date":1611207207,"body":"@SLAP yeah they're back on track doing that netorase thing. That shoes is an implication that another man is on the house. Prolly fucking his wife."},{"id":1514199,"gallery_id":193300,"poster":{"id":3562031,"username":"SLAP","slug":"slap","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611098971,"body":"please .. someone explain the ending on the last page, I can't understand if the wife is back again?"},{"id":1488681,"gallery_id":193300,"poster":{"id":1400370,"username":"starfox1234","slug":"starfox1234","avatar_url":"avatars/1400370.png?_=8fe9415a33f35edc","is_superuser":false,"is_staff":false},"post_date":1610678403,"body":"This is some legendary hentai"},{"id":1348112,"gallery_id":193300,"poster":{"id":3279234,"username":"brucucked","slug":"brucucked","avatar_url":"avatars/3279234.png?_=99f2385fca8c29f2","is_superuser":false,"is_staff":false},"post_date":1605820761,"body":"Their netorase levels is so high that a bbm stepdad which is a natural cucker tried to stop them lmaoooo. but this is gold fr I fapped 3 times in an hour."},{"id":1339514,"gallery_id":193300,"poster":{"id":1343863,"username":"Jabby","slug":"jabby","avatar_url":"avatars/1343863.png","is_superuser":false,"is_staff":false},"post_date":1605475777,"body":"Thank god I didnt get a boner throughout the 3 whole series. If i did, i wouldve killed myself"},{"id":1333413,"gallery_id":193300,"poster":{"id":36732,"username":"jokerXY","slug":"jokerxy","avatar_url":"avatars/36732.png","is_superuser":false,"is_staff":false},"post_date":1605250737,"body":"@joejava what I understood from that is that this is all harukas fault then as she was secretly taking pills which put pressure eon the mc and the she got upset when she was forced to suffer for the consequences of her own actions instead of just straight up telling him that she either didn’t want to be together or that she didn’t want a baby"},{"id":1197818,"gallery_id":193300,"poster":{"id":3574377,"username":"joejava","slug":"joejava","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599505796,"body":"Shuu’s perversion:\nHe gets sexually excited at the emotional-turmoil of having his wife have sex with other men. She agrees to let him choose her sexual relationships. The better looking the man, the closer the relationship of the man to him, and the more vocal the man is at using his wife the more jealousy and shame he feels which leads to greater sexual excitement. He will often be in physical contact with his wife as she has sex with another man, she will position his head so that he is forced to watch her being violated and she will make eye contact with him as she pleasures her partner."},{"id":1197811,"gallery_id":193300,"poster":{"id":3574377,"username":"joejava","slug":"joejava","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599505670,"body":"Shuu’s perversion manifested from his family, friends, and wife putting pressure on him to have a child. He develops Erectile Dysfunction (ED) due to performance anxiety of not being able to impregnate his wife. For sexual satisfaction he masturbates to imaginary images of his wife having sex with other men. This eventually leads to his over coming his ED problem by having sex with his wife immediately after watching her have sex with other men.\n"},{"id":1197808,"gallery_id":193300,"poster":{"id":3574377,"username":"joejava","slug":"joejava","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599505549,"body":"Haruka's perversion:\nShe get sexual pleasure at seeing Shuu in pain, especially his emotional suffering from her infidelities. She enjoys watching his face as the emotional-turmoil becomes so great he starts tearing up. She will insult, ridicule, and embarrass him by comparing his body and his sexual performance unfavorably when compared to her lovers."},{"id":1197798,"gallery_id":193300,"poster":{"id":3574377,"username":"joejava","slug":"joejava","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599505422,"body":"Haruka’s perversion manifests from her desire to a good wife and mother, but feeling unworthy to be a mother since she does NOT want to have Shuu’s biological children (page 17 Ch 26). She is ultimately responsible for Shuu’s perversion manifesting, since it was impossible for him to get her pregnant with her secretly taking birth control pills.\nShe hates Shuu for not putting a stop to the infidelities, allowing both of them to develop their perversions.\nShe loathes and is disgusted with herself for feeling sexual excitement at seeing Shuu suffering."},{"id":1197786,"gallery_id":193300,"poster":{"id":3574377,"username":"joejava","slug":"joejava","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599505186,"body":"Their relationship defined:\nOnly after they have been separated for three years does she tell Shuu about the birth control pills. Shuu holds her tight and tells her that he wants her to be a mother and that he will always remain her husband and together they will raise her children (he accepts being a netorare cuckold). They both agree that they love each other and are happiest when they allow their sexual perversions to rule them. Haruka tells Shuu SHE will now in choose her sexual relationships and will continue to bully him (cause him emotional-turmoil with her infidelities).\n\nSo what does the ending mean:\nHaruka is now sleeping with whomever she wants, trying to get pregnant. The last pages show a large pair off male shoes in the entry way, meaning Haruka is having sex in their apartment.\nShuu gets excited and loudly announces \"I'M HOME\"."},{"id":1152135,"gallery_id":193300,"poster":{"id":2194656,"username":"dvillan6","slug":"dvillan6","avatar_url":"avatars/2194656.png","is_superuser":false,"is_staff":false},"post_date":1597654692,"body":"Wow that was intense .... A perspective I've never seen before ... Whoof man idk idk ... "},{"id":1147141,"gallery_id":193300,"poster":{"id":2929853,"username":"Horayo~","slug":"horayo","avatar_url":"avatars/2929853.png","is_superuser":false,"is_staff":false},"post_date":1597474144,"body":"with this series,nothing can hurt my feeling any more.I can't feel nothing right now..."},{"id":1127421,"gallery_id":193300,"poster":{"id":1048924,"username":"mathewreyes45","slug":"mathewreyes45","avatar_url":"avatars/1048924.png","is_superuser":false,"is_staff":false},"post_date":1596702131,"body":"if I'm just as good as the artist, I will draw it again and then I will put a happy story man the art of this doujin is so good for this fuck retarded autistic story"},{"id":1124909,"gallery_id":193300,"poster":{"id":2438516,"username":"Swagger22","slug":"swagger22","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596597699,"body":"On another note, once you readd this, I doubt there is any higher levels of NTR so you should be more immune to NTR after this hopefully. So that is the only thing you will gain from actually reading this."},{"id":1124897,"gallery_id":193300,"poster":{"id":2438516,"username":"Swagger22","slug":"swagger22","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596597451,"body":"I'm finally done with this shit.  I read volume one yesterday and I was like fuck this and I kept thinking about this for a while. My god, I regret even starting this shit train. At least, I repeat, at LEAST, the ending was ok to the point where I can forget about this shit. I don't usually comment on hentai but after reading this, i need to release the bullshit emotions I had reading this shit. If anyone can actually fap to this hats off to you, although I'm gonna judge the fuck outta you. \n\nTBH, could have prevented the whole thing if she got pregnant by IVF or stop taking the pills. IDK if she actually did take those pills but I'm gonna assume she did cuz i personally don't see why she would lie. \n\nWelp thanks for coming to my Ted Talk. Tah tah and farewell."},{"id":1092398,"gallery_id":193300,"poster":{"id":201857,"username":"chickenhentai","slug":"chickenhentai","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1595330605,"body":"I don't even know anymore"},{"id":1038232,"gallery_id":193300,"poster":{"id":1060740,"username":"justcallmedaboss","slug":"justcallmedaboss","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593253217,"body":"I see a lot of people saying that they had a \"happy ending\" sort of but c'mon the girl definitely went half insane, she was pretty normal at the beginning but then she snapped to be able to accept the reality of what she was living. \n\nShe was not a fucking dumbass like the mc from the start she just became insane to be able to deal with what was going on, why ? Cuz she's a fucking dumbass but in an even worse way, she was a very good person, the worst type of thing you can be in this world, this shows that even a complete fuck can ruin a good person to become that pathetic mess, just cuz she was trying to make him happy. \n\nOverall great fap but still makes me infinitely pity her every read. "},{"id":966055,"gallery_id":193300,"poster":{"id":76058,"username":"mikelitoris","slug":"mikelitoris","avatar_url":"avatars/76058.png?_=65f9cc7a44c35610","is_superuser":false,"is_staff":false},"post_date":1562429822,"body":"Also i love how everyone jack off to gangbang, harem, orgies, unconsensual sex, loveless sex, and other depravity and promiscuity but when a husband and wife, who love each other but wants other people to fuck the wife from time to time, is off limit and too far. Don't usually talk this much but after reading 600 pages of a magnum opus smut drama story i just need to let my thought out there"},{"id":966043,"gallery_id":193300,"poster":{"id":76058,"username":"mikelitoris","slug":"mikelitoris","avatar_url":"avatars/76058.png?_=65f9cc7a44c35610","is_superuser":false,"is_staff":false},"post_date":1562429182,"body":"Though i really feel sorry for the senpai and haruka's dad. That senpai was used and tricked by haruka into doing her. I hope that senpai could get over haruka and haruka's dad could accept the fact that her daughter's husband let people sleep with his wife, well at least enough to reconcile with haruka, he has every right to hate shuu-chan tbh. Man the story is better than most fucking pornhwas or actually, actual legit ecchi drama mangas published by mainstream magazines."},{"id":966036,"gallery_id":193300,"poster":{"id":76058,"username":"mikelitoris","slug":"mikelitoris","avatar_url":"avatars/76058.png?_=65f9cc7a44c35610","is_superuser":false,"is_staff":false},"post_date":1562428896,"body":"The whole story is them coming to terms to shuu-chan's fucked up cuckold fetish. Instead of \"hey my negative trait/flaw is gone now\" resolution, i like how both came to accept shuu-chan's flaw instead. I mean yeah sure he likes when other people fuck his wife but if you put that aside, they're both good people. Shuu-chan is faithful to haruka (because he's the one who want haruka to fuck other people) and he help out people in need while haruka loves her husband and just want shuu-chan to be happy."},{"id":950662,"gallery_id":193300,"poster":{"id":1811031,"username":"maremare","slug":"maremare","avatar_url":"avatars/1811031.png","is_superuser":false,"is_staff":false},"post_date":1561321950,"body":"Usually character like tatakura is shitty cuck ball but in this case he's the only sane person that really wanted to help her"},{"id":949861,"gallery_id":193300,"poster":{"id":2085189,"username":"explicit_desire","slug":"explicit_desire","avatar_url":"avatars/2085189.png","is_superuser":false,"is_staff":false},"post_date":1561270687,"body":"HAHAHAHAHA there is no end, huh?\nWell at least they're happy?\nBut shit, i feel pity for their victim...\nI mean that girl only using other man as her dicktoy to get what she want, the miserable mc face.\nAnd the mc using those two as his fap material.\nHonestly, this is retarded but that's how it is i guess?"},{"id":908552,"gallery_id":193300,"poster":{"id":1714062,"username":"Mob Kun","slug":"mob-kun","avatar_url":"avatars/1714062.png?_=026e2ccff11ebbd6","is_superuser":false,"is_staff":false},"post_date":1558162431,"body":"That was a hella painful read even tho i love NTR, man he's the biggest cuck ever really twisted fucker ugh this is why all the cucks must be killed also kys author "},{"id":884984,"gallery_id":193300,"poster":{"id":1554569,"username":"pornitoxx","slug":"pornitoxx","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1556175146,"body":"@yatodelivery she's cheating him with another guy. There are 2 pairs of shoes and he's just coming home.\n"},{"id":861768,"gallery_id":193300,"poster":{"id":576393,"username":"xBeelzebub","slug":"xbeelzebub","avatar_url":"avatars/576393.png?_=c4427fbb7890ad05","is_superuser":false,"is_staff":false},"post_date":1554064641,"body":"The art is simply too good... it was a bit painful to read though, but still awesome."},{"id":836836,"gallery_id":193300,"poster":{"id":1906104,"username":"frogfroggy","slug":"frogfroggy","avatar_url":"avatars/1906104.png","is_superuser":false,"is_staff":false},"post_date":1551858252,"body":"They're both equally fucked up in the end for each other. damn"},{"id":806662,"gallery_id":193300,"poster":{"id":71475,"username":"gesshoku01","slug":"gesshoku01","avatar_url":"avatars/71475.png","is_superuser":false,"is_staff":false},"post_date":1549202204,"body":"So.... it's done?"},{"id":753179,"gallery_id":193300,"poster":{"id":2080072,"username":"yatodelivery","slug":"yatodelivery","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1544435733,"body":"So what happen at page 193 do she cheating with another guy or just his shoes?"},{"id":746317,"gallery_id":193300,"poster":{"id":1570889,"username":"XanderRaidon","slug":"xanderraidon","avatar_url":"avatars/1570889.png","is_superuser":false,"is_staff":false},"post_date":1543674454,"body":"The story itself is just a string of dumb shit done by the MC and his retarded thought process. However, I've seen realities which are way dumber than this story, therefore this manga is actually very realistic."},{"id":746301,"gallery_id":193300,"poster":{"id":1570889,"username":"XanderRaidon","slug":"xanderraidon","avatar_url":"avatars/1570889.png","is_superuser":false,"is_staff":false},"post_date":1543673940,"body":"Netoraserare explained for idiots: MC loves his wife. MC is a masochist that gets turned on only by NTR. MC is not actually a cuck because it pains him to see his wife with other men. MC in his infinite stupidity decides that instead of taking Viagra for turn-on problems, he decides to force himself and his wife through Hell and Back because he's that much of a retard. This whole ordeal almost destroys the couple, but because they're such a perfect fit for each other, the couple survives.\n\nLesson learned? Don't be an idiot and think about the consequences of your actions before taking important life decisions."},{"id":746289,"gallery_id":193300,"poster":{"id":1570889,"username":"XanderRaidon","slug":"xanderraidon","avatar_url":"avatars/1570889.png","is_superuser":false,"is_staff":false},"post_date":1543672635,"body":"@akehpoloe they \"hate\" NTR. Let's be real here, they've read every single NTR piece this site has to offer. I didn't even finish half of them. If they truly \"hated\" NTR, they would've blacklisted it, not read and comment on every single one."},{"id":733305,"gallery_id":193300,"poster":{"id":1321053,"username":"Slathor","slug":"slathor","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1542215083,"body":"btw if some of you says that don't read the stories and just appreciate the art, you are wrong. this hentai has a story of course nonsense story but still has a plot because of many chapters the author pour into it. what can i say is this is the first time i didn't get boner at ntr so i kind of appreciate this one"},{"id":731815,"gallery_id":193300,"poster":{"id":609674,"username":"akehpoloe","slug":"akehpoloe","avatar_url":"avatars/609674.png?_=069f377f23c3bada","is_superuser":false,"is_staff":false},"post_date":1542040462,"body":"it's funny despite they hate ntr but read till the end lmao"},{"id":731399,"gallery_id":193300,"poster":{"id":1151144,"username":"noobeginner","slug":"noobeginner","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1541986548,"body":"Masterpiece. If I were to named the best NTR doujin, this is it. When 99.9% NTR usually end up badly, this one make it to the good ending. Their love overcome everything they've ever done. I think the husband really represent us as an NTR fan about what it feels like to get cucked. Not a single sex scene doesn't involve in the husband watching. Meanwhile, the wife represent every cheating girl if they know that they're being watched by their cucked partner. In the end, they were no \"cheating sex\" and breakup involved and the couple is clearly enjoying it. Looking at the artstyle and storytelling, I can tell that the author is a woman who love NTR as much as we do and trying to make a happy ending of it. "},{"id":729182,"gallery_id":193300,"poster":{"id":1638309,"username":"Shiro Zero","slug":"shiro-zero","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1541721285,"body":"Both are twisted. Where can I find those milfs? "},{"id":722287,"gallery_id":193300,"poster":{"id":1909788,"username":"jonesjl","slug":"jonesjl","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540888552,"body":"In the end she still want to do with other men in front of her husband while the husband enjoyed it so much. I have feelings that the author had a neto-psycho, logical damaged and sense damaged."},{"id":705472,"gallery_id":193300,"poster":{"id":1963462,"username":"Lewdnude","slug":"lewdnude","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1538925559,"body":"Shit .. I am pretty perverted but even I got grossed out .. No man. The ex boyfruend should have taken her, but to stay with him after all that, perhaps they deserve each other. Just pray no child enters that ... what ever it is."},{"id":666287,"gallery_id":193300,"poster":{"id":1865580,"username":"Lamperouge01","slug":"lamperouge01","avatar_url":"avatars/1865580.png?_=35da6f3266ad514f","is_superuser":false,"is_staff":false},"post_date":1535131856,"body":"Reading the ongoing series was something tho.. Shuu chan no baka.. "},{"id":661794,"gallery_id":193300,"poster":{"id":1455640,"username":"anjingsetan17","slug":"anjingsetan17","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534669889,"body":"only advice i can give to people who haven't read the stories is.DO NOT read the stories just enjoy the art and if you do read the stories then well god bless you"},{"id":657500,"gallery_id":193300,"poster":{"id":1012246,"username":"FapOS","slug":"fapos","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534307550,"body":"The hentai animation adaptation is average and it adapted only till the first netorase play"},{"id":655386,"gallery_id":193300,"poster":{"id":1684079,"username":"Kayfag","slug":"kayfag","avatar_url":"avatars/1684079.png?_=54bc6ba9c485ecd7","is_superuser":false,"is_staff":false},"post_date":1534140858,"body":"God I fucken hate this shit, the art is something I would fap, but I hated the story to the point that I couldn't pop a single boner throughout the 3 volumes. The fucken mc is such a bitch that he can't fucken get a boner unless if he feels that his wife is cheating on him or he's losing her due to shit from the pass, which I'm sure it can be coped by going to a psychiatrist. Also, the only reason I bothered to read all 3 vol was the hope to see some sort of development within the mc, which it seems to happen when he tries to make up with his wife and finally has normal sex. Until you see the last page of the story with another man's shoe in his house and banging sound all over the fucken panel."},{"id":597465,"gallery_id":193300,"poster":{"id":1712196,"username":"crnr","slug":"crnr","avatar_url":"avatars/1712196.png","is_superuser":false,"is_staff":false},"post_date":1533235966,"body":"I wonder how far the animation will go 0w0"},{"id":559648,"gallery_id":193300,"poster":{"id":1123207,"username":"Satan696","slug":"satan696","avatar_url":"avatars/1123207.png","is_superuser":false,"is_staff":false},"post_date":1530112933,"body":"I hate myself....to think that I've read and fap through all three of this series "},{"id":554323,"gallery_id":193300,"poster":{"id":1012246,"username":"FapOS","slug":"fapos","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1529540778,"body":"We should really have a tag called netorase, it's even in the title. so in the end I guess happy end? they didn't divorce? the netoraSE stopped?\n\nI need a similar hentai netorase to this one but this time the wife is a cuck gets off of her husband fucking other girls"},{"id":553420,"gallery_id":193300,"poster":{"id":1774004,"username":"Concent matters","slug":"concent-matters","avatar_url":"avatars/1774004.png?_=be069e9863633cee","is_superuser":false,"is_staff":false},"post_date":1529436351,"body":"Man I really hate one because the plot is stupid another that a hard working salary man gets cucked for no reason feels bad.\nBut this thing ain't ntr this is pleasure. Man after a year I came back to read it full because of that new gaishuu Manga but seeing him suffer all the time and get beaten like that God damn it that's was fun. Fack that ending he should have remained cucked why get together again. Senpai should have win. Cuck like him deserve nothing as a man I feel no sympathy nor any insecurities. Wish all those dudes had gangbanged and impregnated her infront of him. Why didn't she get impregnated by some other man. Author needs to gives a new chapter. "},{"id":517370,"gallery_id":193300,"poster":{"id":1407522,"username":"Ear Rape","slug":"ear-rape","avatar_url":"avatars/1407522.png","is_superuser":false,"is_staff":false},"post_date":1527053163,"body":"man, im finally read this and my bloody thirsty increased. if someone ask me to fuck his wife because same story like this then i will fuck him instead eventhought im not a gay."},{"id":441317,"gallery_id":193300,"poster":{"id":1688591,"username":"torjak","slug":"torjak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1525634069,"body":"I would take a guess and say the author of this art work is a female. The emotional depth of this series is a giveaway."},{"id":441314,"gallery_id":193300,"poster":{"id":1688591,"username":"torjak","slug":"torjak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1525633435,"body":"God-tier cuck that guy, Levi Ackerman lookalike. In the end they both got their happy ending, however twisted it may be."},{"id":434059,"gallery_id":193300,"poster":{"id":762315,"username":"phanlongtran","slug":"phanlongtran","avatar_url":"avatars/762315.png","is_superuser":false,"is_staff":false},"post_date":1524463417,"body":"He is crazy man\n"},{"id":361927,"gallery_id":193300,"poster":{"id":1479470,"username":"HentaiXOtaku","slug":"hentaixotaku","avatar_url":"avatars/1479470.png","is_superuser":false,"is_staff":false},"post_date":1517894114,"body":"Someone explain the ending? The shoes belonged to another man and she continues to cheat on him?"},{"id":360555,"gallery_id":193300,"poster":{"id":546560,"username":"crixuz","slug":"crixuz","avatar_url":"avatars/546560.png","is_superuser":false,"is_staff":false},"post_date":1517665213,"body":"I like it       "},{"id":343044,"gallery_id":193300,"poster":{"id":757794,"username":"Chazks","slug":"chazks","avatar_url":"avatars/757794.png?_=ff206596895f0f98","is_superuser":false,"is_staff":false},"post_date":1514950587,"body":"Thanks to this . I got into netorare haha"},{"id":322786,"gallery_id":193300,"poster":{"id":842752,"username":"Anczar","slug":"anczar","avatar_url":"avatars/842752.png?_=a590080fe2c958d2","is_superuser":false,"is_staff":false},"post_date":1510672437,"body":"3 vol of cuckness.. ahhhhhhhh im bless in hell"},{"id":307022,"gallery_id":193300,"poster":{"id":507349,"username":"BusKota","slug":"buskota","avatar_url":"avatars/507349.png","is_superuser":false,"is_staff":false},"post_date":1507322845,"body":"i only look this because the art but meh this is so stupid, i will never see the vol 1 and 2\nin the end the wife still invite another man, and thus there is no the end of it.\n+1 to the wife father for beating the mc."},{"id":141188,"gallery_id":193300,"poster":{"id":333407,"username":"avid123","slug":"avid123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500192526,"body":"You know, there's something weirdly honest about this that feels like the author is writing from experience... I've seen cucks out of inferiority complexes, but never one like this. This one is downright poison. "},{"id":135786,"gallery_id":193300,"poster":{"id":104223,"username":"azuzu98","slug":"azuzu98","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1498969167,"body":"This is a bad comedy,but I'm all about bad comedy !!\nReally I couldn't help but laugh while I read this."},{"id":130517,"gallery_id":193300,"poster":{"id":995971,"username":"InmortalLucia","slug":"inmortallucia","avatar_url":"avatars/995971.png","is_superuser":false,"is_staff":false},"post_date":1497666113,"body":"Impossible to fap if you only show tits .... 3 volumes of tits only ....."},{"id":128297,"gallery_id":193300,"poster":{"id":18962,"username":"nhockmonss","slug":"nhockmonss","avatar_url":"avatars/18962.png","is_superuser":false,"is_staff":false},"post_date":1497049576,"body":"ya :V the four time I readed that &lt;3 ... "},{"id":126331,"gallery_id":193300,"poster":{"id":344015,"username":"Kainoftheforest","slug":"kainoftheforest","avatar_url":"avatars/344015.png","is_superuser":false,"is_staff":false},"post_date":1496572243,"body":"This story was fucking crazy for me. no boner at all just to be honest up front, the whole story you are made to be put in shuu shoes. this slow taint of pleasure spiked with pain but for me it was all pain. living throught this experience through Shuu is a position i never want to be in in real life but thought fiction i am able to feel disgusted and uncomfortable (its like when you go see a horror film that you know will give you nightmares) whats crazy near the end they both established that they havent changed but they clearly do. Haruka still cant say no but has developed this satisfaction on her husbands face when she bullys him and shuu has just sunken deeper into his fetish but has true satisfaction he has found peace in himself after he got Haruka. and it somehow works! i love the story, love the characters, and thank GOD its a happy ending... But holy shit do i never wanna read this again....but then again...like a good horror film sometimes you want to revisit the nightmares"},{"id":126172,"gallery_id":193300,"poster":{"id":606736,"username":"SleeplessPrince","slug":"sleeplessprince","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1496524616,"body":"So in the end she still having sex with other men?"},{"id":123862,"gallery_id":193300,"poster":{"id":1139018,"username":"MugenZero","slug":"mugenzero","avatar_url":"avatars/1139018.png","is_superuser":false,"is_staff":false},"post_date":1496010696,"body":"I hate this feelings i get in ntr but i still love ntr though LOL. \n\nSo in the end its just a novel read by a couple...Well i want the animation of this to be continued"},{"id":117583,"gallery_id":193300,"poster":{"id":353592,"username":"sakuraga3","slug":"sakuraga3","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1494050763,"body":"anjing banget\n"},{"id":115388,"gallery_id":193300,"poster":{"id":893004,"username":"arnab gharay","slug":"arnab-gharay","avatar_url":"avatars/893004.png","is_superuser":false,"is_staff":false},"post_date":1493493557,"body":"do you got a wife like this send her to me ,i will take care of her good. either you are smoking weed or this happened to you. the art is good... but story is simply garbage...do your​ self a favour don't make story"},{"id":114926,"gallery_id":193300,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1493367688,"body":"@Professional Hentaiologist  Were you born a moron or have you perfected being one in ur lifetime?"},{"id":114786,"gallery_id":193300,"poster":{"id":1103022,"username":"SaduPorunoMaku","slug":"saduporunomaku","avatar_url":"avatars/1103022.png","is_superuser":false,"is_staff":false},"post_date":1493318449,"body":"So... And endless cycle of FUCKING and LOVING and FUCKING and LOVING and FUCKING and LOVING... Still got me boned and at the same time, mind fucked."},{"id":114743,"gallery_id":193300,"poster":{"id":1089889,"username":"Professional Hentaiologist","slug":"professional-hentaiologist","avatar_url":"avatars/1089889.png","is_superuser":false,"is_staff":false},"post_date":1493303438,"body":"Dafuq is this sht? I didn't eve  want to read everything, I just skimmed through. I don't know what kind weed the artist smoked when they were drawing this, but damn wtf is this?"},{"id":114690,"gallery_id":193300,"poster":{"id":826159,"username":"MoMo","slug":"momo","avatar_url":"avatars/826159.png","is_superuser":false,"is_staff":false},"post_date":1493285881,"body":"Lmao Metroid never fails with the condescending attitude. Love it every time tbh /s"},{"id":114651,"gallery_id":193300,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1493272491,"body":"@nchris this is netorase not netori u moron learn the difference and u are using the word evolution in the wrong context"},{"id":114496,"gallery_id":193300,"poster":{"id":434849,"username":"Keksz","slug":"keksz","avatar_url":"avatars/434849.png","is_superuser":false,"is_staff":false},"post_date":1493230731,"body":"I don't know why I wasted an hour reading this series, even though I didn't get a single boner. "},{"id":114493,"gallery_id":193300,"poster":{"id":597735,"username":"Nanocon101","slug":"nanocon101","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493229904,"body":"If i came home and she was still cheating, after saying she wouldnt, i'd literally kill her."},{"id":114490,"gallery_id":193300,"poster":{"id":27598,"username":"Pekopa","slug":"pekopa","avatar_url":"avatars/27598.png","is_superuser":false,"is_staff":false},"post_date":1493228883,"body":"I love the fact that despite you guys hate it.. but you still read it till the end.. it's just funny to me"},{"id":114485,"gallery_id":193300,"poster":{"id":1106683,"username":"TruthExists45","slug":"truthexists45","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493228061,"body":"*But For the those who get off to this shit... Seek help"},{"id":114483,"gallery_id":193300,"poster":{"id":1106683,"username":"TruthExists45","slug":"truthexists45","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493227888,"body":"Thank God. Thank god. My body didn't react a bit when reading all 3 chapters of this bulshit. Not a single boner was cracked even after watching Haru's beautiful tits. I'm not tainted mentally. I can never be a cucked. This manga and Netorare in general makes me lose all sexual desires. There's still a space in heaven for me but as for the rest of you al"},{"id":114476,"gallery_id":193300,"poster":{"id":27598,"username":"Pekopa","slug":"pekopa","avatar_url":"avatars/27598.png","is_superuser":false,"is_staff":false},"post_date":1493224189,"body":"@Jerifishu lol true though"},{"id":114472,"gallery_id":193300,"poster":{"id":111269,"username":"poinky","slug":"poinky","avatar_url":"avatars/111269.png","is_superuser":false,"is_staff":false},"post_date":1493222783,"body":"Does no one realize that the heart wants what the heart wants but the body and mind are completely different organism. First off I can guarantee that I did not realize I was into any sort of hentai until I accidentally came across the shit and got hard, which im pretty sure is the same for slot of other people. All a link is just a \"weird boner land mine' that we all eventually step on, so whether or not if a dude or chick gets off on watching their beloved get smashed by another person and vice versa is not really our fucking problem so long as they as a couple are still happy. Also you fucks don't even think about calling me a \"beta, fag, or cuck\" cause I'm not, I just get off on the actual art regardless of what the story is, unless it's vanilla cause then I'll actually read it, since I'm not stupid enough to get into a story let alone a series that is not a genre I like, you fucking dumbasses. A couple of y'all are cool though so this isn't directed at you."},{"id":114450,"gallery_id":193300,"poster":{"id":109268,"username":"nipplereaper","slug":"nipplereaper","avatar_url":"avatars/109268.png","is_superuser":false,"is_staff":false},"post_date":1493216866,"body":"the cucked lord\n"},{"id":114440,"gallery_id":193300,"poster":{"id":336018,"username":"Jerifishu","slug":"jerifishu","avatar_url":"avatars/336018.png?_=8be4bb417a4490c2","is_superuser":false,"is_staff":false},"post_date":1493214015,"body":"@raichterr or we can just fap to her and ignore the plot? lol \nWe're all betas for being on this site."},{"id":114427,"gallery_id":193300,"poster":{"id":987697,"username":"nchris","slug":"nchris","avatar_url":"avatars/987697.png","is_superuser":false,"is_staff":false},"post_date":1493209657,"body":"Good milf and good netori, but the plot is garbage, it's the same from the begining to end, there is no evolution."},{"id":114422,"gallery_id":193300,"poster":{"id":18962,"username":"nhockmonss","slug":"nhockmonss","avatar_url":"avatars/18962.png","is_superuser":false,"is_staff":false},"post_date":1493206713,"body":"I realy waitting this hentai &lt;3 \n"},{"id":114405,"gallery_id":193300,"poster":{"id":826159,"username":"MoMo","slug":"momo","avatar_url":"avatars/826159.png","is_superuser":false,"is_staff":false},"post_date":1493202826,"body":"Guessing the man shoes at the end suggested he's still getting cuck..  "},{"id":114349,"gallery_id":193300,"poster":{"id":1042957,"username":"K kun","slug":"k-kun","avatar_url":"avatars/1042957.png","is_superuser":false,"is_staff":false},"post_date":1493185445,"body":"the author must be suffer like this story...... RIP author"},{"id":114300,"gallery_id":193300,"poster":{"id":138705,"username":"phdchristmas","slug":"phdchristmas","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1493176982,"body":"dat gril at the start though. Shuu-chan must be gay."},{"id":114287,"gallery_id":193300,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1493173155,"body":"Man, until this volume in specific the last 2 chapters I was hating only Shuu-chan. I was under the impression that Haruka was an Angel but as soon as she confessed what he did (taking the pills -  catalyst for Betamax-kun to feel inferior because he can’t impregnate his wife) I despised her as well, like senpai said they are F*ck up, both deserve each other… Broken minded, the parents disown them and move away, they end up without any family or friends left in the world. Amazing ending... not. My only gripe with this story us that fendom/mature Haruka was in two F*cking chapters only... WTF?!"},{"id":114278,"gallery_id":193300,"poster":{"id":231316,"username":"oldkei","slug":"oldkei","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493172228,"body":"I love the art and haruka boobs...nothing more."},{"id":114276,"gallery_id":193300,"poster":{"id":1013364,"username":"mellow Isaac","slug":"mellow-isaac","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493171736,"body":"@The Listless the last one was a different couple that was reading the porno"},{"id":114274,"gallery_id":193300,"poster":{"id":1027171,"username":"senPIE","slug":"senpie","avatar_url":"avatars/1027171.png","is_superuser":false,"is_staff":false},"post_date":1493171031,"body":"That last one though. Fucking bitch won't let him sleep with 1 girl, but it's totally fine when she sleeps with 10+ fuckers"},{"id":114264,"gallery_id":193300,"poster":{"id":607716,"username":"Red Bug","slug":"red-bug","avatar_url":"avatars/607716.png","is_superuser":false,"is_staff":false},"post_date":1493166751,"body":"those two deserve a special place in hell, from what i suffer keeping up with this series. great little end story though."},{"id":114262,"gallery_id":193300,"poster":{"id":426990,"username":"SunnY","slug":"sunny","avatar_url":"avatars/426990.png","is_superuser":false,"is_staff":false},"post_date":1493166516,"body":"@Rofllcat So true"},{"id":114258,"gallery_id":193300,"poster":{"id":827164,"username":"Raichterr","slug":"raichterr","avatar_url":"avatars/827164.png","is_superuser":false,"is_staff":false},"post_date":1493165596,"body":"over 500 pages of ntr in a single hour uploaded today, a great day for the beta cucks, a sad day for the rest of the site... "},{"id":114256,"gallery_id":193300,"poster":{"id":260281,"username":"Rofllcat","slug":"rofllcat","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493164799,"body":"Reading this shit while it was Ongoing was a torture hahaa"},{"id":114248,"gallery_id":193300,"poster":{"id":698415,"username":"Feronen","slug":"feronen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493162656,"body":"The one-off at the end is priceless."}]