[{"id":517506,"gallery_id":193652,"poster":{"id":342010,"username":"contra123","slug":"contra123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1527067656,"body":"please translate it in english"},{"id":115922,"gallery_id":193652,"poster":{"id":42403,"username":"PeasantX","slug":"peasantx","avatar_url":"avatars/42403.png?_=4689dea0028fc35e","is_superuser":false,"is_staff":false},"post_date":1493595783,"body":"at all) that´s really all they got going for themselves cause translating \"thrust thrust thrust\" or \"pump pump\" is unneccessary af.\n\nFourthly u cant expect peps not to complain if they could always get that stuff for free and suddenly someone is like \"yeag, we own this shit now so gtfo\"\n\nThat concludes why I am a bit sad that jewcob got so many good artists."},{"id":115920,"gallery_id":193652,"poster":{"id":42403,"username":"PeasantX","slug":"peasantx","avatar_url":"avatars/42403.png?_=4689dea0028fc35e","is_superuser":false,"is_staff":false},"post_date":1493595543,"body":"Let me allow to explain why your point is horseshit:\n\nFirst of all if u want to sell a product make it accesable to anyone interested in it. Fakku sub is credit card only. Do u get a credit card in any country easily? No. For example I don´t have any way of actually buying a subscribtion due to not having the necessary income/expenses to succesfully apply for a credit card in my country. (ever herad of paypal? No? It´s only one of the most commanly way used  to do online transactions. Does fakku has that for theier sub? No.)\n\nSecondly the author doesnt get a penny from fakku due to them having contracts with the magazine publishers who pay theier mangakas a fixed amount per work. So dont give me that shit \"herp derp support the artist\" cause thats just bullcrap.\n\nThridly  the sub for one month that is over 10 bucks is rather pricy  for theier limited content and while I see why some peps could argue that u don´t have black bars (I couldnt care less for black bars they dont bother me \n\n"},{"id":115906,"gallery_id":193652,"poster":{"id":698415,"username":"Feronen","slug":"feronen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493593449,"body":"Also, this is 2016-08, not 10."},{"id":115905,"gallery_id":193652,"poster":{"id":698415,"username":"Feronen","slug":"feronen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493593320,"body":"So you expect artists to make your porn for you for free? Who's the bigger Jew?"},{"id":115891,"gallery_id":193652,"poster":{"id":42403,"username":"PeasantX","slug":"peasantx","avatar_url":"avatars/42403.png?_=4689dea0028fc35e","is_superuser":false,"is_staff":false},"post_date":1493589871,"body":"So many good authors are in jewcobs claws....makes me abit sad."}]