[{"id":1736596,"gallery_id":193782,"poster":{"id":2662689,"username":"fheika","slug":"fheika","avatar_url":"avatars/2662689.png?_=fe68594c18b2015f","is_superuser":false,"is_staff":false},"post_date":1620962595,"body":"This isn't really cheating is it? She was just his uncle's private whore, not his lover. Also compared to most men in these stories this guy has a lot of backbone, but he still handled getting his woman away from his uncle like a little bitch."},{"id":382287,"gallery_id":193782,"poster":{"id":1294660,"username":"ClockworkGod","slug":"clockworkgod","avatar_url":"avatars/1294660.png?_=d43bca3412a18875","is_superuser":false,"is_staff":false},"post_date":1520273856,"body":"more garbage, so many wastes of time. "},{"id":132349,"gallery_id":193782,"poster":{"id":983834,"username":"Yato.abcdefg","slug":"yato-abcdefg","avatar_url":"avatars/983834.png","is_superuser":false,"is_staff":false},"post_date":1498121114,"body":"I only got 1 word fuck that uncle he can go to hell"},{"id":116611,"gallery_id":193782,"poster":{"id":34199,"username":"NullHorizon","slug":"nullhorizon","avatar_url":"avatars/34199.png","is_superuser":false,"is_staff":false},"post_date":1493765350,"body":"@frak111: Ah, don't misunderstand me, I wasn't saying either of the two concepts applied to this doujin directly; rather, I was expressing that the general scenario could be a useful reference for illustrating the differences between the mentioned genres, when considered from various perspectives. That said, strictly speaking, netori and netorare aren't defined by lust, although that is the aspect most often capitalized upon by authors of the genres. However the manner the victim's lover is stolen, whether romantically, physically, or otherwise, it falls within the scope of the genre, the only variable is the perspective of the protagonist in the story."},{"id":116562,"gallery_id":193782,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1493751768,"body":"@NullHorizon - Sounds like a decent and upstanding family. XD"},{"id":116523,"gallery_id":193782,"poster":{"id":696384,"username":"frak111","slug":"frak111","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493739707,"body":"@NullHorizon - Yeah, but in the case, she genuinely seemed to fall for the guy romantically (the guy also wanted her because he loved her) and didn't just fall to the lust like NTR does. Plus, even though uncle \"cared\" for the idol girl, it was already an open relationship because he was married so I don't even consider it cheating."},{"id":116517,"gallery_id":193782,"poster":{"id":1007889,"username":"jujubes","slug":"jujubes","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1493738976,"body":"Man, you ruin my tequila.\n"},{"id":116496,"gallery_id":193782,"poster":{"id":34199,"username":"NullHorizon","slug":"nullhorizon","avatar_url":"avatars/34199.png","is_superuser":false,"is_staff":false},"post_date":1493733778,"body":"This could actually be utilized as a highly functional reference source for education on the differences between \"cheating,\" \"netori,\" and \"netorare.\" Strictly speaking, the latter two don't apply here; however, if one considers the implications made in the dialogue, the context changes significantly. For example, when Mikoto refers to herself as \"[the protagonist's] uncle's mistress\"  the implication is that the uncle has a wife to whom he is being unfaithful. Furthermore, the fact the protagonist was \"beaten by [his] uncle\" after her pregnancy became apparent, it is implied that the uncle had some manner of genuine attachment to his mistress. Therefore, in this context, there are elements of basic cheating (i.e., the uncle cheating on his wife with his mistress, and the mistress cheating on the uncle with the protagonist) netori (i.e., the protagonist stealing his uncle's mistress from him) and netorare (i.e., the uncle having his mistress stolen from him) as well. *text limits* DX"},{"id":116475,"gallery_id":193782,"poster":{"id":204606,"username":"Junko Affairs","slug":"junko-affairs","avatar_url":"avatars/204606.png","is_superuser":false,"is_staff":false},"post_date":1493727617,"body":"Nobody cares about your dorky persona controller faggot. I bet even your parents bully you."},{"id":116471,"gallery_id":193782,"poster":{"id":1105273,"username":"shaad","slug":"shaad","avatar_url":"avatars/1105273.png","is_superuser":false,"is_staff":false},"post_date":1493726951,"body":"Good but short"}]