[{"id":1941950,"gallery_id":193814,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1628842900,"body":"The answer is 5"},{"id":1941642,"gallery_id":193814,"poster":{"id":2667952,"username":"CDB","slug":"cdb","avatar_url":"avatars/2667952.png?_=0150b8fd618e0236","is_superuser":false,"is_staff":false},"post_date":1628832155,"body":"I swear the formatting of the nhentai comment system is so messed up. Between letters there can only be one space and all tabs or new lines are omitted. Anyways I’ve put a formatted proof on paste in for anyone who wants a better or easier read of the proof. ==&gt; https://pastebin (.) com/AWAEyfWX &lt;=="},{"id":1941637,"gallery_id":193814,"poster":{"id":2667952,"username":"CDB","slug":"cdb","avatar_url":"avatars/2667952.png?_=0150b8fd618e0236","is_superuser":false,"is_staff":false},"post_date":1628831858,"body":"@utaysidun, well done!  This problem took me a while as well, with me originally misreading the second winning condition and going down a rabbit hole lol. On another note, it isn’t really proof by contradiction either, and as far as I know, this is likely the only proof to the problem as well.\n\nLet me see my take on this.\n=================\nWe are given three pieces of information on rules and others:\n   1-1. If a slave sees two green gags, she will win.\n   1-2. If a slave can rationally deduce her gag color as pink without guessing, she wins.\n   1-3. All gags are pink. \n   1-4. Information cannot be exchanged between the three slaves."},{"id":1941633,"gallery_id":193814,"poster":{"id":2667952,"username":"CDB","slug":"cdb","avatar_url":"avatars/2667952.png?_=0150b8fd618e0236","is_superuser":false,"is_staff":false},"post_date":1628831713,"body":"We will also assume the following conditions:\n   2-1. A gag can only either be pink or green.\n   2-2. All slaves have rational thought processes - which in the case of this doujinshi and author, they probably do, as I don’t think the author really mindbreaks their characters such that rational thought process is removed.\n   2-3. The glass is not tampered with in any way, and is objectively transparent, showing the true color of the other slaves’ gags.\n\nWe know that one slave will truly and rationally reduce the fact that her gag color is pink, and we are tasked with finding how she does this."},{"id":1941629,"gallery_id":193814,"poster":{"id":2667952,"username":"CDB","slug":"cdb","avatar_url":"avatars/2667952.png?_=0150b8fd618e0236","is_superuser":false,"is_staff":false},"post_date":1628831578,"body":"Proof: \n   Denote the three slaves to be A, B, and C. Let us assume that A will be the one that successfully deduces the fact that her gag color is pink. \n\n   In this situation, A knows that her gag is either green or pink, while A sees two pink gags on B and C, respectively. From B’s viewpoint, B will also recognize the fact that A and C have pink gags, and as per usual, B knows that her gag is either pink or green; the same situation with C."},{"id":1941624,"gallery_id":193814,"poster":{"id":2667952,"username":"CDB","slug":"cdb","avatar_url":"avatars/2667952.png?_=0150b8fd618e0236","is_superuser":false,"is_staff":false},"post_date":1628831450,"body":"   A will first assume that her gag is green. Call this assumption X. If X is true, then B sees one green gag and one pink gag. \n\n   B knows that her gag is either pink or green, and will also assume that her gag is green. Let us denote this to be assumption Y. If Y is true, then C will see two green gags, “Mmph” out as utaysidun humorously mentioned, and win as per rule 1-1. \n\n   However, C does not “Mmph” out, which means Y must be false, and B’s gag is pink. If B has rationally deduced her gag is pink, she will “Mmph” out and win as per rule 1-2, but A does not see that(since both A and C’s gags are pink as per 1-3).\n\n   This must mean that X is false, and B does not see one green gag and pink gag. Since X is false, and A’s gag is not green, then it must mean that A’s gag is pink. Knowing this, she will “Mmph” out, win, and gets released. ■QED"},{"id":1325103,"gallery_id":193814,"poster":{"id":3467764,"username":"notoofmatoes","slug":"notoofmatoes","avatar_url":"avatars/3467764.png?_=8f501d5a9be1d1f6","is_superuser":false,"is_staff":false},"post_date":1604899756,"body":"Thank you drinkwater discord  very cool"},{"id":709461,"gallery_id":193814,"poster":{"id":1333792,"username":"Dreamslayer","slug":"dreamslayer","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1539370907,"body":"Utaysidun, there is a far simpler explanation. The walls between them are colored glass. The gags are all pink, but because of the glass they appear green."},{"id":345884,"gallery_id":193814,"poster":{"id":1468484,"username":"Mashu Senpai","slug":"mashu-senpai","avatar_url":"avatars/1468484.png?_=7069bbbc84a83afc","is_superuser":false,"is_staff":false},"post_date":1515332233,"body":"So much yes"},{"id":345031,"gallery_id":193814,"poster":{"id":1200847,"username":"utaysidun","slug":"utaysidun","avatar_url":"avatars/1200847.png","is_superuser":false,"is_staff":false},"post_date":1515207311,"body":"I wish the formatting was better. I just delayed fapping to write this down."},{"id":345030,"gallery_id":193814,"poster":{"id":1200847,"username":"utaysidun","slug":"utaysidun","avatar_url":"avatars/1200847.png","is_superuser":false,"is_staff":false},"post_date":1515207179,"body":"It's not hard, assuming that a) The gag can only be pink or green, and all 3 know that, and b) it is certain that all 3 have an interest in being released and basic reasoning skills. If there is the slightest possibility that b) is false, the following proof has uncertainty attached, which might not fall under condition 2's requirement of \"can deduce\". Proof by contradiction:\n\n1. A thinks: Assume A's gag were green. Then the following would happen...\n2.1 B sees A's green and C's pink\n2.2 B thinks: Assuming B herself were green, then C would see 2 green ones and speak up (\"mmph\"-up) to win as per condition 1\n2.3 Since C does not speak up, the assumption in 2.2 must be false -&gt; B knows she is pink\n2.4 B would speak up to win as per condition 2\n3. A sees B NOT speaking up to win (2.4 doesn't happen) -&gt; contradiction -&gt; one of our assumptions was false.\n4. The only assumption made was (1.), so (1.) must be false -&gt; A knows she must be pink\n5. A speaks up to win as per condition 2.\n\nq.e.d."},{"id":315230,"gallery_id":193814,"poster":{"id":570951,"username":"Sirpaul","slug":"sirpaul","avatar_url":"avatars/570951.png?_=477edbb92e4f27bd","is_superuser":false,"is_staff":false},"post_date":1509048469,"body":"if the other 2 gags are pink, guessing that your own gag was pink too isnt hard."},{"id":117890,"gallery_id":193814,"poster":{"id":1124591,"username":"BallsOfMeat","slug":"ballsofmeat","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1494120647,"body":"This was fun to read"}]