[{"id":136550,"gallery_id":199473,"poster":{"id":141,"username":"ichigawa","slug":"ichigawa","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1499142888,"body":"@Troncol p37 was a concept cover for the original series (Koibito Gokko) that ended up not getting used (actually 34-37 are all concept from first series, 38-42 are previews from continuation series which should be out sometime around the end of the year).\n\nAs for the reuploads, I'm pretty sure there's some bot that reuploads every exhentai post every time it's updated, and this post on exhentai is updated pretty much weekly due to this whole particular series being a weekly blog the mangaka keeps to showcase what these characters are all doing. I agree that nhentai needs some sort of purge or way to update current posts instead of reposting literally every time exhentai gets an update. It's a bit frustrating that this gets an entire reupload for one fucking image.\n\nAs for the story, it's pretty much swinging with a bit of netorase (GF can't help but feel amazing from friend, but she loves her bf more than the friend; all the swapping play was instigated by the bf as well)."},{"id":135133,"gallery_id":199473,"poster":{"id":27598,"username":"Pekopa","slug":"pekopa","avatar_url":"avatars/27598.png","is_superuser":false,"is_staff":false},"post_date":1498802032,"body":"this is the 13th time"},{"id":134938,"gallery_id":199473,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1498760483,"body":"I don’t know how this site works but I think it is time for Nhentai to incorporate a purge system (replace the old version with the latest) unless is a different translation, language it doesn’t make sense to have 5+ post of the same title... About this story I think this swinging is about to turn sour or it already did but it is clear how this is going to pan out and page #37 is a clear indication that this is not \"pure\" swinging in the sense of not keeping secrets to your partner..."},{"id":134930,"gallery_id":199473,"poster":{"id":619446,"username":"nahmeh","slug":"nahmeh","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1498757617,"body":"this has been uploaded a dozen or so times now what the hell"}]