[{"id":1555163,"gallery_id":199501,"poster":{"id":1207517,"username":"KlonMasta","slug":"klonmasta","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612873975,"body":"This is confusing"},{"id":688830,"gallery_id":199501,"poster":{"id":1632481,"username":"TheNooblet","slug":"thenooblet","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1537110030,"body":"What's confusing here is,  Kyonyuu Fantasy 2  and Kyonyuu Fantasy 3 are 2 different MC !  and the Elves, Mermaid and other succubus u see here from page 39 to 43 are from Kyonyuu Fantasy 2, and it's kinda a prequel, it happen hundreds of years before Lute's story, and MC is named Ruin, having that 5 girls in here and Ruin looking awfully like Lute, made me confused.  Kyonyuu Fantasy 3 is also another MC who is a God falling to Mortal World."},{"id":688824,"gallery_id":199501,"poster":{"id":1632481,"username":"TheNooblet","slug":"thenooblet","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1537109627,"body":"btw as i was confused myself before, I explain this series sequels and stuff.    the Original game is  Kyonyuu Fantasy(6girl), about Lute Henge, there is 2 OVA made from this,  the sequel to this is, Kyonyuu Fantasy Gaiden, next Sequel is Kyonyuu Fantasy Gaiden 2, and the last one to Lute's story is Gaiden 2 After,  in total he will have 12 girl i think,  11 of which is from page 28 to 38 in here.  one of them in last game is not here.   not sure if all the girls will become his official wife but the first 6 will become Queen for sure,  there is a few side story and extra with all of them being pregnant and have baby too i think."},{"id":688786,"gallery_id":199501,"poster":{"id":1632481,"username":"TheNooblet","slug":"thenooblet","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1537107915,"body":"This is definitely my most favorite Visual Novel as well, the Story is so much fun and interesting, and MC is great :D smart handsome and funny. Hope Mangagamer can get enough support to translate all of series :D I hope it translate at least all of Lute's story."},{"id":321330,"gallery_id":199501,"poster":{"id":1235704,"username":"zelrio","slug":"zelrio","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1510368879,"body":"Great indeed. My all-time favorite visual novel. Not much of a game, as there are only three choices in the whole game or so, but it combined a decent story with tons of awesome vanilla paizuri. I couldn't ask for more."},{"id":149012,"gallery_id":199501,"poster":{"id":753887,"username":"NormanBates","slug":"normanbates","avatar_url":"avatars/753887.png?_=8dfc896e5bc2dfc7","is_superuser":false,"is_staff":false},"post_date":1501996262,"body":"Haha, this really needs English subtitles. This series is great!"}]