[{"id":149740,"gallery_id":201629,"poster":{"id":1144627,"username":"(SDA) Slut Detection Agent","slug":"sda-slut-detection-agent","avatar_url":"avatars/1144627.png","is_superuser":false,"is_staff":false},"post_date":1502150164,"body":"This is NTR, and those two mild are nice sluts to fuck"},{"id":148633,"gallery_id":201629,"poster":{"id":76058,"username":"mikelitoris","slug":"mikelitoris","avatar_url":"avatars/76058.png?_=65f9cc7a44c35610","is_superuser":false,"is_staff":false},"post_date":1501889967,"body":"Having some kind of philosophical debate on  a hentai site comment section y'all niggas are hella gay yo"},{"id":145615,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1501132511,"body":"@metroid Sadly, thats quite unlikely, where are you from?"},{"id":145414,"gallery_id":201629,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1501093422,"body":"I am still waiting for your real name  and that detailed location. I really want to meet you in real life."},{"id":145322,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1501079415,"body":"@metroid Once again, that doesn't answer my question. I'll try to put it in perspective: Live is harsh- we a are born with limited options, and usually we are what we can be and not what we want to be; yet in the internet we can just be whatever we want. We can mask genre, forget religion or whatever differences we have, chill with people everywhere. We can make some \"fake\" friends, even. Be a \"good\", decent version of ourselves. So I can only wonder, what kind of life could someone have in order to be like you- why would someone choose to be like that? Thinking about it, you don't even have to answer, just think- Is this the best you can be? And nah, I had asthma as a child, but otherwise I'm quite healthy, fellow. You seem to care too much for mothers... hope yours is fine. Maybe you're quite young?"},{"id":145303,"gallery_id":201629,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1501074626,"body":"Well I hope you get some type of incurable cancer and watch your mother die painfully and slowly from a serious illness before you die . I am not even joking here, I am saying this with all my serious and sincere wishes. Be sure to tell me if you get really cancer I want to know so I can help you. I like helping random people on the internet. So please  tell me your real name and where you live in detail. No insults here I seriously want to help  you, if you get cancer.\n"},{"id":145055,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1501029508,"body":"@metroid Question: do you feel better insulting random people on the internet? People who does that usually mirrors the way people treat them irl... were you bullied at school? perhaps at home? or are you just lonely? Your insults show a serious sexual fixation... hope its just you being childish and not a sign of something worst... I'm not even mocking you, its actually the opposite. Insult me all you want, but I just tried to talk with you. I'm starting to feel bad for you."},{"id":144959,"gallery_id":201629,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1501004974,"body":"Nah, it was your slut of a mother that wasted my time with her loose pussy.  Have a faggot day, faggot."},{"id":144950,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1501003761,"body":"Oh well, guess I just wasted my time. Have a good day, fellows."},{"id":144878,"gallery_id":201629,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1500989598,"body":"@Lecaster  Prince_Flower I see that you two faggots like sucking each other's dick, dont let me stop you lol."},{"id":144745,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500958491,"body":"@metroid And btw, thanks for the recommendation! the character designs aren't that great, but the story is interesting. About that: \nPart 1 Isn't tagged as NTR, but I say it should- The female protagonist isn't happy about her husband fucking the other girl, however the husband barely do anything important besides adding the concept of \"there's a husband\". It is tagged swinging, actually .\nPart 2 IS tagged as NTR, and that is correct. The female protagonist is feeling bad about being adulterous, so she wants to stops, BUT she changes her mind when she's shown how her husband happily keeps fucking the other girl (thus SHE is being ntr'ed- even the scene with her dying her hair is a representation of her leaving her husband emotionally) \nPart 3 Is not tagged ntr and it isn't, really. We know the husband exists, but he barely appears in one page at the end, and the phone messages show that he's aware about his wife's affairs and he just don't mind. This would be swinging."},{"id":144730,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500956962,"body":"@metroid btw, I quote you \"A faggot who thinks arguing about hentai on a porn site means a big deal or anybody gives a fuck about the validity of his argument\" yet, you comment in this site A LOT more than me, and seems to get all worked up about silly things... so, are you a faggot?\nAlso! I'm happy to see that at least you're learning from our previous conversation where I pointed you that cheating and netorare aren't equal. I'm happy for you!"},{"id":144724,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500956483,"body":"@metroid You should put more attention on what you read, or try to understand stuff better. I pointed on that the important thing about NTR is the feeling on pain/despair/excitement (or all them at the same time) on the PROTAGONIST who is losing a dear person (either physically or emotionally) And yeah, I say PROTAGONIST because if the person who is being cheated/cuckolded isn't a protagonist in the story, then that story IS NOT NETORARE (by protagonist I don't mean the one the story focus on/is having sex, I mean that the \"losing side\"should be important/relevant for the story) I don't know why you mention the \"sex=netorare\" thing, I never said that. There is usually a tag for \"swingers\", so whats your point? Its a different kind of situation (the couple is open to and enjoys sex that way, as opposed to netorare)"},{"id":144483,"gallery_id":201629,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1500907390,"body":"Also you are wrong about your protagonist assumption , in most ntr stories the protagonist is the person who got ntred from their husband, bf, son, etc., not the other way around. Oh and one more thing, mr. moron, fucking someone doesn't equal to stealing that person, as in the case here. Otherwise all cheating stories would be automatically ntr. A good example of this there are swinging type of hentai which are not labeled as ntr, even though the guy sees his wife/gf fucked right next to him."},{"id":144473,"gallery_id":201629,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1500906466,"body":"Hey cocksucker, keep sucking my cock while you read Kaika ~Ninenme no Aki  which has a very similar situation AND NOT LABELED AS NTR, ONLY CHEATING. You can keep talking shit all you want, I dont give a fuck. Oh and I rather be DUMB than be a FAGGOT like yourself. A faggot who thinks arguing about hentai on a porn site means a big deal or anybody gives a fuck about the validity of his argument. "},{"id":144429,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500897430,"body":"@metroid Sometimes the protagonist realizes the whole thing until the end, in which case ntr looks a lot like simple cheating, however in those cases, the whole situation ends without closure (the losing part is unable to stop the situation when he/she realizes it, and it seems that it will continue or its to late to rescue/take back his/her loved one) Hope this helps you to better understand the genre, my friend.\nBtw, pro tip- insulting someone ISN'T a valid argument or makes your point valid/invalidates someone else's point. It just makes you look dumb."},{"id":144428,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500897175,"body":"@metroid Actually, it is, oh hentai youngster. Allow me to educate you: NTR is about a situation, not a whole genre. If you want to put it simple, is similar to \"incest\" or \"cheating\"- its a situational tag; there can be just one instance on a story, and it is enough for the whole thing to count. NTR happens when someone dear/loved/important is being taken/stolen/soiled while the first person KNOWS or realizes it, yet is unable or unwilling to stop the situation(this is the most important difference with simple \"cheating\"- Netorare might include cheating, but not all cheating is netorare). All in all, netorare will focus on the feelings of three points of view- the person who is being stolen (wife/girlfriend/boyfriend/mom-its the same, the point is that its a truly important for the other protagonist) the person who is stealing, and the important part is, the one who suffers by the whole ordeal (the reader relates to this one by proxy, and gets angry/sad/etc with him/her)"},{"id":144014,"gallery_id":201629,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1500815490,"body":"@LeCaster You obviously dont know what ntr is so you might as well stop talking bullshit like the shit talker you are. There is no such thing as \"it's ntr for one scene\" you moron.\n"},{"id":143969,"gallery_id":201629,"poster":{"id":181159,"username":"LeCaster","slug":"lecaster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500803397,"body":"@metroid Good day sir, and yes it is, if even just the first scene."},{"id":143957,"gallery_id":201629,"poster":{"id":593858,"username":"Manslayer","slug":"manslayer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500798502,"body":"Everything was set up by Souta and Kaho, they knew the both of them were mother and son from the very beginning. In the end it's revealed that Souta and Kaho are mother and son as well."},{"id":143866,"gallery_id":201629,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1500780565,"body":"This aint ntr."},{"id":143544,"gallery_id":201629,"poster":{"id":40471,"username":"boboxxx86","slug":"boboxxx86","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500707754,"body":"yes, I have waited for this\n"},{"id":143538,"gallery_id":201629,"poster":{"id":1121304,"username":"happiestsandy","slug":"happiestsandy","avatar_url":"avatars/1121304.png","is_superuser":false,"is_staff":false},"post_date":1500707111,"body":"Waiting for the English version"}]