[{"id":146951,"gallery_id":202395,"poster":{"id":882062,"username":"robothentai","slug":"robothentai","avatar_url":"avatars/882062.png","is_superuser":false,"is_staff":false},"post_date":1501466363,"body":"Holy moly  this is great, cant wait to see next part"},{"id":146859,"gallery_id":202395,"poster":{"id":627456,"username":"jhr66525","slug":"jhr66525","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1501445942,"body":"I like this author. So glad he's being translated."},{"id":146631,"gallery_id":202395,"poster":{"id":1242928,"username":"Eeliejun","slug":"eeliejun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1501387851,"body":"@Herzer It is not really offended by it but it is alway sad to see the credit page removed. ^^ And is it because we are a bit confused why there are complaints by some people. The resolution we use is picked to make it fit on all screens because some sites don't re size it. I get how a bigger resolution can make it look better but I would find it great if you can explain it in a bit more detail to me. True but if you contacted I would have been happy to provide you with the PSD to make your life simpler. But why change the font to only one font? It is a bit big in my opinion.  But anyway if you ever want to join a team would like the have you we really need more typesetters XD Just ask next time and if you edit it also credit the cleaner. "},{"id":146615,"gallery_id":202395,"poster":{"id":1292,"username":"Herzer","slug":"herzer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1501385444,"body":"@Shameless scans\n\nApologies if you got offended, but your release is way too small in resolution. \nIt was hard for me to enjoy reading it, so I went and used shanko's higher res version.\n\nAnd I did the edit from scratch. I didn't have the script nor the PSDs from your version nor will I use the same font.\nAs for the errors, that's my mistake."},{"id":146599,"gallery_id":202395,"poster":{"id":1242928,"username":"Eeliejun","slug":"eeliejun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1501378529,"body":"@Herzer if you ever see this I just want to ask why? This is not a re-edit it is just all the same fonts you changed page 7 with the bubble so the art does not cover it and don't know why... Also on some pages, you skipped a font to change and on page 27 you messed up a bubble. Also removing the credit page is low because you only credited to Translator but not the cleaner... But I still want to thank you for the interested in the manga."}]