[{"id":856419,"gallery_id":202721,"poster":{"id":2223427,"username":"Cobaltzero","slug":"cobaltzero","avatar_url":"avatars/2223427.png","is_superuser":false,"is_staff":false},"post_date":1553588297,"body":"Fate/stay night = Eroge\nFate/stay night Realta Nua = sanitized all ages version.\nSome scenes are better in the Realta Nua version though. And I think \"Sparks Liner High\" might be an exclusive endind to Realta Nua."},{"id":355443,"gallery_id":202721,"poster":{"id":1135040,"username":"Hina33","slug":"hina33","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1516847784,"body":"As someone that has played the non-Realta Nua version of Fate/Stay Night I can confirm that there are several sex scenes. They are a total trainwreck. The art isn't bad though.\n\nFor those interested: The Fate route has the infamous Shirou/Saber/Rin threesome and a random Shirou/Saber scene, the Unlimited Blade Works route only has a single Shirou/Rin scene near the end, and Heaven's Feel has a Shirou/Rin scene that is just a dream and two Shirou/Sakura scenes (I think there might have even been three). Heaven's Feel is by far the worst since the scenes show up early on instead of only at the end and it likes to randomly show some of the images from the sex scenes so it's hell to try and Let's Play."},{"id":178095,"gallery_id":202721,"poster":{"id":319491,"username":"erihan","slug":"erihan","avatar_url":"avatars/319491.png?_=189939b8b98c3c54","is_superuser":false,"is_staff":false},"post_date":1506314599,"body":"\"Not even one bit of erotic scenes\" you really believe that? The original was h, just like tsukihime, of course the psp and ps2 versions were censored"},{"id":160690,"gallery_id":202721,"poster":{"id":674329,"username":"southornorth","slug":"southornorth","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1504463928,"body":"obviously a misleading information. Fate/Stay Night is purely a Visual Novel, not even one bit of erotic scenes is inside. Heck, it's closer to a Young Adult Novel than an eroge. Indeed in Realta Nua edition on ps2 console, there's written narrative of such erotica, but never a graphical one. Check out Tsukihime also, if you've played and  like F/SN."},{"id":148130,"gallery_id":202721,"poster":{"id":1014614,"username":"iwannaeatdeliciousfood","slug":"iwannaeatdeliciousfood","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1501722405,"body":"Fate/Stay Night IS originally an eroge... though it has less H-scenes than most. This one's well made, with more H than the VN, and retains some of the quality of Fate/Stay Night as well."}]