[{"id":326859,"gallery_id":205008,"poster":{"id":1441928,"username":"MirrorSaturn","slug":"mirrorsaturn","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1511513757,"body":"The artist's comment suggested that the Kidadmiral is another character altogether, and that the Admiral knew that Shigure did the deed with the kid. Could have been lost in translation, but there is also another problem: Shigure wasn't that physical that early. Some of their first interactions suggested she only recently made a move on him. There was nothing suggesting a relationship yet until she took it further than just sharing a bed with him."},{"id":326266,"gallery_id":205008,"poster":{"id":217714,"username":"Argetuon","slug":"argetuon","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1511398854,"body":"If you look at the previous works, its actually the same admiral, so this is kinda a flashback in a sense and the guy in pg11 is just another admiral talking to her, plus her admiral is right there on the same page as well. So no it is not cheating or netorare. All this does is show how long they've been together, till death do them part."},{"id":325587,"gallery_id":205008,"poster":{"id":1441928,"username":"MirrorSaturn","slug":"mirrorsaturn","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1511254267,"body":"It's heavily, *heavily* implied Shigure is cheating on the Admiral with a kid, and he's OK with it. Both this and the Chinese versions should have netorare and cheating as tags.\n\nShota and female yandere is super rare, but the setup here sucks. She breaks her original Admiral's legs and nearly gets him killed...only to cheat on him after handicapping him. That is rough..."},{"id":155045,"gallery_id":205008,"poster":{"id":990635,"username":"Sine","slug":"sine","avatar_url":"avatars/990635.png","is_superuser":false,"is_staff":false},"post_date":1503226387,"body":"Oh, I was waiting for this!"}]