[{"id":2652337,"gallery_id":209494,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658266406,"body":"Wish I could understand the plot though! Like the Nishizumi \"Girls urd Panzer\" example, kind of funny how that ended with ehr abandoning her husband's, daughters and old life to slut around a bitch with her rapists till they dumped her ass and her only worry was finding new cocks to suck! Becoming the female version of that perverted middle age man who hangs around the entrance the strippers of a club use to go in and out hoping he'll get lucky for a pity fuck! Hell she only remembers her wedding ring if only to pawn it off for food money! So the end is suppose to be from the slut's POV that it will all work out for her, when your senses know they won't (especially if NTR Logic kicks in and it still ends with her getting abandoned, no Fairy Tale Evil Win's ending, she's doomed to suffer Saki's fate from \"METAMORPHOSIS\" and like a good horror, no need to show you it too much, just imply as it figures you've SEE stories like METAMORPHOSIS to know how it will end for the dumb heroines!)"},{"id":2652330,"gallery_id":209494,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658266054,"body":"I'm sure in her mind now as this is the classic, \"GF goes to beach, acts stupid and guard down and gets raped into a beach gyaru slut\" she sees him as a cock and nothing more! Having sex for \"ole time sake\" as she broke up with him in her heart as why stay loyal to one when you can have many! Of course the joke like the Girls und Panzer one of the same trope is eventually she's going to run dry on cocks to satisfy her (and EX isn't going to stay single forever, eventually he's going to find him a sweet virgin that SHE use to be with his looks and then dump her! Seriously bright idea she picked for herself! Being nothing more then SEX PRACTISE and likely to him that \"he should just push the issue, since she showed he failed her test by not forcing the issue, she was stupid enough to take drinks from shady men, then go nympho after getting raped that she slutted around on purpose to get more! Plus best distance before she baby traps him when she finally gets unlucky and get preggy)"},{"id":2652318,"gallery_id":209494,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658265769,"body":"Got to love the GF who has her \"scared of sex\" shield up for BF...and then becomes a dunce around shady looking men and willingly takes a drink from him! Hell it looks like BF wasn't even aware she returned so she was slutting around then remembered he existed only when he approached! Feels like she only had sex with him in the typical \"might as well\" and was surprised despite being a virgin, he still satisfied her (Bitch needs to know her place! She's been a slut for a week! She's no sex expert yet!) I like to figure at the end he decided to just break up with her and use her in a \"sex friend manner!\" I mean she has no self-respect anymore and likely quietly broke up with him! Why not use her as she wants to be used, \"practice for when he finds himself a new virgin GF to replace her!) I doubt she minds and sees him as just a cock that lives nearby and is close that can satisfy her when she needs a quickie! So he ain't wrong (as she has no self respect for herself with her looks)"}]