[{"id":512701,"gallery_id":209684,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1526550446,"body":"@diu613 its probably one of those western porn setting where a woman orders a pizza then the delivery guy gets a free pass for fucking her"},{"id":307395,"gallery_id":209684,"poster":{"id":1378854,"username":"diu613","slug":"diu613","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1507408935,"body":"basically from what I have understood so far, the argument started from her bf wanting her to quit the band cos he is not playing guitar anymore, says how girl is amazing that she attracts everyone in, even the famous producer (ntr guy), he says that he just cant compete with such guy even in terms of manliness (sex), there was a scene when the couple had sex the boy asked if she had cum, but she said no... Moreover, the boy has promised/ said to her after sex that he will always be here home, and after the argument he told her to get out, hence she is staying at the producer's room cos she thinks there is no longer a home for her to return and calls her boyfriend a liar. \n\nWhat I dont underststand is how the sex escalated so sudddenly... Like we see her buying food from the store, then when she returns its just sex... wtf ? "},{"id":304009,"gallery_id":209684,"poster":{"id":611054,"username":"Esdeathtatsumi","slug":"esdeathtatsumi","avatar_url":"avatars/611054.png","is_superuser":false,"is_staff":false},"post_date":1506724238,"body":"On page 12 shows that girl expected a call and it was certain of her boyfriend to apologize and be reconciled. We see on page 13 the girl thinking about her boyfriend. She hoped he would try to reconcile with her because she thinks he still loves her . The girl tried to use sex to forget her boyfriend."},{"id":303914,"gallery_id":209684,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1506703152,"body":"I find it hard to believe she broke up with him after slapping him just because he didn't call her . Lets wait for translation"},{"id":303823,"gallery_id":209684,"poster":{"id":611054,"username":"Esdeathtatsumi","slug":"esdeathtatsumi","avatar_url":"avatars/611054.png","is_superuser":false,"is_staff":false},"post_date":1506666780,"body":"The girl was expecting a call from her boyfriend, but after one day he just no called, she accepted the man's advances.\nMashiraga Aki has more realistic hentai. The best of them are the Matsuri trilogy, which no matter how much the girl has sex, she continues to love another guy and in the end comes back to him and Musa.\nLacked a epilogue in the story to clarify the end of the story and what happened after the boyfriend found girl. If this hentai follows the logic of Matsuri and Musa, the girl may have tried to use sex to forget her problems, but she continues to love the other guy."},{"id":303708,"gallery_id":209684,"poster":{"id":1053071,"username":"iizuka","slug":"iizuka","avatar_url":"avatars/1053071.png","is_superuser":false,"is_staff":false},"post_date":1506637757,"body":"Dat NTR...."},{"id":245432,"gallery_id":209684,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1506535991,"body":"So the guy not only got ntred but also got beaten up.  I wonder why the bitch slapped him in the first place and ran to the arms of the other guy right after. "},{"id":233731,"gallery_id":209684,"poster":{"id":52357,"username":"Pegasus80","slug":"pegasus80","avatar_url":"avatars/52357.png","is_superuser":false,"is_staff":false},"post_date":1506486585,"body":"Mas que ntr, me sonó a chica despechada y enojada con su novio, igualmente buena historia."},{"id":233661,"gallery_id":209684,"poster":{"id":864457,"username":"NTrawr","slug":"ntrawr","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1506486465,"body":"Typical ntr. Tbh.  Its great but, seeing a guy taking advantage to a broken hearted girl..... ive seen so many of those."},{"id":232163,"gallery_id":209684,"poster":{"id":995971,"username":"InmortalLucia","slug":"inmortallucia","avatar_url":"avatars/995971.png","is_superuser":false,"is_staff":false},"post_date":1506484427,"body":"How is this ntr? It doesn't feels right, maybe this is a different kind of ntr"}]