[{"id":750332,"gallery_id":209965,"poster":{"id":807099,"username":"Lord Jashin","slug":"lord-jashin","avatar_url":"avatars/807099.png","is_superuser":false,"is_staff":false},"post_date":1544082380,"body":"thanks for the summary fakkuzabancho, I've been searching for a conclusion for a bit. cheers"},{"id":351702,"gallery_id":209965,"poster":{"id":1404193,"username":"fakkuzabancho","slug":"fakkuzabancho","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1516231411,"body":"\nShe basically rejected him, saying that because she loved him so much, so much that she wanted him to leave him with only the good memories. Because afterall, first love are painful like that. Auntie then returned to her her bank book, that she left to her in the past because she said she couldnt handle finances. Only to return when she opens her flower shop. Auntie made a comment about how she should've just gobbled it up, grumble grumble. Auntie asked if she really forgot, and she said she really did. MC then said, just like that, he finished his confession, and although it didnt end like how he wanted it to, it was still a happy resolution. While in melancholy, female coworker stumbles (runs) into him, asking if he is attached. He says, ah no, and then out no where she proposed to him. Her friend comes and knocks her away and tells MC that he is drunk. A day later he teases her when she asked him to sign some documents."},{"id":351699,"gallery_id":209965,"poster":{"id":1404193,"username":"fakkuzabancho","slug":"fakkuzabancho","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1516231191,"body":"FMC's friend delivered some flowers, the patient (FMC's mother) asks her \"Hey miss, what's that over there?\" She replied that it's Pansy flowers, because it's in season. Someone asked her to deliver it here.\n\n\nFMC's mother mumbles Pansy, Pansy... Blooming both bright red and beautiful, I think my daughter would love it too.\n\n\nFMC's friend replies Yeah, I think so too.\n\n\n\nAn apparent time skip later, MC is talking through the phone to his apparent new GF now, which was the abrupt proposal girl. Apparently over some grocery and strawberry. MC sees illusion of FMC overlap with a girl wearing his old school's female uniform. New GF asks if he is listening, then he replies \"Ah yeah I am listening..\"\n\n\nFinal few boxes basically says \"And thus... Just like that... We went on living our lives...\"\n\n\n\nIMO pretty good, bittersweet end. Living our lives is a pretty nice way to put it given that FMC tried to kill herself the previous chapter.\n\nOh yeah, MC also proposed to her the previous chapter. "},{"id":308270,"gallery_id":209965,"poster":{"id":606736,"username":"SleeplessPrince","slug":"sleeplessprince","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1507574425,"body":"When is the english comming?"}]