[{"id":1860827,"gallery_id":210025,"poster":{"id":4506172,"username":"Apapapa","slug":"apapapa","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625833864,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":342225,"gallery_id":210025,"poster":{"id":86323,"username":"lightsoul","slug":"lightsoul","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1514749721,"body":"the hell is this lame shit...?"},{"id":305950,"gallery_id":210025,"poster":{"id":906908,"username":"tatsumakii","slug":"tatsumakii","avatar_url":"avatars/906908.png","is_superuser":false,"is_staff":false},"post_date":1507091704,"body":"↓↓↓ Actually, that's really fucking homo."},{"id":304761,"gallery_id":210025,"poster":{"id":41629,"username":"ninjinchan","slug":"ninjinchan","avatar_url":"avatars/41629.png?_=7d4791707416b330","is_superuser":false,"is_staff":false},"post_date":1506883353,"body":"LAME! I came here hoping the lil faggot would get fucked in the ass by his buddies while his dick flopped around, no homo."},{"id":304393,"gallery_id":210025,"poster":{"id":894259,"username":"Kirbin all day","slug":"kirbin-all-day","avatar_url":"avatars/894259.png","is_superuser":false,"is_staff":false},"post_date":1506806125,"body":"Thanks genjihope, I could get an idea of whats going on now. But seriously they should burn that bikini."},{"id":304297,"gallery_id":210025,"poster":{"id":905306,"username":"genjihope","slug":"genjihope","avatar_url":"avatars/905306.png","is_superuser":false,"is_staff":false},"post_date":1506788783,"body":"I translate little it for u guys and never minds does master that bikini or bra is Magical.... Groups tsf no f Always do Gender bender Magic or Potion Drugs.... There another story similar to this here. https://jumboshirmp.deviantart.com/art/The-Magic-Bra-Chapter-1-A-TG-Story-544663168"},{"id":304282,"gallery_id":210025,"poster":{"id":1132728,"username":"Miku B","slug":"miku-b","avatar_url":"avatars/1132728.png?_=429a457d03f2f8ba","is_superuser":false,"is_staff":false},"post_date":1506786615,"body":"@genjihope isn't it a bikini not a bra??"},{"id":304272,"gallery_id":210025,"poster":{"id":905306,"username":"genjihope","slug":"genjihope","avatar_url":"avatars/905306.png","is_superuser":false,"is_staff":false},"post_date":1506784134,"body":"Those guys Not knowing This is magical bra Turn u Real Girl and Change your  reality views History Very Dangerous.... Bastard Glasses Guy very Lucky make easy get girlfriend very fast with no hard work, I Sorry Main guy If they not Bully him Put  Magical bra he might not Turn into Woman.\n"},{"id":304267,"gallery_id":210025,"poster":{"id":905306,"username":"genjihope","slug":"genjihope","avatar_url":"avatars/905306.png","is_superuser":false,"is_staff":false},"post_date":1506783400,"body":"jist of the story, the macho guy of the group find the bra, dares geek (Satoshi) to wear it, he wimps out. They play rock paper sisors (something similar) to see who has to wear for the day. macho (Subaru is his name) looses, and wears the bra. He's home and sees the burns, and the parts that aren't. Goes back to the beach and is embarrassed because his friends see him. So he puts the bra back on (because this will make it better somehow). Geek asks what is he thinking, and he tells him he's embarrassed and this is for the best. He goes along with it. The day after he is leaving home, in the bra, his mom stops him (her at this point but flat chested). Clearly its a magical bra changing the views of those around you. Her mom just says to take some sunscreen, incase the sun is strong, she wouldn't want burns and blemishes on her skin. Goes to the beach but is more subdued. Geek asks his friends if he thinks that Subaru became cuter. they make fun at him liking her. And let her know. Geek"},{"id":304266,"gallery_id":210025,"poster":{"id":1102471,"username":"Sizar","slug":"sizar","avatar_url":"avatars/1102471.png","is_superuser":false,"is_staff":false},"post_date":1506783230,"body":"Haha funny "}]