[{"id":1620861,"gallery_id":214355,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1615847300,"body":"I like to imagine that she never returns to the business and he forgives her, but she’s gotta deal with some consequences. That’s the problem with a lot of these stories, the authors aren’t willing to have consequences. Plus the final resolution was 2 pages only 177-178, felt anticlimactic after 2 volumes. She gets off scot free."},{"id":1620853,"gallery_id":214355,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1615846915,"body":"I’m a little conflicted. And I think Manaka is too. She wants to be only with her husband and she’s also feeling pleasure from being a prostitute (obviously hentai logic). I think she should have come clean to him, and begged his forgiveness. I kind of get the feeling if she made him understand it was for the money, he’d forgive her. Housewives Becoming prostitutes to pay debts is a thing. And once those debts are paid, they quietly return back to normal life. They use an assumed name while they are in the business. Manaka isn’t."},{"id":1512797,"gallery_id":214355,"poster":{"id":3506316,"username":"Mr_spy","slug":"mr_spy","avatar_url":"avatars/3506316.png?_=b51a956f1e048aca","is_superuser":false,"is_staff":false},"post_date":1611043895,"body":"I need the uncensored one"},{"id":1472669,"gallery_id":214355,"poster":{"id":1326768,"username":"Eliot201","slug":"eliot201","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610107346,"body":"That was nice but she definitely had feelings for the boss's son"},{"id":1201534,"gallery_id":214355,"poster":{"id":2302446,"username":"cottonm","slug":"cottonm","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599676648,"body":"Fuck this bitch"},{"id":1156573,"gallery_id":214355,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1597822012,"body":"This story's ending has always annoyed me. Especially with Manaka considering the gangbang to be a \"punishment.\" A real punishment would be Youichi finding out and dumping her cheating ass. Also, she did it with all of those guys for months multiple times and none of them ever got jealous enough to try and steal her from her actual husband? Especially the younger brother of the pretend husband? Fuck outta here with that shit. "},{"id":636035,"gallery_id":214355,"poster":{"id":676846,"username":"dragonx90","slug":"dragonx90","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1533501737,"body":"Manaka one my favorite hentai girls, she's loyal to her husband and her lust"},{"id":515681,"gallery_id":214355,"poster":{"id":1606010,"username":"Black2v","slug":"black2v","avatar_url":"avatars/1606010.png","is_superuser":false,"is_staff":false},"post_date":1526869900,"body":"I dont know how should i feel about this. Its just adultery. Like a matture reverse harem shoujo manga with many h scenes in it.. "},{"id":360591,"gallery_id":214355,"poster":{"id":793363,"username":"amychu","slug":"amychu","avatar_url":"avatars/793363.png?_=7172200c9c1bcc02","is_superuser":false,"is_staff":false},"post_date":1517671001,"body":"i kinda feel bad for seiryuu cause man HE HAD IT IN HIM. but anyhow im just happy that it ended well. but my seiryuu...\ni mean, i like this kind of guy who  looks calm but had it in him lol. if anyone knows some good stuff please @ me x"},{"id":326116,"gallery_id":214355,"poster":{"id":1130225,"username":"summerjam06","slug":"summerjam06","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1511365922,"body":"@ykid999 Saigado has a habit of letting ungrateful cheating sluts go without punishment. At least Manaka does it for the money, you should go see the one in a doujin called \"Hitozuma Audrey-san no Himitsu\" (one of the most irritating \"cheating-housewife\" doujins out there) where the bitch is married, and yet she fucks three younger guys despite the fact that the first guy raped her the first time they had sex, the second guy blackmailed her into it, and the third guy kinda raped her as well, yet she somehow starts loving them in some weird fucked-up way and continues dating/meeting with them on various occasions (Vol.1 : https://nhentai.net/g/86302/   -   Vol.2 : https://nhentai.net/g/205276/)"},{"id":325464,"gallery_id":214355,"poster":{"id":864892,"username":"ykid999","slug":"ykid999","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1511233998,"body":"I hate hentai some times. I mean this slut gets a happy ending but Saki Yoshida (Super sad but good read https://nhentai.net/g/177013/) OD's in a bathroom, man fuck this. I know different authors but still the way the story is written makes it seem like we're supposed to sympathize with Manaka. In EMERGENCE, I sympathized with Saki because she was a naïve girl who was desperate for friends and willing to do anything to change that. Here Manaka looks like a cheating bitch who was just bored, her main reasons for taking the job was that she was still young. The only way this should have ended was with the pimp girl getting caught and arrested along with the rest of the girls, the husband finding out and leavening Manaka, and finally Manaka hanging herself. I hope there's a part three or an extra where that happens. I would rather have a poorly written story or no story then a horrible story like this one."},{"id":323534,"gallery_id":214355,"poster":{"id":75307,"username":"SirPrise","slug":"sirprise","avatar_url":"avatars/75307.png?_=2250eae0b437afe2","is_superuser":false,"is_staff":false},"post_date":1510813016,"body":"I'm so glad it ended with a happy ending.."},{"id":323405,"gallery_id":214355,"poster":{"id":627456,"username":"jhr66525","slug":"jhr66525","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1510786289,"body":"This series made my dick cry so much. It was crying all over the place. It cried on a towel. It cried on a sock. It cried so much.....and I didn't give a fck. One of my new favorites. "},{"id":323400,"gallery_id":214355,"poster":{"id":1341823,"username":"Meow_5645","slug":"meow_5645","avatar_url":"avatars/1341823.png?_=6575cff4c5c747b3","is_superuser":false,"is_staff":false},"post_date":1510785634,"body":"At last...This series is over\n"},{"id":323064,"gallery_id":214355,"poster":{"id":1349767,"username":"aobutt","slug":"aobutt","avatar_url":"avatars/1349767.png?_=b1ffece2cad88754","is_superuser":false,"is_staff":false},"post_date":1510717640,"body":"You gatta note that Japan's meaning of \"chubby\" is being over like 122lbs. Its insane, but its true. Standards of beauty is very different in Asia. White fair skin, extremely thin, oval shaped faces. Especially in South Korea, good lord the standards of beauty is crazy over there. Its just a different standard from the west. Very over the top, but its their standard."},{"id":323008,"gallery_id":214355,"poster":{"id":1276484,"username":"I-it's not like I like you....","slug":"i-it-s-not-like-i-like-you","avatar_url":"avatars/1276484.png","is_superuser":false,"is_staff":false},"post_date":1510707751,"body":"@hahonryuu\nHe probably meant that she was fucking thicc"},{"id":322995,"gallery_id":214355,"poster":{"id":1176,"username":"hahonryuu","slug":"hahonryuu","avatar_url":"avatars/1176.png","is_superuser":false,"is_staff":false},"post_date":1510704580,"body":"page 164, bottom left panel...THAT'S what he considered chubby 0_o. I mean, she isn't a super model, but she's so ridiculously far away from being \"chubby\" that it's ridiculous. would an actual chubby person be morbidly obese to him?"},{"id":322980,"gallery_id":214355,"poster":{"id":574170,"username":"lotrus28","slug":"lotrus28","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1510703270,"body":"Aghh... I'm not sure how to feel bout the ending.\nThe pimp lady is still on the loose extorting money, but Manaka can now get on with her life. "}]