[{"id":570414,"gallery_id":214438,"poster":{"id":1298583,"username":"massiveloser","slug":"massiveloser","avatar_url":"avatars/1298583.png","is_superuser":false,"is_staff":false},"post_date":1531366530,"body":"yo wtf ive been wanting this story for so long now i wish i didnt know so sad 1000 like "},{"id":566621,"gallery_id":214438,"poster":{"id":1233210,"username":"Aoi Hikari","slug":"aoi-hikari","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530900251,"body":"Part 3.\nShe is a robot after all, she doesn't have any desires of her own, she exists to follow master's orders.\nI'm worried that those questions the new master keeps asking her at the end mean he'll eventually end up like the old master.\nBut I hope that last \"ah, so\" line means he understands her nature as a robot and will use her accordingly. The page with her happily giving hearts placed after that seem to imply everything will be great for them.\n\nI also want to say I've enjoyed this story a lot. I've always liked such angelic characters for whom giving is as natural as breathing and they can't even think of taking. That's like the purest love for the entire world, right? Can't help but admire it."},{"id":566618,"gallery_id":214438,"poster":{"id":1233210,"username":"Aoi Hikari","slug":"aoi-hikari","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530899824,"body":"Part 2.\nThe new Master treats Rin as a toy she is, using her for sex. The text doesn't seem to mention why she goes to school, but I can only assume it is heraster's order. And then there are some guys to whom he owes money or something (I didn't bother to translate their dialogue as there doesn't seem to be any lines for Rin safe for moans). And he lets them fuck Rin as a way to pay his debt. On the last page of sex the guys say \"thanks, that was a lot of fun\" to Rin and she seems to smile. On the next page Master picks her up and says she really helped him. He then asks if she wants something to eat and she says no. He remembers she doesn't eat and asks if she wants something else. She says no she doesn't. He asks then maybe she wants to go to karaoke or something and again she says \"no, nothing\". The last line by the Master says \"ah, so that's how it is\". Then the last page with hearts shows how Rin is happy to give people happiness rather then receive it. Character limit again."},{"id":566613,"gallery_id":214438,"poster":{"id":1233210,"username":"Aoi Hikari","slug":"aoi-hikari","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530899209,"body":"Okay, so here's the story.\nRin is a robot, but the first master treated her as a person. He would even treat her to human food and she would pretend to enjoy it only to throw it all up at night and feed on electricity instead. When he went to work she would just stand there with blank expression all day because he didn't order her to do something. She asks if she should help with cooking, but he says he'll handle it himself. Then they see Miku sing on TV and Master asks if Rin would like to sing too. Rin asks if Master wants her to sing. Master says Rin should do what she wants to do. She asks again if there's anything he wants her to do. To which he replies that he wants her to do what she wants to do. But that's not how robots work apparently. She smiles on the surface, but the next page shows his kindness to her is hurting her (hearts go towards her and pierce her) so she runs away.\nAnother master picks Rin up and he treats her as a toy she is. And here's character limit 4 comments."},{"id":429240,"gallery_id":214438,"poster":{"id":1334442,"username":"NixoSM","slug":"nixosm","avatar_url":"avatars/1334442.png","is_superuser":false,"is_staff":false},"post_date":1523789809,"body":"wtf dude XD??"}]