[{"id":440715,"gallery_id":220582,"poster":{"id":1666933,"username":"stangamer1996","slug":"stangamer1996","avatar_url":"avatars/1666933.png","is_superuser":false,"is_staff":false},"post_date":1525548648,"body":"Zipper. Lol"},{"id":350395,"gallery_id":220582,"poster":{"id":255243,"username":"jinglebelljerk","slug":"jinglebelljerk","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1515995192,"body":"The monster climbs onto him and expresses great interest in his vitality. She/it begins to skin him alive. After climbing into the owner's skin the monster is exuberant over the fact that the owner's skin is truly exceptional. The skinless owner reaches out to the monster in desperation for his skin back and the monster gleefully tells him that it'll give him a chance to survive and to come find it if he manages to pull through. The owner wakes up in Moriyama's skin and freaks out as he stares into the mirror.\n\nTo be continued...\n\nSorry this ended up being way longer than a simple synopsis. Anyways thanks to the group that translated this. Can't wait for chapter 2."},{"id":350392,"gallery_id":220582,"poster":{"id":255243,"username":"jinglebelljerk","slug":"jinglebelljerk","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1515994805,"body":"...by the reveal, decides to check her closet just in case. He steps on the human skin as he steps into the dark closet. \"Moriyama\" appears behind him and tries to seduce him as Moriyama into being her accomplice/make him drop his guard. He's flustered for a moment but sees the huge ass zipper on her back and it finally clicks that this woman may not be Moriyama after all. She wrestles him to the ground and tries to choke him out but he throws her off head first into a mirror. As \"Moriyama\" gets up she expresses interest in him. The owner then finds himself paralyzed from an off-panel injection (during the scuffle I suppose) and questions the monster for the real Moriyama's whereabouts. The monster reveals that the innards are probably being hung out for sale somewhere as they speak and the owner swears to take the monster down with his last breath."},{"id":350384,"gallery_id":220582,"poster":{"id":255243,"username":"jinglebelljerk","slug":"jinglebelljerk","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1515994130,"body":"There is then news about corpses being found with their skin removed. Three days pass. As the owner is leaving work he finds \"Moriyama\" standing in the rain in a daze. When he confronts her initially she doesn't recognize him. He tries to figure out what's going on but then suddenly \"Moriyama\" reverts into character and all suspicion goes out the window. He walks her home. She asks him to stay with her for a bit and then goes off to shower. But before leaving she asks him to not look in her closet. While alone the owner expresses concern over being in a high school girl's home and questions how she's able to afford such an apartment with both her parents gone (she lives alone). While pondering the situation the news comes on and reveals that the skinless corpses that were discovered three days prior belong to Moriyama's two friends, and that the police are currently looking for Moriyama as she's a key witness. The owner, obviously unnerved..."},{"id":350377,"gallery_id":220582,"poster":{"id":255243,"username":"jinglebelljerk","slug":"jinglebelljerk","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1515993348,"body":"A basic synopsis for those who can't read Japanese or Chinese (I had to wait for the Chinese version to find out what was going on):\n\nThe story starts with the long haired high school girl (Moriyama) being \"harassed\" by the yankee-looking customer because she spilled his coffee on him. The big looking dude (the middle-aged owner/her employer) comes along and bails her out as the customer is a kouhai of his. Later, Moriyama's two friends come by to invite her to a weekend theme park getaway, but she's not sure if she's able to get time off on a Sunday because family restaurants are usually busy then. The owner, having a soft spot for his hardworking and straightforward employee, gives her time off to hang with her friends. There's brief talk about the theme park mascots and the owner having not been to one in ages since he stopped living with his daughter and Moriyama impulsively tries to invite him along, promising him a memorable time (which he declines).\n\nMoriyama never returns."}]