[{"id":2124332,"gallery_id":220801,"poster":{"id":1145669,"username":"Mowpey","slug":"mowpey","avatar_url":"avatars/1145669.png","is_superuser":false,"is_staff":false},"post_date":1636038887,"body":"This is my birthday, so lucky :D"},{"id":752324,"gallery_id":220801,"poster":{"id":2077665,"username":"MelloNebula","slug":"mellonebula","avatar_url":"avatars/2077665.png","is_superuser":false,"is_staff":false},"post_date":1544334876,"body":"Why not just get him to be the father lol"},{"id":581780,"gallery_id":220801,"poster":{"id":785261,"username":"Lagoon","slug":"lagoon","avatar_url":"avatars/785261.png?_=8397ba9fe88ee292","is_superuser":false,"is_staff":false},"post_date":1532685506,"body":"English please. This the only art left untranslated from this author"},{"id":563895,"gallery_id":220801,"poster":{"id":277703,"username":"temporow","slug":"temporow","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1530562943,"body":"Ntr or not, the blackmailing should be the “negative” part of the doujin, not the son being ”cucked”. Fuck incest."},{"id":382878,"gallery_id":220801,"poster":{"id":6860,"username":"Seizaburo","slug":"seizaburo","avatar_url":"avatars/6860.png","is_superuser":false,"is_staff":false},"post_date":1520380233,"body":"Son works, principal/teacher discovers that and blackmails her with expelling her son from school/telling the ppal (expulsion anyways), they fuck, son comes back and gives her mother the present he bought with his job, they hug. There's no NTR here, at most you could confuse it with cheating but not NTR at all, are you retards? I dont understand a single shit from chinese but its fucking obvious"},{"id":381312,"gallery_id":220801,"poster":{"id":271381,"username":"Pidor-Blyat","slug":"pidor-blyat","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1520112795,"body":"just for fuck sake . . . fuck ntr :|"},{"id":352503,"gallery_id":220801,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1516343429,"body":"Let me join the convo gentlemen: I can't read the raws, but it seems like the son's purpose for working was to get his mother a birthday present. It'd be natural for him to stop working since he met his goal, so this story would end right here. But if the old guy starts blackmailing the mother with her own pictures then it would continue. However, I see no reason for the son to leave his mother even if she gets together with that guy (she seems single) yet.It will simply be something like HOMESTAY but milder. If they were in an incestuous relationship, the mother wouldve \"kissed\" him goodbye or something of that nature. My guess is that if it does continue the next chapter will loose much of it's \"ntr effect\" therefore there will be no part 2."},{"id":352013,"gallery_id":220801,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1516282713,"body":"@Cockmaster39 You are trying too little . In your example storywise the son should stay in the house to end like that, which would be boring and I never said the son would start living happily after he left , leaving the house doesn't mean he gets to run away from the reality but he is forced to leave a place that originally belonged to him. In my example the other guy not only ntrs his mother but takes his place in the house and makes him an outsider, that's the ultimate ntr. And since the son  is not into his mother sexually there is no real point in showing his dick size . Not all ntr ends showing a cuck with a small dick .Try to read the between the lines rather than the obvious meaning of ntr.\n"},{"id":351963,"gallery_id":220801,"poster":{"id":190713,"username":"danh","slug":"danh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1516275690,"body":"@metroid Here we go again. Fight me metroid with your netorare knowledge!"},{"id":351951,"gallery_id":220801,"poster":{"id":1411565,"username":"Cockmaster39","slug":"cockmaster39","avatar_url":"avatars/1411565.png","is_superuser":false,"is_staff":false},"post_date":1516274520,"body":"@metroid believe me NTR wont end like that.. atleast they will not show the scene where the son leave the house and start happy live somewhere else. The page probably end where his mom smile(completely nympho) to her son while has that man cum pour out of her vagina with Big belly and her son sit there tears in the eyes with small tiny boner ejaculated in his pants. And ended."},{"id":351911,"gallery_id":220801,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1516264388,"body":"Btw I realized she has a band aid on her neck on the last page whereas she didn't have it previously. I wonder why is that. To hide a hicky perhaps? I doubt it will happen but I would like a sequel to this where the guy fucks the mother in front of her son and she gets pregnant with the guy's child and eventually the son leaves the house and the school to work and live on his own. That would complete the ntr.\n"},{"id":351830,"gallery_id":220801,"poster":{"id":1337080,"username":"TrickstaBoy","slug":"trickstaboy","avatar_url":"avatars/1337080.png?_=93b49d0b44cc933c","is_superuser":false,"is_staff":false},"post_date":1516254040,"body":"Who the fuck takes a pic of a nigga washing dishes from a distance like some undercover cop? Lmfao"},{"id":351783,"gallery_id":220801,"poster":{"id":785261,"username":"Lagoon","slug":"lagoon","avatar_url":"avatars/785261.png?_=8397ba9fe88ee292","is_superuser":false,"is_staff":false},"post_date":1516248374,"body":"I want English version"},{"id":351735,"gallery_id":220801,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1516238001,"body":"@Rman So you find it believable that you could trick a woman into having sex just with a couple of pictures showing his son washing dishes and right after she enjoys getting raped and easily gets off . This is nowhere any more believable than your supposed premise of \"a hidden sex craved whore waiting to get screwed into submission\" And I dont see how her son \"sacrifices something out of love he has\" here just because he secretly works to buy a present. There is no taking advantage of someone less fortunate either . The guy only had a couple of pictures of her son washing dishes to blackmail the idiot mother, not some guy stealing from others or even shoplifting just because they are poor. While it's not allowed for students to work in Japan many still do, so at worst they would suspend him from school for a few days or just reprimand him, it's not like they'd expel him or anything. You are seriously full of shit or just plain stupid to think this is a believable scenario.\n"},{"id":351627,"gallery_id":220801,"poster":{"id":1331849,"username":"Rman","slug":"rman","avatar_url":"avatars/1331849.png?_=c55777b74d01fc25","is_superuser":false,"is_staff":false},"post_date":1516215060,"body":"This is the first ntr I believe I've seen with believable story without the bullshit premise of a hidden sex craved whore waiting to get screwed into submission. Instead both parties sacrifice something out of love they have. The other guy was just that one self absorbed loser who takes advantage of someone less fortunate then him."},{"id":351608,"gallery_id":220801,"poster":{"id":522750,"username":"Prince Chan","slug":"prince-chan","avatar_url":"avatars/522750.png","is_superuser":false,"is_staff":false},"post_date":1516211039,"body":"typical NTR but with a sweet ending as his son try to buy her birthday present therefore he work without telling his mom. then the principle of the school caught him because it is forbidden to work during your school life in Japan so he try to blackmailed his mom for sex. END"},{"id":351606,"gallery_id":220801,"poster":{"id":682436,"username":"Z-Voltrin","slug":"z-voltrin","avatar_url":"avatars/682436.png","is_superuser":false,"is_staff":false},"post_date":1516210616,"body":"i think that's like her lover... i think."},{"id":351584,"gallery_id":220801,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1516207669,"body":"I hope this gets a part 2. And is that her son or something?"}]