[{"id":2355841,"gallery_id":221320,"poster":{"id":4943962,"username":"Goburian","slug":"goburian","avatar_url":"avatars/4943962.png?_=2cfe8f98b1f3bc0d","is_superuser":false,"is_staff":false},"post_date":1645610355,"body":"(Windsor) \nHe may be asleep, he may be in the middle of a stressful situation, he may be dead for all I know,\n\nI wonder if others that will read this in the future wonder what I am doing,\n\nIts a bit ridiculous to think about all this in a hentai website lol.\n\nImagine putting a contact link in such place, and maybe 5 years from now, when you have moved with your life and experienced countless new things, someone messages you and say (hey man just saw your comment), I bet it will feel pretty cool...\n\nOkay now after all that random bullshit go bavck to fapping"},{"id":2355830,"gallery_id":221320,"poster":{"id":4943962,"username":"Goburian","slug":"goburian","avatar_url":"avatars/4943962.png?_=2cfe8f98b1f3bc0d","is_superuser":false,"is_staff":false},"post_date":1645609903,"body":"I just noticed something.\nIts truly fascinating how the last person who posted a comment here was almost three years before me, in this remote corner of the  vast internet.\nI wonder if he imagined that three years from then, a young boy will wake up in his room during covid quarantation, and before going to his online class, will find his comment and wonder what he thought.\n\nIts the same with me, I dont really know what kind of person will someday read this, this isnt even a popular doujin so not many people will come here to see this, and among those who do find their way here, most will not care about the comment section and just leave this page without noticing.\nHeck there is a good chance that no one will read this comment, I wonder what will happen to it... \nWill it stay unread here until the site shuts down?\n\nBut I think with such small chance of anyone reading this, it makes it a special thing, dont you agree?\n\nI wonder what the last guy is doing right now (\n\n"},{"id":2355814,"gallery_id":221320,"poster":{"id":4943962,"username":"Goburian","slug":"goburian","avatar_url":"avatars/4943962.png?_=2cfe8f98b1f3bc0d","is_superuser":false,"is_staff":false},"post_date":1645609089,"body":"This was much better than what I had expected at first"},{"id":756163,"gallery_id":221320,"poster":{"id":2082210,"username":"Windsor","slug":"windsor","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1544782135,"body":"There's no mistake, just happy little accidents ;). Artist's drawing is sexy af. "},{"id":353630,"gallery_id":221320,"poster":{"id":750079,"username":"COOLASH","slug":"coolash","avatar_url":"avatars/750079.png","is_superuser":false,"is_staff":false},"post_date":1516561114,"body":"WTF!? Though that slide and Bondage was SEXY AS FUCK!!! 😍"}]