[{"id":1589272,"gallery_id":221590,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1614419470,"body":"Always glad to see them get NTR'd, these generic brown haired, slightly tanned by at least several shades tone then the girls who are as pale/fair as can be, usually with features nit present in the asian phenotype (blue/green eyes + yellow/red or even platinum hair combo), tall and busty, usually very rich and smart or powerful (top % material because of course, nothing less for our nihonsuke protagonist, right?) with names that you can tell they grabbed a book of victorian era western names prominently used by nobility to name the girls (usually something like \"Alicia von Richenstein\" or something like that) while the japrotagonist's name usually begin with a \"K\" (kotarou/kozuke/keichi/kenshiro/kazuma/kazama/kiteru/kizuke/etc,) with some odd \"hinata\" or \"makoto\" These type of cliche bullshit has becoming an overwhelming plague in the industry, it has gotten worse by the years, people complain about realism in hentai only when the self-insert-kun gets shafted out of its wishfulfilment"},{"id":1589245,"gallery_id":221590,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1614418157,"body":"japs always self-insert themselves in this obviously western setting where they are the hottest snowflake and practically the only male around, like here, an all girl school for knight women, what the fuck would a jap know about knight fencing, samurai and ninja stuff is their shit, but nonetheless, this european prestigious setting just so happens to need an instructor and apparently there are none qualified for it locally, it just so happens that all the way down in butt-fucking asia, specifically japan (surprise...) there is \"japanosuke japanmaru\" who has been written by the author of the show to look and sound like every other typical generic jap main character from all those run of the mill romcoms/isekai/shonen shows and also have all its stats cranked up to 999 (like a game dev making their own character god-like), so instead of being the king of japan or whatever, nah let's move over there and be a teacher/gofer boy to the wetdream wish fulfillment \"queen/princess\" main girl."},{"id":1411069,"gallery_id":221590,"poster":{"id":1387175,"username":"a drop of virtues.","slug":"a-drop-of-virtues","avatar_url":"avatars/1387175.png?_=36d1c341684b4d47","is_superuser":false,"is_staff":false},"post_date":1608152399,"body":"boii...     "},{"id":365056,"gallery_id":221590,"poster":{"id":1165045,"username":"Hentius","slug":"hentius","avatar_url":"avatars/1165045.png?_=013cf9419e239018","is_superuser":false,"is_staff":false},"post_date":1518424575,"body":"MFW when I realize Takahiro is actually an undefeated knight, then Hentai plot strikes again."},{"id":356062,"gallery_id":221590,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1516941665,"body":"This is amazing and that art !"},{"id":355022,"gallery_id":221590,"poster":{"id":471445,"username":"Healthy_Poison","slug":"healthy_poison","avatar_url":"avatars/471445.png","is_superuser":false,"is_staff":false},"post_date":1516776421,"body":"that girl beauty is impossible tho. more works like this?"},{"id":354765,"gallery_id":221590,"poster":{"id":1396135,"username":"The Real Dante","slug":"the-real-dante","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1516744571,"body":"The ending was way too sudden, not enough build up and NTR moments. The art is great though."},{"id":354723,"gallery_id":221590,"poster":{"id":750079,"username":"COOLASH","slug":"coolash","avatar_url":"avatars/750079.png","is_superuser":false,"is_staff":false},"post_date":1516741468,"body":"Yay first ! 😀"}]