[{"id":2284672,"gallery_id":231482,"poster":{"id":4930323,"username":"TheBLACKDahlia","slug":"theblackdahlia","avatar_url":"avatars/4930323.png?_=120898c531bff33d","is_superuser":false,"is_staff":false},"post_date":1642972905,"body":"Attempted translation of the setup/premise (part 2): WIFE: \"Is that what you seriously want, Wataru-kun? Then, give me some time to think it over.\" // MC'S THOUGHTS: Two days later, Yumi accepted my wish. After a while, the third party was decided: Kazuki Kashiwagi. Both Yumi and I knew him as he was our college classmate. Back then, his fit body was always a topic of discussion. In college, he often teased us while we were dating. He didn't think our personalities matched and he wondered how good I was in bed. Now, Kazuki is a freelance writer, which also factored into why he was selected. I asked him to write to me about the act, but keep it a secret from Yumi. That day, she left quietly. In the meantime, I waited for what felt like forever. I was filled with expectations and anxieties to the point that I was feeling sick. I received a message from Yumi at the agreed-upon time. // TEXT: \"It's over. I'm sorry. Please organize your feelings because this is not working out.\""},{"id":2284668,"gallery_id":231482,"poster":{"id":4930323,"username":"TheBLACKDahlia","slug":"theblackdahlia","avatar_url":"avatars/4930323.png?_=120898c531bff33d","is_superuser":false,"is_staff":false},"post_date":1642972758,"body":"Attempted translation of the setup/premise (part 1): \n\nMC: \"I beg you!: // MC'S THOUGHTS: That day, my wife was confused... by the sudden wish from me, which was... TO HAVE SEX WITH ANOTHER MAN // WIFE: \"What happened so suddenly? Hey, tell me, I'll listen to you.\" // MC'S THOUGHTS: My wife, though confused, gently reached out to me. I told her everything about my sexual fetish and how I've kept it hidden. My wife, Yumi, she sat there listening, taking it all in. Yumi is 29 years old. We've been married for five years, but we were college classmates, so our relationship was even longer than that. According to her sister, she has a bit of a brash personality because of how she was raised. Something that was important to me is to see how things will end up if she is embraced by another man. For some time now, I've been unable to stop this feeling, and finally I've confessed it to her. // WIFE: \"I'm not stupid!\" // MC'S THOUGHTS: I can see that Yumi is angry. // "},{"id":687389,"gallery_id":231482,"poster":{"id":1338763,"username":"Windy712","slug":"windy712","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1536979165,"body":"This must be too much redraw that i think there wont any english edition"},{"id":561786,"gallery_id":231482,"poster":{"id":329503,"username":"wcputra","slug":"wcputra","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530325332,"body":"dieeeeeeeeeee"},{"id":559967,"gallery_id":231482,"poster":{"id":1324818,"username":"danielle","slug":"danielle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530140128,"body":"Please make some English version of this(Haitoku Sensie) as well the un translated ones ill die happy T_T"}]