[{"id":1674306,"gallery_id":23185,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1618202030,"body":"Oh when he’s talking to his friends, he finds it odd too, and so do they. I guess it wasn’t only me then. Even the author as well through the characters lol. Wish the series had a good ending. Maybe like 4 chapters more would have been enough to tie things up."},{"id":1674222,"gallery_id":23185,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1618199134,"body":"Honestly does she really like MC too. I mean she’s using sex with him to feel good about herself, because there’s someone who loves her. Compared to the sex before that was just carnal to fill the hole, assuage her guilt, and feed her addiction. It’s like this is a whole new addiction, but she can make this work by doing things for him. Kinda feel like she’s imposing herself on him, because she’s so confident he has feelings for her."},{"id":1674214,"gallery_id":23185,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1618198965,"body":"Wow, Sei changed so much. The earlier volumes she was totally anti-sex. And now she’s throwing herself at him constantly. Pg 35 made me laugh. She said, “Vagina for Mamoru only.” Girl, we know you had your problems and you’re trying to change, plus that was your past, but she’s coming off so weird, it’s a huge turnoff. I like a lot in the story but there’s a bunch of stuff in the story that really disappoints me. She, Tomo, and Kaoru still need some resolution to their part of the story. Kaoru was the reason why she became addicted to sex. His actions served as the catalyst to her downward spiral and her almost taking her own life. Which he treats so casually with a smirk, so fuck him. Plus the betrayal of Tomo, one of the nicest characters and a person they supposedly love can’t be just ignored and brushed off when it was the second most important reason for Sei’s descent. She was planning to call Tomo and confess so that needs to be followed through."},{"id":963620,"gallery_id":23185,"poster":{"id":2197050,"username":"-Ara_Ara-","slug":"ara_ara","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1562215449,"body":"Fiquei procurando a parte do gemder bender e nao achei"},{"id":868968,"gallery_id":23185,"poster":{"id":1451093,"username":"Garruk1","slug":"garruk1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1554733138,"body":"o altor deveria acabar logo a serie do Ochiru Tenshi porque e muito boa."}]