[{"id":2232798,"gallery_id":235215,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1640912591,"body":"@RYuujin : sort of. The black haired girl got another guy she wants, but both girls seems to be quite casual about sex. The protagonist Tooru got invited by Mami (his senior at work he wants to get closer with) to a drinking party. Her colleague Sayuri, who shared the apartment, also invites her subordinate, Hosokawa. But because of trouble at work, Hosokawa can't join them. After Sayuri got drunk, Mami told him Sayuri actually planned on having sex with him anyway, so he can do her as he likes. Mami herself planned on making out with Hosokawa, who unfortunately can't come. Later, he had sex with Mami (whom he's actually interested in), but she put on stance that she's only enjoying it just because she hasn't been having sex as freely as she used to be after living with Sayuri. Later after Sayuri awake, he asks why she wants to have sex with him despite not knowing each other that well, to which she answer she's just feels like it, and he got nice body too."},{"id":2201688,"gallery_id":235215,"poster":{"id":2793304,"username":"RYuujin","slug":"ryuujin","avatar_url":"avatars/2793304.png?_=dcae66456dd47421","is_superuser":false,"is_staff":false},"post_date":1639645035,"body":"1st story is a harem?"},{"id":2177311,"gallery_id":235215,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638511682,"body":"The 5th story with them bragging about sex with their girlfriends are funny. First guy dates a younger girl and brag about how she's obedient. Second guy dates their classmate and brag about how there's no hesitation and he feels great knowing he fucks her while everyone else can only jack off. The third guy dates an older girl, which his friends thought is strict, so no sex before marriage. But the fact is she's the dominant in relationship, and those two think that's hot. "},{"id":562637,"gallery_id":235215,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1530403872,"body":"@\nsambucety Only three chapters are in english  You should learn the definition of \"most\""},{"id":524792,"gallery_id":235215,"poster":{"id":1509523,"username":"sambucety","slug":"sambucety","avatar_url":"avatars/1509523.png","is_superuser":false,"is_staff":false},"post_date":1527794150,"body":"most of this is in english in hentai cafe"}]