[{"id":720986,"gallery_id":236080,"poster":{"id":2011199,"username":"whattotype445","slug":"whattotype445","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540742785,"body":"And if I remember correctly wasn't naruto the one who gets kicked out of his own house by his wife and he literally stated that she's scary and he fears Hinata? Naruto is the pussy, he's beta trash. He got slapped around by every woman his whole life, he puts himself in a subservient position in the hopes of winning a girl over, has no balls to stand up for himself, his own wife, a mild mannered Hinata has his pussy whipped, his own daughter beat him up and made him cower. Naruto is a naïve immature emasculated beta simp, that's all canon. \n\nSasuke is the exact opposite, he doesn't fear his woman or make himself subservient, Sakura doesn't try to emasculate him, no woman tries to emasculate him, on the contrary every woman he ever met by themselves take on a feminine role when they're dealing with Sasuke, even a bossy authoritative type like Temari. Sasuke is a true alpha male"},{"id":720982,"gallery_id":236080,"poster":{"id":2011199,"username":"whattotype445","slug":"whattotype445","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540742642,"body":"@lightsoul you sound mad butthurt yourself ever noticed that? Yaoi isn't for gay men, it's drawn by women for women, Sasuke appears in that because he's hot, desirable and is a girls wet dream. Appearing in yaoi is not a bad thing, I would rather be popular with women than men. Plus Sasuke appears in straight stuff too, just because this site doesn't post much doesn't mean artists don't create. Go check Japan's biggest site for manga, Sasuke x Sakura is the most viewed pairing along with having the most fan works dedicated to them, along with that Sasuke himself is the #1 most viewed naruto character and also has the most fan works."},{"id":581063,"gallery_id":236080,"poster":{"id":86323,"username":"lightsoul","slug":"lightsoul","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1532628105,"body":"@bene is mad cuz sasgay appears more in yaois than straight stuff. stop being a naruto hater, he's the main character, this why the name of the show is Naruto, no sasuke. Naruto has two siblings, take a dick to reproduce, compared to sasuke that only has a girl and is a pussy himself."},{"id":549713,"gallery_id":236080,"poster":{"id":1754903,"username":"cats are life","slug":"cats-are-life","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1529030556,"body":"sigh I wish I could understand. Looks like another cute story"},{"id":548489,"gallery_id":236080,"poster":{"id":1751717,"username":"bla bla bla 1212","slug":"bla-bla-bla-1212","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1528874478,"body":"Lovely. I wish this gets translated to English. "},{"id":548484,"gallery_id":236080,"poster":{"id":1751717,"username":"bla bla bla 1212","slug":"bla-bla-bla-1212","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1528874117,"body":"@Maple Syrup you weaboo faggot not everybody is a nardo dickrider like you. not everybody owns a naruto body pillow and dreams of guzzling on his cum like you do. End your life. \"Bruh wtf is this shit.\" This is the good stuff right here bitch"},{"id":548215,"gallery_id":236080,"poster":{"id":1739760,"username":"bene","slug":"bene","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1528843951,"body":"cute doujin, cute couple. "},{"id":548212,"gallery_id":236080,"poster":{"id":1739760,"username":"bene","slug":"bene","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1528843691,"body":"@Maple Syrup Naruto has a vagina, go kill yourself you muppet. Cucks like you should be skinned alive and fed to dogs"},{"id":541130,"gallery_id":236080,"poster":{"id":1307624,"username":"loli snatcher","slug":"loli-snatcher","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1528562737,"body":"But doesn't naruto want to be impaled by sasuke ?"}]