[{"id":675906,"gallery_id":236400,"poster":{"id":380989,"username":"vortex97","slug":"vortex97","avatar_url":"avatars/380989.png","is_superuser":false,"is_staff":false},"post_date":1536024183,"body":"props to @acs100death for all those damn work"},{"id":655962,"gallery_id":236400,"poster":{"id":1648739,"username":"asscream","slug":"asscream","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534181344,"body":"这本子看完让我感动woc\n为什么这么戏剧化？\n跌宕起伏，人物塑造深刻。"},{"id":565458,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530762934,"body":"Chapter 8 end: Four years later, Yuki is seen growing trees in a courtyard with some people. *Apparently, Hiragi is a volunteer (from chapter 7 when she introduced herself). I’m guessing Yuki contacted Hiragi when she gave them the card previously* Hiragi says that Yuki has mail. It’s a letter from Anna and Sakura. Airi has a baby too. Hiragi and Yuki are lovers. Anna and Sakura looks at the photo that Hiragi and Yuki sent them. Sakura is seen being very pregnant. Anna has a boy beside her too. Airi is seen breastfeeding her kid while look at the photo. HAPPY END."},{"id":565455,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530762808,"body":"Chapter 8 continued: Anna and Yuki under the pretense of buying food, decide to leave. They decided to leave Sakura, seeing that she is happy with Shin. Their journey together is finally over. Hiragi gives them a card (volunteering work) to keep in touch. Yuki finally returns home to her mother. She realize that the door is locked. The neighbour came out and asked Yuki why is she back as they have moved out. Yuki realized that her mother abandoned her without telling her. Her mother moved out a long time ago. Yuki and Anna meet again. Anna says that Daisuke fetched her home and she is finally ready to give Daisuke her answer. Yuki tells Anna that she wants to go on another journey as she has not found her path/goal yet. She cries as she says she has no idea what she wants to do. Anna comforts Yuki."},{"id":565452,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530762675,"body":"Chapter 8: Uncle is actually Shin’s Dad. Sakura is fucking Shin’s Dad. Shin’s Dad gloat Sakura asking her to show more of her slutty self. Being fucked in front of Shin, her nipples erected. Hiragi asked Shin to calm down. Sakura apologize for lying to Shin, saying she is a slut and had an orgasm using Shin’s Dad dick. Seeing her girlfriend being gangbanged, Shin also had an erection. Airi is dazed from eating the sex drug and being fucked. Sakura dislike swallowing originally but now she swallowed all the cum. Hiragi seduces Shin, asking him to forget about Sakura playfully. Shin fucks Hiragi thoroughly. Shin fucks Sakura and he passed out. They woke up in a hospital. Anna says that her pussy is loose from all the fucking. They chit chat for a while. Hiragi saved the group. Airi might have amnesia from the incident but her condition is stable. Hiragi blame herself for not taking care of Airi. Anna says it is partly her fault too."},{"id":565449,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530762538,"body":"Chapter 7: The trio attends the party that the Uncle said. They met with Uncle and changed their clothes. Two new girls enter the party. Airi (girl with heart shaped pasties) and Hiragi. Sakura blowjob. Yuki wants to be pregnant and wants men to creampie her. Anna gangbang. Airi dancing. Hiragi blowjob. Airi orgasm. Hiragi and Airi kiss. Yuki and Anna being fucked hard. Sakura doesn’t like to swallow and Airi decided to take over her. Airi ingested a sex drug provided by the men. She fainted from the sexual pleasure. Uncle appears before Sakura. He wants Sakura to showcase her cowgirl riding skills to others. Random guy wants Yuki to showcase her deepthroat skills to others. Yuki deepthroat a 22cm dick. Anna feels that she and her friends are being treated too badly. Anna complained to the organizer saying that the girls are being treated like toys and the men are too rough. They want to leave the party. Anna is too stubborn and got punched. Sakura is fucking Uncle and Shin shows up."},{"id":565447,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530762391,"body":"Chapter 6: Yuki is being molested some uncle. Anna went to suck some office worker's dicks. Yuki have sex with the uncle on the train. Uncle says he wants to impregnate Yuki and have sex with Anna and Sakura. They went to a hotel to have sex. Uncle have a party tomorrow and offered them a 2 day 1 night job to serve them. Sakura accepted the job and money. Sakura fucks uncle again. Sakura called Shin to apologize. Shin wants Sakura to meet his dad and to introduce Sakura to him. Sakura and Shin still love each other. Sakura went back and overheard Yuki saying she wants a baby. Yuki's goal is to have a family and that's why she allows men to creampie her. Anna is angry at Yuki. Sakura comes in to defuse the situation. Sakura says that the party with uncle is the last of her slutty ways. The trio talk about their pussy smell and being huge sluts."},{"id":565446,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530762265,"body":"Chapter 5: Chit chat with Shin and Tatsuya. The group tease Sakura on how she have not met Shin's dad yet. Tatsuya fell asleep. Yuki and Anna tease him in his sleep. Yuki says erotic stuff while Anna sucked his dick. The three went upstairs to fuck, leaving Sakura and Shin alone. Shin confess to Sakura and they made out. Anna forced Yuki to rest as she was not feeling well due to earlier gangbang. Anna has Daisuke but she is ok with fucking Tatsuya. Yuki checks her pregnancy test and she is not pregnant. Sakura and Shin have sex and promise never to leave each other. They talked about the past, Shin had flings in the past. Shin wants Sakura to stay here with him. Sakura propose to Shin. They affirm their love for each other. The next day, Anna and Yuki left, seeing how Sakura found her path and is happy. Cue girlfriend who enters the house. Sakura was shocked and hurt. She ran off, not knowing it was an ex-girlfriend instead. She met up with the rest to continue their journey instead."},{"id":565443,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530762132,"body":"Chapter 4: They travelled to Hokkaido beach. Anna applies sunscreen to Sakura and Yuki. They coincidentally bumped into Shin-kun. Shin-kun is Sakura's childhood crush. Anna bumped into Daisuke. The group chit chatted for a while. Yuki went off with a store owner. Anna is worried and asked Yuki not to force herself. Yuki is hungry for dicks. She 69ed with the store owner. The store owner's employees came and gangbanged Yuki too. One employee asked if Yuki ate contraceptive pills. Cut back to Sakura and Shin-kun. They hugged. Anna and Daisuke. Daisuke loved Anna. They have not met in three years. He wants to be with her but Anna still needs time to consider. Cut back to gangbang with Yuki. Lots of creampies inside Yuki before ending. Yuki meets up with Sakura and Anna. Anna worries for Yuki, said she played too much and overdid it. The trio decides to stay at Shin-kun's house for the night."},{"id":565441,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530762010,"body":"Chapter 3: The trio reached Tokyo. They need to find a place to stay. They saw a random guy outside a sex shop. Sakura wants to fuck him and to earn money in the process. Yuki doesn't want to participate and decide to head back to the hostel first. Sakura and Anna gives the guy a footjob using their juices as lubricant. Sakura gets creampied. Anna sticks a tube into the guy's urethra and drink the cum out of his dick. Sakura does the same."},{"id":565440,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530761836,"body":"Chapter 2: The trio hitch-hike their way to the airport. They are heading to Tokyo via the plane. The trio pays the guys using their body. Anna get DPed. Sakura doesn’t like swallowing and spits the cum out. The cum hits a random girl on another car."},{"id":565439,"gallery_id":236400,"poster":{"id":82998,"username":"acs100death","slug":"acs100death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530761681,"body":"Sakura (short-hair girl with boobs). Yuki (long-hair girl with boobs). Anna (loli girl). All three are good friends. Anna is older than Sakura and Yuki by two years.\nChapter  1: Introduction to the three girls. Yuki's school fees are due. She has no money, and wants her teacher to pay for her. She compensate the teacher using her body. Yuki does prostitution for money. Sakura is a slut, loves sex. Yuki returns home, finds her mother having sex with some guy. Her mother shoo her away. Yuki and Sakura worries about the future, decides to travel to find their path/goal in life and have sex with guys in the process. Sakura has a childhood crush, Shin-kun. Anna overheard their conversation and decided to join their journey. Anna has a rich family and she’s a huge slut too. She have sex and orgies with servants often. Back to the present, they are too tired to walk and decided to hitch-hike."},{"id":555110,"gallery_id":236400,"poster":{"id":897078,"username":"hana213","slug":"hana213","avatar_url":"avatars/897078.png?_=7e7f41672eedcefc","is_superuser":false,"is_staff":false},"post_date":1529621568,"body":"can anyone explain the ending?"},{"id":551077,"gallery_id":236400,"poster":{"id":1686248,"username":"tester1337","slug":"tester1337","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1529208127,"body":"@whoknowswho lmao, now shut the fuck up and keep squeezing your teeny weeny dick silently while appreciating the fap material that Japan gives you. Fucking triggered human garbage."},{"id":550168,"gallery_id":236400,"poster":{"id":573158,"username":"whoknowswho","slug":"whoknowswho","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1529100169,"body":"and a land invasion to cull the last of them for good measures "},{"id":550165,"gallery_id":236400,"poster":{"id":573158,"username":"whoknowswho","slug":"whoknowswho","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1529100047,"body":"its just shows that japan should have been nuked to oblivion"},{"id":549178,"gallery_id":236400,"poster":{"id":1111791,"username":"nayazi233","slug":"nayazi233","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1528959900,"body":"没看懂，是强行ntr吗？"},{"id":547870,"gallery_id":236400,"poster":{"id":1067324,"username":"ailika2009","slug":"ailika2009","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1528811817,"body":"这本子真的太恶心了。。直男癌的我看完不好受。里面的碧池太恶心。"},{"id":547860,"gallery_id":236400,"poster":{"id":134286,"username":"yuya","slug":"yuya","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1528811250,"body":"can anyone explain the ending?"}]