[{"id":567257,"gallery_id":238222,"poster":{"id":48826,"username":"hithummah","slug":"hithummah","avatar_url":"avatars/48826.png","is_superuser":false,"is_staff":false},"post_date":1530974921,"body":"I prefer his design in the anime, less Moe more bratty."},{"id":562921,"gallery_id":238222,"poster":{"id":1757323,"username":"ε-(=｀ω´=) o (◕‿◕✿) (。﹏。)","slug":"e-o-o","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1530442661,"body":"only a guy knew guy taste, no wonder traps are taking over "},{"id":562129,"gallery_id":238222,"poster":{"id":528007,"username":"rEkT","slug":"rekt","avatar_url":"avatars/528007.png","is_superuser":false,"is_staff":false},"post_date":1530360495,"body":"CHILL DUDE"},{"id":562127,"gallery_id":238222,"poster":{"id":1718845,"username":"Kurumi09","slug":"kurumi09","avatar_url":"avatars/1718845.png","is_superuser":false,"is_staff":false},"post_date":1530359956,"body":"traps are taking over dude. Deal with it~"},{"id":562067,"gallery_id":238222,"poster":{"id":1791891,"username":"JoeYabuki","slug":"joeyabuki","avatar_url":"avatars/1791891.png","is_superuser":false,"is_staff":false},"post_date":1530350113,"body":"So as if anime isn't already bad enough by itself now you motherfuckers are gettin into a little sonething called traps. Basically, it's a dude that dresses like a chick, has a dick, and you say it isn't gay. Well I'm here to tell you, IT'S FUCKING GAAAAAAAY!!!!!!! If I walk up to you right fuckin' now with me being a dude and you being a dude and you are turned on by me, that would be gaaaaay. It's no different for fuckin' traps just 'cause they dress like a chick don't mean don't mean they are a chick they got a dick and it's gay! AND DON'T SAY THE DICK MAKES IT CUTER, 'CAUSE THAT DOESN'T MAKE IT CUTER THAT MAKES IT EVEN GAYER! THAT MAKES YOU GAY, BITCH! AND YOU SEND ME PICTURES OF 'EM WITH THEIR LITTLE SKIRTS LIFTED AND THEIR FUCKING NUTS HANGING OUT. I DON'T WANNA SEE THAT SHIT! I'M NOT GAY LIKE YOU! STOP SENDING ME HENTAI!!! STOP SENDING ME ANIME PICTURES!!! STOP SENDING ME TRAPS!!! OH MY GOD!!! AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"}]