[{"id":1516915,"gallery_id":239217,"poster":{"id":2019944,"username":"Sauce Collector","slug":"sauce-collector","avatar_url":"avatars/2019944.png","is_superuser":false,"is_staff":false},"post_date":1611208184,"body":"The devil "},{"id":1092007,"gallery_id":239217,"poster":{"id":2492878,"username":"weidenfeller","slug":"weidenfeller","avatar_url":"avatars/2492878.png?_=974e29a10785b192","is_superuser":false,"is_staff":false},"post_date":1595315511,"body":"Can't wait for the sequel"},{"id":1077347,"gallery_id":239217,"poster":{"id":1302706,"username":"aymanbouyaya","slug":"aymanbouyaya","avatar_url":"avatars/1302706.png?_=ad4edb9685a8569b","is_superuser":false,"is_staff":false},"post_date":1594706757,"body":"I like this one \nI watched years ago and I still feel like it's one of the best ntr out there"},{"id":904436,"gallery_id":239217,"poster":{"id":1728743,"username":"Adam J Harper","slug":"adam-j-harper","avatar_url":"avatars/1728743.png","is_superuser":false,"is_staff":false},"post_date":1557790515,"body":"Why in the ever-loving-fvck are there WALLS OF TEXT down here ??  ......i mean, seriously, they are bigger than the walls in Attack on Titan.  Are people so retarded that they are unironically arguing about kinks ? The fvck is this ?? I thought they were just shitposting but these lunatics are for real......   everyone knows the best part of a NTR is not the guy being cheated on. But the girl being turned into a submissive cock-sleeve by teaching her sheer pleassure. THAT is what makes it appealling...  end of the argument"},{"id":830530,"gallery_id":239217,"poster":{"id":1925322,"username":"Diogenes","slug":"diogenes","avatar_url":"avatars/1925322.png","is_superuser":false,"is_staff":false},"post_date":1551246258,"body":"Lol at the random ass kid"},{"id":793674,"gallery_id":239217,"poster":{"id":1013362,"username":"‏‏‎  ‏‏‎  ‏‏‎  ‏‏‎  ‏‏‎  ‏‏‎","slug":"_","avatar_url":"avatars/1013362.png?_=15e9d449f61a6015","is_superuser":false,"is_staff":false},"post_date":1548029367,"body":"Holy fuck, the arguments down here is lit."},{"id":782493,"gallery_id":239217,"poster":{"id":2069443,"username":"Nig Bigger","slug":"nig-bigger","avatar_url":"avatars/2069443.png?_=170ba8a63bffde7b","is_superuser":false,"is_staff":false},"post_date":1547105108,"body":"Btw I seriously want a sequel."},{"id":782488,"gallery_id":239217,"poster":{"id":2069443,"username":"Nig Bigger","slug":"nig-bigger","avatar_url":"avatars/2069443.png?_=170ba8a63bffde7b","is_superuser":false,"is_staff":false},"post_date":1547104584,"body":"@NullHorizon exactly my thoughts"},{"id":777544,"gallery_id":239217,"poster":{"id":1887319,"username":"goodtimes3041","slug":"goodtimes3041","avatar_url":"avatars/1887319.png","is_superuser":false,"is_staff":false},"post_date":1546714859,"body":"I'm sure most of u here dont actually look like that guy, so why project yourself on an ugly bastard? Its gross."},{"id":775830,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1546590081,"body":">clonedshadow Oh, please... If humanity was capable of it, then we would have achieved so a long long time ago. \n"},{"id":775829,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1546589961,"body":">franknhe Tell it to these butthurt fags that can't even seem to just stay away from all of this. It's not fucking hard to just blacklist this and avoid it."},{"id":775322,"gallery_id":239217,"poster":{"id":2047122,"username":"Milf.Master69","slug":"milf-master69","avatar_url":"avatars/2047122.png?_=6e7df6b1464e46a1","is_superuser":false,"is_staff":false},"post_date":1546547034,"body":"Kill all cucks. "},{"id":743542,"gallery_id":239217,"poster":{"id":1292526,"username":"Somename","slug":"somename","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1543375995,"body":"just here to fap and see interesting comments. >.> i'll stick to the fapping now"},{"id":727045,"gallery_id":239217,"poster":{"id":1902066,"username":"Trollzama","slug":"trollzama","avatar_url":"avatars/1902066.png?_=67cfabb0dd85f350","is_superuser":false,"is_staff":false},"post_date":1541463442,"body":"So yeah, I really hate the NTR tag buuuuut I always hated seeing beautiful women and milfs being \"poked\" by fucking toothpicks from shotas so I gotta admit I really liked this one with a real man getting shit done. \nAlso theres no way to dislike such hot art style. \nArakure just got a fan. \nThe fact that I hate the NTR tag just proves how good his stuff is. "},{"id":726553,"gallery_id":239217,"poster":{"id":334442,"username":"clonedshadow","slug":"clonedshadow","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1541402349,"body":"If only people used this kind of energy to make a solution for world peace :/"},{"id":725027,"gallery_id":239217,"poster":{"id":1599336,"username":"franknhe","slug":"franknhe","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1541224359,"body":"What the fuck are these word walls in a fap site?\nNtr is fictional, no need to get butthurt "},{"id":705650,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1538941360,"body":"@metroid Ha. And you think you're any better? At least, I know I'm an alpha male, while you are trying so hard to be a poser when you're actually a cucked beta male. That's why a kid like you can even love NTR in the first place, huh? Because you don't see yourself as the male stealing, you're the male being stolen from. You're just a pathetic masochist that loves being on the shaft end of the stick. And here I was expecting better from you. But I guess you're from the other side of the pathetic spectrum. Pathetic and disgusting masochists like you are just as bad as vanillafags because you welcome NTR for all of the wrong reasons. In fact, people like you are the sole reason why NTR fans like me gets a bad rep for merely liking NTR in the first place. It's just sickening to even be associated with the likes of you. So go ahead in life and get a girl and then get her stolen from you while you furiously fap to it with extreme pleasure. It suits a real cucked beta like you."},{"id":704663,"gallery_id":239217,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1538835724,"body":"@ ゆりゆり If we could turn that butthurt of yours into energy we could energize the whole world for centuries. Must be the side effect of being a incel permavirgin. It explains the fake ass alpha male pretension you try to project :)\n"},{"id":704532,"gallery_id":239217,"poster":{"id":1649473,"username":"Fjellkein","slug":"fjellkein","avatar_url":"avatars/1649473.png","is_superuser":false,"is_staff":false},"post_date":1538819129,"body":"Hmm              "},{"id":699816,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1538254618,"body":"Which is pathetic. I thought we have avatars/representations of ourselves in anime to have a realistic fantasy escapism? And yet people are sickened by ugly people eh? And this is why you won't ever see ugly people in fictional works much and especially experiencing romance/love. Because the best thing you can do with them is make them despicable cannon fodder that you should have no shame in slaughtering (see This is Basically Fire Emblem) or make them so sympathetic that you're trying to cast them in the holiest of light possible. But still no romancing. Even then, it's gotta be the most purest vanilla love. Otherwise, if there's even one 50 shades of grey-esque moment, all hell breaks loose. This is why I escape to Japanese NTR doujins especially with ugly males. They know what's up. I thought we made these waifus to accept for who we are. Not make this into another Disney fairy tale industry. Besides, if you really wanted that, there's way more than plenty of that out there... "},{"id":699811,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1538254220,"body":"That's why I like NTR. Not the gangbang and then make the girl/waifu the town's resident mcslut. But actually stealing her love and body for himself and only himself. Especially when the MC or the waifu's original lover doesn't appreciate her enough. That being said, big dick package trope is pretty overrated. Especially thanks to Miel Soft... It shouldn't matter what your package (unless you're very fucking tiny like much of these NTR'd MCs), as long as you got the right techniques and decent size to make it count. Anyways, I look at NTR as a method for people who couldn't get love normally, to have a fighting chance. Whatever it takes. Like as nature dictates, survival of the fittest. Eugenics and all that crap. I guess these losers forgotten that rule and wants to have that \"feel good\" experience. And that's why- \"People will do all kinds of mental gymnastics to justify why NTR is the worse thing ever.\" Especially again on ugly fat men. Even if it represents themselves IRL lol. "},{"id":699803,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1538253888,"body":"@AhegaoFace24/7 >\"So much this!! I cant speak for everyone but I would've been disappointed in seeing the kid fuck her, what can he possibly do?\"\n\nIndeed. This is exactly why I have so much disdain for Onee-shota doujins/hentais. Even as far as disdain for the people who like and defend that crap. I mean, how pathetic is your life that you gotta imagine yourself as a 9 year old boy that is being essentially smothered and raped by the older woman? Are they that desperate for some kind of extreme snu-snu? Hell, I would rather watch giantess hentai than watch that shota crap. Shotas were a mistake in this world. Loli is one thing, but shota is another. Especially the (male) fans that gets behind it. I guess no different than diaper/baby fetish. But hey, masochists be all out there. They rather be useless and be the ones to be serviced and made feel good rather than making the waifu feel good. That's why I say that they are pathetic useless trash that can't ever please their waifus. "},{"id":693338,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1537571995,"body":"@AhegaoFace24/7 In fact, speaking of people's vanity, it reminds me of the facebook people who bashed on the old fat guy in Emergence for just being an ugly old bastard who got to fuck Saki, but didn't say shit about the actual \"cool\" guy who led her on that path and utterly ruined her life. Or even the druggies/dealers that sold her the stuff that lead her to her demise. Even though the old guy was nowhere near the root of the problem and was only the tip of the iceberg. He was even willing to buy her out to give her better living (originally). Much better than what the \"cool guy\" ever done for her. Especially him just kicking her to the curb. I bet you anything that people would've been far appalled if 50 Shades of Grey (after some better writing >w>) was casted by one or two more ugly people as the main chars. But hey, whatever makes people feel good about themselves, right? Even if they associate themselves as a smol shota trying to get his little dick into that thicc thot."},{"id":693331,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1537571582,"body":"@AhegaoFace24/7 That is the right approach to this genre. The fact that people are siding with the MC, even if he's a pathetic twat that can never satisfy the girl or even neglects her, just astounds me. I guess whatever makes them feel better about their own miserable lives. They would rather have a girl stick by them, even if they are useless sacks of flesh that is just taking up space on this Earth. It shouldn't matter who it is, what they are, how old they are, or how they look like. As long as the guy can satisfy the waifu for all she's worth, that's what really matters in the end. Therefore, it's elementary. But hey. Whatever makes people feel good inside while liking shit, right? That's why they bash and hate on NTR and ugly old bastards, even if they are loving the waifu right. But love it when a hot looking guy be a downright asshole. People are so superficial and vain. "},{"id":677162,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1536136550,"body":"guest123123123 And proven what exactly? The fact that you're a cuckedfag that can't seem to get/walk away from this, even though you clearly demonize it as the devil's playground? Cuz that's the only thing that has been proven by you and everyone else here who complains about this stuff. You could've just left a negative comment, then blacklist it, and walk away. Never to be seen again. \"Ignorance is bliss\". And yet you can't even do that. Keep telling yourself that you're \"pure\" when you're literally rolling around in the mud and your own filth. Whatever helps you sleep, boy. Oh and btw, you just projected, too, on us with this statement. \"Ugly on the outside, ugly on the inside. It's a sign of self-indulgence. Any guy can lose weight, shave, and get a decent haircut. Fiction's separate from reality.\" But of course you're just gonna ignore your own flaw and hypocrisy. So have fun with yourself, loser. Let's see how far you get with that attitude and mentality in life. "},{"id":677154,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1536135772,"body":"Pft, says the one who keeps coming back here. Makes me wonder who's the real cucked one here if he keeps coming back for more of this stuff, hmm? You're the one who's pathetic and is clearly in the neighborhood and yet has the stupidity to criticize everyone else. Go and find your mommy, boy. I bet she's looking for you. >\"Ugly on the outside, ugly on the inside. It's a sign of self-indulgence.\"< Now now, kid. Don't start confusing us with yourself. That's all on you since you're the one who's here in the first place. If you so goddamn care about others, then why the hell did you even search up an NTR doujin in the first place? Clearly, someone is in sheer denial about himself. You could've just taken everyone else's advice and blacklist this, and yet you keep coming back for these? Don't speak anymore, kid. You're just clearly showing your immaturity. Probably that's why you can so relate to this pathetic shouta because it represents you. How fitting."},{"id":655287,"gallery_id":239217,"poster":{"id":1682421,"username":"guest123123123","slug":"guest123123123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534133093,"body":"@torjak\n@ゆりゆり\nI think you guys just prove my point. Lots of projecting stuff onto me with little to no basis. Ugly on the outside, ugly on the inside. It's a sign of self-indulgence. Any guy can loose weight, shave, and get a decent hair cut. Fiction's separate from reality. I'm not turned on by belittling other people. Doesn't mean i'm a door-mat in real life. Hope you guys grow out of that mentality before destroying yourselves or going postal. "},{"id":628464,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1533449274,"body":"@guest123 Where exactly is the empathy in fantasizing yourself as powerful or rich or good looking like the elites, the rich, or the stars like in Hollywood, hmm? More like envy (and to some point, jealousy) if you ask me. And yet here you are, confusing the two. I bet you just visualize yourself as the shota because you wanted that older girl that would bring you into adulthood during your life of childhood. Now that's what I call pitiful wishful thinking. Especially thinking that the whole world owes you and should just back the fuck off from your girl that you're pining after. I guess then love triangle soap operas is not something you can stomach. You should just go back to watching harem animes or Miyazaki films and reading some vanilla/harem doujins. Just turn off the NTR tags.\n\nFinally to top it all off, #cucktheshotas\n\nShotas were a goddam mistake. Especially Oneeshota. I wonder who likes that kind of trash... Enjoying the sight of a mouse trying hard to fuck a lioness..."},{"id":628388,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1533448805,"body":"@guest123 Either way, keep empathizing. Empathy, sympathy, and mercy is not always a sign of goodness and virtue. It's sometimes just a sign of weakness, especially when its directed to people that don't deserve it. I bet you are the type to sympathize with those pathetic beta male MCs that are in proliferant in harem animes, like Rito from To-Love-Ru. Well, if you identify as a pussy male or empathize for them, then good for you. How sad and pathetic. While NTR gives chances for all, whether you're ugly or a stud. But mostly to the ugly ones. Why? When was the last time you ever seen a romance or harem involving an ugly guy? And if by some rare chance you did, how many of them are out there compared to the average to hot MCs out there? Even the \"average\" ones are relatively good-looking. But hey, whatever makes you feel good about yourself, huh? While too bad, so sad for people who just can't roll with that at all. "},{"id":628343,"gallery_id":239217,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1533448496,"body":"@guest123 Do you even hear yourself? You don't need empathy to fantasize that you're the main hero, especially in power trip fantasies. The MC could be silent or be interesting as a cardboard box and people could still put themselves into their shoes. That's why a lot of RPGs used to have that nameless protag. It's hard to emulate yourself through a pre-established MC, especially ones you can't relate to at all. That's why these NTRs happen in the first place, because some people can't relate to the main guy at all. You do know that any work of fiction where the main guy loses the girl to another person is considered NTR, specifically to the Japanese. You may call it cuck, but it's called survival of the fittest. If you think life is all about giving fairness to the lesser man, then you are the one that is living in pitiful fantasy. Empathy may be good and all, but if you empathize too much, you could even empathize with the person who either kill you or ruin your life. "},{"id":588844,"gallery_id":239217,"poster":{"id":1719463,"username":"JagiOfficial","slug":"jagiofficial","avatar_url":"avatars/1719463.png?_=c579a2638559b729","is_superuser":false,"is_staff":false},"post_date":1533176104,"body":"you guys just let it all out as the real men sit back and watch *eats popcorn...*"},{"id":584533,"gallery_id":239217,"poster":{"id":1688591,"username":"torjak","slug":"torjak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1532981317,"body":"@guess123 You are also one of those people that finds satisfaction in depriving others of their choice of entertainment. There is a reason why hentai/porn have certain tags to cater each and every individuals fetishes. You will not see me complain on vanilla hentais being too mellow because that is what that genre is about, and I enjoy it as it is. You on the other hand is the real sadist, making people feel bad about their fantasy.  "},{"id":584525,"gallery_id":239217,"poster":{"id":1688591,"username":"torjak","slug":"torjak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1532980512,"body":"@guest123 You know your argument is invalid when you mentioned in your own words that woman domination is an NtR trait, which is exactly what I am pointing out and which I specifically singled out. And it is clear as broad day light on my previous comment that I am only attributing such traits into this particular genre, therefore not generalizing and making it basis for other such as vanillas. You are one of those people that argue over things at the wrong place. As you said this is NtR domain so why are you throwing out tantrums on this genre if you know exactly what you will get. I find it stupid and illogical."},{"id":582672,"gallery_id":239217,"poster":{"id":1769262,"username":"vonSalza","slug":"vonsalza","avatar_url":"avatars/1769262.png","is_superuser":false,"is_staff":false},"post_date":1532772441,"body":"There has only been one NTR that has made me feel bad, an incestual manga that I read of two cousins and cousins (the problem is not that they are familiar), one of them lost a game of ejaculating first, he did not have a gifted penis and his cousin he stayed with his cousin and his sister, all in sexual ecstasy; Only at the end and out of pity or compassion did they let him fuck one of the cousins, but it was clear who was the owner of both.\n\nThe NTR denigrates humanity in our own person in all involved, takes away personality and makes them dependent on a natural attribute (such as the penis or vagina), is not based on love but in a pathological love, in vain wish. At least the incest, when there are occasions of true acts of love between one and another (rare thing in nature) does not denigrate.\n\nThe NTR serves for reflection, to masturbate for the aesthetics of the characters but should not be promoted among people the express desire to commit it to others."},{"id":579750,"gallery_id":239217,"poster":{"id":1682421,"username":"guest123123123","slug":"guest123123123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1532483836,"body":"@tomoko\nWhat's your point? Also, domination takes multiple forms. \n@torjak\nBullshit. A woman does not need an abrasive guy to be pleasured. They also don't need some random guy being humiliated. That's ntr's defining trait. You say there's nothing lying underneath, while also saying there's somehing to be understood. I don't get sexual pleasure from some guy being taken advantage of or humliated. Doesn't mean I insert myself into their shoes, it means I have empathy. If people couldn't empathize with others on some level, they wouldn't enjoy fiction and they wouldn't consume porn. Ntr fans seem to either be insecure sadists, or meek masochists. You can dominate over a girl without stepping on some random guy.  "},{"id":577632,"gallery_id":239217,"poster":{"id":995971,"username":"InmortalLucia","slug":"inmortallucia","avatar_url":"avatars/995971.png","is_superuser":false,"is_staff":false},"post_date":1532219827,"body":"I don't like ntr but the art was decent. "},{"id":572746,"gallery_id":239217,"poster":{"id":1688591,"username":"torjak","slug":"torjak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531623762,"body":"@guest123 you clearly do not understand Ntr genre based on what you said. Ntr is about corrupting women and satisying their sexual urges, and any hentai where the woman is satisfied in the end always count as happy ending on my opinion. Your problem is you went self-insert mode and you try to put \"depth\" to porn/hentai. Then you wonder why you feel empty. The only emptiness you should experience is when you empty your balls fapping to this lol."},{"id":572382,"gallery_id":239217,"poster":{"id":34199,"username":"NullHorizon","slug":"nullhorizon","avatar_url":"avatars/34199.png","is_superuser":false,"is_staff":false},"post_date":1531587155,"body":"It's nice to see you too, metroid. It's just not the same nhentai when you go silent."},{"id":572134,"gallery_id":239217,"poster":{"id":1158893,"username":"_Tomoko_Kuroki_","slug":"_tomoko_kuroki_","avatar_url":"avatars/1158893.png?_=77d7062981bdbcaa","is_superuser":false,"is_staff":false},"post_date":1531563669,"body":"Butt hurt vanilafags lmao↓"},{"id":572098,"gallery_id":239217,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1531559875,"body":"Yes get even more  butthurt vanillafags Your anger sustains me little bitches LOL"},{"id":571490,"gallery_id":239217,"poster":{"id":1084824,"username":"randomwarrior","slug":"randomwarrior","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531494406,"body":"Thats right, fuck shotas"},{"id":571358,"gallery_id":239217,"poster":{"id":1486444,"username":"Dartricxz193","slug":"dartricxz193","avatar_url":"avatars/1486444.png","is_superuser":false,"is_staff":false},"post_date":1531479102,"body":"YEAH!! that kid got cucked!! hahaha i feel sorry for him!! he almost got the pussy!"},{"id":570786,"gallery_id":239217,"poster":{"id":1158893,"username":"_Tomoko_Kuroki_","slug":"_tomoko_kuroki_","avatar_url":"avatars/1158893.png?_=77d7062981bdbcaa","is_superuser":false,"is_staff":false},"post_date":1531417141,"body":"It's called a domination fetish you fucktard @guest123123123\nAlso I while I didnt fap to this I thought it was fucking hilarious how her uncle cucked then little kid lmao\nComedy gold"},{"id":570632,"gallery_id":239217,"poster":{"id":451955,"username":"MrDevz","slug":"mrdevz","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531396748,"body":"I don't hate nor like NTR, what i like is whenever i see NTR doujin, i read it and head to the comments, see a bloodbath between Vanilla and NTR lover.\nNow that's what i call real entertainment that i could fap with lol."},{"id":570629,"gallery_id":239217,"poster":{"id":275404,"username":"bickid","slug":"bickid","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531395873,"body":"This uncle is my idol,my aspiration. And fuck her, she was pushing a sex relationship with a little boy, fucking female pedophile. "},{"id":570350,"gallery_id":239217,"poster":{"id":1682421,"username":"guest123123123","slug":"guest123123123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531355856,"body":"Anybody that wants to kill other people because of their fetishes is emotionally stunted, but the people that like ntr must be very empty inside. Why would I place myself in the shoes of an unsympathetic character? It's not written from his perspective. "},{"id":570289,"gallery_id":239217,"poster":{"id":1774006,"username":"Yukie","slug":"yukie","avatar_url":"avatars/1774006.png","is_superuser":false,"is_staff":false},"post_date":1531346273,"body":"Yikes. NTR Garbage"},{"id":570205,"gallery_id":239217,"poster":{"id":1341823,"username":"Meow_5645","slug":"meow_5645","avatar_url":"avatars/1341823.png?_=6575cff4c5c747b3","is_superuser":false,"is_staff":false},"post_date":1531336569,"body":"This was sooo gooooood. At least that guy was not fat and ugly.... LOL. "},{"id":570191,"gallery_id":239217,"poster":{"id":1230299,"username":"ItsAtlas","slug":"itsatlas","avatar_url":"avatars/1230299.png?_=17a96b9c3a1d3145","is_superuser":false,"is_staff":false},"post_date":1531334719,"body":"Not much character development so it doesnt even feel like someone got cucked but raped"},{"id":570184,"gallery_id":239217,"poster":{"id":1158893,"username":"_Tomoko_Kuroki_","slug":"_tomoko_kuroki_","avatar_url":"avatars/1158893.png?_=77d7062981bdbcaa","is_superuser":false,"is_staff":false},"post_date":1531333952,"body":"Kill all vanillafags"},{"id":570119,"gallery_id":239217,"poster":{"id":1034719,"username":"Y v N G s v s h i","slug":"y-v-n-g-s-v-s-h-i","avatar_url":"avatars/1034719.png","is_superuser":false,"is_staff":false},"post_date":1531327750,"body":"when reality hits and you have to watch others fuck"},{"id":570108,"gallery_id":239217,"poster":{"id":34199,"username":"NullHorizon","slug":"nullhorizon","avatar_url":"avatars/34199.png","is_superuser":false,"is_staff":false},"post_date":1531325655,"body":"I'm not sure how to put it, but it's really weird that she started hooking up with a child in the first place. I mean, her uncle was obviously right about her showing off; with a figure like that, wearing a sundress by itself is ridiculous. And she knows the kid one day, and already she's up for going all the way? I'm not usually this judgmental, but damn. ...As an aside, I actually get the feeling, somehow, that the uncle's the sort who would take the boy under his wing and show him what's what. I dunno why, it just seems that way to me, y'know?"},{"id":570079,"gallery_id":239217,"poster":{"id":1125796,"username":"jkhinooo","slug":"jkhinooo","avatar_url":"avatars/1125796.png","is_superuser":false,"is_staff":false},"post_date":1531321381,"body":"this is why i like arakure works... nice NTR"},{"id":570077,"gallery_id":239217,"poster":{"id":263256,"username":"Dejavuu","slug":"dejavuu","avatar_url":"avatars/263256.png","is_superuser":false,"is_staff":false},"post_date":1531321085,"body":"I hate shotas. So this is a past. Nice job"},{"id":570028,"gallery_id":239217,"poster":{"id":756917,"username":"Miku_loli","slug":"miku_loli","avatar_url":"avatars/756917.png?_=f9cb89b1592b7a90","is_superuser":false,"is_staff":false},"post_date":1531313296,"body":"If u enjoy NTR u truly live a sad life."},{"id":569983,"gallery_id":239217,"poster":{"id":1516349,"username":"estarossa13","slug":"estarossa13","avatar_url":"avatars/1516349.png","is_superuser":false,"is_staff":false},"post_date":1531309786,"body":"Lmao raging vanillafags"},{"id":569976,"gallery_id":239217,"poster":{"id":647443,"username":"Rimiru","slug":"rimiru","avatar_url":"avatars/647443.png","is_superuser":false,"is_staff":false},"post_date":1531309387,"body":"Cuckadoodledoo"},{"id":569963,"gallery_id":239217,"poster":{"id":705525,"username":"Paka","slug":"paka","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531307987,"body":"Waste of art that's what netorare and cuckold is. "},{"id":569952,"gallery_id":239217,"poster":{"id":1131465,"username":"DG28","slug":"dg28","avatar_url":"avatars/1131465.png?_=efd2c90a3d96e295","is_superuser":false,"is_staff":false},"post_date":1531306621,"body":"Genocide all cucks. "},{"id":569937,"gallery_id":239217,"poster":{"id":95316,"username":"xLance21","slug":"xlance21","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531303137,"body":"good, shota's deserve get cucked"},{"id":569932,"gallery_id":239217,"poster":{"id":462677,"username":"MadMax777","slug":"madmax777","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1531301601,"body":"Niceeeeeeeeee"},{"id":569907,"gallery_id":239217,"poster":{"id":661562,"username":"Sempaimaster","slug":"sempaimaster","avatar_url":"avatars/661562.png","is_superuser":false,"is_staff":false},"post_date":1531297214,"body":"Damn that @AllVanillafags dude even deleted his comment. Totally roasted."},{"id":569872,"gallery_id":239217,"poster":{"id":1602979,"username":"Badzkie","slug":"badzkie","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531292357,"body":"Kill This Bastard Already Damn It..."},{"id":569856,"gallery_id":239217,"poster":{"id":1218626,"username":"RedBitch","slug":"redbitch","avatar_url":"avatars/1218626.png?_=7e99ec8b59d762c8","is_superuser":false,"is_staff":false},"post_date":1531290455,"body":"Love the art styles so much "},{"id":569842,"gallery_id":239217,"poster":{"id":1209467,"username":"vickers","slug":"vickers","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531289231,"body":"😡😡😡😡😡😡😡............."},{"id":569833,"gallery_id":239217,"poster":{"id":334442,"username":"clonedshadow","slug":"clonedshadow","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1531288753,"body":"I was hoping for more :("},{"id":569829,"gallery_id":239217,"poster":{"id":712365,"username":"The Neko Mafia","slug":"the-neko-mafia","avatar_url":"avatars/712365.png","is_superuser":false,"is_staff":false},"post_date":1531288470,"body":"I always see the same people say they don't like NTR but is like on a majority of the hentai, and the saying to kill all cucks but who puts themselves in the position of the beta? Not the people enjoying the hentai that's for sure."},{"id":569759,"gallery_id":239217,"poster":{"id":642830,"username":"verybigmelon","slug":"verybigmelon","avatar_url":"avatars/642830.png","is_superuser":false,"is_staff":false},"post_date":1531278598,"body":"Clicks favorite 99999 times!!!!"},{"id":569745,"gallery_id":239217,"poster":{"id":1285035,"username":"Never.Forever","slug":"never-forever","avatar_url":"avatars/1285035.png","is_superuser":false,"is_staff":false},"post_date":1531276661,"body":"i always hate when the dude whos getting cucked decides to jerk off while watching, thats some gay shit."},{"id":569702,"gallery_id":239217,"poster":{"id":1661525,"username":"coolguy222","slug":"coolguy222","avatar_url":"avatars/1661525.png","is_superuser":false,"is_staff":false},"post_date":1531269014,"body":"I'm not really into ntr but holy shit did this man just cuck that kid."},{"id":569700,"gallery_id":239217,"poster":{"id":645718,"username":"Serrakura","slug":"serrakura","avatar_url":"avatars/645718.png","is_superuser":false,"is_staff":false},"post_date":1531268297,"body":"Ugh..... Arakure art never dissapoint us"},{"id":569692,"gallery_id":239217,"poster":{"id":41780,"username":"Mirza Maleik","slug":"mirza-maleik","avatar_url":"avatars/41780.png?_=96d8a4e1b15ad945","is_superuser":false,"is_staff":false},"post_date":1531267270,"body":"i dunno why it's always the same theme with this artist, i mean i don't mind ntr but goddamn son change it up a bit sometimes."},{"id":569667,"gallery_id":239217,"poster":{"id":1810331,"username":"Jankyassniggerdick","slug":"jankyassniggerdick","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531264656,"body":"@hithummah You're right, it's niggerare, because only niggers can get off to this shit."},{"id":569662,"gallery_id":239217,"poster":{"id":1302706,"username":"aymanbouyaya","slug":"aymanbouyaya","avatar_url":"avatars/1302706.png?_=ad4edb9685a8569b","is_superuser":false,"is_staff":false},"post_date":1531263838,"body":"What a bitch"},{"id":569653,"gallery_id":239217,"poster":{"id":712956,"username":"suzue","slug":"suzue","avatar_url":"avatars/712956.png","is_superuser":false,"is_staff":false},"post_date":1531262295,"body":"Arakure is damn good"},{"id":569648,"gallery_id":239217,"poster":{"id":1270298,"username":"Ignormie","slug":"ignormie","avatar_url":"avatars/1270298.png","is_superuser":false,"is_staff":false},"post_date":1531262038,"body":"instant fav"},{"id":569625,"gallery_id":239217,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1531260513,"body":"Too many \"nice guys\" in the comment section"},{"id":569618,"gallery_id":239217,"poster":{"id":987697,"username":"nchris","slug":"nchris","avatar_url":"avatars/987697.png","is_superuser":false,"is_staff":false},"post_date":1531259620,"body":"411 favs... 411 degenerates that in real life would get horny knowing that they are fucking the \"girlfriend\" of a kid who does not even have pubic hair. OK."},{"id":569601,"gallery_id":239217,"poster":{"id":48826,"username":"hithummah","slug":"hithummah","avatar_url":"avatars/48826.png","is_superuser":false,"is_staff":false},"post_date":1531257719,"body":"This is no ntr you morons. Just act your age and project yourself to the ugly bastard that you are IRL"},{"id":569598,"gallery_id":239217,"poster":{"id":1797784,"username":"Tony098","slug":"tony098","avatar_url":"avatars/1797784.png?_=be57b4b655ad8ebf","is_superuser":false,"is_staff":false},"post_date":1531257342,"body":"Like hell it would you'll fuck in your uncles place ,if its like that I'm going to kill that ugly bastard save my sister.\nOh I forgot only Japan people watch their fucking loves someone else right? Motherfucker"},{"id":569583,"gallery_id":239217,"poster":{"id":437292,"username":"HakuWillReturn","slug":"hakuwillreturn","avatar_url":"avatars/437292.png","is_superuser":false,"is_staff":false},"post_date":1531254681,"body":"Lol kid got bitch slapped"},{"id":569581,"gallery_id":239217,"poster":{"id":1218031,"username":"Schmand","slug":"schmand","avatar_url":"avatars/1218031.png","is_superuser":false,"is_staff":false},"post_date":1531254481,"body":"@AllVanillafags Because you apparently are too mentally challenged, here's a tutorial for you: Go to your profile -> Then under your profile picture click on \"Blacklist tags\"-> Click on the \"+\" next to blacklist tags and write \"netorare\" in there -> then save it. Done. No more NTR for you, it's that easy. "},{"id":569562,"gallery_id":239217,"poster":{"id":1810089,"username":"MLGYourMom","slug":"mlgyourmom","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1531252031,"body":"holy shit, i can't believe i came to that degenerate garbage.\ni really need to stop masturbating."},{"id":569491,"gallery_id":239217,"poster":{"id":990635,"username":"Sine","slug":"sine","avatar_url":"avatars/990635.png","is_superuser":false,"is_staff":false},"post_date":1531246933,"body":"Kill me.          "},{"id":569488,"gallery_id":239217,"poster":{"id":1800168,"username":"Iexpectedbettertodie","slug":"iexpectedbettertodie","avatar_url":"avatars/1800168.png","is_superuser":false,"is_staff":false},"post_date":1531246802,"body":"Kill Iexpectedbetter."}]