[{"id":2004513,"gallery_id":240297,"poster":{"id":4417821,"username":"Shieldson","slug":"shieldson","avatar_url":"avatars/4417821.png?_=187647d8754606a9","is_superuser":false,"is_staff":false},"post_date":1631171086,"body":"There’s a part 2 in Otokonoko HELL'S GATE #02 page 69. Wish it was translated though."},{"id":804232,"gallery_id":240297,"poster":{"id":1345024,"username":"GOD Tewi","slug":"god-tewi","avatar_url":"avatars/1345024.png?_=2fa51b8d90b38fe0","is_superuser":false,"is_staff":false},"post_date":1548969215,"body":"At least he said no homo lol"},{"id":697769,"gallery_id":240297,"poster":{"id":1665031,"username":"yomiya","slug":"yomiya","avatar_url":"avatars/1665031.png?_=974e85e473de2c06","is_superuser":false,"is_staff":false},"post_date":1538023833,"body":"@Tony98 You're a hypocrite,shut the fuck and get off your damn high horse. Don't act like you came here to criticize when you're here too, keep to yourself you dumpster fire"},{"id":653796,"gallery_id":240297,"poster":{"id":699810,"username":"hotzi","slug":"hotzi","avatar_url":"avatars/699810.png?_=ec672ee25651662c","is_superuser":false,"is_staff":false},"post_date":1534005994,"body":"\"I'm not gay, but you're so cute that I probably wouldn't mind fucking you\" - pickup line of the century"},{"id":651110,"gallery_id":240297,"poster":{"id":220552,"username":"Sammy Popheart","slug":"sammy-popheart","avatar_url":"avatars/220552.png?_=a37ea25cdcd7de40","is_superuser":false,"is_staff":false},"post_date":1533717675,"body":"Awesome. We definitely need more bisexual hentai."},{"id":582473,"gallery_id":240297,"poster":{"id":1584793,"username":"Fujoshi-Tan","slug":"fujoshi-tan","avatar_url":"avatars/1584793.png","is_superuser":false,"is_staff":false},"post_date":1532756350,"body":"Man, this sure is a comment section"},{"id":580819,"gallery_id":240297,"poster":{"id":1564264,"username":"MasterSaku","slug":"mastersaku","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1532603889,"body":"\"I'm not gay, but you're so cute that I probably wouldn't mind fucking you\"\nSee, it's stuff like that that makes you sound gay, dude."},{"id":580139,"gallery_id":240297,"poster":{"id":1477270,"username":"Crepe$","slug":"crepe","avatar_url":"avatars/1477270.png?_=63b4aed506d39132","is_superuser":false,"is_staff":false},"post_date":1532529104,"body":"@captainweekend also Aogiri Penta is my favorite trap artist of all time, I literally love almost everything he makes I even liked that work of his which the user \"FutaKnight\" bashed on (Costte!! Toilet no Hanako-kun) because it was on first person perspective which isn't a bad thing if done right and that was what Aogiri did, also I recently shat on Papa Katsu! By Binto but yeah Binto is outright praise worthy for his work on Nii-chan wa Bitch Gyaru, that was transcendent af, and Damn Po-Ju is amazing, I just wished he'd make more lengthy stuff soon."},{"id":580129,"gallery_id":240297,"poster":{"id":1477270,"username":"Crepe$","slug":"crepe","avatar_url":"avatars/1477270.png?_=63b4aed506d39132","is_superuser":false,"is_staff":false},"post_date":1532528595,"body":"@captainweekend that's understandable, I really just preferred how Konnyaku handles things but seriously though Chinzu did make a lot of good stuff, I just couldn't get into most of it, this has been my issue since I've known luckily someday his/her style will grow on me (which is probably slowly happening because I read the entirety of his Chin doujin) but yeah you're quite right there this all falls down to preferences, the reason Shiroo isn't even in my favorites, because I have similar issue, he did make some outright God Tier stuff but there is always this part of him to just makes him fall, but regardless he's still a good artist same with the 2 you mentioned."},{"id":580109,"gallery_id":240297,"poster":{"id":447871,"username":"captainweekend","slug":"captainweekend","avatar_url":"avatars/447871.png","is_superuser":false,"is_staff":false},"post_date":1532527320,"body":"@HentaiCrepes also binto, po-ju, and aogiri penta are all artists that deserve more credit and are far better than shiroo and konnyaku"},{"id":580063,"gallery_id":240297,"poster":{"id":447871,"username":"captainweekend","slug":"captainweekend","avatar_url":"avatars/447871.png","is_superuser":false,"is_staff":false},"post_date":1532525392,"body":"@HentaiCrepes konnyaku's and chinzu's style are so similar (to the point that I reckon most people don't even realize they're different artists) that really any criticism of a particular element of their work can be just as viable against the other. I think it ultimately comes down to personal preference. I think that chinzu has been consistantly good, whereas konnyaku has done a lot of good work, but has a lot that is just meh.(especially since he does a lot of futa).\n\nAlso I didn't mean to undersell shiroo, as he's done some of my favourite doujins ever (trap or otherwise) but really it does come down to him having a similar issue to konnyaku, just not as big a library of good works, especially compared to nagi ichi and zenra."},{"id":579908,"gallery_id":240297,"poster":{"id":1477270,"username":"Crepe$","slug":"crepe","avatar_url":"avatars/1477270.png?_=63b4aed506d39132","is_superuser":false,"is_staff":false},"post_date":1532507040,"body":"@Tony098 This is the internet, stop threatening people because of what they like and show some respect, atleast they aren't taking drugs or being rapists irl, so fuck off!"},{"id":579900,"gallery_id":240297,"poster":{"id":1477270,"username":"Crepe$","slug":"crepe","avatar_url":"avatars/1477270.png?_=63b4aed506d39132","is_superuser":false,"is_staff":false},"post_date":1532506378,"body":"@captainweekend If you didn't know Konnyaku hasn't even released some of his best art in this site, if you wanna see what I'm talking about check this out: https://www.pixiv.net/member_illust.php?mode=medium&amp;illust_id=67862307 and https://www.pixiv.net/member_illust.php?id=77467&amp;type=illust he literally has like 4 unreleased doujins online which are probably were he utilizes his style properly, but I mean he already gave us Trap Of Astolfo and Nerawareta Ani which are God Tier, so I suggest checking out those links, also yeah Nagi Ichi is the G.O.A.T. I can't believe how awesome his style is, and as for Zenra QQ yeah he is great but it's kinda debatable whether he is better than Shiroo, the only work I like from what I've seen from him was Merry Pokochins https://nhentai.net/g/182143/ But regardless he's a great artist."},{"id":579895,"gallery_id":240297,"poster":{"id":1477270,"username":"Crepe$","slug":"crepe","avatar_url":"avatars/1477270.png?_=63b4aed506d39132","is_superuser":false,"is_staff":false},"post_date":1532505788,"body":"@captainweekend but yeah the way I see it Chinzu actually Utilizes his style best on the Chin doujin: https://nhentai.net/g/158268/ which is by far his best work and the part where he gets out of his comfort zone and doesn't just stick with one sex postion, still though not my cup of tea and I find some of his stuff to lack of impact, there wasn't enough shading in some of his drawings which just really left me in a dull state, what I like about Magifuro is that he adds impact to the sex scenes, he oversizes genitalia to make it look more intense and visually striking an example would be this https://nhentai.net/g/227805/10/ \nAnd yeah there are times when he just does too much and exaggerates it to death like in here https://nhentai.net/g/236195/ but the thing is in every new work he publishes he just keeps getting better and better. "},{"id":579892,"gallery_id":240297,"poster":{"id":1477270,"username":"Crepe$","slug":"crepe","avatar_url":"avatars/1477270.png?_=63b4aed506d39132","is_superuser":false,"is_staff":false},"post_date":1532504989,"body":"@captainweekend LMFAO l who the fuck thinks Konnyaku is worse than Chinzu, in my Opinion they have the similar quality I just like Magifuro more because he literally experiments with things and tries out different, sure Magifuro can make a lot of garbage sometimes like this one https://nhentai.net/g/207571/ and can be out of hand with the oversized genitals at times but one thing's for sure atleast he doesn't draw his characters as if they look like some inhumanely looking blobs which was my problem Chinzu, Not that it's a bad thing that he draws them like that,bit actually makes his artstyle look more distinct and stand out which can attract some people I guess, but yeah like what I said I really find the way he draws some of the body really felt off and underwhelming, I mean at times he even draws genitalia very oddly that it doesn't even look like a dick."},{"id":579796,"gallery_id":240297,"poster":{"id":1297894,"username":"ExtremeYousoro","slug":"extremeyousoro","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1532490484,"body":"@Iexpectedbetter LOL"},{"id":579650,"gallery_id":240297,"poster":{"id":447871,"username":"captainweekend","slug":"captainweekend","avatar_url":"avatars/447871.png","is_superuser":false,"is_staff":false},"post_date":1532466424,"body":"@HentaiCrepes I don't know how you can reccomend konnyaku over chinzurena when his style is a lot worse. However, shiroo is good when it comes to trap doujins, but nothing compared to the greats like nagi ichi and zenra QQ."},{"id":579638,"gallery_id":240297,"poster":{"id":1751605,"username":"Black Santa","slug":"black-santa","avatar_url":"avatars/1751605.png?_=ac9b80d684364c53","is_superuser":false,"is_staff":false},"post_date":1532465270,"body":"Good shit... good shit"},{"id":579384,"gallery_id":240297,"poster":{"id":1104501,"username":"Bendover","slug":"bendover","avatar_url":"avatars/1104501.png","is_superuser":false,"is_staff":false},"post_date":1532444440,"body":"Reading chinz doujin is like playing lottery, without reading tags u dont know what u gonna get."},{"id":579363,"gallery_id":240297,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1532442018,"body":"@Tony098 How ironic why are you here then? spreading religion of peace or something? and how idiotic your comment is any rape crime you commit is basically you are fucked in every country if you get caught not just in some other country and if you meant raping/banging young boys complain that on the middle east where such thing is a rampant thing to do and half of the people who probably likes to read this kind of thing prefer jacking off to it or whatever rather than doing any crime in real world like how naive are you? do you think every person who visit site like this are people who don't have a brain and just will rape anything what will they see or anything that moves."},{"id":579242,"gallery_id":240297,"poster":{"id":1268066,"username":"FledBeast578","slug":"fledbeast578","avatar_url":"avatars/1268066.png","is_superuser":false,"is_staff":false},"post_date":1532427633,"body":"I may be fine with yaoi, I may be fine with shotacon, but tag your fucking cheating!"},{"id":579073,"gallery_id":240297,"poster":{"id":1810573,"username":"UnfortunatelyAlive","slug":"unfortunatelyalive","avatar_url":"avatars/1810573.png","is_superuser":false,"is_staff":false},"post_date":1532406755,"body":"@Tony098 Thanks, I will write that on my list of things that I don't give a fuck"},{"id":579065,"gallery_id":240297,"poster":{"id":312284,"username":"The Loosest Foreskin Of West","slug":"the-loosest-foreskin-of-west","avatar_url":"avatars/312284.png","is_superuser":false,"is_staff":false},"post_date":1532405841,"body":"Tony098 I'll fuck you till you love me "},{"id":579057,"gallery_id":240297,"poster":{"id":1797784,"username":"Tony098","slug":"tony098","avatar_url":"avatars/1797784.png?_=be57b4b655ad8ebf","is_superuser":false,"is_staff":false},"post_date":1532404751,"body":"Lucky you people are hiding some whole piece of shit of four walls and\nDoing this kind of thing , If ur outside\nin the world people in other countries will defenitly kill you bastards ."},{"id":579052,"gallery_id":240297,"poster":{"id":1797784,"username":"Tony098","slug":"tony098","avatar_url":"avatars/1797784.png?_=be57b4b655ad8ebf","is_superuser":false,"is_staff":false},"post_date":1532404585,"body":"Well lucky he's not seen if he has I will kick in his dick and punch him in the face ."},{"id":579000,"gallery_id":240297,"poster":{"id":510270,"username":"Lucas Underwear","slug":"lucas-underwear","avatar_url":"avatars/510270.png","is_superuser":false,"is_staff":false},"post_date":1532397603,"body":"New of Chinzurena, yeah baby!!! x3 ❤"},{"id":578980,"gallery_id":240297,"poster":{"id":1477270,"username":"Crepe$","slug":"crepe","avatar_url":"avatars/1477270.png?_=63b4aed506d39132","is_superuser":false,"is_staff":false},"post_date":1532395579,"body":"I was never a fan of how chinzurena draws stuff and sometimes find his art to be overrated, but for some reason this turned me on, It felt like Chinzu didn't over do the aspect I disliked about him and that was to not make body parts especially the genetalia look like it should be intented to, but yeah this was a fine work of his, but I still find him to be not as good as people call him out to be, Magifuro Konnyaku and Shiroo are the trap artists who should be praised for their art ffs go check them out! but yeah I'd give this a 7/10 it was hot."},{"id":578925,"gallery_id":240297,"poster":{"id":25571,"username":"Frozzy","slug":"frozzy","avatar_url":"avatars/25571.png?_=738fe647d8f406fe","is_superuser":false,"is_staff":false},"post_date":1532388664,"body":"nice lil traps cum from their butts being licked"}]