[{"id":650978,"gallery_id":241728,"poster":{"id":36381,"username":"maverih345456","slug":"maverih345456","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1533706302,"body":"and the last one 4.\"Kalesh is dekinai\" by Jyunpu (『カレシがデキナイ』by じょぶじゅん。) :A teenage girl who is a virgin and never gets luck in getting a boyfriend due to her vanity ,But after she ordered a sex toy and is about to masturbate in front of her mirror it become sentinel and takes on the male version of herself so it can have sex to get rid of her virginity."},{"id":650976,"gallery_id":241728,"poster":{"id":36381,"username":"maverih345456","slug":"maverih345456","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1533706155,"body":"2.\"Honto no Ozomi\" by Kaihata Yu (『ホントノノゾミ』by 成海優) : It tells about a teenager who is using a phone app to create a female version of himself who can give him sexual pleasure but in a twist,The female clone switch minds with him so she can take over his life and turn him into her sex toy.\n\n3.Runaway! Childcare Android\" by Ayu Kirishima (『暴走!育児アンドロイド』by 霧島鮎): A lolicon obsessed scientist creates a prototype female android which was used to take care of children though  he copied personalities of himself into it,But then a cabinet fell on the android and the scientist is trying to save her only for its chemicals to spill on him and regressed him into a shota and his android is activated however since she is female she is obsessed with shotacon as she  has the scientists personality and obsession with lolicon that she is going to have sex with him \n"},{"id":650975,"gallery_id":241728,"poster":{"id":36381,"username":"maverih345456","slug":"maverih345456","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1533706035,"body":"This is the second volume of the TS genderbend selfcest erotic manga anthology called 2D Comic Magazine TS Jibun Heroine mou Hitori no Ore ga Erosugite Gaman Dekinee! 1.\"Clone Girl Love Fuck\" by Kanno Takashi (『クローンガール ラブファック』by 菅野タカシ) : Taking place in the near future where the military are creating clone soldiers from the DNA of volunteers ,One american soldier is training his female clone named Sally who doesn't like to beaten by him too many times,But using the memories she obtained from him since she is his clone She is going to counter attack him by attacking his weak points 'sexually',At the end during the shower,the soldier is still shocked that Sally beat him but tells her he will do a rematch with her next time which Sally accepts the challenge"}]