[{"id":654205,"gallery_id":242195,"poster":{"id":688661,"username":"悲伤","slug":"bei-shang","avatar_url":"avatars/688661_dOSwRDA.png","is_superuser":false,"is_staff":false},"post_date":1534046952,"body":"Whenever I hear that song, what happened on that day comes flooding back to me. It was during summer vacation, and Airi-san invited me into her bedroom. With a lewd smile, she slowly pulled her shorts off, and climbed onto the bed, on all fours."},{"id":654203,"gallery_id":242195,"poster":{"id":688661,"username":"悲伤","slug":"bei-shang","avatar_url":"avatars/688661_dOSwRDA.png","is_superuser":false,"is_staff":false},"post_date":1534046798,"body":"I was greeted with the view of her ass facing me, hidden only by the fabric of her panties. I stared at the scene, taking in the “shape of woman” that she displayed for me while the evening light streamed in through the window. I could see she was wet through her panties as she slowly lowered them."},{"id":654202,"gallery_id":242195,"poster":{"id":688661,"username":"悲伤","slug":"bei-shang","avatar_url":"avatars/688661_dOSwRDA.png","is_superuser":false,"is_staff":false},"post_date":1534046672,"body":"I’d seen female genitalia on the Internet many times. To be honest, seeing it in the flesh seemed like a grotesque thing to me. Airi-san once again displayed herself for me, spreading her ass with her hands so I could get a good look. Airi-san lived in the same apartment building as me, and I’d known her for years. And now I was staring at her nude body, and smelling her lewd smell. It was like a dream."},{"id":654199,"gallery_id":242195,"poster":{"id":688661,"username":"悲伤","slug":"bei-shang","avatar_url":"avatars/688661_dOSwRDA.png","is_superuser":false,"is_staff":false},"post_date":1534046521,"body":"Sliding my penis inside her, I was overwhelmed by the warmth and feel of her and ejaculated immediately. She was very understanding, and we lay there together talking with me about things. Knowing her husband would be home soon, I buried my face in her breasts, and told her, “I wish time would just stop for both of us right now.” Tears filled her eyes at this, and she hugged me fiercely. “I couldn’t think of a way to tell you, but we’re moving next month.”"},{"id":654197,"gallery_id":242195,"poster":{"id":688661,"username":"悲伤","slug":"bei-shang","avatar_url":"avatars/688661_dOSwRDA.png","is_superuser":false,"is_staff":false},"post_date":1534046366,"body":"But we still had some time before she was to move, and we had sex many times together. I’ll never forget what it felt like, holding her in my arms, sharing our secret together."}]