[{"id":899427,"gallery_id":242881,"poster":{"id":506017,"username":"haraman","slug":"haraman","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1557431602,"body":"Алло, это /po/?"},{"id":660330,"gallery_id":242881,"poster":{"id":1875817,"username":"n00dle","slug":"n00dle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534540810,"body":"As for bankruptcy, Japanese has the highest debt to GDP ratio in the entire world at well over 200%. Not that this actually matters, because the yen is a sovereign currency that the Japanese government is the sole issuer of. 'Debt' is a meaningless concept in such a scenario."},{"id":660327,"gallery_id":242881,"poster":{"id":1875817,"username":"n00dle","slug":"n00dle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534540590,"body":"\"WHICH IS WHY JAPAN WAS REBUILT AND BECAME A PROSPEROUS COUNTRY, INSTEAD OF LANGUISHING AS A ROTTEN, BANKRUPT HELLHOLE RULED BY TYRANNICAL MONSTERS LIKE ALL THE STATES THE SOVIET UNION GAINED CONTROL OVER.\"\n\nJapan had been essentially a one-party state for over half a century, something the United States very approves of and supports. Japan never truly underwent an equivalent of denazification, and many war criminals and others closely tied to Imperial Japanese warmongering quietly reentered Japanese politics after the end of the American occupation, often with CIA support. As long as they were anti-communist, the US was happy to put them in charge of its unsinkable aircraft carrier.\n\nOne of the reasons Japan was able to so quickly recover was prosper was because it was essentially centrally planned out of the Ministry of International Trade and Industry (MITI)."},{"id":660323,"gallery_id":242881,"poster":{"id":1875817,"username":"n00dle","slug":"n00dle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534540055,"body":"\"WE KNEW THE PSYCHOTIC JAPS WHO HAD BEEN FIGHTING TO THE LAST MAN FOR THE WHOLE FUCKING WAR WOULD NEVER SURRENDER AFTER A MERE DEMONSTRATION (WHICH IS WHY WE HAD TO BOMB NAGASAKI AFTER HIROSHIMA)\"\n\nThe Japanese were already trying to surrender, and we knew it. And the Nagasaki bombing seems to have an entirely automatic process; the whole affair just went through the bureaucracy and  the second bomb was dropped as soon as it was possible. Truman never actually specified a second bombing.\n\n\"WAITING FOR JAPAN TO STARVE OUT WOULD'VE COST HUNDREDS OF MILLIONS MORE CIVILIAN LIVES\"\n\nThe entire population of Japan was less than 72 million in 1945.\n\n\"DROPPING THE BOMB TOLD THE RUSSIANS (WHO HAD JUST DECLARED WAR ON JAPAN AND WERE MOBILIZING)\"\n\nThe Soviets declared war and invaded Manchuko on August 9th. Hiroshima was nuked on August 6th. And the Soviets didn't stop their offensive operations until the Japanese surrender on September 2nd. Your timeline is completely nonsensical."},{"id":660314,"gallery_id":242881,"poster":{"id":1875817,"username":"n00dle","slug":"n00dle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534539246,"body":"Even if were some reason we simply *had* to use the nukes, something the historical record doesn't at all support, we didn't have to start by immediately dropping them over city centers (Hiroshima actually had a military base with 20,000 soldiers. It survived mostly unscathed). We could have glassed a deserted island, or nuked a significant military target. The battleship Nagato, Japan's last still afloat capital ship, had survived a conventional air raid in the middle of July. We could have reduced her to melted slag and the Yokusoka Naval Arsenal to an inferno, all with a single bomb. We ended up nuking Nagato anyway during post-war tests."},{"id":660310,"gallery_id":242881,"poster":{"id":1875817,"username":"n00dle","slug":"n00dle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534538771,"body":"Yeah, that's basically a bunch of gibberish, Im_a_fucking_sinner. MacArthur didn't agree with dropping the bomb, and in fact was never even consulted. Ralph Bard, Undersecretary of the Navy, disagreed with the bombs. Leahy, Chairman of the Joint Chiefs of Staff, disagreed with their use. There wasp lenty of dissent. We were well aware the Japanese were already making attempts at a negotiated surrender via Moscow mediation, and there were plenty of voices in the Truman administration who advised letting the Japanese know they could keep their Emperor, their number one concern (in the end they were allowed to keep him even after unconditionally surrendering). The claim we had to nuke them rests on the false assumption that there was no alternative to invasion. Plenty of people just wanted to keep blockading the home islands. The post-war Strategic Bombing Survey assessed that the nukes weren't needed and continued sea-mining of shipping lanes would have done the job by November 1945."},{"id":659480,"gallery_id":242881,"poster":{"id":1786832,"username":"KiyohimeLancer","slug":"kiyohimelancer","avatar_url":"avatars/1786832.png","is_superuser":false,"is_staff":false},"post_date":1534470487,"body":"And so, we fap.\n\nThe End"},{"id":659350,"gallery_id":242881,"poster":{"id":1873425,"username":"Im_a_fucking_sinner","slug":"im_a_fucking_sinner","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534459493,"body":"WE'D SEEN AND SUFFERED THE LENGTH AND BREADTH OF THE CRUELTY INFLICTED BY THE AVERAGE JAPANESE SOLDIER, WHO WAS A BULLY, A RAPIST AND A MISERABLE LITTLE FUCK WITH ABSOLUTELY NO RESPECT FOR HUMAN LIFE. SO WHEN WE FINALLY REACHED MAINLAND JAPAN, BELIEVE ME WHEN I SAY WE JUST DIDN'T GIVE A FUCK ABOUT HOW HUMANE THE BOMBS WERE. THEY MADE OUR VICTORY EASIER, AND THAT'S ALL WE FUCKING CARED ABOUT. AND THE JAPS, TO THIS DAY, HAVE THE FUCKING GALL TO BITCH AND WHINE ABOUT HOW THOSE MEAN OLD AMERICANS NUKED THEM, BUT THEY REFUSE TO TAKE RESPONSIBILITY FOR THE WANTON MURDER, RAPE AND CRUELTY INFLICTED BY THEIR OWN GOVERNMENT. YOU REAP WHAT YOU SOW, AND IN 1945, THE JAPS REAPED HELLFIRE. DEAL WITH IT."},{"id":659345,"gallery_id":242881,"poster":{"id":1873425,"username":"Im_a_fucking_sinner","slug":"im_a_fucking_sinner","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534459361,"body":"BUT YOU KNOW WHAT? NONE OF THAT FUCKING MATTERS. ALL THAT ASIDE, THE TRUTH, THE REAL, HONEST, BRUTAL TRUTH, IS THAT BY 1945, WE DIDN'T GIVE A SINGLE ROTTEN FUCK WHAT HAPPENED TO THOSE LITTLE SLANT-EYED BASTARDS. BY THAT TIME WE KNEW ABOUT THE BATAAN DEATH. MARCH. WE KNEW ALL ABOUT THE POW'S WHO WERE MACHINE-GUNNED THEN DUMPED INTO TRENCHES. WE KNEW ALL ABOUT THE RAPE-HOUSES IN THE PHILIPPINES WHERE WOMEN WERE LITERALLY RAPED TO DEATH. WE'D SEEN THE PICTURES OF OUR SOLDIERS HAVING THEIR HEADS CHOPPED OFF BY SMIRKING LITTLE CUNT COWARDS WITH CHEAP \"KATANAS,\" SO PROUD OF BEING BIG BAD WARRIORS FOR THE EMPEROR. "},{"id":659341,"gallery_id":242881,"poster":{"id":1873425,"username":"Im_a_fucking_sinner","slug":"im_a_fucking_sinner","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534459241,"body":") SURE, THE B-29 AIRDROPPED MINING CAMPAIGN HAD SHUT DOWN 95% OF ALL SHIPPING TRAFFIC TO THE HOME ISLANDS IN JUST A FEW MONTHS, COMPLETELY CUTTING OFF JAPAN FROM FOOD SUPPLIES, AND WAITING FOR JAPAN TO STARVE OUT WOULD'VE COST HUNDREDS OF MILLIONS MORE CIVILIAN LIVES THEN THE BOMBINGS. SURE, DROPPING THE BOMB TOLD THE RUSSIANS (WHO HAD JUST DECLARED WAR ON JAPAN AND WERE MOBILIZING) THAT THEY WEREN'T GOING TO GET THEIR FILTHY FUCKING COMMIE MITTS ON JAPAN IN THEIR POSTWAR LAND-GRAB, WHICH IS WHY JAPAN WAS REBUILT AND BECAME A PROSPEROUS COUNTRY, INSTEAD OF LANGUISHING AS A ROTTEN, BANKRUPT HELLHOLE RULED BY TYRANNICAL MONSTERS LIKE ALL THE STATES THE SOVIET UNION GAINED CONTROL OVER. "},{"id":659339,"gallery_id":242881,"poster":{"id":1873425,"username":"Im_a_fucking_sinner","slug":"im_a_fucking_sinner","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534459119,"body":" I'M TIRED OF SEEING THIS STUPID DEBATE SO LET'S GET ONE THING STRAIGHT. SURE, THERE WERE A FUCK TON OF PERFECTLY LEGIT REASONS FOR DROPPING THE BOMB. SURE, WE KNEW THE PSYCHOTIC JAPS WHO HAD BEEN FIGHTING TO THE LAST MAN FOR THE WHOLE FUCKING WAR WOULD NEVER SURRENDER AFTER A MERE DEMONSTRATION (WHICH IS WHY WE HAD TO BOMB NAGASAKI AFTER HIROSHIMA) "},{"id":658710,"gallery_id":242881,"poster":{"id":1606377,"username":"iavoe","slug":"iavoe","avatar_url":"avatars/1606377.png","is_superuser":false,"is_staff":false},"post_date":1534401710,"body":"Thats some good.knowledges... but posted in a wrong place... right?"},{"id":658614,"gallery_id":242881,"poster":{"id":1875817,"username":"n00dle","slug":"n00dle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534394196,"body":"They can't understand why Western powers would sanction Japan over Japanese crimes in China. What's more, they think China was within Japan's imperial sphere of authority anyway, and the West shouldn't dare to even utter an opinion on matters there. Revisionists contrive that Japan was under threat from an ABCD alliance, rather than an aggressor being sanctioned in response to illegal actions against China. The alliance devloped after and in response to Japanese warmongering."},{"id":658606,"gallery_id":242881,"poster":{"id":1875817,"username":"n00dle","slug":"n00dle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534393822,"body":"Broadly accurate, though Nitze being featured is completely misleading. He was talking about the late war mining and blockading of inter-island shipping. He was not talking about starving Japan in 1941, before they started the war with the Western powers. \n\nThat and the ridiculous portrayal of an ABCD encirclement of Japan reek of revisionism. This is basically Japan going and beating up its neighbors, and then whining that its surrounded by enemies. FDR didn't enact oil embargoes against Japan because he was friends with rich people in China (I'm not sure if the doujin author actually belives this or is just recounting what some Japanese at the time thought), he did it because he was appalled by what the Japanese were doing.\n\nThis seems to be a giant blind spot with many Japanese. They have no comprehension of what was done to China, and just kind of a dumb Homer Simpson slow blink response to outrage about it."}]