[{"id":661883,"gallery_id":243314,"poster":{"id":1447176,"username":"EvolutionKills","slug":"evolutionkills","avatar_url":"avatars/1447176.png?_=0a66d106fc025676","is_superuser":false,"is_staff":false},"post_date":1534679293,"body":"Also, the lines have no edges, another victim of the process. The originals are pretty clearly hand draw with pressure sensitive tools, mostly likely some sort of Wacom-esque drawing tablet or monitor. But the colored lines have no edges, because they're the product of a vector line tool, most likely in Adobe Illustrator or a similar editing program. Lines no longer have edges or sharp swooping curves that culminate in a point before continuing on. Everything is just uniform boring curves, because that's what vector line tools do, draw a curved line between two points. Nearly all of the originally artistry is lost in the process. Sure, you can copy the basic line structure and the proportions, but the colorized version is such an incredibly poor representation of the original work. There is just too much lost in translation."},{"id":661875,"gallery_id":243314,"poster":{"id":1447176,"username":"EvolutionKills","slug":"evolutionkills","avatar_url":"avatars/1447176.png?_=0a66d106fc025676","is_superuser":false,"is_staff":false},"post_date":1534678544,"body":"I definitely prefer the original line drawings. I can tell this isn't just coloring in the original art, but rather that this is a color filled trace of the originals. Unfortunately the tracing has eliminated a lot of the finer line work and the depth and richness of the original lines. Whereas the original line work had a variety of thickness and shades of darkness, the colorized lines are all uniformly black and thick, making all of the wonderful original work look muted and samey as all that information was lost in the tracing. Also there are plenty of detail missing, including the man's body hair, toenails, and the extra detailing on the lingerie. It is, overall, a poor facsimile of the original work. I much prefer the artistry present in the original work, than the substantial loss of detail and subtlety that was exchanged to get a pretty bland color pass."},{"id":661400,"gallery_id":243314,"poster":{"id":371356,"username":"EvilRyo","slug":"evilryo","avatar_url":"avatars/371356.png","is_superuser":false,"is_staff":false},"post_date":1534635750,"body":"The original black and white has been up and translated for some time. This is just a colored version. Click the artist tag "},{"id":661343,"gallery_id":243314,"poster":{"id":1645063,"username":"yumri","slug":"yumri","avatar_url":"avatars/1645063.png","is_superuser":false,"is_staff":false},"post_date":1534627340,"body":"i hope for more as they looked like it will make for a good continuing H-manga"},{"id":660961,"gallery_id":243314,"poster":{"id":1224843,"username":"BNANMN","slug":"bnanmn","avatar_url":"avatars/1224843.png","is_superuser":false,"is_staff":false},"post_date":1534599219,"body":"It look nice"},{"id":660934,"gallery_id":243314,"poster":{"id":1355909,"username":"Not someone to trust","slug":"not-someone-to-trust","avatar_url":"avatars/1355909.png?_=515476afcc69a2f4","is_superuser":false,"is_staff":false},"post_date":1534596491,"body":"Correction: There is shading, but not a extensive one. I did like the coloring except for the extremely light pink nipples"},{"id":660930,"gallery_id":243314,"poster":{"id":1355909,"username":"Not someone to trust","slug":"not-someone-to-trust","avatar_url":"avatars/1355909.png?_=515476afcc69a2f4","is_superuser":false,"is_staff":false},"post_date":1534596365,"body":"@cakelover22 That's because there's no shading and the background is on full white."},{"id":660897,"gallery_id":243314,"poster":{"id":729453,"username":"cakelover22","slug":"cakelover22","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1534592929,"body":"the coloring looks like it wasn't added at all."}]