[{"id":2011790,"gallery_id":24511,"poster":{"id":3341146,"username":"Frankie222","slug":"frankie222","avatar_url":"avatars/3341146.png?_=151f2e7094d6f151","is_superuser":false,"is_staff":false},"post_date":1631468485,"body":"Yeah I still got this"},{"id":1989917,"gallery_id":24511,"poster":{"id":3260081,"username":"lbnrPtk","slug":"lbnrptk","avatar_url":"avatars/3260081.png?_=304e9a23b9842b75","is_superuser":false,"is_staff":false},"post_date":1630615701,"body":"First time in my life I've stopped masterbating & started enjoying the story.\nThis story made me feel Sad & filled with anger. It's like I'm feeling Masaki. \nBEST HENTAI STORY"},{"id":1705736,"gallery_id":24511,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619661454,"body":"Also, props to Yamane telling Makoto how much of a punk he was for not telling Masaki anything and decided to be with his mother, not out of love, but out of a sense of superiority, trying to get a one up on him. Truly despicable. Loved how she told him how it was. Love the dialogue in this series."},{"id":1705730,"gallery_id":24511,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619661319,"body":"Finally, however, Miharu's decision of leaving her son without telling him really impacted me the most. It appears, that she could not believe her son saw her as a woman, and walking in on Masaki's sex time with Yamane only solidified her fear of such a situation, and she believed that she could not allow herself to fall into something so depraved, and it is understandable why she left after having been assaulted by her son. However, it never sat right with me that she practically abandoned her son, something she said she would regret doing, especially after her husband left a long time ago. And never told her son anything and decided to stay with Makoto, his \"friend\" That to me, was truly a terrible betrayal, but we at least learn more as to her thought process next volume. Continue on with the story, it gets very heated and interesting!"},{"id":1705722,"gallery_id":24511,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619661069,"body":"Miharu only approached Makoto in a motherly way, since he was having to pay for school by himself, so she felt as something good to at least pay for some of his meals to help him a little, however, Makoto took advantage of this kindness and motivated her to get into a relationship with him, not even considering what Masaki could have felt. Again, Miharu, Masaki's mother was also in the wrong for not telling her son for a year, however, Makoto was definitely the worst one between the two since he felt a sense of superiority of conquering his \"privileged\" friend's mother, and was even having those kinds of thoughts as he had his way with Miharu, a truly narcissistic, disgusting individual who deceived himself thinking he loves Miharu, when in reality he just did it for the kicks more so than anything. And showing Masaki that sex tape fully sealed the type of malicious person Makoto was, hurting Masaki and betraying Miharu's trust."},{"id":1705717,"gallery_id":24511,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619660765,"body":"Now that we get an understanding as to how Miharu and Makoto's relationship started, we can see there were no malicious intentions from the mother's end, however, like any \"positively\" budding relationship, she was emotionally motivated to do some things she should not have. However, it is understandable considering her past of having focused most her life in her career, making great strides, and raising her son since he was six years old by herself. So this relationship was something new for her that she felt like could have made happen. However, just being with your son's best friend invites so many problems, and the worst part about it though, I believe, is how the \"best friend\" being young and having many potential options in girlfriends, decides to be with his \"best friend's\" mom of all people, and never said anything for an entire year. The mother Miharu was definitely in the wrong for this as well, just as much, but we learn why she goes down this route in the next volume. "},{"id":1520142,"gallery_id":24511,"poster":{"id":3322860,"username":"shinjixx","slug":"shinjixx","avatar_url":"avatars/3322860.png?_=d38e3aa62f9843bc","is_superuser":false,"is_staff":false},"post_date":1611344652,"body":"Good work, URE-002 is the live adaptation "},{"id":917333,"gallery_id":24511,"poster":{"id":2475641,"username":"Planet Pepega","slug":"planet-pepega","avatar_url":"avatars/2475641.png","is_superuser":false,"is_staff":false},"post_date":1558895393,"body":"He is on top of my list rn\n"},{"id":137650,"gallery_id":24511,"poster":{"id":1221483,"username":"uMad","slug":"umad","avatar_url":"avatars/1221483.png","is_superuser":false,"is_staff":false},"post_date":1499408200,"body":"fvck this sht"}]