[{"id":870452,"gallery_id":245898,"poster":{"id":2375978,"username":"JapBoi","slug":"japboi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1554880765,"body":"Also I’ll translate the last page in depth because it was very noice.  It won’t be as nice without the illustrations, but I still wanted to do it\n\n70 and some years since we met... Today is our real parting (because she’d said she would leave but stayed with him). Had I accomplished good deeds during that time?\n\nI hope I was able to do so for you.\n\nLike you did for me.\n\nDaughter: “Mom? Where’s dad?”\nMother: “...he went to a far away country, dear”\nD: “Will I be able to see him again?”\nM: “Not for a while. After a long, long time, after you’ve grown up, and even further”\nSon: “Mom, let’s go. You’re going to go around to do good deeds, right?  I’ll help.”\nM: “All right, let’s go”\n"},{"id":870436,"gallery_id":245898,"poster":{"id":2375978,"username":"JapBoi","slug":"japboi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1554879351,"body":"@dendygamer\n@m1ch431\n@est430\nThe ghist of the thing is that the dark elf is trying to get rid of the bad image of dark elves by doing good deeds.  She’s seen visiting somebody’s house, but he turns her away due to her outfit. The boy, an orphan living alone, asks her to come to house and asks for various favors like food and chores, which he couldn’t do alone.  The boy then grows up, and has become self-sufficient, farming and declining her offer of instantly hunting meat, saying his own rice would suffice.  She then says she was going to depart to do good deeds elsewhere, and says whether he has one last wish, pressing him when he hesitates. He replies that he would like to have a child between him and the dark elf, to which she agrees after some surprise. It’s the first time for both of them, and they confess love to each other. 70 years later, she’s at his grave for a final farewell, leaving with their two children for her original quest of doing good deeds."},{"id":735905,"gallery_id":245898,"poster":{"id":30317,"username":"est430","slug":"est430","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1542515166,"body":"@m1ch43l grave of the guy she had sex and lived with, i mean, you know the difference of elfs and humans lifespan. Just a guess as i cant understand jap.. And as i can tell the small darkelf is their offspring."},{"id":707097,"gallery_id":245898,"poster":{"id":675581,"username":"m1ch43l","slug":"m1ch43l","avatar_url":"avatars/675581.png","is_superuser":false,"is_staff":false},"post_date":1539098615,"body":"@DendyGamer only 2 found: This and one of kuroinu. \nbtw, whose grave is it at the end?"},{"id":684454,"gallery_id":245898,"poster":{"id":1383040,"username":"DendyGamer","slug":"dendygamer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1536714252,"body":"TRANSLATION NEED!!! Dark elves without orcs, rape and other shit it's ultra rare"},{"id":681125,"gallery_id":245898,"poster":{"id":378817,"username":"remos18","slug":"remos18","avatar_url":"avatars/378817.png","is_superuser":false,"is_staff":false},"post_date":1536463213,"body":"NEED MOREEEEEEEE"}]