[{"id":2173973,"gallery_id":246069,"poster":{"id":2162014,"username":"goodcelot","slug":"goodcelot","avatar_url":"avatars/2162014.png?_=85d3a135800e913d","is_superuser":false,"is_staff":false},"post_date":1638340639,"body":"this is a story, not a porn"},{"id":2129609,"gallery_id":246069,"poster":{"id":1868660,"username":"neil218","slug":"neil218","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636276427,"body":"I want to marry her. Best girl ever."},{"id":1667049,"gallery_id":246069,"poster":{"id":2879900,"username":"coolboxess","slug":"coolboxess","avatar_url":"avatars/2879900.png?_=e8ebf3ed4b598722","is_superuser":false,"is_staff":false},"post_date":1617867277,"body":"Man this is so deep "},{"id":1541328,"gallery_id":246069,"poster":{"id":3337469,"username":"ILikeChairs","slug":"ilikechairs","avatar_url":"avatars/3337469.png?_=9704dc1d40c8cb6b","is_superuser":false,"is_staff":false},"post_date":1612290423,"body":"This hit pretty hard man "},{"id":1298219,"gallery_id":246069,"poster":{"id":1954175,"username":"prinzpudding","slug":"prinzpudding","avatar_url":"avatars/1954175.png?_=75ecd253ff2aa37d","is_superuser":false,"is_staff":false},"post_date":1603805454,"body":"Don't scroll down guys. This work is emotional and full of hope. That's all you need to know."},{"id":1193786,"gallery_id":246069,"poster":{"id":458823,"username":"sedoboi","slug":"sedoboi","avatar_url":"avatars/458823.png","is_superuser":false,"is_staff":false},"post_date":1599329390,"body":"@B3gg most english commenters here are kids. They want their waifu to be pure, and at the same time also fulfill their lewd fantasies. The story is way better than most other stories here. If you look at it in a way, it's probably the best ending possible. She almost killed herself, but instead find a silver lining, and did it all for her fans. Western porn have definitely destroyed the image of pornstars, Japanese pornstars are treated like idols, and most of them are wholesome like Yua and Kaho."},{"id":986449,"gallery_id":246069,"poster":{"id":1460332,"username":"B3gg","slug":"b3gg","avatar_url":"avatars/1460332.png","is_superuser":false,"is_staff":false},"post_date":1591708318,"body":"In the Mandarin translation all the comments below are commenting about how the story is emotional and uplifting... and here it's a bunch of people calling the protaganist a slut. "},{"id":961047,"gallery_id":246069,"poster":{"id":861453,"username":"Ｐｕｒｅ Ｌｏｖｅ❤","slug":"pure-love","avatar_url":"avatars/861453.png","is_superuser":false,"is_staff":false},"post_date":1561998923,"body":"Such a shame, that this god tier art and character design is wasted on this cuck garbage. kys author\n"},{"id":941398,"gallery_id":246069,"poster":{"id":2062497,"username":"Grait","slug":"grait","avatar_url":"avatars/2062497.png","is_superuser":false,"is_staff":false},"post_date":1560656121,"body":"Don't scroll down guys"},{"id":921863,"gallery_id":246069,"poster":{"id":810230,"username":"GudSchidt","slug":"gudschidt","avatar_url":"avatars/810230.png","is_superuser":false,"is_staff":false},"post_date":1559258249,"body":"@Jackir some pornstars would probably be invited to some late night shows if they retired, don't know too much about that but I do know of a former pornstar starring in a horror film."},{"id":919876,"gallery_id":246069,"poster":{"id":2460219,"username":"Lubricatedbread","slug":"lubricatedbread","avatar_url":"avatars/2460219.png","is_superuser":false,"is_staff":false},"post_date":1559106912,"body":"My heart has a massive boner rn"},{"id":880830,"gallery_id":246069,"poster":{"id":714428,"username":"Jackir","slug":"jackir","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555817964,"body":"cuz ykno, this is a hentai site and you obviously cant handle a vanilla doujin because that reminds you of how you get cucked/cheated on/ntr'd every time you get close to a girl because of how much of a beta faggot you are."},{"id":880828,"gallery_id":246069,"poster":{"id":714428,"username":"Jackir","slug":"jackir","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555817825,"body":"are NOT describing most ffm/mmf doujins, where MALE 2 /FEMALE 2, DOES NOT ACTUALLY INTERFERE, but instead join in on the agreement of everyone involved, not the fucking cheating garbage you are describing, do you understand (ofc you dont you're retarded) how fucking stupid you sound you fucking incel?\n\nyou make it sound like if the girl rejects the 2nd male it's a bad thing and that means she's mind controlled, and it's ''interefering'' if the 2nd guy starts fucking raping her, you absolute cuck, and do you know how we deal with someone ''interfering'' ? (unable to accept getting rejected by the girl who obviously dosent fucking want them because that obviously happens to you alot considering you are an incel), WE BEAT THE FUCKING FAGGOTS FACE IN CUZ HE CANT HANDLE GETTING REJECTED AND TRIES TO STEAL OUR GIRL AGAINST HER FUCKING WILL YOU RETARD (not to mention if she cheats on us then obv we dislike that BECAUSE 99% OF THE TIME IT MAKES NO SENSE AND ITS NOT OUR FETISH YOU CUCK)"},{"id":880827,"gallery_id":246069,"poster":{"id":714428,"username":"Jackir","slug":"jackir","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555817473,"body":"you absolute cuck, these are not things which we are guilty of, we arent the ones calling you ntrfags niggers anc incels, you are the ones calling us that for truthfully pointing out garbage. you are the incel here, you are the cuck here, and you are the retarded nigger that dosent realise this is a women that is under full control of a man, not the things we enjoy, she was manipulated and forced into this life. this was never her choice, she never chose to become a porn star, she was manipulated into it you hypocritical fuck\n\nand this sentence btw'' they can only get off when there's only one main male protagonist without any other male interfering so they can think of the MC as themselves. '' is retarded, , you are describing cheating. which we despise. this isnt a love triangle drama where the girl ends up with one guy, you are describing a vanilla doujin where some asshole ''interferes'' (rapes, blackmails, etc) and makes it cheating/netorare, ykno, THE THING WE FUCKING DISLIKE you"},{"id":880825,"gallery_id":246069,"poster":{"id":714428,"username":"Jackir","slug":"jackir","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555817209,"body":"yeah sure she might get some ''yeah you go girl'' bullshit like she didnt get insanely manipulated (and she's letting the same guy who made her into a whore make others into whores, she dosent care, she is corrupted) into what she is.\n\nalso this is NOTHING like ''exploring sexuality'' no, she got deceived raped got her life destroyed and mind broken so now she thinks being a whore is the same as being an idol you are fucking insane not to mention many of those people you call out are in fact hating on ffm threesome and harems (the same things for both male and female harems btw you retard) cuz they're just as garbage, also hating ntr netori cheating swinging does not mean you hate mmf threesome just cuz there's 2 men, you're also disregarding the story which is 90% of why we hate it, also you said prostitution implying both male and female prostitution, and you're right i hate both. not to mention 99.9999% of the times we call out mmf threesome there's also swinging or cheating goingon"},{"id":880823,"gallery_id":246069,"poster":{"id":714428,"username":"Jackir","slug":"jackir","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1555816895,"body":"lets not forget that i really doubt a porn star would get invited to a late night show, not to mention @stereob she will likely find a guy that she likes just to end up having her dreams shattered because he realises she's just another whore, sure a well paid one but that changes nothing, also are we just forgetting that she was lied to and her life basically destroyed until horny actual incels like @Schmand started wanting to fuck her (cuz let's be real 99.999% of people just want to fuck her) ''gave her hope'' which changes nothing about how her life was basically ruined and how this is made to be a cheery story even though it's nothing like it in reality, her life was still ruined she just changes to become a whore, also she's still just another mind broken girl just that this doujin puts a bullshit dreamy spin on it, she's in reality barely different from the broken whore who just wants cock, do you honestly think she's gonna get anything but pity if people find out her true story?"},{"id":768254,"gallery_id":246069,"poster":{"id":1259477,"username":"seraphimz","slug":"seraphimz","avatar_url":"avatars/1259477.png?_=c780d0b26446eef9","is_superuser":false,"is_staff":false},"post_date":1546005535,"body":"I just wanted to beat my meat but it won't stop crying"},{"id":751846,"gallery_id":246069,"poster":{"id":1814846,"username":"nothinwronghere","slug":"nothinwronghere","avatar_url":"avatars/1814846.png","is_superuser":false,"is_staff":false},"post_date":1544278435,"body":"My dick too sad to nut aw man ;(("},{"id":742886,"gallery_id":246069,"poster":{"id":1093679,"username":"dommychi","slug":"dommychi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1543295483,"body":"Apparently with these Male hosts in real life, many of them seduce girls and the girls themselves actually end up in the \"night industry\" to support these hosts. "},{"id":712466,"gallery_id":246069,"poster":{"id":923754,"username":"troxers","slug":"troxers","avatar_url":"avatars/923754.png?_=f3e06b590e5bebde","is_superuser":false,"is_staff":false},"post_date":1539736487,"body":"Very good awesome"},{"id":694987,"gallery_id":246069,"poster":{"id":1936371,"username":"thatcutewitch","slug":"thatcutewitch","avatar_url":"avatars/1936371.png","is_superuser":false,"is_staff":false},"post_date":1537750830,"body":"Amazing story "},{"id":692793,"gallery_id":246069,"poster":{"id":1002554,"username":"papahh","slug":"papahh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1537508337,"body":"Freakin thot "},{"id":690279,"gallery_id":246069,"poster":{"id":171209,"username":"Syapaaye","slug":"syapaaye","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1537222912,"body":"What the hell I'm here to fap, not to FEEL, man... "},{"id":688490,"gallery_id":246069,"poster":{"id":1823199,"username":"JOJO666","slug":"jojo666","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1537079061,"body":"Beautiful art with the contrast Black-White/colored to mark her emotional state...but the story is so sad! I barely fapped...."},{"id":688075,"gallery_id":246069,"poster":{"id":164585,"username":"dreminh","slug":"dreminh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1537032034,"body":"awsome1111111111111111"},{"id":688056,"gallery_id":246069,"poster":{"id":1224843,"username":"BNANMN","slug":"bnanmn","avatar_url":"avatars/1224843.png","is_superuser":false,"is_staff":false},"post_date":1537030636,"body":"Its emergence with a good ending"},{"id":687318,"gallery_id":246069,"poster":{"id":1530666,"username":"MichaelB","slug":"michaelb","avatar_url":"avatars/1530666.png","is_superuser":false,"is_staff":false},"post_date":1536968669,"body":"The message is actually clear, you can complete your dreams in other ways, but this wasn't a really good example for sure xD"},{"id":687135,"gallery_id":246069,"poster":{"id":585371,"username":"Swinger fanatic","slug":"swinger-fanatic","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1536949641,"body":"these story focused hentai makes me even hornier lol...feels like you're faping to the real deal instead of just another 2d porn material. kinda like it's more arousing reading an ecchi manga than straight hentai"},{"id":687062,"gallery_id":246069,"poster":{"id":1929925,"username":"monong","slug":"monong","avatar_url":"avatars/1929925.png","is_superuser":false,"is_staff":false},"post_date":1536945476,"body":"Porn Star Story LOL"},{"id":686172,"gallery_id":246069,"poster":{"id":821099,"username":"main account","slug":"main-account","avatar_url":"avatars/821099.png","is_superuser":false,"is_staff":false},"post_date":1536851739,"body":"@PentacleMonster, thank you kind friend, I'm trying to install mods manually by putting them on the folder but it always fails and not working. Thank you, the nexus mods actually pretty good. My mods are on order and I can use them without putting them on the directory. As for the mods that are nudes, I'll pass and stick to my 2D stuffs. 3D animations are nice too but it depends on the mood. Hopefully you have a nice day ahead mate!"},{"id":685995,"gallery_id":246069,"poster":{"id":1542512,"username":"kakibesar","slug":"kakibesar","avatar_url":"avatars/1542512.png","is_superuser":false,"is_staff":false},"post_date":1536832721,"body":"Wow this is the most stupid girl I ever read... How could she doesn't realise about that man"},{"id":685270,"gallery_id":246069,"poster":{"id":1218031,"username":"Schmand","slug":"schmand","avatar_url":"avatars/1218031.png","is_superuser":false,"is_staff":false},"post_date":1536768673,"body":"@stereob & Pentacle I should have worded it better i suppose, but i obviously don't mean every vanilla-lover with it. I don't even have anything against people that enjoy vanilla, i only have something against the obvious perpetrators that spam each ntr upload, aka: iexpectedbetter, mike pence, ikillcucks, zerobero12 etc. These guys treat women as if they have full control over them and they treat every slightly slutty character with absolute hatred. They absolutely love harems and FFM's, but MMF's, prostitution? Fuck that thot, she should burn in hell, worthless whore! etc. They can only get off when there's only one main male protagonist without any other male interfering so they can think of the MC as themselves. You don't need to be a genius to see that they're incels IRL. @-Le No clue what you're on about, did you even read this? She's not getting raped, she's prostituting herself. Oh, but you're a vanillafag, okay, looks like all of the above rings a bell?"},{"id":684894,"gallery_id":246069,"poster":{"id":787016,"username":"Hydrotore003","slug":"hydrotore003","avatar_url":"avatars/787016.png?_=d98724e99761b330","is_superuser":false,"is_staff":false},"post_date":1536746904,"body":"Worthless whore"},{"id":684878,"gallery_id":246069,"poster":{"id":1513702,"username":"-Le","slug":"le","avatar_url":"avatars/1513702.png","is_superuser":false,"is_staff":false},"post_date":1536745983,"body":">tfw liking vanilla makes me a cuck and an incel because i dont enjoy reading a girl get raped by 23 fat ugly dudes"},{"id":684390,"gallery_id":246069,"poster":{"id":1071055,"username":"PentacleMonster","slug":"pentaclemonster","avatar_url":"avatars/1071055.png","is_superuser":false,"is_staff":false},"post_date":1536707134,"body":"@main account, you can use nexus mods and apply them using their mod manager. You can also \"subscribe\" to mods on steam. The steam mods update automatically, however their content is usually less impressive and is filtered. You can't find nude body mods on the steam workshop. @Schmand, yes the mix of black and white and colored is damn stupid. It is one thing if you have colored pages then B&W pages but not partially colored pages. As for the vanilla fags comments... nice bait m8"},{"id":684358,"gallery_id":246069,"poster":{"id":107054,"username":"sterob","slug":"sterob","avatar_url":"avatars/107054.png","is_superuser":false,"is_staff":false},"post_date":1536703277,"body":"@schmand: don't conveniently group people complaining in this thread with vanillafags to suit your agenda. "},{"id":684290,"gallery_id":246069,"poster":{"id":1218031,"username":"Schmand","slug":"schmand","avatar_url":"avatars/1218031.png","is_superuser":false,"is_staff":false},"post_date":1536697055,"body":"The mix of colored and black&white is fucking cancerous, but i'll turn a blind eye this time because everything else is pretty decent. Vanillafags are incels confirmed btw. Guys, females can explore their sexuality just like men can. Makes you wonder why there isn't anyone hating on all the works where they guy is whoring himself out. Hypocritical vanillafag closet cuck incels."},{"id":683969,"gallery_id":246069,"poster":{"id":821099,"username":"main account","slug":"main-account","avatar_url":"avatars/821099.png","is_superuser":false,"is_staff":false},"post_date":1536672059,"body":"guys you do you know how to install mods on skyrim?"},{"id":683965,"gallery_id":246069,"poster":{"id":107054,"username":"sterob","slug":"sterob","avatar_url":"avatars/107054.png","is_superuser":false,"is_staff":false},"post_date":1536671816,"body":"@crashzzyla: the message is human are more resilience than you think. Many doujins end with  \"the girl is broken, she is ruined\". However human can grow, learn and start anew. Scar can heal, nightmare can be forgotten, your life is not over. You can find your own happiness as long as you continue to live. \n\nSo do not give up on yourselves.  \n\nCoincidentally, today is National Suicide Prevention Day, to people who are being suffocated by the darkness, the loneliness, the weight of responsibility, or the sadness similar to this girl.\n\nFailure is always an option.\n\nLet's say that you get up, and walk away. Quit your job, walk away from your family, and just let everything burn. Absolutely everyone involved is still better off than if you died. All of the things that you think would be made better by you dying will be made just as much better, if not more so, by you simple walking away. And you can always walk back, you can reconnect with people, and there will be a happy ending for you. "},{"id":683473,"gallery_id":246069,"poster":{"id":87297,"username":"MessedUp","slug":"messedup","avatar_url":"avatars/87297.png","is_superuser":false,"is_staff":false},"post_date":1536626034,"body":"This could've gone horribly wrong like in Emergence, but the author decided to \"fuck it, I want some happy-kinda ending\""},{"id":682965,"gallery_id":246069,"poster":{"id":1015155,"username":"TruthTeller","slug":"truthteller","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1536588581,"body":"i don't mind, i also  just don¨'t care, not my kinda story"},{"id":682692,"gallery_id":246069,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1536569978,"body":"@tkmasterx Honestly female adult film stars are much more respectable than sjw,pc,feminist women today except probably for stormy daniels most of this women didn't graduate and poor etc (of course their might be some other reason) and has no choice but to enter such industries just to live just like what happened to this story she was naive and got tricked by a piece of shit guy drop out in college (but as long as she graduated HS and with her looks she can get a respectable job)  but because she snapped,depressed etc she indulge herself in pleasure just to forget everything but in the end paid everything off for her she got popular which was she wanted to be in the spotlight or princess."},{"id":682591,"gallery_id":246069,"poster":{"id":40920,"username":"WeabsRUs","slug":"weabsrus","avatar_url":"avatars/40920.png","is_superuser":false,"is_staff":false},"post_date":1536564257,"body":"I dont know what to feel. If she enjoys it... ok i guess?"},{"id":682537,"gallery_id":246069,"poster":{"id":54252,"username":"tkmasterx","slug":"tkmasterx","avatar_url":"avatars/54252.png","is_superuser":false,"is_staff":false},"post_date":1536561773,"body":"she was able to find a good ending for herself and i think thats ok. makes me see adult film stars in a kind of better light. "},{"id":682337,"gallery_id":246069,"poster":{"id":1407522,"username":"Ear Rape","slug":"ear-rape","avatar_url":"avatars/1407522.png","is_superuser":false,"is_staff":false},"post_date":1536549159,"body":"you are princess. broken princess"},{"id":682296,"gallery_id":246069,"poster":{"id":1796659,"username":"nixx-","slug":"nixx","avatar_url":"avatars/1796659.png","is_superuser":false,"is_staff":false},"post_date":1536544662,"body":"bitch i love this!!!! "},{"id":682293,"gallery_id":246069,"poster":{"id":641961,"username":"Atang","slug":"atang","avatar_url":"avatars/641961.png?_=02c80c202ecd3ae8","is_superuser":false,"is_staff":false},"post_date":1536544358,"body":"dont let your dreams be memes? this book kinda motivates you but in a particularily wrong way"},{"id":682265,"gallery_id":246069,"poster":{"id":38369,"username":"fozzibab","slug":"fozzibab","avatar_url":"avatars/38369.png","is_superuser":false,"is_staff":false},"post_date":1536541552,"body":"Yeah...this was awful. I don't read hentai for story content, I read it to get off, and this totally killed my desire to do that. Great job. "},{"id":682039,"gallery_id":246069,"poster":{"id":190041,"username":"ricoken","slug":"ricoken","avatar_url":"avatars/190041.png","is_superuser":false,"is_staff":false},"post_date":1536521322,"body":"Umm what? "},{"id":682036,"gallery_id":246069,"poster":{"id":355316,"username":"ryder21","slug":"ryder21","avatar_url":"avatars/355316.png","is_superuser":false,"is_staff":false},"post_date":1536521002,"body":"It's like a reminder that things don't always work out like you want it and try to give a positive pov of the situations we've to going through "},{"id":681968,"gallery_id":246069,"poster":{"id":1757903,"username":"ketiax","slug":"ketiax","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1536515736,"body":"I was prepared for my heart to be destroyed to pieces.\n\nIt melted instead. Dark, terrifying, but ends up being heartwarming."},{"id":681901,"gallery_id":246069,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1536511411,"body":"Well if she likes it why not after all its not like every dream can be achieved by not dirtying yourself sometimes, the story definitely feels like some sort of idolm@ster story though then again given this author works mostly parodies of idol anime i guess that understandable except this is a JAV idol, though felt sorry for her and the guy was more than a prick,piece of crap for tricking her etc....if she only existed IRL i probably would kneel immediately in front of her and say i want marry her lol then again nah....already planned to die all alone im unable to support someone other than myself."},{"id":681861,"gallery_id":246069,"poster":{"id":1407522,"username":"Ear Rape","slug":"ear-rape","avatar_url":"avatars/1407522.png","is_superuser":false,"is_staff":false},"post_date":1536509427,"body":"applause, burn everything on the ground"},{"id":681833,"gallery_id":246069,"poster":{"id":1877210,"username":"ebd","slug":"ebd","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1536506667,"body":"wtf, i came here to fap, not for feels, still a great story tho"},{"id":681711,"gallery_id":246069,"poster":{"id":1047835,"username":"daaded","slug":"daaded","avatar_url":"avatars/1047835.png","is_superuser":false,"is_staff":false},"post_date":1536499910,"body":"beautiful arstyle and a bittersweet story what more could you ask for?!\nwell... this is a porn site so probably some fucking porn"},{"id":681697,"gallery_id":246069,"poster":{"id":927982,"username":"Black Falcon","slug":"black-falcon","avatar_url":"avatars/927982.png","is_superuser":false,"is_staff":false},"post_date":1536499200,"body":"great story! "},{"id":681649,"gallery_id":246069,"poster":{"id":1442564,"username":"L'","slug":"l","avatar_url":"avatars/1442564.png?_=e9e9d92a59014e89","is_superuser":false,"is_staff":false},"post_date":1536496432,"body":"*Slowly claps*"},{"id":681536,"gallery_id":246069,"poster":{"id":755210,"username":"Love Juice","slug":"love-juice","avatar_url":"avatars/755210.png?_=6a6612c7cb2b76de","is_superuser":false,"is_staff":false},"post_date":1536490408,"body":"W O K E    "},{"id":681492,"gallery_id":246069,"poster":{"id":186147,"username":"Haraguro","slug":"haraguro","avatar_url":"avatars/186147_CVoB3xp.png","is_superuser":false,"is_staff":false},"post_date":1536488178,"body":"that's actually sad, but my dick says fuck it"},{"id":681485,"gallery_id":246069,"poster":{"id":1775293,"username":"TohsakaNozomi","slug":"tohsakanozomi","avatar_url":"avatars/1775293.png?_=0aca036bdc458372","is_superuser":false,"is_staff":false},"post_date":1536487745,"body":"Long story short: she a hoe and she likes it"},{"id":681481,"gallery_id":246069,"poster":{"id":247529,"username":"PussyHunter69","slug":"pussyhunter69","avatar_url":"avatars/247529.png?_=2cbb3950cfb27df2","is_superuser":false,"is_staff":false},"post_date":1536487389,"body":"This is like discovery channel show about a JAV artist. I mean horee shitto"},{"id":681478,"gallery_id":246069,"poster":{"id":842752,"username":"Anczar","slug":"anczar","avatar_url":"avatars/842752.png?_=a590080fe2c958d2","is_superuser":false,"is_staff":false},"post_date":1536487092,"body":"Fuck this shit"},{"id":681461,"gallery_id":246069,"poster":{"id":1292128,"username":"Pentagram Industries","slug":"pentagram-industries","avatar_url":"avatars/1292128.png","is_superuser":false,"is_staff":false},"post_date":1536485918,"body":"We're hitting autism levels that shouldn't even be possible."},{"id":681458,"gallery_id":246069,"poster":{"id":1626669,"username":"Jetstream sam","slug":"jetstream-sam","avatar_url":"avatars/1626669.png?_=98853a137cd5569c","is_superuser":false,"is_staff":false},"post_date":1536485751,"body":"Oh boy          "},{"id":681397,"gallery_id":246069,"poster":{"id":1539583,"username":"HanBun","slug":"hanbun","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1536482059,"body":"Damn it's hard to fap wth so much feels"},{"id":681386,"gallery_id":246069,"poster":{"id":59502,"username":"Joulian","slug":"joulian","avatar_url":"avatars/59502.png","is_superuser":false,"is_staff":false},"post_date":1536481413,"body":"Well, this was... empowering?\n"},{"id":681369,"gallery_id":246069,"poster":{"id":1815790,"username":"rskyron","slug":"rskyron","avatar_url":"avatars/1815790.png?_=a9e2e36900a46364","is_superuser":false,"is_staff":false},"post_date":1536480704,"body":"I'm happy with who I am today... A ho."},{"id":681334,"gallery_id":246069,"poster":{"id":289607,"username":"KirinoLover","slug":"kirinolover","avatar_url":"avatars/289607.png","is_superuser":false,"is_staff":false},"post_date":1536479151,"body":"WOW, I couldn't fap, the story is so intriguing!"},{"id":681299,"gallery_id":246069,"poster":{"id":392762,"username":"machan12","slug":"machan12","avatar_url":"avatars/392762.png","is_superuser":false,"is_staff":false},"post_date":1536477621,"body":"My life is depressing enough, I don't need my faps to be depressed too"},{"id":681282,"gallery_id":246069,"poster":{"id":261212,"username":"Nudeclear","slug":"nudeclear","avatar_url":"avatars/261212.png?_=347810fb81a2da19","is_superuser":false,"is_staff":false},"post_date":1536476724,"body":"Good gracious fuck lord, I want to favorite this but I can't! I want some pussy as well!"}]