[{"id":2409500,"gallery_id":250445,"poster":{"id":2029608,"username":"山本栞","slug":"shan-ben-kan","avatar_url":"avatars/2029608.png?_=86d5b267d7a33d2a","is_superuser":false,"is_staff":false},"post_date":1647868417,"body":"The best cheerleader tag "},{"id":2238100,"gallery_id":250445,"poster":{"id":7789,"username":"jcspins","slug":"jcspins","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641132532,"body":"Where's/When's part 2, where she lets him fuck her pussy?"},{"id":1450228,"gallery_id":250445,"poster":{"id":3765678,"username":"ohno0128","slug":"ohno0128","avatar_url":"avatars/3765678.png?_=801d9d19a00fa696","is_superuser":false,"is_staff":false},"post_date":1609473792,"body":"Nah it turns out i got some infection im all good"},{"id":1432505,"gallery_id":250445,"poster":{"id":3765678,"username":"ohno0128","slug":"ohno0128","avatar_url":"avatars/3765678.png?_=801d9d19a00fa696","is_superuser":false,"is_staff":false},"post_date":1608944451,"body":"Am i mentally retarded for getting a half boner to the comments"},{"id":1431200,"gallery_id":250445,"poster":{"id":1302816,"username":"ok42069","slug":"ok42069","avatar_url":"avatars/1302816.png?_=c0349cf8fa312b94","is_superuser":false,"is_staff":false},"post_date":1608895142,"body":"literal warzone in the comments but imma still beat it"},{"id":1086907,"gallery_id":250445,"poster":{"id":1220247,"username":"sintae","slug":"sintae","avatar_url":"avatars/1220247.png?_=834936f4b951a360","is_superuser":false,"is_staff":false},"post_date":1595106080,"body":"You're all gay"},{"id":885664,"gallery_id":250445,"poster":{"id":1699643,"username":"Gley","slug":"gley","avatar_url":"avatars/1699643.png?_=d59deb26456b7a3c","is_superuser":false,"is_staff":false},"post_date":1556232433,"body":"     Bullshit"},{"id":812349,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1549721186,"body":"Bye b-WAIT U HAVEN'T TOLD ME WHAT THAT BOOKS NAME WAS WAAIIIT!!!"},{"id":806919,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1549221686,"body":"Well it was fun, but time to do as I said I would last week. \"I'll remember you all in my therapy sessions\" Ciao!"},{"id":806398,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1549178689,"body":"First off, BAHAHA ur comment made me laugh (metroid), second yes I got ur referrece and thought it to be very clever and thirdly plz no racism, no body likes it."},{"id":806223,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1549164274,"body":"Other M don't you get tire of your own hype I mean really. "},{"id":805683,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1549112092,"body":"\nLordCellofEarth9 I shall whip you twenty times for your insolence you shit eatin nigger .  Now shut up my  delusional  slave bitch and tell me   did  you  finish cleaning the toilet with your tongue?  You lazy niggers should be boiled in hot water that will teach ya for  talking against your master you nigger piece of shit "},{"id":805514,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1549089488,"body":"..........Wow \"metroid\", did my \"Chef Hogan\" comment actually cause you to \"change your pic\" in a form of \"spiting\" or something? . That was very impressive \"me\" LOL. "},{"id":804702,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1549007196,"body":"@LordCellofEarth9 you called it this fag loves talking to himself huh, oh and Other M say hi to mother for me and tell her that her lab report and she does have AIDS have fun with that."},{"id":804057,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1548953563,"body":"Ecchinosuke's mom is jumping on top of my dick right now she says hi to her son with a smile :) I'm sure Otaku the Prince get this reference and \nLordCellofEarth9  yougot me all wrong; I love niggers, after all which race  makes a better slave,  right?"},{"id":803594,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1548911665,"body":"@LordCellofEarth9 I told to stop paying attention to this THOT her just a troll trying to be clever, oh hi Otaku the Prince.\nI hope you got that reference please. "},{"id":799409,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1548546136,"body":"@metroid Okay I think everyone has a point this has gotten bigger then it should be. I might respond to anything \"meaningful\" directed at me till next Sunday from now. Then I'm un-favoriting this story and not responding to ANY comments made here. To \"move on\" and allow more \"meaningful comments\" to take hold. Since everything else seems to be just \"back and forths\" with a certain \"Chief Hogan\" Avatar \"troll\". Comment sections were meant more for commenting, not to be a haven for meaningless trolling and \"no-gain\" arguing with trolls. I'm sure metroid will take their last few \"pot-shots\" on the way to that day LOL. I'll be surprised if they stay silent till then as one last \"Fuck you\" to me."},{"id":797340,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1548345795,"body":"@Otaku the Prince I see that  you are still waiting for LordCellofEarth9's cock to cum on your face faggot boi Keep waiting bitch LOL"},{"id":796201,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1548245640,"body":"Holy fuck, I leave for 4 weeks and come back expecting those 'off-brand' books you had seen (LordCellofEarth9) or to be completely silent and dead but turns out I was wrong. Metroid...shut up, Ecchinosuke, hello and LordCellofEarth9, I'm still waiting! lol"},{"id":776634,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1546650830,"body":"@metroid HAHAHAHAHAHAHAHAHAHAHA.........never change metroid xD"},{"id":776520,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1546644018,"body":"@LordCellofEarth9 thanks dude I appreciate the sentiment, though metroid is just a troll looking for attention which explains the lengths he'll go to get someone trigger."},{"id":776399,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1546633006,"body":"LordCellofEarth9 Based on your experience with your mother is it true that nigger whores love anal? I am making research for my thesis so I thought you could help. LOL\n"},{"id":776224,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1546621689,"body":"@Ecchinosuke Also be careful about using the \"N\" word, don't want to see you get banned when those's \"pieces of wasteful human shitstain parasites\" get their claws on site's like nhentai and start banning people over comments. metroid is one thing I can care less for their last comment, but you I count as a friend, had to lose \"coms\" with one of the few \"NTR\" haters I get along with (other then \"IExpectedBetter\", but I see them as the \"Groot\" of the comment sections LOL)."},{"id":776183,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1546619106,"body":"@metroid  .............. Okay metroid that's kind of desperate to get my attention? (I was actually surprised you'd go THAT far to get my attention....good to know your standards of trolling.....as in you don't have a limit it seems, or as 'Filthy Frank' once said a \"it's time to stop\" point);;;;;;@Ecchinosuke All I have to say on NTR is \"diminished returns\" are coming no matter how much NTR fans try to disguise it, the art might be getting better, but honestly the \"animated\" form of NTR porn will be the last \"swan song\" before it starts becoming the \"bad salt\" you aid just to try and give your story \"unneeded flavor\".....Not like it matters as I got it blacklisted (but it seems their desperate, notice how many upload's of \"Takeda\" newest doujin appeared a few weeks ago, That's some \"desperation\" and I'm seeing even more doujin being MIS-TAGGED to avoid getting hit by the blacklist...luckily their front page gives them away, but still.....) "},{"id":774320,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1546477273,"body":"@metroid come man we know you like nigger cum you eat it every day, and yes LordCellofEarth9 and I did spend the new years together so what are sad you weren't invited the party. "},{"id":773657,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1546434174,"body":"Since we have a nigger here with a small cock, just like Ecchinosuke loves to suck,  we can all have fun with KKK , right nigger or should I say half evolved monkey?\n"},{"id":772865,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1546384090,"body":"@metroid \"It's so great to be loved\" LOL;;;;;;;;; @Ecchinosuke \"Agreed with you on that one, I'm also offended somewhat with the overuse of Black Guy steals Japanesse Girl from her man because HUGE COCK cause next to hating it in NTR, I'm a black guy IRL, but I let it bounce off because it just means they're compensating for something if you know what I mean, whenever someone does the 'Black Man is a thief' of any kind. Making them kind of pathetic. Kind of happy that shit stays in NTR, where I don't have to see it often\""},{"id":772690,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1546371265,"body":"@Ecchinosuke LOL I see that you still have some LordCellofEarth9's cum on your face. I assume you two litle faggots had a lot of fun last night celebrating the new year . Keep sucking and fucking each other faggots after all it's the only thing you are good for. :):)\n"},{"id":772554,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1546364927,"body":"@LordCellofEarth9 no he doesn't have any favorite on him cause he's a troll, however about the fact that metroid may or nay not be a girl portraying a douche doesn't matter in the slightest. Hell it might be funnier for him to be a guy cause of his overuse insult involving black guys and big black cocks, if he's a girl then the joke will not be as funny."},{"id":772543,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1546364607,"body":"@metroid and Happy New Year to you too asshole. You're right we are not special for you to pay attention to us, but yet here you like a good predictable bitch. Oh and by the way thanks for proving my point about your insults as cheap as a 5 dollar hooker. "},{"id":771888,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1546317726,"body":"LordCellofEarth9 Puh-lease, beatch you are overestimating yourself. You are simply one of the many bitches here I enjoy to fuck with. There is nothing special about you for me to pay you that much of a special attention. Now, do your job and go wait in the corner for some johns like a good little bitch, it's the new year and I need money.\n"},{"id":770148,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1546182734,"body":"@Ecchinosuke I have to suspect that they (as for all we know Metroid is a woman, that's doing a funny job portraying a \"dude bro\" LOL) have ALOT of free time to be look through EVERY doujin and favoring the one's you or now myself are on. EVERY LAST ONE OF THEM for responses."},{"id":767989,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1545981664,"body":"@LordCellofEarth9 I wouldn't know about just that, I only get lucky to find him cause he just likes to pick up fights with everyone for no reason."},{"id":767347,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1545915511,"body":"@Ecchinosuke I got a question, if you wanted to follow somebody to see where else they commented on, on this website, How'd would you go about doing it? I ask this because I saw the most unexpected thing (Don't know if I can do it or not). Metroid commenting on other stories I placed in favorites because I commented on them.     And yeah I agree on what you said, it's funny as I don't hate ALL NTR, but honestly I tend those NTR are of the \"Reverse NTR\" kind where it's the woman stealing another woman's man. They usually end up being better written, and don't leave that \"bad aftertaste\" NTR typically leaves behind (and the women are never drawn \"fugly\" like the assholes in a typical NTR like the \"Old Mummy Man\" and the \"Fat Ugly Guy\"). I only hate a small few that act way to much like a normal NTR (I think it's because in a Reverse NTR, it's alot like a Netori, or more I can't feel sorry for the other girl sort of thing. or whatever, just as long as it doens't act like common garbage)"},{"id":767166,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1545897480,"body":"@LordCellofEarth9 to you as well hopes for a better tomorrow.\nTell me about it with them, it's very easy to call vanilla fag every time someone point out the obvious problems with the story, they don't like it as they view it backwards in the point of view of the asshole rather then the husband or boyfriend getting his love one getting taken. Which I always say that these idiots don't know the definition of Netorare, cause they don't put themselves in the shoes of the the guy suffering but rather the so called alpha. Is like someone calling themselves masochist but not liking pain of any sort. "},{"id":766239,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1545827487,"body":"@Echhinosuke &amp; metroid And Happy New Years to everyone who made a comment here! (Just in case I forgot!). Plus Ecchinosuke, those who \"defend NTR\", I'm starting to wonder if they truly \"LIKE\" NTR, aren't just saying all the nice things they say in the comment section hoping a \"Vanilla Fag: will say something so they can start a flame war. That's just me"},{"id":765497,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1545758796,"body":"@LordCellofEarth9 see what did I tell ya this guy or girl is just a broken record don't bother with him, oh and Merry Christmas to all in the comment section that includes you asshole metroid."},{"id":765292,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1545738780,"body":"Ecchinosuke I am glad you came running to help your fag friend with your cock since you don't have a life and nothing better to do.And as expected you are making up stuff from your ass that you use to think instead of your shit filled brain. I've never called anyone cuck so far I dare you to prove otherwise. Sucking too many cocks must have triggered your delusions again. L-O-L\n"},{"id":765140,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1545725115,"body":"@LordCellofEarth9 don't bother with this idiot it's fun some to have him as a convenient punching bag but after a while it gets boring. He only has about 3 types of insult 1 your mom getting fuck by black guys (which tells you his fetish), 2 calling people cuck even though he's the one that likes NTR, and 3 when two or more people are ganging up on him he immediately calls them gay by implying that their sucking each other off like he dud to us. This idiot is just as repetitive and unoriginal as a lot of NTR. "},{"id":765095,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1545719863,"body":"Sorry, I  cant understand what you are saying while you have Ecchinosuke's cock in your mouth."},{"id":765055,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1545716344,"body":"@metroid \"Walls of text\"......Careful about those shards cutting you metroid, as your throwing stones in that house of glass of yours  ;)  \n\n(On a serious note, what is with you and peoples \"mother's\" anyway, all your back and forths to Ecchinosuke since I first saw the two of you's go betweens with each other a year or so ago in the other doujin comments, it always seems to be you implying your doing his mother, and now mine? which makes me feel special inside that I worthy enough to have \"your momma\" cracks made at me by you, \"how's your relationship mother doing metroid\", and that's me being \"serious\". )"},{"id":764990,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1545710325,"body":"Ecchinosuke and LordCellofEarth9 just cant stop sucking each other's dick since they love each other so much Almost love it as much as watching their mothers fucked in front of them by big black dicks belonging to the gangsta rappers for some reason. No wonder LordCellofEarth9 can't  leave here being the faggot cocksucker who  loves Ecchinosuke's cock   and being  the biggest butthurt boy on the site evident from his huge wall of texts complaning about the same shitty thing over and over again . Have fun faggot bitches while sucking each other and dont worry about your moms :)\n"},{"id":764369,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1545655450,"body":"@Ecchinosuke I was (well I was no longer going to comment much in THIS doujin's comment section), as I really had nothing more to say on NTR (I already got what I wanted with this story being properly tagged, though other upload's as of late seem to be proving my point that they seem to be \"purposely\" holding back \"certain tags\", mis-tagging or re-uploading the SAME FUCKING THING ). But metroid seems to have the magic touch in keeping people around when they just want to move on (honestly I'm starting to think NTR lovers and not all of them, but they seem to love acting like a cookie cutter NTR that's not unique is great and are vocal about it just hoping a NTR hater will start with them, but that's just me I suppose, I see them enter vanilla stories to insult those who liked it.....the same ones who complain about people hating their shit) "},{"id":763300,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1545551024,"body":"@LordCellofEarth9 wait didn't you say you were leaving? Not that I'm complaining it's good to have actual individuals with a brain unlike others."},{"id":762455,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1545458590,"body":"@baaskaas123  \"WELCOME to our little war. A bit late getting here ah?"},{"id":761710,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1545380181,"body":"@Otaku the Prince hi there welcome to the comment section of an on going debate of who here has fucked metroid's mom? The answer its simple everyone which explains why he's a dick to everyone bye."},{"id":755749,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1544744187,"body":"@metroid I love you too metroid. I was just about to leave this comment section forever too (just came to unfavor it as I was deleting my datafiles of all NTR doujin so they would stop showing up on my quick searches). Are you that bored that you had to literally come back here to check and see if me and/or Ecchinosuke (who I know you secretly love getting their attention....since I see your back and forth with them on other doujin comment sections. Sorry metroid, I can't get in-between the thing you have with Ecchinosuke, so I'll have to decline a \"back and forth\" between us) updated or added any new comments. \"Seriously\"! Well guess I have to keep this favorite just to see who else will add to this growing ass pot of comments I suppose xD Don't bother \"Otaku the Prince\", this is \"metroid\" stick with \"Ecchinosuke\", they DO read all the comments, I just happen to be caught in their \"AOE\" that's all. "},{"id":753914,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1544523753,"body":"U don't have to be such a dickhead bro, they r just speaking for what they want and what they like, read ALL the comments and you'll understand"},{"id":750917,"gallery_id":250445,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1544157092,"body":"LordCellofEarth9 and Ecchinosuke You two faggots really should stop sucking each other's cock in public, not everyone wants to watch you two little butthurt bitches fucking each other and sucking cum from each other's face\n"},{"id":735221,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1542447508,"body":"&amp;MiiaBestWaifu Yeah I agree, I won't chance it with some, but others like that \"Magical Girl\" one (The one that is ongoing and even has the Magical Boy in it get gender bended and corrupted\" is listed as NTR (In a way it's both since both love interests at the end are corrupted and brainwashed into loving the same being LOL, Honestly it doesn't feel like NTR at all, even on the chapters that ARE suppose to be the NTR I don't feel it, and that Artist is known for making some pretty vicious NTR, so that's unique).\n\nIf I miss a good one that isn't NTR but listed as such....Oh well, it's a huge sea of Hentai and I have a deep memory, so I'd rather not accidentally read a NTR that's going to Trigger me at the cost of missing a good story (Hell I refuse to read \"Kouji\" stuff in English EVER, and I love Gender bend/corruption, but his stuff leaves me with Nightmares if I read the English as in the JAP, I can enjoy the pictures and BS the story to myself that won't leave me with nightmares)."},{"id":734890,"gallery_id":250445,"poster":{"id":1914584,"username":"MiiaBestWaifu","slug":"miiabestwaifu","avatar_url":"avatars/1914584.png?_=9eb11138e770fb8a","is_superuser":false,"is_staff":false},"post_date":1542413378,"body":"this doujin is exactly why i dont blacklist Netorare, because all \"netorare\" are not really netorare and so i can miss a lot with the bad tag"},{"id":730098,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1541832267,"body":"@Ecchinosuke Oh I agree. just found it funny that's all"},{"id":729056,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1541706939,"body":"True but I still stand by the fact that this not NTR and more of a guy trying to have a conversation with a stuck up bitch that turns out to be a good girl being force to do something for someone she may like."},{"id":727055,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1541464418,"body":"Came back and finally saw this tagged as Netorare..........I would say \"Bitching enough\" has prevailed. But I say thee nay. As it should have been tagged NTR from the start. Find it funny that they likely came back and tagged it properly because their were more \"Nays' in this comment section then \"Yeah's\". So those who comment just to insult us \"vanilla lovers\". You can join our congratulations as you also helped in getting this properly tagged LOL. Doesn't it feel nice helping your \"opposition\" over actually \"beating them\"."},{"id":721636,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1540809255,"body":"Its all goods cell take ur time and   \nfap ur way through it ;)"},{"id":721281,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540773950,"body":"I'm having a blast with Metroid, not the game but asshole NTR white knight that likes to call others cucks while being the one that likes to read them."},{"id":720942,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540739858,"body":"Yeah......goes to show their hitting that \"point\" where they've \"Strip Mined\" NTR in general that even their fans are only defending them because they hate \"vaniila's\" insulting their \"kink\" more then because they (artist/writer) actually \"made a decent\" or unique NTR (I feel looking at any praise a generic unoriginal NTR gets is because of the art and NOT because of the NTR, Large chance they looked at it from a Non-ENG version, then only commented praises in the ENG section just to piss off \"Vanilla's\" then any praise since they pretty much admitted EVERYTIME that they only fap to the art and don't bother with the story...meaning any insults at those who do read the story is short-sighted &amp; idiotic on their end since they \"admitted\" they didn't care to read it). Kind of sad, but that's what happens when everyone starts mining that \"mountain of gold\". It was going to get \"mined out\" eventually, the more people who started mining it, the faster it was going to happen inevitably "},{"id":720882,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540734399,"body":"Besides it may as well not be NTR cause they barely talk to each other and this is one of those force NTR narrative that are all the rage lately."},{"id":720782,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540719296,"body":"@xDurdead1......Your really trying to get a \"Vanilla\" to react to you..aren't you?  I give your comment a 2 out of 5. Your comment was \"trying WAY to hard\" to get a negative reaction from \"vanilla faqs\" that it comes off a bit...\"desperate\" for attention (Critiquing here, not being sarcastic, just pointing it out) "},{"id":720597,"gallery_id":250445,"poster":{"id":1989416,"username":"clockmaker","slug":"clockmaker","avatar_url":"avatars/1989416.png?_=a0542722fc9b7196","is_superuser":false,"is_staff":false},"post_date":1540697814,"body":"yes good shit. we need a sequel where the video of the girl having sex is sent to the baseball dude and he breaks down. after that, he hangs himself in the locker room where the girl and coach are having sex."},{"id":719594,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540566315,"body":"True I've gone to read my fav author Fue is been a while."},{"id":719519,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1540552885,"body":"Lol not alot of comments today "},{"id":719356,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540531411,"body":"Cool take your time on finding that story and I just like eating trolls that's all."},{"id":719227,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540514398,"body":"I know guys, Really want to help, I;m still looking through past hentai, but there's alot of them, and the ones I mentioned were by memory. I'll still look, but it's hard as hell as I mentioned prior, it was \"Last Year\" that I saw some of those stories....and alot of shit got uploaded since then, so it's like I'm trying to find a \"needle in a hay sack\" (sad to, since their are some I REALLY want to find again since I read them when I first start reading Hentai two decades ago, but not remembering the artist means I've given up). Also don't bother with obvious trolls like \"boje_ostanovi_xentai\" Ecchinosuke. There not worth your time, especially when they put down a short comment hoping to get attention from me LOL, I was going to ignore them till you brought them up (It validates them, which I don't want to do with \"that one\", I only comment if it's someone saying something \"meaningful\", I won't repeat myself otherwise)"},{"id":718977,"gallery_id":250445,"poster":{"id":1304465,"username":"Initial-Q","slug":"initial-q","avatar_url":"avatars/1304465.png","is_superuser":false,"is_staff":false},"post_date":1540483722,"body":"I thought this is long manga, but i regret after seeing the comment"},{"id":718854,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1540464367,"body":"Also cell, you wouldn't mind helping a brother out and telling me what the name of the mentioned Hentai is would you?"},{"id":718852,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1540464241,"body":"And it keeps going and going and going and going and going\n"},{"id":718725,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540447972,"body":"@boje_ostanovi_xentai the comment section as been going on for ages in hentai years so people already fapped to this again ages ago so your comment is pretty much pointless. "},{"id":718701,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540445243,"body":"Good but I won't be able to find the story if I don't get a clue of were to find it first,."},{"id":718610,"gallery_id":250445,"poster":{"id":1703694,"username":"ugly_bastard_fetish","slug":"ugly_bastard_fetish","avatar_url":"avatars/1703694.png?_=4da07fea18897a76","is_superuser":false,"is_staff":false},"post_date":1540432871,"body":"stfu and fap"},{"id":718345,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540401571,"body":"Funny enough I'll never get it in ENG, but I actually do like the stories where a guy steals the MC's \"side bitch\" in his harem that he is not dating at all because honestly I hate Harem's especially with the girl \"pining\" for a taking guy. It's why I don't mind \"NTR\"  that has them taken like the Takeda \"Infinite Stratos\" one (Especially as I didn't like Cecilia AT ALL, and Charlotte I like, but she's not the \"main girl\" so I don't mind, and it's not like the bland MC who's name I don't care to remember was much of an entity in that story other then \"Oh my side bitch got taken.....Oh well\". or the SAO's that AREN'T Asuna, largely Suguha (What a sad waste of a character) or the other girl's. Don't care as long as it's never the Main Girl, not like it hurts the \"Bland Harem Protagonist\" because as stated \"He still has bitches\" so what's one taken from him going to do (Especially if he barely gives much of a fuck about it to, making it clear she was a \"side bitch\" at that). Again no ENG."},{"id":718338,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540401222,"body":"Another dismissal I get is \"I'm not retarded enough to read the story of a porn\". which doesn't work either because of the term \"A Picture tells a thousand words\". Even if you take the dialogue out of a NTR, the pics are designed to make it clear that you don't even need to hear them talking to guess what their saying and doing, I got alot of Pics from NTR's in my folders since the art was good and fapable, but the rule is, I have to know it's not a NTR, such as the guy getting \"stolen\" is even seen at all, especially the \"fucking in front of him or seen by him scenes\", it doesn't come from an existing work that I've seen already like Naruto or such, and basically I see it as just Corruption/Moral Degenaration and noting more. and no English, I trick my brain into seeing it as Non-NTR this way to enjoy. Otherwise if the illusion is broken, I delete it to forget it existed. just how it is."},{"id":718329,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540400866,"body":"Again, I forgot, but someone did collect all that Artists work into one book, so you should be able to find it (It was a year ago that I saw it, I remember the story, but I don't remember the name)\n\n\"Hentai Logic\" has become the new \"Turn your Brain off\" that many anime reviewers on youtube especially DXFan have made clear they've started to despise. It seems like the intent was that term shielded \"Silly Nonsense\" in an anime like Mirai Nikki from being seriously critized because of a large amount of it's sillyness, but sadly for those. Good stuff like Konosuba and even before that GURREN 'FUCKING' LAGANN exist to prove that with your brain \"on or off\", they hold up especially if you remove the silliness. Without the silliness, something like Mirai Nikki cannot hold up and isn't worth your time if you have to turn your brain off to enjoy (Though I still love the \"Yuno x Yukki\" Yandere Hentai it spawned LOL, and those have a better story then the source it was taken from too).  "},{"id":718309,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540398875,"body":"And yes the BS excuse of \"it's just hentai logic\" doesn't make it better. I've red comments that said to just jerk off and not to pay attention, but if I wanted that I would just go watch a regular porn, or the worst excuse \"Just put yourself in the shoes of the guy doing the fucking and not the cuck crying\" and then you understand why I said the never had a girlfriend remark. So yes hentai logic doesn't give it an excuse to be so blatantly retarded or infuriating incoherent. "},{"id":718252,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540395623,"body":"What's the name name of that story so I can judge it for myself as well."},{"id":718251,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540395395,"body":"Another Story made by the same artist/writer had this guy marry this hot woman and brought her to his family home to show he off. Cue his brother sleeping with the willing slut behind his back before they conspire to kill the husband off (where she'll get all his belongings and money) and after the deed was done they got together...and then he died cause it turns out she was ALSO cheating on \"him\" with his father....and then the father and mother died trying to kill the other (Father to get the wife out of the way and the mother to get revenge as she found out about the cheating). The chick got everything...and then she died from an accident. The entire family got wiped out because of \"disloyalty\" yeesh but funny as hell. (They even all met up in heaven and acted completely chill about the cheating and murder, she even got back together happily with her first husband, wonder why their not all in hell though I think that was the point of that picture)."},{"id":718245,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540394746,"body":"(LP) Them caring for \"Bastard\" grandchildren that aren't genetically related to them \"in any way\" similar to what happened to him\" \"blissfully unaware\" at all that their \"bloodline\" they love gloating about \"prospering\" is going to end (It's suspected they've been having sex recently in front of the dead guy's memorial in the house for added insult) and just like the husband. their completely unaware of it (hence Karma) and honestly I don't hate the son and his cheating wife since they at least look like their not \"dishonest\" about their fucked up relationship. Alot like another story where the Husband turned his wife into a \"cheating slut\" and had the \"stealing asshole\" under his payroll (even paying him to trick his wife into thinking they were having more sex behind his back, letting her think she has control) to sent him \"all their sexual moments\". He even was willing to raise the guy's bastard child alongside his own child with her as this shit continued. IT was funny to read.  "},{"id":718232,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540393990,"body":"(Continued from last post) never got to leave his \"genes\" behind (even the \"wife\" had an laugh at this, having fully embraced she was a cheating unloyal bitch who believed she \"got away\" with her sin and got \"everything\" in the process) as her son tells her how happy his marriage was and just how much his own wife was \"just like his mother\". The twist as you easily guessed is he \"purposely\" married a beautiful unloyal slut and let her believe she was \"doing the same thing his mother did to his \"father\" to him just to enjoy peeping on her cheating sex, his \"daughter\" is not his so basically not his \"whore\" of a mother nor his \"real father's\" grandchild. So \"their bloodline is going to die out\" in a funny \"karmic way\" (Pathetically too seeing how the dead husband was an \"unknowing\" cuck unlike the son. The story leaves off that the \"Husband\" is cursing his \"disloyal\" \"friend\" and \"wife\" by \"their\" son becoming a cuck and leaving no children behind.  (NEXT POST, Sorry)"},{"id":718229,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540393505,"body":"Got another NTR that was funny where the MC of the story became a cuck because of his bitch mother and his \"father's friend\". He got married, had a daughter, and brought his new family to his old home for his father's funeral. His mother has been living with his father's \"friend\" since his death, and then the story shows the past as the MC as a kid came across the two \"cheating with each other\", awakened to sex and start peeping on them, turns out he was the \"friend's\" son as she's \"barely\" been doing it with her husband before he was born and the both know it (he even looks more like the friend then his \"Father\". The two even have a laugh at the father's expense because he died for a family that \"wasn't even his\" as the \"Friend\" decided to get with the mother after his death and \"take his proper place\" as her husband alongside being her lover. Hell he even looked at his \"granddaughter\" and had a laugh at how the two's \"bloodline\" prospered, while his \"poor friend\" (NEXT POST)"},{"id":718222,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540392994,"body":"@Ecchinosuke I think Sanagi just \"embraced\" hentai logic and realized the asspulls used in NTR are going to get more and more boring so he might as well \"be as silly and ass pulley\" as possible. Honestly when he started going \"full NTR\" I blacklisted him as I did Takeda. Feels like he realized people were going to \"bitch\" about the story anyway and decided to \"just not care anymore\" about making sense (I honestly respect him for it, at least you know what to expect in his work, unlike other NTR writers who do some of the most retarded shit to make the NTR happen...I blame that abit on us since we defended them with the term \"Hentai Logic\", and like all terms, it's being used as a shield)"},{"id":718217,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540392668,"body":"@ItsMagic Then why did you come down to the comment section. I think you made a mistake Mr. \"Get A Life\" and the Porn is \"above this comment section\" if you want to \"just fap\". Always find it funny when \"Bozo the clown\" in his full makeup calls \"ME\" the weirdo....after beating someone to death with a Chicken....."},{"id":718053,"gallery_id":250445,"poster":{"id":1280841,"username":"ItsMagic","slug":"itsmagic","avatar_url":"avatars/1280841.png","is_superuser":false,"is_staff":false},"post_date":1540369502,"body":"I just want to fap tbh, ya'll are weirdos to give a shit about this. Get a life ffs."},{"id":717559,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540311831,"body":"To be honest my problem with NTR is mostly the story structure that sometimes makes no sense and does not work. Cheating hentai have always been there and I don't have beef with them but NTR just takes that concept and kind off shits all over it. For instance Sanagi Torajirou (Takeda Hiromitsu dumber younger brother) have lots of stories like that one in particular that seems made to piss me off. A happy couple move in to a new apartment and the landlord of set building used to be bully by the wife in high school, (You know we're this is going by now) landlord uses that information to blackmail her into becoming his cumdump or he'll tell the husband about her. This artist is known to always do shit like this in all his stories and is actually quite sad and boring."},{"id":717484,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540304627,"body":"I learned to just make them say \"Oh my car\" like in the Street Fighter games. It makes it funnier (After seeing so many repeats of the same scene, I have nothing but apathy for NTR now. All I get mad at is the tag's not being properly applied because it's becoming noticeable. That and so many FUCKING re-uploads (Especially of NTR), truthfully if it's to remove the censors on that one, then I don't mind, but why the fuck did I see so many uploads of that recently new Takeda story. That was too much honestly. Doesn't matter the genre (Mostly pissed because I was expecting newer stories, not a re-upload of a story that WAS ALREADY UPLOADED). This also seems to collide with my problem with the tags as a I noticed the \"Already Uploaded\" tag on them.....which means if they did that shit to a NTR story the never put more then that tag on it, causing the blacklist not to work unless you blacklist the Artist/Group. I'd rather not do so on those who actually do more then NTR. but left no choice."},{"id":717423,"gallery_id":250445,"poster":{"id":1924963,"username":"radslam","slug":"radslam","avatar_url":"avatars/1924963.png","is_superuser":false,"is_staff":false},"post_date":1540295577,"body":"@Ecchinosuke Dog Wife is one of the greats imo, too often in ntrs where the husband/boyfriend finds out about the affair  they just collapse to their knees and start fapping, instead of actually doing something productive like revenge or beating up the bull"},{"id":717394,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1540291291,"body":"I just read dog wife and I agree with Ecchinosuke that this sort of NTR wouldn't be bad every once in a while (Not that I pay attention to the plot much) and have reccently been reading some reverse NTR and it's not that bad :)"},{"id":717333,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540281073,"body":"I finished reading Dog Wife and I kind of want more stories like that one rather then the shit we keep getting, NTR with no consequence."},{"id":717020,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540240155,"body":"Sorry ya'll, Tried to re-find the story, but well, it's still tagged NTR, and I blacklisted NTR so it was like going through a sea of \"black\" Will keep looking...\n\nBut there's always \"Dog Wife\" where the guy \"doesn't\" let his cheating wife walk away \"karma-free\" after he caught her (it's really funny to read through). It's also a good one. and yeah \"@Otaku the Prince &amp; @Mangadropz\", I take full responsibility for a good amount of this getting as big as it did. Funny how bitching about \"mis-tagging &amp; \"tin-foil hat\" conspiracy's to trick me and other into viewing NTR\" got.....\"out of hand\" LOL. \"@Luckdie\" it's cool to be divided sometimes, I usually hate people when their response to disagreeing with me is to insult me more then \"countering my opinion\" like a human being), so same to you man."},{"id":716872,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540222752,"body":"Actually I kind off want read it too by this point it sounds interesting. "},{"id":716777,"gallery_id":250445,"poster":{"id":34199,"username":"NullHorizon","slug":"nullhorizon","avatar_url":"avatars/34199.png","is_superuser":false,"is_staff":false},"post_date":1540213027,"body":"@Otaku the Prince: You, sir and/or madame, are a gentleman and a scholar. Also, long comments are long. Not that I have a problem with that..."},{"id":716711,"gallery_id":250445,"poster":{"id":1691013,"username":"Otaku the Prince","slug":"otaku-the-prince","avatar_url":"avatars/1691013.png","is_superuser":false,"is_staff":false},"post_date":1540203469,"body":"Holy fuck, went to bed after reading the first THREE comments and come back to... this shit... took me a whole fucking hour and 23 minutes to read from there to here and..wow, don't know which is more interesting, the Hentai or the comment section. Honestly I look for NTR hentai just for the creative arguments people come up with bagging and defending certain genres. Good luck with everything :)"},{"id":716696,"gallery_id":250445,"poster":{"id":401066,"username":"dsfargeg","slug":"dsfargeg","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540201215,"body":"daily reminder nobody loves you and you will die alone and forgotten"},{"id":716679,"gallery_id":250445,"poster":{"id":1287260,"username":"Mangadropz","slug":"mangadropz","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1540197144,"body":"jesus christ. someone in this comment section clearly has way too much time."},{"id":716675,"gallery_id":250445,"poster":{"id":1998962,"username":"Luckydie","slug":"luckydie","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540196502,"body":"Uh, i want to like you because of some of things u said but then i disagree with other things you said and im overall conflicted but just know @LordCellOfEarth9, you're a chill person"},{"id":716673,"gallery_id":250445,"poster":{"id":1442090,"username":"Patriot_95","slug":"patriot_95","avatar_url":"avatars/1442090.png?_=28ee927c604aef60","is_superuser":false,"is_staff":false},"post_date":1540196040,"body":"@LordCellofEarth9 Damn, you're right about the situation of Ann and Shiho, I played the game two full playthroughs but you know, sometimes details and texts like that go over the head while playing, btw. which is the name of such story you explicit described? Looks like it's definitely worth a reading"},{"id":716632,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540190241,"body":"(Continued from last Post) He also was the one who started having the other girl approach the boyfriend. Effectively setting them up, especially as the girl was stupidly avoiding him, making him suspicious and he set the seeds of distrust (like \"Iago to Othello\" LOL) causing him to distrust her that he finally gave up and moved on to the other girl (and suspected that the coach showed him the pictures of them having sex without outing himself, hence why he ignored her like she was trash). And the final part of the plan was her giving in and throwing her self respect to the wind to be his eager masochistic bitch. And the best part, it looked like she was about to rage on him, but instantly continued to act like a bitch in heat, like she accepted she lost and accepted her fate...with him leaving her to be gangbanged by the other \"male teachers\" she looked down on to her eagerness like a boss. I liked it because it's one of the few NTR where the only one screwed over is the stupid girl."},{"id":716622,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540189913,"body":"@Patriot_95 this reminds me of another NTR where the coach played the girl in the exact same way. Training her till she became a masochist, and all her secret keeping to \"protect her boyfriend\" bit her in the ass as he started suspecting she was cheating on him, especially when she caught him spending time with another girl (which actually was innocent). In the end the Coach freed her from the blackmail, but the damage was done, her boyfriend left her for the other girl (even ignoring her when they walked past each other while he continued to talk to the other girl....causing her to get turned on from being ignored and losing him) and she went back to the coach and became \"his bitch\". The twist, the coach arranged EVERYTHING, he's the one who convinced her boyfriend to \"bring her to the love hotel and fuck her\" getting the blackmail that started this shit (since he's an up and comer he never planned on releasing it as he benefited from him being a success). (Continued on next post)"},{"id":716612,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540189592,"body":"@bladenight21 Being a \"NTR Lovers\" doesn't make you a race &gt;:(::\n\n@Patriot_95 I think one scene in Persona 5 said this well. Ann notes that Kamoshida would not have done anything to risk the Volleyball team not winning another national, so he would have very likely NOT put Shiho in a starting position. Meaning that had she given into Kamoshida's demand to have sex like what happened before he raped Shiho, it would have been for nothing (and seeing how she was seen as Kamoshida's \"bitch\" at that point, no one would believe her side of the story...that and them covering for the piece of shit) meaning everything the two did only hurt the other and they shouldn't have gotten involved with Kamoshida (Hell I suspect the coach was lying out of his ass on revealing that blackmail since he benefits from the Senpai making it as a Star Player, being the coach of said star player and she stupidly fell for it like she didn't have an alternative choice, your right he did dodge a bullet with her)."},{"id":716591,"gallery_id":250445,"poster":{"id":1442090,"username":"Patriot_95","slug":"patriot_95","avatar_url":"avatars/1442090.png?_=28ee927c604aef60","is_superuser":false,"is_staff":false},"post_date":1540186756,"body":"I only came here for the anal tag tbh. also, that baseball player definitely dodged a bullet.\nYeah, maybe the girl was doing this for him but he doesn't know that so in the end, everyone is happy; the girl is getting her butthole fucked while \"protecting her lover\", and the player is going to get another girl for him, so, I don't see anything wrong in this story"},{"id":716587,"gallery_id":250445,"poster":{"id":1242965,"username":"SanMig","slug":"sanmig","avatar_url":"avatars/1242965.png?_=2bc89387284fa4fd","is_superuser":false,"is_staff":false},"post_date":1540186359,"body":"bladenight21 hahaha"},{"id":716543,"gallery_id":250445,"poster":{"id":43535,"username":"bladenight21","slug":"bladenight21","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540182681,"body":"Vanillafags are bigoted racists who deserve to die :)"},{"id":716501,"gallery_id":250445,"poster":{"id":458885,"username":"JoJo49","slug":"jojo49","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540180693,"body":"Personally, I just come here for the comments drama"},{"id":716349,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540168335,"body":"@MeniLTere I know, isn't it grant LOL"},{"id":716262,"gallery_id":250445,"poster":{"id":754385,"username":"MeniL","slug":"menil","avatar_url":"avatars/754385.png","is_superuser":false,"is_staff":false},"post_date":1540159487,"body":"Damn more than a day and this comment section keeps getting better and better "},{"id":716081,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540145418,"body":"@alquienmirando While I did get into my dislike to NTR, I was mostly bitching about how \"Tags\" are not being properly applied (If NTR lovers would like less people to bitch on their hentai, then they should be wanting the taggers to properly tag their material, so then there's no excuse for complaining because \"Blacklist\"). I think we can all do with the \"shaming lines\" friend.\n\nAnd the mention of feminism was to making a note on \"masturb8\" comment about how Athletes are surrounded by THOTS and the fact the female MC of this story is a cheerleader. Please don't try to make it out as though I'm crusading for feminism, nothing's worse then someone twisting a person's words into something there not, and/or putting words in others mouth's.\n\nAnd \"donytyvi\" that comment is as overused and annoying as everyone saying \"First\" in a comment section. Say something more meaningful or don't comment at all (Same words for those who comment \"First\")\n\n"},{"id":716062,"gallery_id":250445,"poster":{"id":662256,"username":"yourmommom","slug":"yourmommom","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1540144106,"body":"when the comment section has more plot than the manga itself"},{"id":716051,"gallery_id":250445,"poster":{"id":1211799,"username":"alguienmirando","slug":"alguienmirando","avatar_url":"avatars/1211799.png","is_superuser":false,"is_staff":false},"post_date":1540142892,"body":"U guys are so passionate about cartoon porn; is honestly amazing. Im kinda jealous...seems fun. \nAlso; feminst mention on a ntr??? How progressive; this comment section! "},{"id":715996,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540138170,"body":"@masturb8 True that (Too bad Feminism is ruining that for the THOTS with looks, out of petty jealousy....Women am I right, if they can't be the THOT's they dreamed of being or can't anymore, then they'll assure the next generation can't either. Don't care myself either way, but it's amusing to watch none the less, like Pamela Anderson condemning Porn because she hit the wall and is to proud to do GILF porn LOL) "},{"id":715994,"gallery_id":250445,"poster":{"id":763280,"username":"masturb8","slug":"masturb8","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540137772,"body":"Athletes are surrounded by thots. These hoes aint loyal. While these thots are giving succ these athletes will be making millions"},{"id":715809,"gallery_id":250445,"poster":{"id":1242965,"username":"SanMig","slug":"sanmig","avatar_url":"avatars/1242965.png?_=2bc89387284fa4fd","is_superuser":false,"is_staff":false},"post_date":1540115247,"body":"@AYAYA it's too low"},{"id":715771,"gallery_id":250445,"poster":{"id":462677,"username":"MadMax777","slug":"madmax777","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1540109192,"body":"So great! Gonna fap again."},{"id":715756,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540107515,"body":"I found it funny that the title around the artist for this story changed, causing my Blacklist to un-shade it. I wonder if they took note of my bitching and declaration to just blacklist the artist instead.....Hmmm (Starts putting Thin Foil on head in complete paranoia fear)"},{"id":715748,"gallery_id":250445,"poster":{"id":971589,"username":"ArmpitEnjoyer","slug":"armpitenjoyer","avatar_url":"avatars/971589.png","is_superuser":false,"is_staff":false},"post_date":1540106192,"body":"So people here like to get cucked. Not into that beta thing "},{"id":715652,"gallery_id":250445,"poster":{"id":1608261,"username":"waaaaaaa","slug":"waaaaaaa","avatar_url":"avatars/1608261.png?_=bbc3694071157c93","is_superuser":false,"is_staff":false},"post_date":1540093755,"body":":thonking:"},{"id":715622,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540090430,"body":"Funny thing is. Someone on this story's comment section on E-Hentai a few hours ago made a good case that this technically wasn't NTR as the two character's weren't together.....though it falls apart as her being stolen by another guy is still NTR."},{"id":715619,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540090175,"body":"@Runzie What's wrong? Can't use the \"That's what the Blacklist option is for\" retort. Have to go back to before Tag's were even a thing. Sorry but that's kind of Pathetic. You were better off not making the comment, but what does one expect from much of the NTR base. They just like their genre like to \"repeat themselves over and over again with nothing really new other then the faces saying the lines\"."},{"id":715587,"gallery_id":250445,"poster":{"id":238862,"username":"Runzie","slug":"runzie","avatar_url":"avatars/238862.png","is_superuser":false,"is_staff":false},"post_date":1540086468,"body":"Dear vanilla fags, can you fuck off that way please? This is ain't your stuff"},{"id":715550,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540082566,"body":"Plus I actually find it funny that I like reading the comments on a NTR then the actual NTR. Another strike on how base line NTR has become more boring and boring that people come more for the comments then the ACTUAL NTR unless it has good Art....which is ruined by the NTR. Oh well, I'm not going to waste anymore time on hating NTR, they're's no point with Blacklisting being a thing, and if the taggers are secretly hoping to boost views on a NTR by not tagging properly, then I'll just Blacklist the Artist. and use the Blacklist as a \"sign\" to be cautious\" to avoid being \"Triggered\" that I was tricked into viewing NTR LOL (Also if the Taggers are doing that, FUCK YOU TAGGERS, \"EAT SHIT AND FALL OFF YOUR HORSES\")"},{"id":715540,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540081397,"body":"@Shady Individual I said my own piece on NTR and that's it, A Larger amount of my comments were directed at Mis-Tagging. Back to the Bride with ye Troll (And you didn't make any opposing commentary other then \"LOL how Gay LOL\" so don't even \"TRY\" using the classic \"You can't call people Troll's for disagreeing with you\" line, as that only applies if as I stated you actually said anything that was opposition other then trying, hoping \"AND FAILING as I won't reply if your next to me proves my point\" that your a troll and nothing more. Got no time in the last 60 years of my life to waste on your kind, So I say \"Good Day SIR\". Plus your Kink shaming those who like Yaoi just to insult us about \"overthinking Hentai\" \"Stupid Hypocrite\" in the off chance you had any meaning Troll)"},{"id":715535,"gallery_id":250445,"poster":{"id":754385,"username":"MeniL","slug":"menil","avatar_url":"avatars/754385.png","is_superuser":false,"is_staff":false},"post_date":1540081064,"body":"@Shady Individual totally agree with you lmao . Thats why this website has better comments than youtube haha"},{"id":715494,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540076800,"body":"@Shady Individual are you lonely about the fact that you won't get any."},{"id":715467,"gallery_id":250445,"poster":{"id":261212,"username":"Nudeclear","slug":"nudeclear","avatar_url":"avatars/261212.png?_=347810fb81a2da19","is_superuser":false,"is_staff":false},"post_date":1540074586,"body":"@Ecchinosuke @LordCellofEarth9 you two are perfectly fit for each other. Long ass comments, thorough analysis on hentai that most people only fap about, etc. Now now, get a room and suck each others dick hahahahaha"},{"id":715431,"gallery_id":250445,"poster":{"id":1996059,"username":"973-eht-namuh-973","slug":"973-eht-namuh-973","avatar_url":"avatars/1996059.png","is_superuser":false,"is_staff":false},"post_date":1540071866,"body":"This is what happen went you not tag properly. Just look at comment section and this guy needs help."},{"id":715418,"gallery_id":250445,"poster":{"id":1495782,"username":"ϻania","slug":"ania","avatar_url":"avatars/1495782.png?_=1d0b61b9e76d767a","is_superuser":false,"is_staff":false},"post_date":1540071067,"body":"why an ugly bastard"},{"id":715411,"gallery_id":250445,"poster":{"id":754385,"username":"MeniL","slug":"menil","avatar_url":"avatars/754385.png","is_superuser":false,"is_staff":false},"post_date":1540070551,"body":"Its been 15 hours guys what the hell"},{"id":715407,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540070352,"body":"@torrinoxx hi and welcome to this the very first comment section that didn't devolve into Anarchy."},{"id":715404,"gallery_id":250445,"poster":{"id":1024593,"username":"Hardgore","slug":"hardgore","avatar_url":"avatars/1024593.png","is_superuser":false,"is_staff":false},"post_date":1540069841,"body":"\nthe authors no longer think of anything good and they repeat and repeat the same shit...but the anal sex scenes were good "},{"id":715403,"gallery_id":250445,"poster":{"id":940390,"username":"torrinoxxx","slug":"torrinoxxx","avatar_url":"avatars/940390.png","is_superuser":false,"is_staff":false},"post_date":1540069673,"body":"I just read comment here"},{"id":715386,"gallery_id":250445,"poster":{"id":564400,"username":"sat590","slug":"sat590","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540068808,"body":"pfftttt next shitty manga."},{"id":715378,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540068039,"body":"Ecchinosuke \"OH GOD\" I hate when those devolve into a Harem, that defeats the purpose of calling it \"Reverse NTR\" then. But yeah I see what you mean, honestly it's interesting how much \"double standards\" I have (I despise BBM x Loli, But love the fuck out of BBW/MILF x Shota LOL)"},{"id":715361,"gallery_id":250445,"poster":{"id":291582,"username":"Zyzz unleashed","slug":"zyzz-unleashed","avatar_url":"avatars/291582.png?_=b50e4ae362765482","is_superuser":false,"is_staff":false},"post_date":1540066307,"body":"Humanity is fuck long ago agony is the way they live even in hell XD"},{"id":715319,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540063014,"body":"Yeah like the fact that some reverse NTR shows the girl getting her boyfriend stolen from her only to devolve into a harem cause seeing the girl suffer like a guy would is too much I guess."},{"id":715314,"gallery_id":250445,"poster":{"id":835847,"username":"Soss","slug":"soss","avatar_url":"avatars/835847.png","is_superuser":false,"is_staff":false},"post_date":1540062137,"body":"Stfu autist"},{"id":715287,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540058974,"body":"Ecchinosuke That and Cheating is okay in my book if the guy/girl getting cheated on has NO characterization and the artist/writer avoids NTR implications honestly, Hell a bonus of Netori in my book (before it started getting infected with NTR \"pretending\" to be Netori) is the one getting their significant other stolen acts alot like the \"stealing asshole\" in a NTR, while the \"Stealing\" MC is alot more sympathetic and it doesn't either \"cringe\" territory like NTR does (Like small cock and shit like that). I actually root for the stealing to happen (It's funny how in the case of Reverse NTR, as long as they avoid what I hate the most about NTR, Double Standard actually works here, Usually the girl getting her man stolen was not the good for him anyway, or had no characterization that I don't feel bad about it...unlike NTR where the Guy HAS to be a \"Nice Guy\", otherwise the \"cuck factor\" doesn't work). \n\nMudslinging helps no one but the Trolls &amp; Asses who love filling Comments with trash."},{"id":715280,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540058569,"body":"Ecchinosuke Agree, this is how \"diminished returns\" happen because they rather \"be happy\" with the NTR they got, rather then expect them to \"do something new at the very least\". NTR just \"exists\", and thanks to blacklist, I don't care much anymore to bitch about it. Just avoid it.\n\nYeah I agree with you on why Ima Ria happened as it did (as you put it, the BBM MC was foolish to get together with an idol even if she liked him back because what happened at the end was going to happen, and the good thing about that story is if you just stop at Chapter 1, then you can treat it as a \"happy\" Vanilla that is only a \"stand alone\" and not a \"set up\" for Chapter 2 &amp; beyond. Honestly I still do like Takeda and have all his \"Non-NTR\" works. It's sad that he's repeating himself over and over again in the NTR department and the only saving grace, which isn't much is the erotic artwork...Oh well like I said I have all his Non-NTR works and ignore his NTR works that it doesn't matter)\n"},{"id":715258,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540056165,"body":"Sorry if my comment about girlfriend was too much, however I just wanted to say the NTR just like every other kinks have a fan base I just fine that the majority of them that keeps saying things like VANILLA tag or normies like to see themselves in the shoes of the asshole rapists just cause he's getting laid and not crying. Takeda Hiramitsu's Ima Ria was a good book cause it wasn't just an NTR but because it was commentary on the Idol Industry how dark and corrupt it can get. Tuna Empire or Maguro Teikoku is one of my favorite author even if some if not all of its work revolves around cheating, the thing is that there a foundation can be found as for most NTR there is none. Again sorry I meant no insult to no one, rather I'm more disappointed with some of the fan base th as all."},{"id":715252,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540055271,"body":"(CONTINUED FROM LAST POST, COMMENTING ABOUT THE LENGTH WITHOUT LOGICAL REASONING WILL GET YOU IGNORED) Said NTR soured my view on NTR in general. But strangely I like \"Reverse NTR\" where it's the guy getting stolen. I think it's because it doesn't fall into the stupid \"trappings\" NTR has (Like say, one dicking is all it takes for the woman to throw away her dignity) and I'm not left with my thoughts on the aftermath for the stolen stupid girl as well. Every-time I do, I'm always thinking about \"Saki\" from \"Emergence\", no matter how much the writers try to draw a \"happy ending\" for everyone but the cuck at the end, that logic is still there that the chick is going t end up like Saki. While in a Reverse NTR, I see the chick stealing the guy in the vein of a \"Yandere\" and I love Yandere Hentai.....as long as there's no snuff or guro that is LOL. The only decent NTR is Netori &amp; Reverse and thanks to BS Tagging even their getting confused for Baseline crap NTR. What's up with the Taggers?"},{"id":715248,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540054842,"body":"(CONTINUED FROM LAST POST) What I meant by that last part was I saw one where the Girl without reason had sex with the \"Asshole\" without ANY CAUSE TO DO SO, despite not being a slut, despite wanting to save herself for her love interest. \"No\" she had sex with the Asshole....who originally attacked her to try and rape her because he's so good at sex, the girl's immediately get brainwashed....but wasn't that good of a fighter so he got his ass kicked. And you want to know what caused it.....HE CRIED LIKE A LITTLE BITCH AND BEGGED HER TO HAVE PITY ON HIM AND HAVE \"PITY SEX\" WITH HIM, Despite as I mentioned \"Not being a slut\" as she was a virgin and KNOWING he wanted to rape her originally. She decided \"okay, but just this once\" and we all know where that lead. The writer didn't even try to set the situation up, hell I feel that writer was trying to invoke \"Hentai Logic\" when that only applies if said girl was a slut prior to just sleep with her would be rapist. "},{"id":715243,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540054493,"body":"Ecchinosuke Using the \"have no girlfriend\" line is an insult to all of us who enjoy hentai. As much as I despise NTR. \"Kink Shaming\" is kind of hypocritical here (Throwing Stones in Stone houses). You have a point though about NTR, and the one problem with it's fan's is the only thing they can properly defend is \"It's got good art\"....and really nothing more. The fact some good artists like Takeda have \"fully gone to the dark side\" is very annoying. But we have to respect their decision to do so. and thank Nhentai &amp; Tsumino for having the \"Blacklist\", Fuck you E-Hentai). All the things you listed (Brainwash, ETC) are honestly everyone's favorites, but NTR annoyance is the artists/writers for them have run out of material that they start infecting those concepts (Took me a while to re-love Corruption after accidentally walking into a Corruption NTR a decade ago), and end up revealing as you said how stupid NTR ends up being (Especially in one where the girl stupidly walks into the NTR)"},{"id":715241,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540054123,"body":"Momoon That advice would work, if the Artist drawing NTR weren't doing everything possible when they draw the pictures that even without words, \"A picture tells a thousand words\". If you read all the clique NTR lines, especially with similar pictures and poses in other NTR, then your mind is going to substitute the missing words for you. (I do copy well drawn pics from a NTR sometimes that is in JAP, but I have to do it in a way that it leaves NO HINT that it's NTR so I just pretend it's something else and \"enjoy the art\", otherwise my mind WILL recognize it as NTR for the reasons I stated it and it's ruined for me, I have no choice but to delete it)\n"},{"id":715239,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540053803,"body":"\"SanMig\" you said it best. Calling others gay \"in this current year\"? \"N O D I G I N I T Y\" \n"},{"id":715235,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540053585,"body":"ayus31 Proving my point that you went to immediately insult me when I said something negative about NTR then READING MY FUCKING COMMENT NTR Cuck...or Troll if your not into NTR and just wanted to troll. I was talking about tag's not being placed WHERE THERE SUPPOSE TO, Not the NTR itself (If it was tagged AS NTR, I would never have even shown up in the comment). "},{"id":715233,"gallery_id":250445,"poster":{"id":261212,"username":"Nudeclear","slug":"nudeclear","avatar_url":"avatars/261212.png?_=347810fb81a2da19","is_superuser":false,"is_staff":false},"post_date":1540053549,"body":"Fucking anal bullshit. Fuck her pussy damn it!!"},{"id":715227,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540053279,"body":"That and NTR in my opinion is not a genre by this point, cause it feels like its just brainwashe, mind control, blackmail, cheating, hypnosis, mind break, corruption, rape, gangbang, and out right stupidity on the writers part by making characters so stupid that is kind off hard to relate to them. "},{"id":715214,"gallery_id":250445,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1540052865,"body":"Because actually having the guy have a pair and do something about the situation, and the girl smart enough to admit she fucked up takes effort, and actual intelligence something that most if not all NTR writers don't do or have. Is the same story being told over and over again, to the point that you know what's going to happen, how is going to happen, and how is going to end. NTR has no foundation to stand on which is the reason why it feels so hollow and the worse is that most of its fan are a bunch sociopath that probably never had a girlfriend as they put themselves in the shoes of the rapists cause they don't want to feel bad, that is not how you shout watch it NTR is for emotional masochist who enjoy pain not a bunch of assholes who don't even know what Netorare means and still call themselves fans. I love VANILLA cause at least it's doing the job that it was created for and that is being a foundation to support the story."},{"id":715201,"gallery_id":250445,"poster":{"id":1133655,"username":"SpecialBoy","slug":"specialboy","avatar_url":"avatars/1133655.png","is_superuser":false,"is_staff":false},"post_date":1540051167,"body":"I’d rather like men then NTR."},{"id":715181,"gallery_id":250445,"poster":{"id":755753,"username":"sirflim","slug":"sirflim","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540049774,"body":"@ItsAtlas3 My issue with ntr is just how formulaic it is. 90% of it is literally a carbon copy of every story before it. My other beef is how many of these stories don't let the \"victim\" in on the truth by the end of the story, and the few that do always go the \"I'm so wimpy I'm just going to stand here and ejaculate in my pants while I watch my girl getting boned\". So she's become a dick slave to some grotesquely offensive piece of trash, why not let the guy know about it? Why not let him at least try to do something about it even if he gets the shit kicked out of him, or make him kill himself. Make the girl actually feel bad for a moment even if she is so brainwashed into enjoying the nasty ass smegma dick no real girl would go 20 feet near. \n\nI dig the drama, but I can only really enjoy like 1 out of 30 NTR stories. They're usually just too cringey. "},{"id":715164,"gallery_id":250445,"poster":{"id":1242965,"username":"SanMig","slug":"sanmig","avatar_url":"avatars/1242965.png?_=2bc89387284fa4fd","is_superuser":false,"is_staff":false},"post_date":1540049072,"body":"ayus315 Chill.calling someone gay doesn't make you a real man in fictional world hahaha\n"},{"id":715152,"gallery_id":250445,"poster":{"id":763113,"username":"Momoon","slug":"momoon","avatar_url":"avatars/763113.png","is_superuser":false,"is_staff":false},"post_date":1540047370,"body":"It's not that bad as long as you don't read the words"},{"id":715095,"gallery_id":250445,"poster":{"id":1326771,"username":"thebl00dedge","slug":"thebl00dedge","avatar_url":"avatars/1326771.png","is_superuser":false,"is_staff":false},"post_date":1540039185,"body":"i found this to be so annoying cause me and the coach have the same scar "},{"id":715082,"gallery_id":250445,"poster":{"id":1230299,"username":"ItsAtlas","slug":"itsatlas","avatar_url":"avatars/1230299.png?_=17a96b9c3a1d3145","is_superuser":false,"is_staff":false},"post_date":1540037131,"body":"Is it me or did i just get burnt out from to much ntr... It just got randomly boring i usually just let how stupid the black mails are but after it got boring i just cant get out my mind how SOME ntr fmc are so dumb says shit like \"i need to keep holding on for senpai\" or just getting fucked so they do,t get black mailed\"oh i cant let senpai see!\".... And anyone know what he means by *THAT* delinqent did he get some small shitty detention for idk not wearing school uniform?"},{"id":715059,"gallery_id":250445,"poster":{"id":1438238,"username":"mase10","slug":"mase10","avatar_url":"avatars/1438238.png","is_superuser":false,"is_staff":false},"post_date":1540033134,"body":"stop being a worthless faggot @ayus31"},{"id":715055,"gallery_id":250445,"poster":{"id":989568,"username":"thatrandomblackdude","slug":"thatrandomblackdude","avatar_url":"avatars/989568.png","is_superuser":false,"is_staff":false},"post_date":1540032433,"body":"tbh these typa stories are just boring now. it's like the same thing everytime. still gets my dick hard tho"},{"id":715046,"gallery_id":250445,"poster":{"id":792911,"username":"That Guy 319","slug":"that-guy-319","avatar_url":"avatars/792911.png?_=230a595efe04ec92","is_superuser":false,"is_staff":false},"post_date":1540031101,"body":"How many times has this same story been told but by different authors...I've lost count."},{"id":715026,"gallery_id":250445,"poster":{"id":1045807,"username":"ayus31","slug":"ayus31","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540027349,"body":"LordCellofEarth9 shut up normies..\nVanilla is for gay...\nAhh, how refreshing to watch NTR early in the morning...\nOnly those stupid asshole will dislike this kind of genre.\nVanilla?\nWtf, so you're fapping to mister nice looking guy with a really lucky scenario. Fucking gayshit.\n\nIf you're enjoying vanilla just because the guy isn't an ugly bastard then your a fucking gay.\nSo your basically fapping to a handsome looking animated comic dude,gayshit at it's finest."},{"id":715024,"gallery_id":250445,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1540027124,"body":"Oh hey welcome to this website LOL XD @LordCellofEarth9"},{"id":715009,"gallery_id":250445,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540025858,"body":"Again with this shit? I just saw this tagged as NTR on E-Hentai. Yet I come around here looking for updates....just to see this one \"CLEARLY\" (as NTR is among my Blacklisted). Any NTR Lovers who dislike us \"Vanilla Faqs\" want to chime in on us \"bitching and moaning\" about NTR and not using the blacklist when shit like \"this SHIT happens\".\n\nSeriously NHentai, WTF?....Oh well maybe this artist will make some good hentai in the future not NTR, maybe they won't, I won't no because I'm blacklisting them the moment this comment gets posted. As I made a point when I saw this shit in a previous NTR that wasn't tagged properly. If they're trying to \"brainwash\" us \"vanilla faqs\" into accepting NTR by forcing it down our throats with all these's \"re-uploads\" and \"mis-tagging\", then I say \"power to them\" I'll just \"blacklist the artist and/or group then\". As it's the only damn thing they can't \"mis-tag\" now \"can they\""},{"id":714986,"gallery_id":250445,"poster":{"id":969786,"username":"Xucker11","slug":"xucker11","avatar_url":"avatars/969786.png?_=980b3317edf04e39","is_superuser":false,"is_staff":false},"post_date":1540022577,"body":"Fuck the ending"}]