[{"id":718159,"gallery_id":250734,"poster":{"id":1783845,"username":"maxtor","slug":"maxtor","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540385254,"body":"im a ntr fan. but this is nowhere near as good as seasons of sogetsu, a classic from sanbun, that honestly, he has never topped. "},{"id":717209,"gallery_id":250734,"poster":{"id":1047,"username":"kirino","slug":"kirino","avatar_url":"avatars/1047.png","is_superuser":false,"is_staff":false},"post_date":1540266117,"body":"I agree with @BiggieDubz lets not fight this should be a place of happens and faps not aggressive comments just cuz you don't like what's someone else like."},{"id":717177,"gallery_id":250734,"poster":{"id":1527258,"username":"7 Eyes","slug":"7-eyes","avatar_url":"avatars/1527258.png","is_superuser":false,"is_staff":false},"post_date":1540263123,"body":"I don't know if to think you guys suck at this or be embarrassed that I can tell so easily but imo the cover itself lets you know what you're in for, imo. I have only been duped a few times and only because it's made to do so, in some stories. Try to at least learn some key jap words in regards to what you may or may not like and some artists are pretty much dead set on their genres so avoid people like sanbun, rocket monkey, mashiraga aki, etc... if you're so disgusted by ntr. They may sometimes put out vanilla or neutral works but you'll be safer for avoiding them "},{"id":717076,"gallery_id":250734,"poster":{"id":800422,"username":"BiggieDubz","slug":"biggiedubz","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1540248404,"body":"Also @bladenight21, you do realize the reason so many \"vanillafags\"have been popping up lately is because the uploaders are bad at tagging stuff?  I've blacklisted rape, NTR, orgy, ugly bastard... you name it.  What, in the case of this manga specifically, am I supposed to blacklist in order to avoid it?  It's to the point where I have to blacklist specific artists, but frankly that's a lot of work and I don't want to do it.  My point is that you should really be redirecting your anger/frustration towards NHentai, not the users who are trying to fap.  Let's be on the same side and try to get the mods to make the site a better place to find fap fuel, yeah?  (Also sorry for my previous, aggressive comment)"},{"id":717074,"gallery_id":250734,"poster":{"id":800422,"username":"BiggieDubz","slug":"biggiedubz","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1540247966,"body":"Kill all cucks :)"},{"id":716994,"gallery_id":250734,"poster":{"id":43535,"username":"bladenight21","slug":"bladenight21","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1540238184,"body":"Racist vanillafags go kys :)"}]