[{"id":1282855,"gallery_id":253147,"poster":{"id":3731107,"username":"drnam645","slug":"drnam645","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603185094,"body":"One more thing, if someone has some knowledge in japanese i do too (even if its's just a litte) the hardest part for me is to identify the different kajis, but it'd be easier if I had some one with whom share the work. It would be a great opportunity for me to practice and learn more japanase. Page 58 had a particular kanji that for the life of me I just couldn't find. At the very least we would be one step closer to finally have this thing translated"},{"id":1282837,"gallery_id":253147,"poster":{"id":3731107,"username":"drnam645","slug":"drnam645","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603184644,"body":"I don't know in what part they come to the conclusion that the headmaster can't have children despite cumming inside her multiple times, I don't know who revealed this info or if it's legit. I also don't know what happened to headmaster after chapter five. And in the end teacher says that the baby is his and his stepmother over hears it, and somehow at that moment he sees his dead mother fly  off. Don't really now what to make of that ending thou. I'm here also hopping for a full translation only chapter 1 is translated. If some one does understand more and can feel in the blanks or correct me please do, we are in this boat together fam."},{"id":1282832,"gallery_id":253147,"poster":{"id":3731107,"username":"drnam645","slug":"drnam645","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603184466,"body":"Were he realizes that things are not so bad, since here stepmother already had his father, teacher is free to be with whomever she wants and he was also just using here for sex and a substitute for here death mother and bullies won't stop unless he confronts them, so he needs to stand up for himself. Later for reason that I can't understand, teacher gets fed up with the headmaster and leaves and decides to stay secluded at here home, headmaster tries to take her back but she doesn't respond. Seems like he tries to win teacher back but gets in a fight with the bullies and has one last confrontation with his inner demons with the help of his dead mother as @hackoftheworld explained. What im not totally sure yet is when in the previous chapter his spirit sees teacher and headmaster kissing iif that is one last hallucination or if it's real, would be preatty scummy but woudn't surprise me. In the end seems like teacher apologises for not keeping here promise of protecting him"},{"id":1282820,"gallery_id":253147,"poster":{"id":3731107,"username":"drnam645","slug":"drnam645","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603184145,"body":"Soooo, what i managed to understand is that the boy had some affair with his stepmother, but then reality check cause in the end she still his father girlfriend, so he seeks comfort on his teacher. Both as some sort of substitute over the lost of her dead mother, bullies are bullies and he can't stand against them. Teacher takes pitty on him an fucks him over almost the entire summer. Headmaster finds out and initially coerce her into becoming his sex partner in exchange of not revealing her affair with here student. In typical NTR fashion, she accpets in order to \"protec\" him but eventually falls into pleasure, that and also headmaster seems to project his deceased wife onto here and gives here here airings. she seems to start to take pity on him too. So the convination of pitty, enjoying their sexual encounters, and being a better idea to stop fucking here student; she fully becomes the headmasters partern. MC gets fed up and decides to end it all, but has some revelation"},{"id":1123216,"gallery_id":253147,"poster":{"id":2075190,"username":"jesterxmusketeer","slug":"jesterxmusketeer","avatar_url":"avatars/2075190.png","is_superuser":false,"is_staff":false},"post_date":1596522048,"body":"LPT: You can download google translate on your phone and use the camera feature to scan and translate any language you want. The translation kinda retarded but just good enough to understand whats going on. Btw I don't know why no one wants to translate this work to english. Its pretty good imo"},{"id":831135,"gallery_id":253147,"poster":{"id":1652256,"username":"Jeanne d'Arc","slug":"jeanne-d-arc","avatar_url":"avatars/1652256.png","is_superuser":false,"is_staff":false},"post_date":1551315055,"body":"So many good positions and angles but god damn the drawing is lame af. Imagine if someone like fue or shindol redrew all of this. It would probably be all time high rated hentai"},{"id":765232,"gallery_id":253147,"poster":{"id":2065714,"username":"Kaizer4444","slug":"kaizer4444","avatar_url":"avatars/2065714.png?_=206537542e19d667","is_superuser":false,"is_staff":false},"post_date":1545734809,"body":"If only knew WTF shit's happening"},{"id":748101,"gallery_id":253147,"poster":{"id":71167,"username":"fanhuachengshi","slug":"fanhuachengshi","avatar_url":"avatars/71167.png","is_superuser":false,"is_staff":false},"post_date":1543842473,"body":"Seems to be a good end(nope)"},{"id":746871,"gallery_id":253147,"poster":{"id":287357,"username":"bluemorpho99","slug":"bluemorpho99","avatar_url":"avatars/287357.png","is_superuser":false,"is_staff":false},"post_date":1543723003,"body":"thanks hackoftheworld at least i dont need to wait until the english translation come (which is probably never come)"},{"id":739822,"gallery_id":253147,"poster":{"id":1143922,"username":"lordofwill","slug":"lordofwill","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1542987414,"body":"This is so sad can't fap to this，good story though"},{"id":738480,"gallery_id":253147,"poster":{"id":1780967,"username":"instra","slug":"instra","avatar_url":"avatars/1780967.png","is_superuser":false,"is_staff":false},"post_date":1542831149,"body":"I’m not even horny why am I on this site.  Why am I reading this. Why does this make me want to bleach my eyes "},{"id":734534,"gallery_id":253147,"poster":{"id":988214,"username":"hackoftheworld","slug":"hackoftheworld","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1542372995,"body":"For those who want to know the plot. The boy had bully trauma(resulted by 2 student) From there on, this 2 guy keep haunting him in his dream. For long time, he failed to overcame his own fear until the chapter 5, he fought back both physically and later mentally(chapter 6). He was hurt, but he manage to beat those guys and go find his teacher. The last fight happen mentally as he was trying to convince himself teacher still love him and evil part of himself say otherwise, she have multiple sex partner for pleasure and love toward the boy was fake all along. Just when evil part almost win, his mother appeared to support him and table turned. He wake up after fall unconscious for 2-3 months. THEN SHE GONNA RAISE THE HEADMASTER'S BABY WITH THE BOY AND YAY, HAPPY ENDING. Nah, headmaster was Azoospermia."},{"id":734121,"gallery_id":253147,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1542323286,"body":"This is a chinese translation not a reupload u moron"},{"id":734034,"gallery_id":253147,"poster":{"id":195895,"username":"1911213843","slug":"1911213843","avatar_url":"avatars/195895.png","is_superuser":false,"is_staff":false},"post_date":1542311827,"body":"So weird                !\n"},{"id":734002,"gallery_id":253147,"poster":{"id":1220485,"username":"Branlix2000","slug":"branlix2000","avatar_url":"avatars/1220485.png?_=7befc944ca9d1e09","is_superuser":false,"is_staff":false},"post_date":1542307246,"body":"Just ! Why does it exist?!"},{"id":734001,"gallery_id":253147,"poster":{"id":7627,"username":"gantz123","slug":"gantz123","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1542307078,"body":"WTF!!!!!!!!!!!!"},{"id":733979,"gallery_id":253147,"poster":{"id":1516349,"username":"estarossa13","slug":"estarossa13","avatar_url":"avatars/1516349.png","is_superuser":false,"is_staff":false},"post_date":1542304582,"body":"So many reuploads from this artist but still no translation?"},{"id":733965,"gallery_id":253147,"poster":{"id":661977,"username":"sexysentinel","slug":"sexysentinel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1542303478,"body":"Da fuq was this shit"}]