[{"id":2167980,"gallery_id":253823,"poster":{"id":3724507,"username":"horn e","slug":"horn-e","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638072311,"body":"While y'all is being mad at eachother, ahri needs to fix her brain and she desperately need a new one"},{"id":991743,"gallery_id":253823,"poster":{"id":2363996,"username":"raspberry milk man","slug":"raspberry-milk-man","avatar_url":"avatars/2363996.png?_=de41865aa39635a8","is_superuser":false,"is_staff":false},"post_date":1591781435,"body":"for all my fellow vanilla boyz, this shit is non canon 'cause warwick doesn't have that tank on his back.\nthank you for coming to my ted talk "},{"id":955881,"gallery_id":253823,"poster":{"id":656972,"username":"Black Jesus Christ","slug":"black-jesus-christ","avatar_url":"avatars/656972.png","is_superuser":false,"is_staff":false},"post_date":1561718788,"body":"This is hurt to read"},{"id":950916,"gallery_id":253823,"poster":{"id":810157,"username":"Nemesistheking","slug":"nemesistheking","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561344526,"body":"@TruthTeller yo shut the fuck up its hentsi. Why are you crying about it?"},{"id":946213,"gallery_id":253823,"poster":{"id":1015155,"username":"TruthTeller","slug":"truthteller","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1560995520,"body":"@Lucifer-san use every single time this has happened there has been something deeply and obviously flaw behind it, not to mention this being judged by the victors as everything in history is meaning every time someone has had good intentions and it's workled out they are judged as good but if it dosent work out because they are on the losing side they use that expression\n\nalso seriously becoming bland? more like i dont just break and change my mind because this time i liked the fictional character representative of what we desire in real life being disrespected and ruined due to nothing at all.\n\nfuck this author, fuck anyone who thinks this is fine because it's just fiction, and fuck anyone who honestly believes just because this is made by the same author it isnt a fanfic"},{"id":946210,"gallery_id":253823,"poster":{"id":1015155,"username":"TruthTeller","slug":"truthteller","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1560995296,"body":"@Lucifer-san also lets not get into the fact of the massive fucking double standard the fuck author is conveying here, she can ''let herself go'' but he cant get drugged and forced against his will? see i'm actively in my life trying to destroy such bullshit doublestandard stereotypes however i can, but somehow i feel like you arent doing that\n\nalso work of fiction? in works of fictions things arent as stupid complicated they can be in real life, they can be as obvious and as black and white as they are written on the fucking page, and YET this dsigusting piece of shit destroys that because he wanted some more money, that is truly disgusting and another instance of people doing retarded things for a buck, also once again, do i have to mention that some people actually care about the fictional works as they represent something aand when some cunt tries to destroy it they destroy something precious? also the term ''the road to hell is paved with good intentions'' never actually works bec"},{"id":946203,"gallery_id":253823,"poster":{"id":1015155,"username":"TruthTeller","slug":"truthteller","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1560994883,"body":"@Lucifer-san you get me wrong, actually you dont really the difference is you actually think that i wouldnt do the same to stop this irl aswell, also it may be a fictional work but that dosent change the fact that author made this out of nothing just to sell garbage and completely destroys how these characters would act, and guess what you made a larger speech than i ever did, also lets not forget the fact that this is akin to the shit that happened to got, a complete destruction of characters, for what? are you honestly saying you dont feel disgusted by reading this garbage? he cant even continue it because that's how garbage it is"},{"id":939221,"gallery_id":253823,"poster":{"id":1430602,"username":"Lucifer-san","slug":"lucifer-san","avatar_url":"avatars/1430602.png","is_superuser":false,"is_staff":false},"post_date":1560484608,"body":"Do not get me wrong - if someone tried to wrong me by stealing my significant other, I would very much like to throughly torture, use their flesh for my own personal purposes, and keep their shrunken heads as trophies (even keeping an entire room), but being outraged over a fictional character being displayed in an unsavory manner in a work of fiction does not warrant throwing a shit fit over it. Doing it over so many repeated times and on numerous different websites would cause such an action to become more of a chore over time and become rather bland."},{"id":939215,"gallery_id":253823,"poster":{"id":1430602,"username":"Lucifer-san","slug":"lucifer-san","avatar_url":"avatars/1430602.png","is_superuser":false,"is_staff":false},"post_date":1560484144,"body":"Evil will always exist - trying to fight it by killing and justifying it \"in the name of justice\" is but a mere farce to practice evil while maintaining the belief that it is for a \"higher purpose\". Numerous people have used such rationale in the past - after all, the old adage that \"the road to Hell is paved with good intentions\" have persisted in history for so long."},{"id":939214,"gallery_id":253823,"poster":{"id":1430602,"username":"Lucifer-san","slug":"lucifer-san","avatar_url":"avatars/1430602.png","is_superuser":false,"is_staff":false},"post_date":1560483997,"body":"@TruthTeller Lets face it. You and many others can hate all you want, but all there is at the end of the day is a pursuit to censor that which you do not like, all the while such acts take place in reality. You'd save fictional characters (who do not express \"free will\" in the sense that true living organisms do), but let NTR be rampant all over the world and videos being bought and shared throughout the Abyss Web (what I call the Dark Web/Deep Web) for anyone to access. That is - sadly- the extent of what White Knights can do. All talk, but no real strength in reality. [Humans have their dark fantasies from time to time.]"},{"id":939208,"gallery_id":253823,"poster":{"id":1430602,"username":"Lucifer-san","slug":"lucifer-san","avatar_url":"avatars/1430602.png","is_superuser":false,"is_staff":false},"post_date":1560483596,"body":"@TruthTeller You say you'll kill them all? I dare say you tell lies rather than truth. Do not get me wrong - there ARE real people who do commit NTR (which I find unsavory, considering I come from a more traditionalist Christian family), but it would be absurd even for me to declare to kill every single person who commits such an act. You do not know exactly where, when, and how each and every different person would commit it - are you going to turn the world into Orwell's \"Nineteen Eighty-Four\"? I would not stoop so low as to become a criminal in the eyes of the law to take out criminals in the eyes of morality.  And what about 200 years from now? Would you still keep that promise? Absurd. Even more absurd it would be when it is a mere work of FICTION is what spurs you on. [Though works of literature has indeed driven many a great person to higher pursuits, it is to be acknowledged that the work above is but more dramatized and fantastical imitation of reality.]"},{"id":939199,"gallery_id":253823,"poster":{"id":1430602,"username":"Lucifer-san","slug":"lucifer-san","avatar_url":"avatars/1430602.png","is_superuser":false,"is_staff":false},"post_date":1560483119,"body":"Meanwhile people be writing essays in the comments that has only pathos and no logos. An argument can only be an argument if it is supported by evidence and is written from an objective point of view. This is the basics for developing an argument that should have been a skill learned before graduating from high school. [You can name call all you want, but the fact is that one should not expect the opposition to respect you or even consider thinking you are correct if you think insults and swearing are the way to go]. As it stands, the average argument against NTR in the comments are deeply flawed and are more just opinions - rather than a legitimately constructed argument that supports the side one fights for. [I do not mind reading the comments, but at best they are all just white knights that are far too naive of how cruel reality is.]"},{"id":860724,"gallery_id":253823,"poster":{"id":17102,"username":"my-raifu","slug":"my-raifu","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1553989268,"body":"NTR sequel, what a load of shit"},{"id":787670,"gallery_id":253823,"poster":{"id":735110,"username":"kittyclaire","slug":"kittyclaire","avatar_url":"avatars/735110.png?_=d06b7831f9a35da7","is_superuser":false,"is_staff":false},"post_date":1547526972,"body":"wish i could be in ahri's place x3"},{"id":780928,"gallery_id":253823,"poster":{"id":1015155,"username":"TruthTeller","slug":"truthteller","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1546976621,"body":"the fact that this even fucking exists is pathetic"},{"id":780902,"gallery_id":253823,"poster":{"id":1015155,"username":"TruthTeller","slug":"truthteller","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1546974122,"body":"this physically made me puke. this is the most disgusting inhuman thing i have EVER read, ait makes literally fucking no sense and proves how fucking morally corrupt and braindead people are, and if i ever find this piece of shit i will beat the shit outta him\n\nthe destruction and moral bankruptcy of humanity everybody, get the fuck off while you can, the cuck needs to die"},{"id":780891,"gallery_id":253823,"poster":{"id":1015155,"username":"TruthTeller","slug":"truthteller","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1546973077,"body":" @👌⚐🕆☠👎👍☠✌🏱✌☹💣 this ''FEELS'' like netorare? are you fucking braindead? this is netorare, and it's the most disgusting shit i've ever fucking seen, this is such fucking an amount of cuck that the author is just fucking asking to be shanked holy fuck how much of a cuck can you be? not o mention this is completely fucking retarded\n\nalso let's not mention how much of an obvious cuck the author is after making the garbage double standard that it's okay for her to cheat but not for him, holy fuck this disgusts me to another fucking leve, i'm seriously about to fucking puke"},{"id":772838,"gallery_id":253823,"poster":{"id":1134530,"username":"Null17","slug":"null17","avatar_url":"avatars/1134530.png","is_superuser":false,"is_staff":false},"post_date":1546382002,"body":"What a bitch shes mad that his dick gets hard for another women while shes being fucked buy other men i guess that's hentai logic for you"},{"id":769347,"gallery_id":253823,"poster":{"id":1769963,"username":"Shiro Ecchi","slug":"shiro-ecchi","avatar_url":"avatars/1769963.png?_=10f6b076542f3552","is_superuser":false,"is_staff":false},"post_date":1546114053,"body":"and then theres Riven"},{"id":752308,"gallery_id":253823,"poster":{"id":1109498,"username":"Red Railgun","slug":"red-railgun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1544333651,"body":"This feels like netorare for me. Seriously it feels like netorare. I don't like it, despite having read through it, I still don't like that it feels like netorare."},{"id":751273,"gallery_id":253823,"poster":{"id":2088967,"username":"shxro","slug":"shxro","avatar_url":"avatars/2088967.png","is_superuser":false,"is_staff":false},"post_date":1544201983,"body":"I need a 3rd part where ahri and Warwick apologize to each other or something like that please "},{"id":740288,"gallery_id":253823,"poster":{"id":1337221,"username":"xxnarutoxx","slug":"xxnarutoxx","avatar_url":"avatars/1337221.png","is_superuser":false,"is_staff":false},"post_date":1543042753,"body":"Fuck that fox mr wolf is all she needed"},{"id":739574,"gallery_id":253823,"poster":{"id":1934015,"username":"13575677654456","slug":"13575677654456","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1542957976,"body":"Who tf keeps reuploading this shit"},{"id":739571,"gallery_id":253823,"poster":{"id":1848394,"username":"Ethalos","slug":"ethalos","avatar_url":"avatars/1848394.png","is_superuser":false,"is_staff":false},"post_date":1542957424,"body":"It's missing the Ahegao tag, Ahegao is the best tag how could they leave it out"},{"id":739545,"gallery_id":253823,"poster":{"id":43535,"username":"bladenight21","slug":"bladenight21","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1542955051,"body":"kys vanillafags :)"},{"id":739466,"gallery_id":253823,"poster":{"id":1160854,"username":"sekutai","slug":"sekutai","avatar_url":"avatars/1160854.png","is_superuser":false,"is_staff":false},"post_date":1542947156,"body":"So when do we get some riven action?"},{"id":739448,"gallery_id":253823,"poster":{"id":1202548,"username":"gxwild5","slug":"gxwild5","avatar_url":"avatars/1202548.png","is_superuser":false,"is_staff":false},"post_date":1542945077,"body":"Grrrr!     "},{"id":739434,"gallery_id":253823,"poster":{"id":1991384,"username":"chickenlickinfuck","slug":"chickenlickinfuck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1542943668,"body":"Twas not a proud fap"},{"id":739385,"gallery_id":253823,"poster":{"id":1739094,"username":"akinlabistclair","slug":"akinlabistclair","avatar_url":"avatars/1739094.png?_=5660288bbcb306a8","is_superuser":false,"is_staff":false},"post_date":1542937768,"body":"My recommend on YouTube is full of video's with that new hero who can \"copy\" others and now i have to see it here also? I can't catch a break can I? "},{"id":739342,"gallery_id":253823,"poster":{"id":1281503,"username":"Electrique","slug":"electrique","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1542933718,"body":"Por alguna razón esto me deprime"}]