[{"id":973915,"gallery_id":254599,"poster":{"id":2567844,"username":"just a boy with a trombone","slug":"just-a-boy-with-a-trombone","avatar_url":"avatars/2567844.png","is_superuser":false,"is_staff":false},"post_date":1563074390,"body":"Honk honk\n"},{"id":745924,"gallery_id":254599,"poster":{"id":778330,"username":"Virtud","slug":"virtud","avatar_url":"avatars/778330.png","is_superuser":false,"is_staff":false},"post_date":1543629685,"body":"I actually love this site more than Tsumino, faults and all, but it seriously gets annoying when I go to Touhou Project tag to try and find new content, or at least new English translated ones from older ones, but I find the same recycled crap all over again. That really sucks, I hope they change that soon enough."},{"id":745683,"gallery_id":254599,"poster":{"id":41197,"username":"firestorm252","slug":"firestorm252","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1543602806,"body":"It seems NNN is getting everyone antsy. feel free to take grievances to other sites. If you pay enough maybe they'll even care. "},{"id":745682,"gallery_id":254599,"poster":{"id":24556,"username":"Dr_Death","slug":"dr_death","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1543602769,"body":"I agree with shino. As good as this site is, and i never have lack of seeds while torrenting, the fact that a gallery cannot be removed or updated is very old school and you can see the flaws with the system right now."},{"id":745670,"gallery_id":254599,"poster":{"id":2017242,"username":"Reverie01","slug":"reverie01","avatar_url":"avatars/2017242.png","is_superuser":false,"is_staff":false},"post_date":1543601503,"body":"Fuck that, I never told anyone to become a disappointment to their parents and slave away drawing little kids getting raped before their deadline while living in their cramped room and dining on convenience store ramen. And I certainly never told the admin(s) here to mirror other sites without having a proper way to update galleries or to never keep any of their promises like to allow updating and editing galleries. Free or not, fuck this, fuck that, fuck Fakku and fuck you. The end."},{"id":745589,"gallery_id":254599,"poster":{"id":66887,"username":"shinobinomono","slug":"shinobinomono","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1543594929,"body":"oh yes as always, lets not upload something new lets just upload stuff we already uploaded just because it had a wrong spelled word or something dumb like that. someone needs to make a better hentai page since nhentai just wants to keep uploading the same thing over and over and over"}]