[{"id":1934975,"gallery_id":255653,"poster":{"id":4381591,"username":"leocalonge100","slug":"leocalonge100","avatar_url":"avatars/4381591.png?_=11aeb193231c8110","is_superuser":false,"is_staff":false},"post_date":1628564726,"body":"The mother the daughter are both iddiot and can someone kill that guy and that idiot boyfriend or childhood friend is iddiot kill that guy"},{"id":953397,"gallery_id":255653,"poster":{"id":324760,"username":"bloodtears23","slug":"bloodtears23","avatar_url":"avatars/324760.png?_=fa233efccb8c3469","is_superuser":false,"is_staff":false},"post_date":1561528932,"body":"The guy just listens, he no longer hurt about the girl's and the douche's affairs since he too did ntr things on some of his girls. They checked on a hotel and the girl confessed she'd like to have a second chance. The guy didn't gave a straight answer, he just go along. They fucked, the girl like his skillz in bed than the douche can give her a while back. They slept after the passionate lovemaking. The woman woke up smiling that she's satisfied only to find the guy no longer around. She rushed and ask the reception where is the guy she's with but the staff only told her he's already checked out and the bill is already paid. \n\nIts up to you guys how its end, but this is my own ending."},{"id":953383,"gallery_id":255653,"poster":{"id":324760,"username":"bloodtears23","slug":"bloodtears23","avatar_url":"avatars/324760.png?_=fa233efccb8c3469","is_superuser":false,"is_staff":false},"post_date":1561528480,"body":"His old childhood friend hid her surprise in the changes her old friend became. The guy don't want anything but just to play along and keep testing the waters with his classmates, he and his old childhood friend never had much interactions aside from simple greetings. Deep within the heart of the girl, she knows the reason why the guy is being distant and cold to her, she buried it within. Reunion come to an end and the people when to their own affairs. The guy leaves but he was stopped by the girl, sayin she wanted to have an update on his life recently. The guy mockingly smiles but since its night the girl never saw the mocking aura it gives. He agreed, sayin that he's a bit tipsy and wanna reduce it before returning to his appartment. They have a chat, the guy humor the girl answering her questions but some are sarcastic. The night is deep and the girl doubt she'll be be able to go home at that hour. The girl and the douche never last long as expected. The douche got bored."},{"id":953369,"gallery_id":255653,"poster":{"id":324760,"username":"bloodtears23","slug":"bloodtears23","avatar_url":"avatars/324760.png?_=fa233efccb8c3469","is_superuser":false,"is_staff":false},"post_date":1561527673,"body":"Funny is, its all just to make the guy have the guts to confess to his childhood friend, and since the girl wants to plug her leaking hole, they bang. Leaving the pathetic virgin guy to get cucked.\n\nAnother timeline but with different ending. Years later, the cucked boi become experinced in bed. He seduced and slept with many girls, thot or virgin alike just to fill the void in his heart. But no avail.\nThen he received a call from his old classmates that they're having a reunion. He's having doubts coming since its just a bother but he wanna see how much his classmates grown. \nThen being a typical reunion, they got to know their classmates. The cucked boi sure hit puberty hard, he's handsome with a mid-length messy hair. While his slu--childhood friend still a beautiful but mature apperance just like her mom but with long hair. \nThe get-together is become quite awkward for a moment but the fun continues for the former classmates. \nBut he doesn't care anymore and flirt with his classmat"},{"id":888628,"gallery_id":255653,"poster":{"id":902476,"username":"digimon0101","slug":"digimon0101","avatar_url":"avatars/902476.png","is_superuser":false,"is_staff":false},"post_date":1556492503,"body":"心脏受不了的请绕道。温馨提示"},{"id":888627,"gallery_id":255653,"poster":{"id":902476,"username":"digimon0101","slug":"digimon0101","avatar_url":"avatars/902476.png","is_superuser":false,"is_staff":false},"post_date":1556492383,"body":"这本子有病。 。。。"},{"id":816083,"gallery_id":255653,"poster":{"id":1168249,"username":"Cezak","slug":"cezak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1550034441,"body":"man ... if a girl betrays you just forget about her and look for a new one, do not complicate you life so much the sea is full of fish..."},{"id":805654,"gallery_id":255653,"poster":{"id":220166,"username":"qwert12345","slug":"qwert12345","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1549107330,"body":"Why the fuck that boy still love that girl, whole family is just a whore"},{"id":754322,"gallery_id":255653,"poster":{"id":589379,"username":"The Blacklister","slug":"the-blacklister","avatar_url":"avatars/589379.png?_=b0def5a33b58a8a5","is_superuser":false,"is_staff":false},"post_date":1544578552,"body":"The Fuck?ALMOST EVERY FUCKIN TANK,STORY,DOUJIN SOMEONE SHIT OUT TO THIS FUCKING SITE IS FUCKING NTGARBAGE.WHAT THE FUCK IS WRONG WITH YOU PEOPLE?"},{"id":754095,"gallery_id":255653,"poster":{"id":2015725,"username":"Apocoloco","slug":"apocoloco","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1544546874,"body":"Is this end or not? I do not understand is always the same as the MC keeps loving? What happens with the others where I got pregnant and the protagonist cuck takes care of the son? Are very few who happen something different. Was it not easier for the bride to end with the boyfriend and continue with his life?\n"},{"id":754061,"gallery_id":255653,"poster":{"id":593858,"username":"Manslayer","slug":"manslayer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1544543172,"body":"Then comes Rinka's mom who is actually a cheating milf, witnessed Charao fucking some other woman by chance. What are the odds that the same guy is actually fucking her daughter? Rinka's mom decides to tell Charao to back off lest he wants to have a little \"chat\" with the police. Charao notices her husband is a different dude and makes a comeback, then offers to spare Rinka under the condition that she takes Rinka's place. She agrees and justifies her actions as a way to protect her daughter and Takashi. Yawn."},{"id":754048,"gallery_id":255653,"poster":{"id":593858,"username":"Manslayer","slug":"manslayer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1544542594,"body":"Of course this being a no-brainer NTR manga she decides to get fucked, orgasm'd, decides to fuck with him a little more in all sorts of places officially turning into the slut she imagined herself to be. But waiiiiit! Cue reveal of meganekko who isn't blackmailed but is actually a nympho with a sex drive of OVER 9000!!!, just there to help Charao smash that Rinka puss. Takashi confronts Charao but is mocked that he never knew the true slutty side of Rinka, asks him to hide in the exact same closet he first witnessed them fucking to make a point. From there Rinka loudly confesses that she's addicted to Charaodick only to find out she was being watched by Takashi. From that point on she doesn't bother hiding her perverse allowing Charao to fuck her again and again. Takashi being the NTR fodder still decides that he still loves Rinka regardless, finally getting to pound dat Rinkass he longed for. Need I say more for the ending?"},{"id":754041,"gallery_id":255653,"poster":{"id":593858,"username":"Manslayer","slug":"manslayer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1544541855,"body":"Oh come on this is the generic \"Charao fucks girl, girl gets addicted to the orgasms she experienced from the charaodick and goes back to fuck him again\" flat, boring NTR plot. What's more to explore about this? What? Still wanna know? Fine, fuckboy, here comes WoT.\nGist of story: Protagonist Takashi, who likes his next door childhood friend Rinka, keeps getting visions about her getting fucked by some other dude. Cue Charao who openly confesses he wants to tap dat Rinka ass and immediately gets his ass kicked. One day Takashi went to her house to bring her class notes, alarmed by her coming back home, hides in her closet and witnesses Charao fucking his beloved Rinka. \n*Flashback to a few months ago* Rinka finds out her meganekko friend was blackmailed to gangbang over a sex video, then decides to confront the culprit only to be stopped by Charao, says he can help meganekko be free under the condition of him banging Rinka once. "},{"id":753981,"gallery_id":255653,"poster":{"id":800624,"username":"Rustynail","slug":"rustynail","avatar_url":"avatars/800624.png?_=52fe1e93c55bce3d","is_superuser":false,"is_staff":false},"post_date":1544534091,"body":"I don't mind if I die, but come on now, where's the English version of this whole story, and not the chapters version as it doesn't give the whole story. "},{"id":753979,"gallery_id":255653,"poster":{"id":2049905,"username":"LoneWolf44","slug":"lonewolf44","avatar_url":"avatars/2049905.png","is_superuser":false,"is_staff":false},"post_date":1544533496,"body":"Time to die, i guess..."},{"id":753936,"gallery_id":255653,"poster":{"id":1316047,"username":"ScTruF","slug":"sctruf","avatar_url":"avatars/1316047.png","is_superuser":false,"is_staff":false},"post_date":1544528301,"body":"不喜歡NTR啊，這三小啦，垃圾欸"},{"id":753935,"gallery_id":255653,"poster":{"id":1076243,"username":"Narkin","slug":"narkin","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1544528300,"body":"Oh... I hate this genre... Netorare... But also this genre can very good awake my rejection... I hate myself. Сука. Такое хреновое послевкусие..."},{"id":753932,"gallery_id":255653,"poster":{"id":1316047,"username":"ScTruF","slug":"sctruf","avatar_url":"avatars/1316047.png","is_superuser":false,"is_staff":false},"post_date":1544528175,"body":"幹你娘，這本為什麼沒有NTR標籤，幹"}]