[{"id":755384,"gallery_id":255734,"poster":{"id":674664,"username":"TheUnsaid","slug":"theunsaid","avatar_url":"avatars/674664.png?_=2ba2c1af13b0bab8","is_superuser":false,"is_staff":false},"post_date":1544696228,"body":"@usamiharu\nAre we reading the same manga? Miyako isn't thirsty here. She's thirsty in the main story, but when the sex starts she becomes an \"iyaa dame\" type girl. Tsubame's fine. Even when you choose to dominate her, her personality stays consistent with how she behaves in the main story. Momoyo literally picks up chicks all the time and is constantly straddling Yamato. In every ending that includes her besides her own, she acts more like she does in the main story. Also they're all virgins so expecting them to be sluts is pushing it. \n\nI'm not denying the majikoi girls are top tier waifus. Margit and Chris are some of my favorites of all time. That doesn't mean I can't be critical of the game.\n\nAgain, they are my noble masters handled it MUCH better than Majikoi. They were all consistent in the adult stuff with how they acted in the game."},{"id":755356,"gallery_id":255734,"poster":{"id":1209269,"username":"Fire Wolf","slug":"fire-wolf","avatar_url":"avatars/1209269.png?_=0bedd1dd63c454f2","is_superuser":false,"is_staff":false},"post_date":1544691299,"body":"i see you are also waiting for the glorious hound unit "},{"id":754931,"gallery_id":255734,"poster":{"id":1334241,"username":"TomixSoulWeaver","slug":"tomixsoulweaver","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1544646858,"body":"Still waiting for the margit after story "},{"id":754808,"gallery_id":255734,"poster":{"id":1209269,"username":"Fire Wolf","slug":"fire-wolf","avatar_url":"avatars/1209269.png?_=0bedd1dd63c454f2","is_superuser":false,"is_staff":false},"post_date":1544630222,"body":"well said @usamiharu"},{"id":754720,"gallery_id":255734,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1544622419,"body":"@TheUnsaid What's the connection of everyday normal personality when it comes to sex scene? So if a woman is quiet most of the time do you expect her to be quiet in sex? like really...and passive girls? many of the heroines aren't passive at all hell Miyako is pretty much the big example of the thirstiest heroines and Tsubame which you can choose to dominate her or be dominated and as for Momoyo even though she acts aggressive in her normal everyday life but that's mostly for the fighting not through sex fucking hell she's a fucking virign she doesn't know jackshit about relationship and sex so what do you expect to her act like a thirsty slut or something...and if you read the VN after becoming couple with Yamato she became less aggressive because you know they became couple but anyways most of the Majikoi heroines are top tier waifus."},{"id":754635,"gallery_id":255734,"poster":{"id":1242965,"username":"SanMig","slug":"sanmig","avatar_url":"avatars/1242965.png?_=2bc89387284fa4fd","is_superuser":false,"is_staff":false},"post_date":1544611116,"body":"wow 2 chapters more"},{"id":754585,"gallery_id":255734,"poster":{"id":674664,"username":"TheUnsaid","slug":"theunsaid","avatar_url":"avatars/674664.png?_=2ba2c1af13b0bab8","is_superuser":false,"is_staff":false},"post_date":1544604712,"body":"They are my noble masters did a much better job handling the adult stuff imo."},{"id":754584,"gallery_id":255734,"poster":{"id":674664,"username":"TheUnsaid","slug":"theunsaid","avatar_url":"avatars/674664.png?_=2ba2c1af13b0bab8","is_superuser":false,"is_staff":false},"post_date":1544604558,"body":"Majikoi had a great story but really passive girls. I thought Momoyo would at least have a higher sex drive considering how she acts in the story. The girls don't feel like the same girls in their adult scenes compared to how they behave in the main story."}]