[{"id":2425652,"gallery_id":256972,"poster":{"id":3466017,"username":"egoBorder","slug":"egoborder","avatar_url":"avatars/3466017.png?_=65433cf61b22f220","is_superuser":false,"is_staff":false},"post_date":1648559660,"body":"fabulous!!"},{"id":1965839,"gallery_id":256972,"poster":{"id":1610581,"username":"Lil'Lolicon-san","slug":"lil-lolicon-san","avatar_url":"avatars/1610581.png?_=f33c1e938922c8e5","is_superuser":false,"is_staff":false},"post_date":1629662717,"body":"-so this Author (and alike) aren't playing with dolls of the 2D Characters anymore, they just said \"Gonna be this character myself\" (Please get the reference) but also myself in it playing as myself with myself. It's incredible, a fucking masterpiece of its own, looking from the bottom up of course. But still, me myself years ago and now still thinking of the same thing while seeing these Authors and their works: \"*facepalm*, please get help\". Remind me of those people with psychological problems of \"Dissociative Identity Disorder\" or... \"Depersonalization Disorder\" yeah the latter stand more firmly. My point? Eh, i'm just ranting on some random stuffs on a H-Manga website, whatever."},{"id":1965829,"gallery_id":256972,"poster":{"id":1610581,"username":"Lil'Lolicon-san","slug":"lil-lolicon-san","avatar_url":"avatars/1610581.png?_=f33c1e938922c8e5","is_superuser":false,"is_staff":false},"post_date":1629662457,"body":"-Remember those moments or even an entire Story (Anime, Manga, Novel) of the literal form of \"clíche\" where everything just somehow all just fit together perfectly without any \"unintentional\" mistakes? Back to my point, this is just literally the Author talking &amp; acting to themself but with another \"person\" (2D Characters) image as their other's self, stripped all away what made that \"2D Characters\" \"themself\" and just inserted themself in just like \"Well, now i'm in here (the story), and also i'll be you now, living in your life\", remind me of -that- Story that is also \"body swap/soul swap\". Don't even wanted to -name- it for i refuse to even give it a spit of my own for its pityful self. Yeah you can say that this Story is something, i'll just say \"no\" and leave it at that for the undeniable fact that this story didn't start anything, it merely being an Amplifier and a Loudspeakers to spread the \"idea\" to more people and that's all to that bit. Back to the topic,-"},{"id":1965808,"gallery_id":256972,"poster":{"id":1610581,"username":"Lil'Lolicon-san","slug":"lil-lolicon-san","avatar_url":"avatars/1610581.png?_=f33c1e938922c8e5","is_superuser":false,"is_staff":false},"post_date":1629662001,"body":"I'll say this now once and for all: My god, the Author of this and the alike (Hypnosis, Mind Control,...) Category of H-Doujinshi are indeed Losers, the Lowest of all, not even a form, or deserve a Category to describe themself as a whole (So side note, please never stop what you're doing, you all are doing us losers (I even have an account here, who's judging down here) a favor, at least everytime we're feeling down like we losers always do we can all just get down here and look at these and still can feel better about ourself: \"At least we aren't this of a loser/Still there are those that even lower than us\"). But still, i'm amused at this particular Author's works. We're all used to the \"still acceptable\" form of this (mentioned above), i'll describe it as \"playing with dolls\" (the Authors, and their dolls), for that's all to it, plus minus some \"additives\", but this, this Author themself and their works in particular is just like the literal form of \"Go fuck yourself\";-"},{"id":807881,"gallery_id":256972,"poster":{"id":1841564,"username":"Happy_Sugar_Life","slug":"happy_sugar_life","avatar_url":"avatars/1841564.png","is_superuser":false,"is_staff":false},"post_date":1549314545,"body":"I waited maybe 3 months for this and i must say it was worth it!"},{"id":766556,"gallery_id":256972,"poster":{"id":795958,"username":"G-BenderCrespy","slug":"g-bendercrespy","avatar_url":"avatars/795958.png?_=6449610aa268defc","is_superuser":false,"is_staff":false},"post_date":1545850326,"body":"Merry Christmas everyone ziiiiip🍆💦💦"},{"id":766043,"gallery_id":256972,"poster":{"id":1189169,"username":"PanzerIVausfH","slug":"panzerivausfh","avatar_url":"avatars/1189169.png?_=1b4490f9c63c3e43","is_superuser":false,"is_staff":false},"post_date":1545809181,"body":"How would it feel to be fucked by your own dick?"},{"id":765988,"gallery_id":256972,"poster":{"id":2095685,"username":"Mach10_lolifapper","slug":"mach10_lolifapper","avatar_url":"avatars/2095685.png","is_superuser":false,"is_staff":false},"post_date":1545804404,"body":"Mmm\n\n..mmmmmm"},{"id":765964,"gallery_id":256972,"poster":{"id":278162,"username":"DoujinsRLove","slug":"doujinsrlove","avatar_url":"avatars/278162.png","is_superuser":false,"is_staff":false},"post_date":1545802985,"body":"Thanks for the Christmas present !"}]