[{"id":806725,"gallery_id":257409,"poster":{"id":1993285,"username":"oops you're not mom","slug":"oops-you-re-not-mom","avatar_url":"avatars/1993285.png?_=49fed59a8c810c98","is_superuser":false,"is_staff":false},"post_date":1549207684,"body":"And the demonlord's second coming was prevented because the saintess convinced the hero that she loves him (she does but still need that big, fake dick) and therefore reduce his negative feelings"},{"id":806723,"gallery_id":257409,"poster":{"id":1993285,"username":"oops you're not mom","slug":"oops-you-re-not-mom","avatar_url":"avatars/1993285.png?_=49fed59a8c810c98","is_superuser":false,"is_staff":false},"post_date":1549207380,"body":"Ok I read back, it's literally a sex doll type homunculus"},{"id":806720,"gallery_id":257409,"poster":{"id":1993285,"username":"oops you're not mom","slug":"oops-you-re-not-mom","avatar_url":"avatars/1993285.png?_=49fed59a8c810c98","is_superuser":false,"is_staff":false},"post_date":1549207259,"body":"And I didn't read the last parts so this just me arbitrarily guessing but did the saintess trapped the noble's soul in that amulet to be her personal sex slave? That was kinda a shitty end for a shitty person but has everyone got the bad end? Even the bad guy?"},{"id":806717,"gallery_id":257409,"poster":{"id":1993285,"username":"oops you're not mom","slug":"oops-you-re-not-mom","avatar_url":"avatars/1993285.png?_=49fed59a8c810c98","is_superuser":false,"is_staff":false},"post_date":1549206821,"body":"I feel like in this story god literally made it a zero sum game. The hero will defeat the demon king and be corrupted into the new demon king and the cycle repeats. The only true way to win is to not heavily rely on the hero and sacrifice a lot of soldiers, adventurers, knights, serfs and normal people and finally the hero does the killing blow. The only way for man to move forward, win and become more advanced is to learn from their past mistakes and not over rely on the hero. To truly unite mankind in one ultimate struggle for freedom. You might think I am over thinking this but this just reminds me of similar plots in novels I read before. The ones where the true enemy was actually your best ally all along type of developments."},{"id":800778,"gallery_id":257409,"poster":{"id":1388793,"username":"Lemmings","slug":"lemmings","avatar_url":"avatars/1388793.png?_=3b702e3e6eb0bb51","is_superuser":false,"is_staff":false},"post_date":1548655675,"body":"Top 10 bruh moments in anime"},{"id":792727,"gallery_id":257409,"poster":{"id":2191737,"username":"nuir","slug":"nuir","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1547955289,"body":"I have been sticking stuff through my ass since I was 9 or so (am 19 now) and I do not every day, and I am addicted but that like this. They look like under the effect of a powerful addictive drug which they would just be animals.  What she wants is far beyond lust or love meaning especial when you think she only wants 2/3 thing, lots o jizz, a big shaft and last powerfull lust drug, all easy to solve by her lover. But ofc that would no longer be NTR. Any way other than the behaving like a drugg addicted a sever case, nothing else is real. (But the drug part is scary real)"},{"id":773836,"gallery_id":257409,"poster":{"id":1423362,"username":"yamisora1998","slug":"yamisora1998","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1546445199,"body":"whether it is a tank or a digital release is not a problem, I also don't know the difference between them. Please translate this to english, if possible also Walpurgis no Inmu Aido Iris. "},{"id":771172,"gallery_id":257409,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1546261266,"body":"@\nutsuho The one uploeded before  was the digital release not the tank you cocksucking faggot piece of shit retard who cant tell the difference between a tank and a digital release.  Now fuck off and stop spewing more bullshit from that asshole passes for your mouth."},{"id":771050,"gallery_id":257409,"poster":{"id":642853,"username":"utsuho","slug":"utsuho","avatar_url":"avatars/642853.png","is_superuser":false,"is_staff":false},"post_date":1546251657,"body":"@metroid this shit already has the fucking tank with all chapter, and it uploaded 2 FUCKING MONTHS AGO you fucking piece of garbage, not to mention it has 230 page, 2 more page than this re-upload  "},{"id":770216,"gallery_id":257409,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1546187467,"body":"@ \nutsuho This is the tank with all chapters not a reupload you retarded faggot. And there is no such thing as jap uncensored version of hentai all of them are censored due to law unless they are  decensored by translators or fakku."},{"id":769223,"gallery_id":257409,"poster":{"id":642853,"username":"utsuho","slug":"utsuho","avatar_url":"avatars/642853.png","is_superuser":false,"is_staff":false},"post_date":1546101906,"body":"I though this shit finally has an eng translation or maybe an jap uncensored version but no, just a re-up for some reason :'v "}]