[{"id":1940408,"gallery_id":258744,"poster":{"id":4447696,"username":"TaeTaeJK","slug":"taetaejk","avatar_url":"avatars/4447696.png?_=0fca37960f03a550","is_superuser":false,"is_staff":false},"post_date":1628783015,"body":"This is a \"What If\" story. So it's basically like an alternate reality to the previous story. \nBasically, the main guy wakes up dead and doesn't remember anything. The guy with the dot on his forehead is kinda like the grim reaper and shows him his life. His daughter moved in with him, they start having sex, she got pregnant, a year later her mom finds her, only to discover that she has a baby with her own father. Out of rage, she kills the father with her umbrella. \nThe story is well, pretty messed up. But honestly, this was HOT. That scene of the daughter seducing her father and licking his face. Him telling her to stop, only for the next page to be a shot of him cumming on her stomach...Then on page 16, when they realize they're out of condoms. The daughter asks \"what do we do...\". Their long stare into each other, as they both agree to have unprotected sex. Leading to a baby in the next page. \nReally hot storytelling!"},{"id":1359595,"gallery_id":258744,"poster":{"id":2388761,"username":"Natsky29","slug":"natsky29","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606249493,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1322588,"gallery_id":258744,"poster":{"id":3492281,"username":"ichika_assfucks","slug":"ichika_assfucks","avatar_url":"avatars/3492281.png?_=b080b4ae18a24790","is_superuser":false,"is_staff":false},"post_date":1604806301,"body":"Read 335143 if you want to know what's this is about. I don't really get it at first because I couldn't read it."},{"id":1320441,"gallery_id":258744,"poster":{"id":809172,"username":"ialdabaoth","slug":"ialdabaoth","avatar_url":"avatars/809172.png","is_superuser":false,"is_staff":false},"post_date":1604719450,"body":"@subtletee I think that was the family registration form where it will acknowledge him as her \"father\".\n"},{"id":1320404,"gallery_id":258744,"poster":{"id":2258816,"username":"subtletee","slug":"subtletee","avatar_url":"avatars/2258816.png?_=e6c63a486a42e3b7","is_superuser":false,"is_staff":false},"post_date":1604718385,"body":"can someone explain the last page ?\nwhat is the paper supposed to be ?"},{"id":815794,"gallery_id":258744,"poster":{"id":1630832,"username":"warmachine9923","slug":"warmachine9923","avatar_url":"avatars/1630832.png","is_superuser":false,"is_staff":false},"post_date":1550009312,"body":"@acts I read it in my language translation which is not japanese. There was a gold digger named soko who was re married to a rich guy which is not make appearance in the original one he had a daughter named Sana one day Sana and soko met soko's ex which is trying to blackmail soko for money but then the body guard attacked on him, later on the daughter Sana came to his Apartment just for stay because her dad rape her everyday and her mom can't protect her and the ex is trying to get the revenge form her daughter but things gone wrong her mother found out first at that time the ex doesn't know about her father yet and tell Sana to go home the other day. Her mom came but passed out so he managed to fuck her before she wake up after that Sana found out and that leads to the story right here"},{"id":778271,"gallery_id":258744,"poster":{"id":881191,"username":"vkNg","slug":"vkng","avatar_url":"avatars/881191.png","is_superuser":false,"is_staff":false},"post_date":1546765917,"body":"I dont think the pages are ordered"},{"id":777980,"gallery_id":258744,"poster":{"id":1798866,"username":"acts","slug":"acts","avatar_url":"avatars/1798866.png?_=ab3069cbf275fefc","is_superuser":false,"is_staff":false},"post_date":1546747194,"body":"Can someone explain wtf is going on here"}]