[{"id":779406,"gallery_id":258886,"poster":{"id":371356,"username":"EvilRyo","slug":"evilryo","avatar_url":"avatars/371356.png","is_superuser":false,"is_staff":false},"post_date":1546857368,"body":"@xxxlolicon\nHe had new stuff uploaded but the tl isn't complete on the new one"},{"id":779400,"gallery_id":258886,"poster":{"id":1568259,"username":"XXXLOLICON","slug":"xxxlolicon","avatar_url":"avatars/1568259.png","is_superuser":false,"is_staff":false},"post_date":1546856799,"body":"@DoujinsRLove where the fuck was Michiking all the past year i was looking for sum lolis?, GODDAMMIT "},{"id":779112,"gallery_id":258886,"poster":{"id":49509,"username":"Pleb","slug":"pleb","avatar_url":"avatars/49509.png","is_superuser":false,"is_staff":false},"post_date":1546832798,"body":"i came back to read it don't worry"},{"id":779009,"gallery_id":258886,"poster":{"id":371356,"username":"EvilRyo","slug":"evilryo","avatar_url":"avatars/371356.png","is_superuser":false,"is_staff":false},"post_date":1546823433,"body":"Well, they would have worked as assistants for each other or under someone together t some time to get started and developed a style of their own from there. Even if at some points the point of some doujins is to imitate the artstyle of the work being parodied, dragonball, fairytale, one piece, etc.\nIf they worked together before it is likely that they could develop a similar taste and artstyle, not to imitate, but to compliment.\nWho cares\n\nI was hoping this was a translation and not a reupload"},{"id":778830,"gallery_id":258886,"poster":{"id":1092173,"username":"Psychojing","slug":"psychojing","avatar_url":"avatars/1092173.png","is_superuser":false,"is_staff":false},"post_date":1546807577,"body":"@DoujinsRLove pft I read it"},{"id":778826,"gallery_id":258886,"poster":{"id":278162,"username":"DoujinsRLove","slug":"doujinsrlove","avatar_url":"avatars/278162.png","is_superuser":false,"is_staff":false},"post_date":1546807440,"body":"I probably just wasted an inordinate amount of time giving an answer that will probably not actually be noticed and making myself seem like far more of a degenerate than I already am, Excellent."},{"id":778815,"gallery_id":258886,"poster":{"id":278162,"username":"DoujinsRLove","slug":"doujinsrlove","avatar_url":"avatars/278162.png","is_superuser":false,"is_staff":false},"post_date":1546806915,"body":"On the Chiguchi Miri note, they worked together, this is a collab. I have i no idea why this reuploded didn’t tag it as such, but the first upload did, you can check by looking at it. Now for the other two: I barely know the former so I’ll just talk about the latter, and honestly, I have to heavily disagree with you, *Kyokucho* (that’s literally how his name is read) and Michiking look nothing alike if you’ve actually taken time to look at their works, and while Hisai has some similarities to both. Once again, the differences become apparent very quickly with time. Finally: all of them work with fairly different tags, Michiking has a “Pedo” thing with Shota, Lolis, and a bit of Femdom from time to time. Kyokucho deals in the more an  “authentic” side of rape/mind break (IE: The girl “breaks” and just kind of lies their with dead eyes, as opposed to becoming some dick crazed nympho). While Hisai very, *very* much deals in story-centric Vanilla and only occasionally does Loli."},{"id":778764,"gallery_id":258886,"poster":{"id":1127570,"username":"Homosexual fire of the north","slug":"homosexual-fire-of-the-north","avatar_url":"avatars/1127570.png","is_superuser":false,"is_staff":false},"post_date":1546804393,"body":"Well, you see....... I don't fucking know"},{"id":778759,"gallery_id":258886,"poster":{"id":49509,"username":"Pleb","slug":"pleb","avatar_url":"avatars/49509.png","is_superuser":false,"is_staff":false},"post_date":1546804038,"body":"Can someone explain to me why this person draws almost exactly like Chiguchi Miri? And can someone also explain why Sanagi Torajirou's and Takeda Hiromitsu's art is so similar? And same for  Kyochoko, Hisasi and Michiking?"}]