[{"id":1476622,"gallery_id":259485,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1610253344,"body":"Did he stopped doing doujins?? No updates from this artist in 2 years :("},{"id":1110386,"gallery_id":259485,"poster":{"id":3375355,"username":"komentator","slug":"komentator","avatar_url":"avatars/3375355.png?_=e2a7c0e98aa4af50","is_superuser":false,"is_staff":false},"post_date":1596013803,"body":" I miss wamusato haru doujin update 😥"},{"id":838027,"gallery_id":259485,"poster":{"id":1090865,"username":"Manzoku","slug":"manzoku","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1551970633,"body":"Finally, Netorase which is quite simple.  A guy or gal enjoys or is sexually stimulated by their SO having sex or being taken by someone else, or just the act of letting them sleep with someone else.  Some of these can lead to NTR situations or some can lead to just weird kinky sex.  The MC isn't always define and wives and husbands can be seen sleeping with other people with permission by both partners.\n\nBasically, Netori = MC stealing (most of the time girl stays with her husband because of BS reasons but can't live without the MC's cock).  NTR = MC's SO gets taken, probably mind broken or went crazy.  Loses will to live in most cases, while SO has the sex of her live and becomes a slut.  Netorase = Letting your SO sleep with other people."},{"id":838024,"gallery_id":259485,"poster":{"id":1090865,"username":"Manzoku","slug":"manzoku","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1551970451,"body":"Netorare or NTR is quite simple where the MC gets his or her (but rarely) significant other taken away, boyfriend or husband.  Since the MC is the MC he is always present so they try to show the mind break that ensues with him realizing that she is cheating and loves the other person.  For NTR haters, it leaves a pain in the heart cause you envision that MC to be you.  For NTR lovers, they either don't envision themselves as the MC but the one taking or don't really associate with anyone and really love the mind break/ahegao of the taken lover when all she can think about is sex/cock.  Sometimes the significant other (SO) leaves the MC, but sometimes she doesn't and some stories end on a mystery or open ending, mostly negative like Otome Dori.\n"},{"id":838021,"gallery_id":259485,"poster":{"id":1090865,"username":"Manzoku","slug":"manzoku","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1551970211,"body":"It's not even NTR.  Depending what you're take is on NTR as a whole.  Cheating/Netori should be it's own category, NTR should be it's own category, and Netorase should be it's own category.\n\nSimply explaining, cheating/netori is the main character stealing someone's significant other (mostly it's the male/husband and it's b.c he's either always away for work or working late; or not really sexually active, or the rare case of cheating) the husband or significant other is rarely shown and most of the time the one who gets stolen doesn't actually leave their significant other, with having their hearts still loving their boyfriend or husband but sexually can't get satisfied unless it's with the MC.  This is most cases.\n\nI ran out of space, will cont in the next comment."},{"id":794981,"gallery_id":259485,"poster":{"id":589379,"username":"The Blacklister","slug":"the-blacklister","avatar_url":"avatars/589379.png?_=b0def5a33b58a8a5","is_superuser":false,"is_staff":false},"post_date":1548143451,"body":"...ALMOST EVERY FUCKIN TANK,STORY,DOUJIN SOMEONE SHIT OUT TO THIS FUCKING SITE IS FUCKING NTRASH.WHAT THE FUCK IS WRONG WITH YOU PEOPLE?"},{"id":789987,"gallery_id":259485,"poster":{"id":615994,"username":"joshalchemist","slug":"joshalchemist","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1547713662,"body":"Translate this to English please."},{"id":785082,"gallery_id":259485,"poster":{"id":342010,"username":"contra123","slug":"contra123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1547316658,"body":"in english"}]