[{"id":805927,"gallery_id":261787,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1549135070,"body":"@onemore7 Ah you mean that....well nothing new its kinda a stereotyping of some sort like for example Idolm@ster char. Fumika (the quiet type char. in general) tend to be also in rape doujin and the reason why char. like bradamante are always involve in rape situation because she's what you call a char. with personality that is confident or etc ya know one of those ojou-sama char. like Luvia,Rin from Fate which is good to dominate in some way and as for Anal well most of the time char. with Leotards,Swimsuit etc (any clothes that shows plump asses) tend to get anal because leotard main attraction is the butt itself its actually pretty simple when the char. has plump boobs most authors will do paizuri and breast feeding,if its thighs then some sort of Rim job etc"},{"id":805646,"gallery_id":261787,"poster":{"id":771228,"username":"onemore7","slug":"onemore7","avatar_url":"avatars/771228.png?_=b35a93e10bdf7dff","is_superuser":false,"is_staff":false},"post_date":1549106339,"body":"@usamiharu A similar thing with both is that I saw a lot of Anal and rape pics of them but now that you mentioned Angela looks like blonde+leotard+twintails= rape hentai . Not just Brada and Shine Mirage in that category."},{"id":805558,"gallery_id":261787,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1549094562,"body":"@onemore7 Because of she's wearing white & blue suit and the fact she's a blonde? well nothing new as their bound to be character look alike but Bradamante doesn't look like her much in my opinion if you are comparing look alike of Bradmante might as well just say Angela Balzac lol because same artist Saitom."},{"id":805296,"gallery_id":261787,"poster":{"id":771228,"username":"onemore7","slug":"onemore7","avatar_url":"avatars/771228.png?_=b35a93e10bdf7dff","is_superuser":false,"is_staff":false},"post_date":1549069146,"body":"I just noticed that Bradamante kinda of looks like \"Shine Mirage\" , a heroine from another hentai."}]