[{"id":820295,"gallery_id":263469,"poster":{"id":1086250,"username":"Dononon","slug":"dononon","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1550437091,"body":"I'd gather a machine like that would rip a bull's dick clean off. Without even blinking. Fucking monster of a machine they are."},{"id":820294,"gallery_id":263469,"poster":{"id":1086250,"username":"Dononon","slug":"dononon","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1550436931,"body":"cut. I remember that in college, I used to go to a CNC course, where they teach you to cut metal into different shapes. Used to try to put the fear into people about putting their hands, anywhere near a moving machine. And one day this girl had her hair caught in it. Had it ripped right out.\n\nFucking glad too, would've been a real moment to see her head spinning around that drill bit, and that machine would do that. Rip it right out, it cuts fucking raw steel, it isn't stopping for bone or cartilage, would've been a nightmare for the rest of my life seeing her head spinning. Must've shat herself, certainly ran out crying after that. I used to get dazed moments, feeling dizzy just thinking about having my hand or anything else near those machines. And holy shit, you get superstitious around them. I couldn't take that. I swear, I'd be dead if I just 'slept' at the control one day."},{"id":820292,"gallery_id":263469,"poster":{"id":1086250,"username":"Dononon","slug":"dononon","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1550436720,"body":"In the absence of art that depicts something of such high quality, I have to improvise and make some myself. Hence that steak reference before. Steak is commonly part of beef cuts, tenderloin is favoured but I think some rich, horse-like flavour can come from the stubborn thigh muscles, possibly the glutes. You slice off a piece of that meat, it should look extremely red, rich in iron. Not too salty, though, blood doesn't really taste salty, does it?\n\nIt's definitely got a flavor though. I can't even remember the last time I tasted blood, usually a memory of a split lip comes to mind. How about a raw, inflamed side of your head. I'd gather other than a distinct soreness it would feel empty to have the left side of your head cut off, like a slice. You don't have to use a butcher's cleaver, no, but it does make cutting easier, the metal has a weight under it.\n\nYou can usually tell when someone's being cut, because their first impulse is to pull the hand away, or whatever limb is being"}]