[{"id":864632,"gallery_id":263531,"poster":{"id":2361079,"username":"BagramPl","slug":"bagrampl","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1554335658,"body":"@Ravenleaf Keichi and Bell living in celibate is the only actual outcome. The ntr outcome doesn't make sense since it would corrupt Bell and basicaly make the whole \"no libido Keichi\" thing meaningless. It's either Keichi doing the deed with Bell and corrupting her or no1 ever doing it with her and they live in celibate."},{"id":822873,"gallery_id":263531,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1550673815,"body":"well there would have been a lot of NTR anyway, thats the nature of anime happy couples. but in this case, its a bit extra cruel because lets be honest, it was the only actual outcome other than keichi and bell being celibate their whole lives. (which I guess is possible and what the author was going for, but like doujin artists are gonna let that fly) "},{"id":822678,"gallery_id":263531,"poster":{"id":1047,"username":"kirino","slug":"kirino","avatar_url":"avatars/1047.png","is_superuser":false,"is_staff":false},"post_date":1550656490,"body":"@Ravenleaf Wow I see why there a lot of ntr of it now. They live happily ever after  but his dick stop working. That's the odd way you could end something. Thx that's save me a lot of time.  "},{"id":822458,"gallery_id":263531,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1550631863,"body":"@kirino its actually the manga/novels, the anime never goes that far. but yeah, towards the end of the series, thats how the author chose to explain why bell and keichi never did the deed, god made sure he couldn't. It's unfortunately cannon. It was a pretty unsatisfying way to deal with it, keichi got a really raw deal and bell knew the whole time. I also am unsure if Urd knew or not, I actually thought she did, which is actually even more fucked up"},{"id":821375,"gallery_id":263531,"poster":{"id":1047,"username":"kirino","slug":"kirino","avatar_url":"avatars/1047.png","is_superuser":false,"is_staff":false},"post_date":1550544050,"body":"Wait did the show really end like that or are you guys talking about another doujins?...I never made it pass the first season."},{"id":821148,"gallery_id":263531,"poster":{"id":588468,"username":"michirusan","slug":"michirusan","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1550525464,"body":"Yeah, that final reveal about Keiichi was pretty fucked up, but holy shit it really DID explain just about every single one of the early whoopie fail situations that happened early on  when the series was still mostly slice of life/cock-blocking the audience. What it DIDN'T explain was URD making any attempts to actually get Keiichi to mambo with Bell (or anyone else), unless this was one of the need to know things ONLY Bell was privy too, and if that was the case really should have been noted since that was her primary role in the story, that of a plot starter."},{"id":821084,"gallery_id":263531,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1550518816,"body":"Ah my goddess was pretty fucked up all things considered. Yeah, Keichi got the best girlfriend ever but so as not corrupt her, his libido was basically turned off and he had zero sexual desire. And then there was the doujins...so many doujins of people doing what he could not... "}]