[{"id":832862,"gallery_id":264631,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1551488539,"body":"@VirusCity`17 Damn, thanks for that, They were the perfect couple (in that they only seem to do things TOO LATE, him in saving her quick enough, and her seeming to regret killing him in revenge AFTER DOING THE DEED). I'd feel sorry for him, if he hadn't waited DAYS to try and rescue her (what did he expect to find, FUCKING REMAINS or something? seeing as he ran because he thought they were being attacked by a dragon).\n\nHonestly it be even more nightmare fuel if she trapped his soul in his skull, assuring he'd \"always be with her\". Though if she was \"sucking out his essence\", he became \"one with her\".......when she absorbed his soul that is, guessing his skull was because it was the only thing left of him afterwards by the time she felt....some regret in \"devouring him\". Wouldn't be surprised if she \"prefers it that way\" with her new mindset, she'll never have to fear him \"running away from her again\", Since he can't anymore. Hope the Trans explains things better."},{"id":832508,"gallery_id":264631,"poster":{"id":5805,"username":"VirusCity17","slug":"viruscity17","avatar_url":"avatars/5805.png","is_superuser":false,"is_staff":false},"post_date":1551450036,"body":"@LordCellofEarth9\n\nHere's the plot. The two went into the Forest of Lost, they are couples that wished for a peaceful life without monster so they went into the forest to kill monster that is named as \"Black Matter\". In battle, Lia(the girl) was grabbed, and she asks Tia(the guy) for help. But the guy was delusional(caused by magic) and see a dragon, so he ran away in fear. The girl still firmly believes that the guy will return, but lost faith as the monster whisper words of corruption to her. \nAFTER A FEW DAY(yeah wait a few day before going back, good job), this guy finally returned with full preparation, hoping to find and saves her, only to find Lia becomes a monster. She hates him and intends to fk him so she can suck essence or something. The guy apologized but fall to the deaf ear. The guy regretted his decisions to run away at his final moment. Few months passed in the last page, the skull is most likely the guy's remains, indicating the girl still loves him somehow."},{"id":832287,"gallery_id":264631,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1551425970,"body":"If anyone can be so nice (And no not you Hugh/Metroid). Can anyone give me the plot of this story or at least explain the point where she got corrupted and kept the skull of the guy like it was a precious \"teddy bear\"? Please and Thank You!"}]