[{"id":2474709,"gallery_id":267759,"poster":{"id":2681344,"username":"weeb_virtuoso","slug":"weeb_virtuoso","avatar_url":"avatars/2681344.png?_=357201844897582d","is_superuser":false,"is_staff":false},"post_date":1650612583,"body":"this is just funny"},{"id":2089656,"gallery_id":267759,"poster":{"id":4712779,"username":"Kirby Cosmico Sage","slug":"kirby-cosmico-sage","avatar_url":"avatars/4712779.png?_=16a450ed36d39745","is_superuser":false,"is_staff":false},"post_date":1634546829,"body":"Following from this, illagers are fascist counter-revolutionaries attempting to crush the villagers communes. Their rulers live in decadent mansions, enslave prisoners and operate under a strict military hierarchy with four distinct social classes: The evokers, the leaders. The vindicators, the officers of the illager army, the pillagers, the foot-soldiers and the witches, the poorest of the hierarchy, who live in shacks far away from civilization. They attack the peaceful villagers in order to dominate their territory, steal their resources and enslave them and their golems for forced labor."},{"id":2089653,"gallery_id":267759,"poster":{"id":4712779,"username":"Kirby Cosmico Sage","slug":"kirby-cosmico-sage","avatar_url":"avatars/4712779.png?_=16a450ed36d39745","is_superuser":false,"is_staff":false},"post_date":1634546697,"body":"In fact, villagers are entirely lacking in any sort of hierarchy, making their society both classless and stateless, the two categories that must be filled in order for any society to be considered fully communist. When threatened, villagers co-operate to build a golem, a selfless automaton that displays altruism towards villagers and will defend them at any cost, rather then establish a military hierarchy, preserving their communistic system. Villages, more like communes."},{"id":2089650,"gallery_id":267759,"poster":{"id":4712779,"username":"Kirby Cosmico Sage","slug":"kirby-cosmico-sage","avatar_url":"avatars/4712779.png?_=16a450ed36d39745","is_superuser":false,"is_staff":false},"post_date":1634546550,"body":"I don't care about this, what I care about is that I think Villagers are communists. I came to this conclusion after watching my village for around 15 minutes to see what they actually did. While this sounds like a joke, I actually looked into this and it turns out that the villagers operate under a semi-communistic socialist economic system, with only a single element that prevents them being fully communist, which is obviously the fact that they still use money to trade with outsiders. Village society operates under \"from each according to his ability, to each according to his need\", as all villagers (save the disabled (nitwits) or children) will work to the best of their ability and give food and resources to fellow villagers. There is no economic hierarchy in villages, as there is no \"boss\" villager who pays other villagers wages in order to work for him. Instead, villagers work for the community and give their produce to other villagers."},{"id":1791425,"gallery_id":267759,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1623105653,"body":"THIS IS NOT NTR NOR RAPE. Sakura and Sho aren't in a relationship and only childhood friends so both of them are single. They might be mutually in love now but that can change. Sakura gave her consent to the rando so it's not a crime. I won't be surprised if at the last chapter Sakura would fell in love with the rando then they became lovers, got pregnant then got married or let's just say even if Sakura still loves Sho but the moment she found that she's pregnant then she would be forced to marry rando.\nConclusion:\nSakura is kind of naive and a moron at the same time.\nSho is a wimp.\nNakata is a opportunist. "},{"id":865191,"gallery_id":267759,"poster":{"id":589379,"username":"The Blacklister","slug":"the-blacklister","avatar_url":"avatars/589379.png?_=b0def5a33b58a8a5","is_superuser":false,"is_staff":false},"post_date":1554385894,"body":"...Almost every fuckin tank,story,doujin someone shit out to this fuckin site is fucking NTRASH.What the fuck is wrong with you people? -- MEMBER OF ANTI-NTRASH MOVEMENT --\n"},{"id":863508,"gallery_id":267759,"poster":{"id":727653,"username":"Virgin Hunter","slug":"virgin-hunter","avatar_url":"avatars/727653.png?_=6105f57b55f23107","is_superuser":false,"is_staff":false},"post_date":1554225844,"body":"NTR Education"},{"id":862888,"gallery_id":267759,"poster":{"id":2314615,"username":"Brunyel","slug":"brunyel","avatar_url":"avatars/2314615.png","is_superuser":false,"is_staff":false},"post_date":1554176576,"body":"Funny  :))"},{"id":862819,"gallery_id":267759,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1554171999,"body":"betting how many months the full thing will get translated "},{"id":862792,"gallery_id":267759,"poster":{"id":1710301,"username":"LeVocaloid","slug":"levocaloid","avatar_url":"avatars/1710301.png","is_superuser":false,"is_staff":false},"post_date":1554169375,"body":"lol this air headed gurl "}]