[{"id":1568443,"gallery_id":271690,"poster":{"id":3843847,"username":"Gunna🅿️","slug":"gunna","avatar_url":"avatars/3843847.png?_=0da495ccd261e3a7","is_superuser":false,"is_staff":false},"post_date":1613453922,"body":"This isn't NTR (although that's not a bad thing). This is just rape, cheating at worst, but not really imo. The story so far is interesting, but also very messed up, I really don't like this guy who's treating Mitsuba like she's his property"},{"id":976988,"gallery_id":271690,"poster":{"id":154640,"username":"CreampieLover69","slug":"creampielover69","avatar_url":"avatars/154640.png","is_superuser":false,"is_staff":false},"post_date":1563318342,"body":"i hope the next chapter comes out soon \n\\(\"_\")/ can't wait to see what happens next. I really like the artstyle and I don't have a problem with ntr (yeah I know many people don't like it but w/e)"},{"id":905950,"gallery_id":271690,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1557922103,"body":"Idk why but Kimi no na wa with ntr just doesn't fit, I can't feel any cause it's just weird lol"},{"id":901215,"gallery_id":271690,"poster":{"id":1974191,"username":"宛若青空","slug":"wan-ruo-qing-kong","avatar_url":"avatars/1974191.png","is_superuser":false,"is_staff":false},"post_date":1557575673,"body":"your japanese is fucking good,I master japanese so i can say you are right"},{"id":900268,"gallery_id":271690,"poster":{"id":2443290,"username":"Old_Daruma","slug":"old_daruma","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1557505942,"body":"They guy quite understands that Mitsuha may try to break out but it is implied that he is not worried because he wants to use the drug on Mitsuha when she comes"},{"id":900263,"gallery_id":271690,"poster":{"id":2443290,"username":"Old_Daruma","slug":"old_daruma","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1557505710,"body":"@Sigil my Japanese is not perfect but that's what I understood without paying attention that much\n\nThey guy is trying to make Mitsuha pregnant to be sure she will be his for the rest of her life. Thus, he has sex with her during her days of ovulation, keep her in the house to avoid she can buy morning after pill and even check when she washes after the intercourse. Therefore, he believes she is gonna be pregnant with his child soon. However, Mitsuha little sister finds her and the two went to a cafe and have some lovely chat about the past. At a certain point the little sister points out that Mitsuha is not wearing her ribbon anymore and Mitsuha is somehow surprised she forgot about it. After the meeting she decided to face the guy (possibly because she wants to break out). She called the guy telling she needs to talk and is coming to his apartment where at the same time other people are having sex thanks to some kind of afrodisiac drug."},{"id":899511,"gallery_id":271690,"poster":{"id":2442045,"username":"SigilSquared","slug":"sigilsquared","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1557440002,"body":"does anyone know what's happening so far"}]