[{"id":1506746,"gallery_id":271638,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1610817346,"body":"https://hentainexus.com/view/8324 In English for you all you deviants out there lol. So basically at the end she’s trying to ask the guy out after the whole thing. Wonder how he’ll respond. Seems like he kinda got disillusioned with her in the end, like it killed his interest when he saw her behave so slutty."},{"id":899257,"gallery_id":271638,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1557416839,"body":"Someone has already said he will translate it so just be patient faggots "},{"id":899077,"gallery_id":271638,"poster":{"id":1635965,"username":"KingCuck","slug":"kingcuck","avatar_url":"avatars/1635965.png","is_superuser":false,"is_staff":false},"post_date":1557401102,"body":"not sure but just looking at the pics: Girl likes senpai, but thinks that senpai doesnt like virgin girls because the other guy keeps telling that hes a pervert and that he is into slutty girls.Senpai wants to proof that hes not a pervert and wants to set the other guy up that hes the one.but then the girl walkks into the room and the guy grabs her and probs tries to seduce her but she told him that who would like a girl like her since shes just a virgin and that senpai is into slutty girls.The guy then tells her to train (fucks) her to be a slut for senpai.The next day the guy made the girl blindfolded and have a threesome (unknowingly that senpai is the 3th guy).Senpai realised that all he has been doing was staring (being a cuck) while they were fucking the other day.On the end the girl asks senpai if she has a girlfriend.happy end?"},{"id":898844,"gallery_id":271638,"poster":{"id":2328261,"username":"yuurei777","slug":"yuurei777","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1557378053,"body":"Im a bit confused too. But i didnt read it seriously. Too lazy to translate it all"},{"id":898764,"gallery_id":271638,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1557370642,"body":"Whats going on here?"}]