[{"id":977752,"gallery_id":276457,"poster":{"id":2588506,"username":"torylanezzz","slug":"torylanezzz","avatar_url":"avatars/2588506.png","is_superuser":false,"is_staff":false},"post_date":1563378204,"body":"@zakum @natesh640 where did you read the untranslated chapters? I can't find them anywhere"},{"id":975936,"gallery_id":276457,"poster":{"id":1143182,"username":"shiro8","slug":"shiro8","avatar_url":"avatars/1143182.png","is_superuser":false,"is_staff":false},"post_date":1563232604,"body":"@zakum I don't think the mother is the one actually having sex with the teacher, I think is the whore he meets and just role plays with her because after the deed is done she does not recognize the kid and also because the teacher really does think he did nothing wrong which is right"},{"id":954922,"gallery_id":276457,"poster":{"id":292633,"username":"zakum","slug":"zakum","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561645750,"body":"@natesh640 I think the old man and lady have something to do with her breaking out of the hypnotism, since she looked pretty shocked after those panels. That'll match with how she managed to contact hypnotism sensei for help also. As for page 494, apparently there's a 10 year time skip? Honestly doesn't make any fucking sense lol. A 1 year time skip would make sense, but 10 years?"},{"id":953963,"gallery_id":276457,"poster":{"id":2339986,"username":"natesh640","slug":"natesh640","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561571982,"body":"@zakum Yes their second x-scene is still not clear. But if i have to guess that teacher just showed the pictures and warned her of that three little devil's past activity. Also there will be a scene where the doctor explains something to the mother and she was in shock. The scene placement makes me believe this does happen before the three idiots eventual doom. But I'm more interested in who that old dude and old lady on page 484 is and what happen to that girl(head of photo club)?. Also what's going on in page 494?."},{"id":953903,"gallery_id":276457,"poster":{"id":292633,"username":"zakum","slug":"zakum","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561568681,"body":"I'm sure some of you will want to flip your tables after reading this. Well, guess what, there's still 60+ pages of this. SPOILERS AHEAD, but I think you probably won't even be scrolling down here unless you're hoping for answers. I can't read Japanese so I'm not 100% of the exact details, but the mom somehow contacted the hypnotism sensei before her meeting with the 3 idiots, and he managed to hypnotise them into fucking each other. So no, she did not have sex with them. In the end it's a happy ending for most of the characters barring the obvious ones. Even the ugly school teacher ended up with a wife and children. \n\nThe one thing I'm not sure about is what's the deal with the mom fucking the school teacher cuz of the drug's side effect. Is that just another hallucination or did that actually happen? She retained enough mental faculty to contact hypnotism sensei to help her, so was the whole slut-mode thing even real?. I suppose we'll just have to wait for the rest to be translated. "},{"id":953225,"gallery_id":276457,"poster":{"id":1143182,"username":"shiro8","slug":"shiro8","avatar_url":"avatars/1143182.png","is_superuser":false,"is_staff":false},"post_date":1561516681,"body":"@KingSlum No thats the whore he haired because looked like the mom"},{"id":953196,"gallery_id":276457,"poster":{"id":613890,"username":"Ipan","slug":"ipan","avatar_url":"avatars/613890.png","is_superuser":false,"is_staff":false},"post_date":1561514541,"body":"I think soon this story will be finished"},{"id":952859,"gallery_id":276457,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1561487636,"body":"Comment section is absolutely shit"},{"id":952785,"gallery_id":276457,"poster":{"id":1602979,"username":"Badzkie","slug":"badzkie","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561484071,"body":"Kill all cucks"},{"id":952733,"gallery_id":276457,"poster":{"id":2538045,"username":"Hentaiporest","slug":"hentaiporest","avatar_url":"avatars/2538045.png","is_superuser":false,"is_staff":false},"post_date":1561480593,"body":"Do you like hentai games? Well then to you Play Free - playhentai.ga"},{"id":952708,"gallery_id":276457,"poster":{"id":92240,"username":"grandmaster11","slug":"grandmaster11","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1561479040,"body":"-SPOILERS-\n\nIts some kind of dream. Chill out my fellow vanilla lovers.\n\n-SPOILERS-"}]