[{"id":969085,"gallery_id":276723,"poster":{"id":2494901,"username":"Amir Syarifudin","slug":"amir-syarifudin","avatar_url":"avatars/2494901.png","is_superuser":false,"is_staff":false},"post_date":1562673872,"body":"Haruna (榛名) was a warship of the Imperial Japanese Navy during World War I and World War II. Designed by the British naval engineer George Thurston and named after Mount Haruna, she was the fourth and last battlecruiser of the Kongō class, amongst the most heavily armed ships in any navy when built. Laid down in 1912 at the Kawasaki Shipyards in Kobe, Haruna was formally commissioned in 1915 on the same day as her sister ship, Kirishima. Haruna patrolled off the Chinese coast during World War I.\nDuring gunnery drills in 1920, an explosion destroyed one of her guns, damaged the gun turret, and killed seven men. During her career, Haruna underwent two major reconstructions. Beginning in 1926, the Imperial Japanese Navy rebuilt her as a battleship, strengthening her armor and improving her speed and power capabilities.\nIn 1933, her superstructure was completely rebuilt, her speed was increased, and she was equipped with launch catapults for floatplanes.\n\n-Wikipedia, ofc"},{"id":957446,"gallery_id":276723,"poster":{"id":1553384,"username":"bbbbbbbbbbbbbbbbbbbbbbbbbb","slug":"bbbbbbbbbbbbbbbbbbbbbbbbbb","avatar_url":"avatars/1553384.png","is_superuser":false,"is_staff":false},"post_date":1561838264,"body":"i can't see the appeal either"},{"id":956179,"gallery_id":276723,"poster":{"id":756917,"username":"Miku_loli","slug":"miku_loli","avatar_url":"avatars/756917.png?_=f9cb89b1592b7a90","is_superuser":false,"is_staff":false},"post_date":1561744409,"body":"@Zero12349 because you niggas are sick #killallcuck2020"},{"id":956108,"gallery_id":276723,"poster":{"id":456612,"username":"Zero12349","slug":"zero12349","avatar_url":"avatars/456612.png","is_superuser":false,"is_staff":false},"post_date":1561737923,"body":"I like how ntr bois are chill about vanilla stuff and then this one dude keeps commenting kill all cuck on ntr mangs lol"}]