[{"id":1508217,"gallery_id":277935,"poster":{"id":1606537,"username":"Def2004","slug":"def2004","avatar_url":"avatars/1606537.png?_=d63c409712cac14e","is_superuser":false,"is_staff":false},"post_date":1610879516,"body":"Damn what a real big cake she have there"},{"id":1246525,"gallery_id":277935,"poster":{"id":3693252,"username":"toutoumomoomoo","slug":"toutoumomoomoo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601566834,"body":"\n\nIf you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me (i accidentally read this comment, so sorry)"},{"id":970690,"gallery_id":277935,"poster":{"id":42268,"username":"Tae_22","slug":"tae_22","avatar_url":"avatars/42268.png","is_superuser":false,"is_staff":false},"post_date":1562810773,"body":"Slut aoyama ❤❤❤❤"},{"id":970689,"gallery_id":277935,"poster":{"id":1127570,"username":"Homosexual fire of the north","slug":"homosexual-fire-of-the-north","avatar_url":"avatars/1127570.png","is_superuser":false,"is_staff":false},"post_date":1562810746,"body":"Maldita sea. Quiero cogerme al Doppio. No puedo soportarlo más. Cada vez que pongo los mismos videos tengo una erección masiva. He visto literalmente todos los videos rule 34 que hay de el online y sus parodias porno. Mis sueños no son nada más que sexo constante con el Doppio. Estoy cansado de despertarme cada mañana con 6 charcos de semen en mis boxers sabiendo que todos esos charcos debieron ser eyaculados en la ancha cara del Doppio. Quiero que el tenga mis bebés Doppio. Mierda, mi madre me vio metiéndosela a la almohada con la cara del Doppio. La había pintado del Doppio. Mamá no me ha dicho una palabra en 10 horas y estoy preocupado de que se lleve mis Blurays 4k del Doppio y Doppio Vol. 2. Es posible que no vuelva a ver al Doppio más, adiós y gracias humanos.\n\n~Bucciarati~"}]