[{"id":2480190,"gallery_id":278869,"poster":{"id":4878103,"username":"Yeeuwu","slug":"yeeuwu","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1650843016,"body":"Wtf I mean the is right but yeah"},{"id":1998107,"gallery_id":278869,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1630928185,"body":"However, it's not the sex between lovers that teaches him, it's just how to make trashy hentais. Because this lovemaking has nothing graceful or romantic about it. "},{"id":1998055,"gallery_id":278869,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1630926174,"body":"New things are always more intense, so logically it shouldn't take much to make her feel pleasure. No one can be bad enough to not be able to stimulate a genital part... Especially after 20 minutes of rubbing... Whether you're good at it or not, it's still an intimate stimulation, so unless it's painful, there's no way you can't make her feel something... Mashiro's reactions are totally disproportionate, especially with what happens next... I also can't understand why Sorata and Mashiro would let Jin stay in the room like a voyeur. We can see that Mashiro is hiding when we see her panties at the end of the series. Incoherent fiction. "},{"id":1998053,"gallery_id":278869,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1630926051,"body":"It's so ridiculous this total lack of credibility... Mashiro is a virgin, so don't make her act like an easy going, super experienced and debauched girl, who has huge sex demands... Not to mention that not all women inevitably like womanizers like Jin, who collect sexual diseases, are only good at sex because they proudly live for their sexuality like animals and are therefore very bad in love. They run away from commitment like cowards, unfit for any form of eternal loyalty because of their sex addictions and we know that Mashiro doesn't like perverts who privilege his beautiful body over his soul. Being treated too brutally or vulgarly in bed does not make the unanimity either, especially if they do it for true love. It's especially the pornos that fill our heads and pervert our minds with false ideas received... "}]