[{"id":2561491,"gallery_id":280687,"poster":{"id":4966987,"username":"ScrubKingOficalBitchBoiSlayer","slug":"scrubkingoficalbitchboislayer","avatar_url":"avatars/4966987.png?_=cee91b513caf41d0","is_superuser":false,"is_staff":false},"post_date":1654000447,"body":"Let us pray that we will be never be as autistically retarded as moron LordCellofEarth9 who has no life and keeps posting walsl of texts every day on a fucking porn site. Amen."},{"id":2558164,"gallery_id":280687,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653859032,"body":"@Y E H B O I Doubt you'll ever see it, this story ending and that \"Snuff\" tag makes it clear the girls are pretty much dead if left as Skinsuits for a extended amount of time! Like with the main girl, her final moments are the guy who stole her body making her feel despair via corrupting her young master and even getting him to admit he HATED the strict \"REAL\" her and loved the \"current her\" Only reason the kid's alive is because he's useful in getting more skinsuits and I'm guessing he's trick the kid into thinking HE'S the Kunoichi just using different forms with those other skins! The Boy is a trophy to allow him to hide, but once he's forgotten and he grows tired, he may kill the boy after letting him know his \"onee-chan's\" true fate and \"how he helped in that\" since he's the type who loves killing people when they fall into despair"},{"id":2367662,"gallery_id":280687,"poster":{"id":1168948,"username":"Fookin Laser Sights","slug":"fookin-laser-sights","avatar_url":"avatars/1168948.png?_=51f64285b2765d14","is_superuser":false,"is_staff":false},"post_date":1646134417,"body":"Damn. I want that needle so badly "},{"id":1449292,"gallery_id":280687,"poster":{"id":2898376,"username":"Y E H B O I","slug":"y-e-h-b-o-i","avatar_url":"avatars/2898376.png?_=7217c8541a01c118","is_superuser":false,"is_staff":false},"post_date":1609442036,"body":"I want to see something similar or a continuation of this,where the people who turned into skins get turned back to what they once we're"}]