[{"id":1842051,"gallery_id":283764,"poster":{"id":485606,"username":"MegaNeger","slug":"meganeger","avatar_url":"avatars/485606.png","is_superuser":false,"is_staff":false},"post_date":1625051877,"body":"Fact: used up girls are disgusting, only cucks and betas deny this."},{"id":1426269,"gallery_id":283764,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608738233,"body":"Personally, the ending I’d have preferred is the MC runs away sad and just learns a lesson from what he saw to be more proactive in his next relationship, cause he was kind of insensitive in the beginning but the punishment for his actions was a bit extreme. "},{"id":1426256,"gallery_id":283764,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608737997,"body":"Also I’m really fascinated by all the little tidbits in the story. Like the fat guy saying he’s definitely gonna have sex with her after he’s punched by the NTR guy for wanting to stick it in her pussy. Or the other guy claiming that she belongs to him etc. Like the story feels like it has these threads that are left unresolved. If there was sequel, there would probably be NTR and worse tbh because now they’re official. I’d be interested in a vanilla sequel but I don’t think we’d get one."},{"id":1426249,"gallery_id":283764,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608737735,"body":"But man, I don’t understand how somebody  would still want to be with someone after they’ve seen them having unprotected sex with some random person. Just a major turnoff. Not saying the girl is used up or something like that, but it’s one thing knowing your partner has previous experience before you which is totally normal and natural, and another thing seeing it in real time lol. "},{"id":1426241,"gallery_id":283764,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608737389,"body":"https://hentainexus.com/view/5442\n\nEnglish de censored in the link.\nSo basically they’re at the stage where they’re close to dating. She thinks they went on a date. He’s still playing it slow. But it seems like she’s been in a sexual relationship with the other guy at the same time she’s been trying to start a relationship with MC. The end is so abrupt. She says she’s not the kind of girl he thinks she is. He tells he loves her and will protect her. Like dude, why didn’t you protect her when she was telling that guy no. And she’s also in the wrong since she’s been sleeping around with that guy numerous times while trying to date you. She’s just scared that she’ll get caught this time around. God the art is so beautiful. Especially page 10, her face is just so beautifully drawn. Reminds me of Seto Yuuki’s art."},{"id":1228756,"gallery_id":283764,"poster":{"id":680268,"username":"machine08","slug":"machine08","avatar_url":"avatars/680268.png?_=e143166d0bfba3fd","is_superuser":false,"is_staff":false},"post_date":1600885052,"body":"You're worse than these ntr douche if you think  used up girls are disgusting "},{"id":1204028,"gallery_id":283764,"poster":{"id":747898,"username":"ayami123","slug":"ayami123","avatar_url":"avatars/747898.png?_=cc4978cd112629f7","is_superuser":false,"is_staff":false},"post_date":1599797974,"body":"LOL why would he pick her, knowing she's all used up oh well :D"}]