[{"id":1584518,"gallery_id":284446,"poster":{"id":3600503,"username":"blitzsan","slug":"blitzsan","avatar_url":"avatars/3600503.png?_=53b89b247484cddf","is_superuser":false,"is_staff":false},"post_date":1614195622,"body":"sometimes the price for being able to read is not worth paying lol\nand every time i read a ntr it shows"},{"id":1428239,"gallery_id":284446,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608802390,"body":"she told her husband his father and brother was peeping on her but he just laughed it off. Then the get her drunk and turn her into their bitch. The father and brother is at fault for stealing the wife out of jealousy while the husband at fault for being so damn dense"},{"id":1278659,"gallery_id":284446,"poster":{"id":1793595,"username":"spid","slug":"spid","avatar_url":"avatars/1793595.png?_=477aaaa930effc00","is_superuser":false,"is_staff":false},"post_date":1603013605,"body":"Shame, would have become a lot better if it shows the aftermath. I wanna see her being the bitch if the house and getting fuck in secret. It’s already good as is though "},{"id":1076726,"gallery_id":284446,"poster":{"id":3413723,"username":"RedHawk01","slug":"redhawk01","avatar_url":"avatars/3413723.png?_=7855f2011fb3dcc8","is_superuser":false,"is_staff":false},"post_date":1594675184,"body":"Really this kind of father and brother just need to be wipe out from Earth, just because your brother get a better girlfriend than you will never have in your life doesn’t mean you can treat her like a dog, this is why people start to lose faith in humanity . "},{"id":1076724,"gallery_id":284446,"poster":{"id":3413723,"username":"RedHawk01","slug":"redhawk01","avatar_url":"avatars/3413723.png?_=7855f2011fb3dcc8","is_superuser":false,"is_staff":false},"post_date":1594675049,"body":"Really man, just a beer and faint, nonsense . The two rapers talk nonsense, gotten use to your body, since he didn’t do it with her « boyfriend », who know maybe he have a bigger and better dick than yours . Even so, when his boyfriend tend to see that she’s not virgin and told her why since she say to him she’s virgin, he will find out since he’s more respectable than the two shits used as his family . As his place, I just call cops or get a gun and kill them . "}]