[{"id":2532290,"gallery_id":285161,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1652819062,"body":"2022 as of writing this comment, this has been abandoned by the artist hasn't it...? I guess he got bored of it since he still makes new works"},{"id":2386662,"gallery_id":285161,"poster":{"id":4488952,"username":"TinyDickCuckold","slug":"tinydickcuckold","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1646910121,"body":"Ok the story is just getting stale and spinning in circles, and there are a few ways things could be shaken up. First idea either Fuukas boyfriend or the katana guy gets to watch her be fucked, as that is always the inevitable conclusion of NTR. Second idea is that either the katana guy or her boyfriend actually gets to fuck her, and we get to see how either man just doesn't feel good and is kinda boring to Fuuka after having fucked so many men. Thirdly stop dripfeeding us answers to your mysteries and drop large amount of answers, as the more you sidetrack from that mystery the less we care."},{"id":2120863,"gallery_id":285161,"poster":{"id":821387,"username":"Laoto","slug":"laoto","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635877022,"body":"This series didn't got any better. The girl is 10/10 but the male partners all look like fucking turds."},{"id":2099424,"gallery_id":285161,"poster":{"id":3611154,"username":"Captain Netorare","slug":"captain-netorare","avatar_url":"avatars/3611154.png?_=b2106edd97eeffb8","is_superuser":false,"is_staff":false},"post_date":1634971558,"body":"She fucking the fat kid it's barely decent and I hope that shit ends... the scenes with the old dad were more intense I want more of that, I like her fucking old ugly guys that's how she started this series and I want more of that, hope next scenes are with the dad or a new old character, she already did old janitors, teachers, yakuzas, rich old man his son and she's doing a bit his secretary, next ones can be a homeless old guy (he fucking her inside a tent would be hot), a old guy that owns a small groceries shop (she giving him blowjobs when hes selling groceries), a uncle would be interesting the loser brother of her dad (so he can fuck her in her own house and room) , talking about relatives maybe the dad of the good looking MC (yes she getting fucked on that guy house it's a nice twist) , etc. that's the cool thing with ugly old dudes they have great variety."},{"id":1850754,"gallery_id":285161,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1625403735,"body":"@Garlen / @Kami Nana also pretty much the same reason here! i just hope guy won't accept her at the end.."},{"id":1228230,"gallery_id":285161,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600862069,"body":"@Garlen Same reason I've been keeping an eye on it. That one chapter...when she was in the future...seemed to imply that he almost hated her...speaking coldly to her and all(which she didn't even notice...shows how much she actually cares...). Now just waiting for the shit to hit the fan and for the MC to tell her to go fuck herself."},{"id":1093456,"gallery_id":285161,"poster":{"id":3308058,"username":"Garlen","slug":"garlen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595369428,"body":"It's been a long time. the only reason I kept up with this story is to see the male MC confront the female MC for being a cheating slut who runs away from the safety of both dojo and police protection to get herself in more problems just for some strange dick. It was implied that happened in the future i.e (future chapters) and I just want to see it on paper."},{"id":1044913,"gallery_id":285161,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593504202,"body":"Was this cancelled...? Haven't seen any new ones in a LONG time. That said, the guy should just forget this girl. That or FMC has to let him have any other girl he might want on the side. It's only fair. Still, would rather he just learned about it and left her."}]