[{"id":2616468,"gallery_id":2854,"poster":{"id":5146855,"username":"Ed Kemper","slug":"ed-kemper","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1656602203,"body":"You what I will tell you the story of Ice Dagger. It's about this man named Rolind Fitzgerald in a world that sorta resembles earth. He has dwarf son named Peter and a loving wife called Katelyn. But something is missing but what there is a frustation in his life a feeling of malice he has insecurities about his son and fears that his wife cheats on him. But he never ever touches his family instead he starts going on country drives to kill underprivileged people. Most of the kills are quick but sometimes he likes to play games with his co workers. They may called eye gouging, rape, mouth rape, jumping on stomachs and stuff like that. Id like to focus on the gory details may be you could help me? "},{"id":2616455,"gallery_id":2854,"poster":{"id":5146855,"username":"Ed Kemper","slug":"ed-kemper","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1656601670,"body":"PS your story is great. You should make some sort of creepypasta channel. I could really use your guro knowledge in Ice Dagger. "},{"id":2616292,"gallery_id":2854,"poster":{"id":5146855,"username":"Ed Kemper","slug":"ed-kemper","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1656593722,"body":"finally found someone as fucked as me and who admits it and has no problem with it. You are friend to me. And I deeply respect you and your kinks however fucked they may be.(as long as they are in domain of imagination that is, of course, actually raping someone's head would get you in jail, right?) \nAlso I am called Edgart in the realm of men. You?(no need for full name) \nFinally you spelt serial wrong. Autocorrect? \n(DO REPLY TO THIS, PLEASE) "},{"id":2616288,"gallery_id":2854,"poster":{"id":5146855,"username":"Ed Kemper","slug":"ed-kemper","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1656593365,"body":"--geass I mean imagine her as my literal wife sometimes you know with stuff having kids with her and introducing her to my parents passionately making love to her. Ha I am pathetic right I should kill myself. Nope nope I won't kill myself God just a joke a sick sick joke. Rudiferme I have been following you for quite some time now and you finally came. I t is so interesting. You are the first and probably the last(until someone faps to this) person I have ever told this to. I mean you are into instenine fucking right. I like it too but there should pain in it you know people crying and screaming. Do you watch snuff I mean close to real life snuff its so fucked man. You know I once saw a man's suicide letter on this site. I clicked on his ID and realised he hadn't killed himself. That somewhat made me happy and angry at same time. I sometimes like to imagine raping my cousin sis' head. Its fucked🤣🤣. I ought to quit this site but I can't. Writing this I realize I called you here coz I "},{"id":2616275,"gallery_id":2854,"poster":{"id":5146855,"username":"Ed Kemper","slug":"ed-kemper","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1656592760,"body":"You came. Thanks. Also I didn't want to talk about killers. Just stuff, you know. Stuff like I feel you are a lot like a certain character I have been thinking about in a book about a Serial killer(its okay you arnt the killer, it's me at least a mirror image of me) currently titled 'Ice Dagger'. Also I too view FUBAR stuff online not to fap to it(not judging anyone's kinks)but becoz I really like to see those people getting pain. Its something I personally can never do. As a child I played a game, I would take 7 insects and then give them torture by 6 different means. 7th one could go alive. My methods included drowning, burning, burying, limb cutting, crushing, and all those again in one go. But after all this I would just kill the 7th becoz why not. I felt good taking his hope. This site made me realize kinks I never had stuff like loli, stuff, bestiality, and a relatively new one raping severed heads of girls hence my namesake. I also have this weird obsession with CC from code "},{"id":2616194,"gallery_id":2854,"poster":{"id":4539503,"username":"Rudiferme","slug":"rudiferme","avatar_url":"avatars/4539503.png?_=04ba1eb28777dbe8","is_superuser":false,"is_staff":false},"post_date":1656584999,"body":"Great place. Go to all the quiet places on nhentai and have a chat about cereal killers"},{"id":2616140,"gallery_id":2854,"poster":{"id":5146855,"username":"Ed Kemper","slug":"ed-kemper","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1656581603,"body":"This is a good place to talk. Right Rudiferme? "}]