[{"id":2413914,"gallery_id":289248,"poster":{"id":2460690,"username":"karimlan","slug":"karimlan","avatar_url":"avatars/2460690.png?_=4fa74d49f0b42e5d","is_superuser":false,"is_staff":false},"post_date":1648059935,"body":"A nice ntr actually. I know ntr is frowned upon by most people here but the author actually puts some effort making a realistic approach to this. Like the player making use of the girl's vulnerability to get into her slowly and not the usual lazy writing like mind control or blackmail. And a wise man once said, never kneel on a girl when it's not your fault. At least in this case the girl gets guilty and broke up immediately and didn't ghost him like most do. And this why your dreams are more important than bitches. "},{"id":2409863,"gallery_id":289248,"poster":{"id":1894107,"username":"NOWAIFUNOLAIFU23","slug":"nowaifunolaifu23","avatar_url":"avatars/1894107.png?_=eff575bc0ecd7990","is_superuser":false,"is_staff":false},"post_date":1647882296,"body":"@DOMODARK bro stop smoking that copium shit you're losing your mind. "},{"id":2402188,"gallery_id":289248,"poster":{"id":4893315,"username":"BIG DUMPi","slug":"big-dumpi","avatar_url":"avatars/4893315.png?_=4b6e4cd9fcc178af","is_superuser":false,"is_staff":false},"post_date":1647630307,"body":"bruh that playboy is a stalker, taking advantage of emotionally unstable people. She's also kinda a slut for just immediatly fucking a guy whom shes met only once before."},{"id":2397498,"gallery_id":289248,"poster":{"id":3779596,"username":"Yuuji200619","slug":"yuuji200619","avatar_url":"avatars/3779596.png?_=f4bf8a7882f3e108","is_superuser":false,"is_staff":false},"post_date":1647427806,"body":"Bruh the girls in this story are so hit and sexy since your a football player you can grab another bitch to be honest mc in this kind of story doesn't think to much for his next move. If i we're you il just go ahead and future farm so if the girl your dating breaks up with you you have multiple spare one's to date😎😎😎\n"},{"id":2394926,"gallery_id":289248,"poster":{"id":4609503,"username":"SoulNoEffect","slug":"soulnoeffect","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647297979,"body":"another inciddent where the MC, dont have his cellphone to explose a narcissist rapist on the rooftop."},{"id":2394771,"gallery_id":289248,"poster":{"id":3354234,"username":"NNnewFag","slug":"nnnewfag","avatar_url":"avatars/3354234.png?_=fe0e9c0644d8b918","is_superuser":false,"is_staff":false},"post_date":1647292015,"body":"Onto of that you guys talk about human nature even though it's rare to not get extremely angry more so than sad leading to you beating the shit out of either your gf for cheating on you or the other which in this case both is fine "},{"id":2394769,"gallery_id":289248,"poster":{"id":3354234,"username":"NNnewFag","slug":"nnnewfag","avatar_url":"avatars/3354234.png?_=fe0e9c0644d8b918","is_superuser":false,"is_staff":false},"post_date":1647291874,"body":"I see others saying the Mc was wrong even though it's clearly the girls fault for not being open and honest it's not like him having to stop playing to care for his gf is going to immediately make him significantly worse at soccer you guys are literally blaming the person who has done nothing wrong while ignoring the fact that the fuckboy emotionally manipulated someone who was in a vulnerable state just to get some pootang and the gf being extremely dishonest "},{"id":2394765,"gallery_id":289248,"poster":{"id":3354234,"username":"NNnewFag","slug":"nnnewfag","avatar_url":"avatars/3354234.png?_=fe0e9c0644d8b918","is_superuser":false,"is_staff":false},"post_date":1647291679,"body":"This is kinda beyond fucked while the art is good if you look into just a little more you'll come to find the fuckboy is a complete dip shit it's not even about \"being able to tell fiction from reality\" I just don't like dip shits and people who manipulate people who just went through some traumatic or worrying experience. \n\nAlthough it's kinda obvious who's gonna end up on top the guy focusing on himself or the fuckboy who does nothing and is a complete bum "},{"id":2382731,"gallery_id":289248,"poster":{"id":4560719,"username":"Reyzan","slug":"reyzan","avatar_url":"avatars/4560719.png?_=76491c1223fa58be","is_superuser":false,"is_staff":false},"post_date":1646756446,"body":"Have i read it somewhere the story kinda familiar"},{"id":2374406,"gallery_id":289248,"poster":{"id":4455131,"username":"mirrorsreflectyou","slug":"mirrorsreflectyou","avatar_url":"avatars/4455131.png?_=75a39f7bb8a6f3e6","is_superuser":false,"is_staff":false},"post_date":1646439999,"body":"Damn           "},{"id":2370155,"gallery_id":289248,"poster":{"id":3679313,"username":"pulse_y","slug":"pulse_y","avatar_url":"avatars/3679313.png?_=0bdefe2933c08f45","is_superuser":false,"is_staff":false},"post_date":1646255586,"body":"i dont approb"},{"id":2354545,"gallery_id":289248,"poster":{"id":3688471,"username":"©DEATH®","slug":"death","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1645546000,"body":"Ngl, this guy has some skills."},{"id":2349807,"gallery_id":289248,"poster":{"id":3509596,"username":"28stabwound","slug":"28stabwound","avatar_url":"avatars/3509596.png?_=f0be85010e33b795","is_superuser":false,"is_staff":false},"post_date":1645359660,"body":"W-woah DID YOU JUST ASSUME MY SPORT!?????\nOH HELL NAH! Kid let me tell you this\nYoure lucky im not short tempered because i would have took my betty buckshot and shot you and that hoe on the spot\nHOW DARE YOU TELL ME TO PLAY SOCCER!\nARE YOU MY DANM MOM I DO SWIMMING\nS-W-I-M-M-I-N-G! REMEMBER THAT WORD OR I WILL LITERALLY BLOW THAT DANM HEAD OF YOURS MATE DONT MESS WITH THIS AMERICAN LAD"},{"id":2346450,"gallery_id":289248,"poster":{"id":4612380,"username":"Hirot🌺","slug":"hirot","avatar_url":"avatars/4612380.png?_=7e69fc7cd418d679","is_superuser":false,"is_staff":false},"post_date":1645237066,"body":"Baguu mó sem sentido tlgd kk"},{"id":2342962,"gallery_id":289248,"poster":{"id":4609651,"username":"leung_GW","slug":"leung_gw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645072316,"body":"@DOMODARK Great writeup! You should also write about how the fuckboy reacted when he saw how successful MC is. "},{"id":2339809,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1644949393,"body":"The only thing I wanted to argue in previous paragraphs is that the girl will also lose. Something almost certain."},{"id":2339790,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1644949066,"body":"@DOMODARK Having already discussed it with other readers, we agree that MC won't be the only person to lose. It's so obvious that the Fuckboy is lying (behaving like someone he's not) that she'll most likely find out about the lies. From there there are many possibilities, but it is almost certain that she will also lose. Although the author will not put this scene, because in the NTR only the cucks lose. Too bad, it would have given a touch of realism. "},{"id":2334680,"gallery_id":289248,"poster":{"id":646817,"username":"DOMODARK","slug":"domodark","avatar_url":"avatars/646817.png?_=86d633d51b6e8f0c","is_superuser":false,"is_staff":false},"post_date":1644856237,"body":"@SchrodingerZ  By selling her body she sees mc drivin a Luxury fararri with bad ass bitch  she says his name and he notices her and “his gf says you know this hoe?” He says shit I ain’t never seen this. Dirty ho before  get away from and then cries again as mc drives off into the sunset. Oh and fuckboy grew up to become a certified giggilo hopping from bitch to bich working a dead end job bcuz as u guess he’s retarded. My perfect ending and apologies for the poor grammar and punctuation."},{"id":2334666,"gallery_id":289248,"poster":{"id":646817,"username":"DOMODARK","slug":"domodark","avatar_url":"avatars/646817.png?_=86d633d51b6e8f0c","is_superuser":false,"is_staff":false},"post_date":1644855825,"body":"@SchrodingerZ She almost didn’t recognize his him he’s grown so tall handsome and strong that he looks like a completely different person she calls out to him and he says “fmc what do u want?” Her eyes begin to water telling mc her mother died Mc replies saying “I forgot the part where that’s my problem ,why not tell your bf or  do you only tell guys who are not ur bf ur problems?” (ik shameless Spider-Man reference)  she’s taken aback by Mc’s lack of empathy (her audacity right)  she says they’ve broken up and that he used and manipulated her and that she’s so sorry and wants Mc back. Mc tells her she choose the duck boy and that he doesn’t want to be with a cheating whore like her and walks away. She then breaks down crying with regret , sorrow. rumours and pictures of her taking dick start to spread she becomes a complete out cast at school. To wrap it up fix drops out starts working at a  brothel bcuz she has no skill or speck of intellect to pay off her moms passing and her bills "},{"id":2334632,"gallery_id":289248,"poster":{"id":646817,"username":"DOMODARK","slug":"domodark","avatar_url":"avatars/646817.png?_=86d633d51b6e8f0c","is_superuser":false,"is_staff":false},"post_date":1644854954,"body":"@SchrodingerZ She realizes how much of a stupid idiot she for now realizing he has multiple girls and only wanted her for her body. On her visit to the hospital still deeply troubled by the truth she musters up the courage to go see her mom where she’s told her mom has sadly passed away and she now has to pay the expensive hospital bill ( because life support ain’t cheap :) she then breaks down crying as she leaves the hospital it starts to rain she tries to call the fuckboy (idk but she’s a Dumbass)  about her mom he picks up and as she is telling him what happened to her mom. she hears another girl getting her back blown out in the background (Lmao)  he then says “oh that’s too bad come by my place later 😈”  she then breaks up with duck boy  hangs up the phone. her eyes now lost their color she goes home and breaks down crying herself to sleep. She then figures the only person she really still has is Mc. The next day at school she tries to finds Mc and finally stumbled onto the Mc "},{"id":2334587,"gallery_id":289248,"poster":{"id":646817,"username":"DOMODARK","slug":"domodark","avatar_url":"avatars/646817.png?_=86d633d51b6e8f0c","is_superuser":false,"is_staff":false},"post_date":1644854189,"body":"@SchrodingerZ You’re analysis and afterstories are realistic asf, I desperately want the Author to make a pt.2 of this story is very well grounded in reality. Though the only part that’s unrealistic is the Mc and Fmc lack of communication, I mean come on the mf can’t make a little time out of the day for his gf? Since the author hasn’t made and after story I’ve been forced sit with this ending on my conscience. So I thought of my own ideal ending. The Mc realizes his faults and accept the reasons he lost her nd moves on and learns to focus not on himself but one’s around him. This experience not only makes him stronger but a better individual. He improves even more in soccer growing into a stronger and bigger frame making him the strongest player on his team. His talents are then noticed by a pro club that he is then draftred to A pro team. While the is going after Fmc tries to seek affection from Fuckboy. She finally realize the fuckboy doesn’t care about Her at all (Shocker)"},{"id":2320013,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1644347502,"body":"Taniguchi exaggerates in the context of sex so that the MC suffers more (for example, MC seeing them fuck and that she has so much initiative in sex 😆). Which already seems exaggerated like any hentai. So, dont be sad: part of the personality of our characters is also fiction"},{"id":2319811,"gallery_id":289248,"poster":{"id":3637620,"username":"ロリ好き","slug":"rorihao-ki","avatar_url":"avatars/3637620.png?_=d9749061b18eb055","is_superuser":false,"is_staff":false},"post_date":1644335490,"body":"Man😔 this hurts I know how he feels but it was an interesting story "},{"id":2303536,"gallery_id":289248,"poster":{"id":3045412,"username":"GigaHorni","slug":"gigahorni","avatar_url":"avatars/3045412.png?_=21eb32ebe98b95d8","is_superuser":false,"is_staff":false},"post_date":1643681238,"body":"Pain peko.    "},{"id":2301331,"gallery_id":289248,"poster":{"id":3912730,"username":"mdp2p","slug":"mdp2p","avatar_url":"avatars/3912730.png?_=7711466711224010","is_superuser":false,"is_staff":false},"post_date":1643600577,"body":"I been searching this for a long time. Thanks God."},{"id":2292306,"gallery_id":289248,"poster":{"id":1661251,"username":"pyrex123","slug":"pyrex123","avatar_url":"avatars/1661251.png?_=61bcc744ea54b93c","is_superuser":false,"is_staff":false},"post_date":1643254316,"body":"Lmao weak ass beta"},{"id":2286669,"gallery_id":289248,"poster":{"id":3728761,"username":"Vien","slug":"vien","avatar_url":"avatars/3728761.png?_=ff0595f30eaca58c","is_superuser":false,"is_staff":false},"post_date":1643050763,"body":"So this is it? found the first doujin I read 2 years ago "},{"id":2286553,"gallery_id":289248,"poster":{"id":4059555,"username":"Shota doujins = Zzz","slug":"shota-doujins-zzz","avatar_url":"avatars/4059555.png?_=b4d022724ac3683a","is_superuser":false,"is_staff":false},"post_date":1643047084,"body":"Pipipipi  "},{"id":2273462,"gallery_id":289248,"poster":{"id":3511313,"username":"brumh","slug":"brumh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642545730,"body":"This is your brain on NTRfaggotry"},{"id":2267179,"gallery_id":289248,"poster":{"id":4636581,"username":"mayucf","slug":"mayucf","avatar_url":"avatars/4636581.png?_=782a94a5c12d8f79","is_superuser":false,"is_staff":false},"post_date":1642289350,"body":"The karen girl  gets pregnant and get ditched\nBy the fucktard\n\nEnded with the legendary karen words\nshe said: all the boiss are the same"},{"id":2265591,"gallery_id":289248,"poster":{"id":126231,"username":"kinhchuaha1","slug":"kinhchuaha1","avatar_url":"avatars/126231.png","is_superuser":false,"is_staff":false},"post_date":1642220246,"body":"it's just some porn and the guys below me turned it into some sorta philosophy talking fest"},{"id":2259580,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641993489,"body":"@WhiteR9se I agree that it expresses the nature of the loser, his feelings in the face of what he has already lost: regret, helplessness, sadness. But you also have to understand that Taniguchi exaggerates in the context of sex so that the MC suffers more (for example, MC seeing them fuck and that she has so much initiative in sex 😆). Which already seems exaggerated like any hentai. So, dont be sad: part of the personality of our characters is also fiction."},{"id":2259412,"gallery_id":289248,"poster":{"id":3715582,"username":"Rifu","slug":"rifu","avatar_url":"avatars/3715582.png?_=555079d417ad4e0a","is_superuser":false,"is_staff":false},"post_date":1641986617,"body":"Go Shou! make your dreams come true!!!"},{"id":2259340,"gallery_id":289248,"poster":{"id":4127209,"username":"WhiteR9se","slug":"whiter9se","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1641983802,"body":"This is one of the first doujins that shook me from deep down. The ending was i would say not favorable (for me). But it is what would have happened irl if the given conditions were the same. also I agree with what @q9za and @SchrodingerZ are saying. The extension of this story, so to say a sequel would have the same routes as they talked about. But looking at the artist profile, I don't think there would be any sequels coming out. Anyways, this  was in no way a pleasant read but it is one of those doujins that nail down human nature very precisely like the mc realizing what he has done wrong. Welp, anyone who read this till here, thanks for listening to my thoughts. \n\n"},{"id":2258265,"gallery_id":289248,"poster":{"id":3832010,"username":"Davidalia","slug":"davidalia","avatar_url":"avatars/3832010.png?_=aae6da38d9d14c88","is_superuser":false,"is_staff":false},"post_date":1641945170,"body":"Mood geden"},{"id":2253955,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641773561,"body":"@q9za (...) If we assume that she gives him another chance, Here are two possibilities (which are less likely than the ending where she leaves it). Even the first one is just a temporary extension of the ending where she ends up with him: 1) The Fuckboy has no real intention of changing and keeps fooling the FMC, which sooner or later she will knows. This would end up burying the relationship. 2) The Fuckboy's intentions are sincere and it really changes for the better. This seems unlikely to me compared to the endings seen before because it requires maturity and time for the relationship to move forward - something that, from what I have witnessed IRL, is unlikely in love affairs that occur at school. Plus, she knows the Fuckboy had no sincere intentions at first. We are talking then of a relationship with an antecedent that goes against and that would make it difficult for this relationship to prevail. A happy ending for the relationship is not impossible but, it has a low percentage"},{"id":2253906,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641770958,"body":"@q9za And I know that nothing is written yet, but we can build on what would be most likely by observing similar situations in everyday experience (irl). And in this case, the girl finding out about the Fuckboy's actions is very likely (based on what I mentioned). It is possible that the Fuckboy wants to retain her but he will not give it as much importance if she finally decides to get away from him (if we assume that she was just one more conquest like others). She could give him another chance if the Fuckboy tries to convince her that he will change..."},{"id":2253884,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641769839,"body":"@q9za A true romantic relationship could form, but it is unlikely. To begin with, is difficult that the Fuckboy can hide the previous conquests (who could look for the Fuckboy), because they all live together in a school. It would be easy if the Fuckboy didn't go to school and his actions were unknown. But as I already said in a previous comment, both in a school and in the university, one knows the identity of another, unless he maintains a low profile: which is not the case of the Fuckboy, who does not mind showing himself seated and embraced of two girls in the school. My idea is summarized in that with such actions, the people around him have an idea of ​​the Fuckboy and those who do not, will soon have it: the Fuckboy as a casanova."},{"id":2253360,"gallery_id":289248,"poster":{"id":3477581,"username":"L.A.T.O.M","slug":"l-a-t-o-m","avatar_url":"avatars/3477581.png?_=84c38b4e012fc457","is_superuser":false,"is_staff":false},"post_date":1641745365,"body":"What's with the long message "},{"id":2253032,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641733198,"body":"-ing as long as it is educated and from past experience, but not stable enough as so that every action and it's following results are set in stone, as in, things which are unexpected, uncomprehensible, and inconceivable do happen sometimes, and if you are skilled enough in your specific field, you can force your assumed future to be supplied to you. We do not know the future of this doujin, henceforth, we can't truly know what happens next, the possibilities are endless. So why are we to assume the future is favorable to the MC and not the fuckboy?"},{"id":2253019,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641732708,"body":"@SchrodingerZ I've omitted a simple fact that in real life, people change and adapt accordingly with the changes forced externally upon them or in their environment. What you've mentioned is pointing out that there is the possibility- no, it is certain that the FMC will adapt and begin to leave the fuckboy as she is tossed aside, that is assuming the fuckboy does toss her aside. It is entirely true what you state, and it fits perfectly with the logical reasoning of any human, that assuming it isn't altered by emotion. But I believe that the possibilities of ending are more than three, reason being, we don't exactly know if the fuckboy himself does not change, or if he plans out a method to exclusively date her while keeping her hidden from his other girlfriends, he might turn into the FMC's friend. It may lead to disaster in fuckboy's future or to flourish a true romantic relationship with the FMC . I've personally observed that life is stable enough that you can assume almost everyth-"},{"id":2252647,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641714579,"body":"@q9za As we can see from what I mentioned, the panorama changes because it would no longer be an ending where the Fuckboy has the <prize> in his arms and she is happy with him (as another winner). That's what the cover of this doujin shows. But if we assume all the consequences, the image changes since three separate paths arise: 1) The MC who lost the girl 2) the FMC who was deceived and is left alone and 3) The Fuckboy who despite not continuing with the girl , he already took what he wanted from her. As you can see ... it is a different panorama at the end that Taniguchi gives us."},{"id":2252641,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641714089,"body":"@q9za Consequently, she would realize that she was deceived and would weigh what she <won> and what she lost. Here... I can think of two endings: 1) she try to get back to the MC or 2) sshe stay alone for a while. I don't take into account the ending with her going back to the Fuckboy because their relationship is superficial and based only on sex. And clearly the Fuckboy had to act being the understanding friend (which was what she needed)."},{"id":2252630,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641713651,"body":"@ q9za Anyway, it's a somewhat skewed story. It does not show all the consequences and only poses the MC as the absolute loser. In real life, people are not eternal and well-deserved prizes for the <best card player>. The human being learns from his mistakes and the plays can be reversed having new winners and new losers. That social dynamic is what this story hides, which presents the Fuckboy as the absolute winner (and showing the girl as a winner by getting a <best match>. But if we take into account social hierarchies, and not just the human psyche , the Fuckboy is an outcast with a bad reputation and whose lie could easily be discovered since in a school people have a well-known social identity. That is, at school: everyone knows who they are and what they do. would realize the deception and would be another of the losers in this story.\n"},{"id":2252322,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641700277,"body":"@leung_GW I would say that is a factor that determines what happens in their relationship, but in this case, comparing the looks of the protagonist and antagonist, we can assume that if the protagonist travelled the same path of the antagonist, he would reach the same results as the antagonist. Reason being that, the dominant factor that lead to the current results is the antagonist's great timing and strong charisma, not the looks. A good example of what you are saying would be Terasu MC's spin on NTR doujins where the cheating is dominated by physical looks rather than charisma and the such. Although it's great you pointed this out, since rereading the manga now made me focus on the art details of the characters rather than the story, and I can see the difference of looks, although it seemed to not affect the girl's opinions much."},{"id":2252175,"gallery_id":289248,"poster":{"id":4609651,"username":"leung_GW","slug":"leung_gw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641694280,"body":"@ q9za Great Post. But wouldn't you agree that despite all his intelligence, the antagonist's greatest weapon in his arsenal, and the prime reason why he is as successful as he is in seduction, is his good-looks? \n\n"},{"id":2252171,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641694033,"body":"I'm seeing a lot of grammar mistakes after proofreading my posts (such as their -> there) but sadly you can't edit posts."},{"id":2252165,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641693902,"body":"-that is what varies between every task that man does, be it social, physical, or anything. The perfect balance would be to know how to do something, and when to do it, including other factors that come in depending on tbe subject. All in all, this is a great display of human nature, in which you see how a more intelligent, focused and exploitative party can occupy and humiliate a thick-skinned conserved party. Good read."},{"id":2252153,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641693491,"body":"-stead focusing on mundane tasks in which he would achieve things that are of less value than time spent. I personally categorize the work ethics I've observed into three categorise, one would be pure and simple bruteforce and hardwork which yields the similar results regardless of timing (which would in this case be the protagonist) , one would be incorrectly timed although intelligently planned smart work that is not executed or pursued correctly (that would the case IF the antagonist tried to bang the chick as fast as possible, lets say one day and she rejected him, or if he tried to strip her earlier and she refused), and the case in which the perfecy balance is struck, and in which the you are yielded success (that would be the current antagonist, as his work was correctly timed, correctly executed, and intelligently planned). In real life, this cannot be replicated, as their is not true perfect balance between the two, although we can try to be closest to the balance as possible-"},{"id":2252136,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641693001,"body":"-otagonist's route of remaining ignorant and looking for more blunt cases to form a relationship, this doujin would not have happened. Immediately after the antagonist took on the slip which was handed to him (which the protagonist did not do), he formulated a plan, a plan in which he spent time waiting (so timing was involved) he had to formulate and adapt to what she would say, he used his seduction skills to peer closer and closer to her personal life. In the end, he was successful. He had banged the chick, and the protagonist had become at loss. That is a display of pure domination and thinking skill from the antagonist. Showing just how skilled he is at a social engineering and seduction. To all those saying that the protagonist would have become successful in life later, that would be wrong. It is most likely that he will be exploited as an underpaid nine to five worker by a big company rather than a man who achieves his dreams, because he refuses to pursue bigger dreams, but in-"},{"id":2252126,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641692561,"body":"Take it, but instead relied on ignorance and patience, opting in for a slower process of domination, which in my opinion would be more beneficial to both parties (protagonist and GF) if better executed.\n-\nThat is where the antagonist comes in. He was presented by pure luck, where they saw each other on the soccer field, and from then on he had a singular aim, unlike the protagonist, which was to bang the chick. You can tell at that immediate moment that the protagonist was going to lose. Reason being; the protagonist did not even know he was in a state of war with the other party, and your enemy not knowing they are in a battle gives you the perks of stealth and them not fighting back.\n-\nRNG was involved in that the antagonist found a slip the moment he met her, that would be when her mother had an accident, a slip to get more personal with her and go to her house. But you have to add that, if the antagonist's idea to initiate a conversation did not happen, but he instead chose the pr-"},{"id":2252110,"gallery_id":289248,"poster":{"id":2923383,"username":"q9za","slug":"q9za","avatar_url":"avatars/2923383.png?_=db8f39880b880d5a","is_superuser":false,"is_staff":false},"post_date":1641692150,"body":"I've read two of Taniguchi daisuke's doujins, in which one is is where the MC wins, and this current one.\n\nIt's pleasant in that it shows the nature of humanity and it's origin. To take for yourself is to steal from another, be it a human, or a natural resource from the ground. For every winner, there will be a loser, and it is sound to say that you will more often be the loser than the winner, and in this case the hardwork the antagonist(?, guy who stole the girl), and his calculation and planned actions really shined through.\n\nIt's a good insight into seeing that concentrated intelligent work (and in this case correct use of timing) rather than brute force hardwork will make you accomplish things quicker.\n\nAs stated, the protagonist spent a solid 6 months expanding his relationship and trying to get closer to her, focusing on aimless, unplanned dates and meetings. And when the opportunity presented itself (it most likely presented itself multiple times in the past too) he failed to -"},{"id":2239894,"gallery_id":289248,"poster":{"id":4609651,"username":"leung_GW","slug":"leung_gw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641202869,"body":"@SchrodingerZ On a realistic level I think its quite likely that the fuck boy will be a male prostitute in the future...selling his body and cock to the highest bidder...basically a parasite who do not understands the meaning of real work. I dont know if we should call that comeuppance or not. "},{"id":2239825,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641199714,"body":"@leung_GW If we put the story on a realistic level, the possibilities change, but it depends if MC resumes his relationship with the repentant FMC, after she discovered the Fuckboy deception. If that happens, MC could get revenge on the Fuckboy or decide not to. If MC decide to do it: he could convince his friends to give the Fuckboy a beating."},{"id":2239805,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1641198608,"body":"@leung_GW Based on the story of Taniguchi, nothing will happen to the Fuckboy (since in the NTR this character always wins). Also, if this story had a second part, we would see that the FMC is one more bitch of the Fuckboy. All of this based on the logic behind the Taniguchi story, not from a realistic perspective."},{"id":2235991,"gallery_id":289248,"poster":{"id":4609651,"username":"leung_GW","slug":"leung_gw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641051811,"body":"@SchrodingerZ1 Based on Taniguchi's story, what do you think will happen to the fuckboy? Would he get any comeuppance? "},{"id":2234595,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1640991631,"body":"@ Dr.Granpa In these cases, like the doujin, it is the girl who finally loses, after learning of the deception. Feelings of guilt, regret, and pain arise. In that sense, Taniguchi follows the same route as any NTR author (showing the girl happy and without the worst end). We know that in IRL, a girl will almost always be tricked / humiliated by the Fuckboy, who just wants to fuck her. And Taniguchi here omits a lot to only show a part of the whole. It becomes a bit hypocritical since the lesson does not only apply to the MC. But, well, I don't see everything negative. What I rescue from Taniguchi's work is that at least he has built a coherent (somewhat realistic) situation about how a Fuckboy can win over a girl."},{"id":2234589,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1640991508,"body":"@Dr.Grandpa Well, The doujin has a message that shows the MC as a loser ... but to construct such a message Taniguchi Daisuke is hypocritical since he does not dare to write the real consequences: he only writes what suits him so that only the MC looks like the loser and everything seems to be his fault. Taniguchi omits too many things: 1) Once the Fuckboy gets what he wanted, he just stops acting like the gentleman in front of the girl 2) The girl IS NOT GOING TO BECOME HIS BITCH. On the contrary, she will realize that (sooner or later) that everything was a lie: and it is not difficult not to know, since at school it is easy to know the profile of a student. 3) The girl either ends up alone or will look for the MC. Maybe they will never come back or maybe they will, but that would be the true ending. This story would be realistic if the Fuckboy was a person with sincere intentions from the beginning, so he would not have to always act."},{"id":2225989,"gallery_id":289248,"poster":{"id":4701063,"username":"Dr.Grandpa","slug":"dr-grandpa","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640664811,"body":"I don't know why people say this is a cursed ass NTR but to be honest this is just a life or love lesson. Taniguchi Daisuke basically told us the importance of understanding your partner's emotions. Even though we have something important that we need to prioritize, if you have a girlfriend/wife always remember that she's also one of those important things to comfort and be with. I'm a vanilla enjoyer but this kinds of NTR isn't bad as it not only gives us a story driven plot, great art, but also a moral lesson on love life to look to. That's why I like NTRs made by TD."},{"id":2212693,"gallery_id":289248,"poster":{"id":4354264,"username":"Whore4men","slug":"whore4men","avatar_url":"avatars/4354264.png?_=4c3365bdecabc168","is_superuser":false,"is_staff":false},"post_date":1640151539,"body":"That's why being a a single the best"},{"id":2199195,"gallery_id":289248,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1639515972,"body":"@llik lla skcuc: dude you sound like a broken record boomer... this is a work of FICTION, get a hold of yourself man."},{"id":2197387,"gallery_id":289248,"poster":{"id":2398352,"username":"llik lla skcuc","slug":"llik-lla-skcuc","avatar_url":"avatars/2398352.png?_=21dc69ae8cd4c9cf","is_superuser":false,"is_staff":false},"post_date":1639421025,"body":"Bruh so they don't call each other?? What about chatting?? Meeting one time at least a week? This couple is BS bruh. Also that girl accepting that playboy advance? Did her parents not teach her?? Did she not suspect?? Also, cheating before break up?? Welp, what did I expect "},{"id":2191270,"gallery_id":289248,"poster":{"id":3850815,"username":"Kpz","slug":"kpz","avatar_url":"avatars/3850815.png?_=b7fb1ade3726dc8d","is_superuser":false,"is_staff":false},"post_date":1639142422,"body":"I fucking hate this with all my heart their all idiots except for the manipulative sob of a bitch that guy is insidious. "},{"id":2190820,"gallery_id":289248,"poster":{"id":4636581,"username":"mayucf","slug":"mayucf","avatar_url":"avatars/4636581.png?_=782a94a5c12d8f79","is_superuser":false,"is_staff":false},"post_date":1639118048,"body":"The dude will leave the girl pregnant and leave her be\n\nShe is just a mere seggss toy\n\nWhile the cucked boy will pursue his career to be a successfull and get a better girl"},{"id":2181728,"gallery_id":289248,"poster":{"id":2720193,"username":"Steenee","slug":"steenee","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638704645,"body":"Wow. This thing hits hard.\n"},{"id":2180700,"gallery_id":289248,"poster":{"id":4091706,"username":"Đark★Łightツ","slug":"dark-lighttsu","avatar_url":"avatars/4091706.png?_=e4f9f140c4f36fb2","is_superuser":false,"is_staff":false},"post_date":1638660288,"body":"https://www.youtube.com/watch?v=x4ptkKLXxoo&list=PLxBSvq0t-zxxgjsL9BUB_4Bb9re8xRjn9&index=3\nTHE END !!"},{"id":2173512,"gallery_id":289248,"poster":{"id":3855943,"username":"Blahbs77","slug":"blahbs77","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638315133,"body":"Forreal, we need a part two where mc gets onto national team and gets a russian supermodel girlfriend"},{"id":2173482,"gallery_id":289248,"poster":{"id":716476,"username":"Snoiper","slug":"snoiper","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1638312992,"body":"Bro everything happened so fast, too fast to hurt. "},{"id":2156363,"gallery_id":289248,"poster":{"id":4868148,"username":"OrcLover123","slug":"orclover123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637555387,"body":"After scrolling for some good NTR, I just saw this one again. This gave me serious PTSD."},{"id":2150452,"gallery_id":289248,"poster":{"id":4787854,"username":"grafisafsya","slug":"grafisafsya","avatar_url":"avatars/4787854.png?_=42d491dcf1b87f17","is_superuser":false,"is_staff":false},"post_date":1637255197,"body":"What do you expect from a selfish human and high lust, forget him, then continue something that makes you happy, surely your life will be happy."},{"id":2149031,"gallery_id":289248,"poster":{"id":4411072,"username":"GoodFap21","slug":"goodfap21","avatar_url":"avatars/4411072.png?_=822ce1d43ed19d30","is_superuser":false,"is_staff":false},"post_date":1637187256,"body":"Lesson learned if you enter a relationship better invest your time and connect with your partners. The soccer dude deserved it, it was all just bad timing and legit it was just poor connection between the two soccer boy and the girl. They should've been more open with one another. "},{"id":2132789,"gallery_id":289248,"poster":{"id":2462865,"username":"what's a pic","slug":"what-s-a-pic","avatar_url":"avatars/2462865.png?_=a365bb255910a273","is_superuser":false,"is_staff":false},"post_date":1636429686,"body":"I need a part two revenge arc"},{"id":2132706,"gallery_id":289248,"poster":{"id":1122987,"username":"uterus invader","slug":"uterus-invader","avatar_url":"avatars/1122987.png?_=421f46ef21a229d6","is_superuser":false,"is_staff":false},"post_date":1636426899,"body":"Lmao I hate them all. You already listed the reasons why. I hate the girl too, fuck girls trying to act like innocent weak maidens. Can you imagine if the genders were all reversed here LOL"},{"id":2131128,"gallery_id":289248,"poster":{"id":4044890,"username":"117475","slug":"117475","avatar_url":"avatars/4044890.png?_=5349e7eaf321e020","is_superuser":false,"is_staff":false},"post_date":1636351841,"body":"I read this around 2 Years ago when it first came out and I hated both guys. Now I have returned after my judgement has matured and I still hate both guys. The soccer guy is a fucktard the moment he decided to only focus on soccer and not pay much attention to his girlfriend. The other guy was already a fucktard even before the story. He's a manipulative son of a bitch. I can't say I hate the girl but she shouldn've at least tried to resist some more. "},{"id":2124486,"gallery_id":289248,"poster":{"id":4422938,"username":"Chris_downbad","slug":"chris_downbad","avatar_url":"avatars/4422938.png?_=1732115aae005cd1","is_superuser":false,"is_staff":false},"post_date":1636046297,"body":"Perfect so beautiful "},{"id":2124478,"gallery_id":289248,"poster":{"id":4413261,"username":"Kinkybaloma69","slug":"kinkybaloma69","avatar_url":"avatars/4413261.png?_=bf5fb8af8bb5812b","is_superuser":false,"is_staff":false},"post_date":1636045985,"body":"Ahh Japan... And their weird twisted fetishes"},{"id":2111337,"gallery_id":289248,"poster":{"id":3388125,"username":"ReeLon","slug":"reelon","avatar_url":"avatars/3388125.png?_=6399cc6bd4c859b4","is_superuser":false,"is_staff":false},"post_date":1635468209,"body":"id love to see an arc where the dude just leaves her to fuck another woman and she just breaks down in tears, and after that she tries to return back with shou but hes just not interested anymore."},{"id":2108955,"gallery_id":289248,"poster":{"id":1646526,"username":"Sérgio Moro","slug":"sergio-moro","avatar_url":"avatars/1646526.png?_=0092ce4212e3e606","is_superuser":false,"is_staff":false},"post_date":1635359449,"body":"What the fuck"},{"id":2103479,"gallery_id":289248,"poster":{"id":3687286,"username":"hopping123turtleking","slug":"hopping123turtleking","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635131725,"body":"MC is hardworking and honest, if he is able to get over this he will be successful later in life. That fuckboy bastard on the other hand has nothing but his cock and good looks, he wont be anything but a gigolo selling ass. "},{"id":2099265,"gallery_id":289248,"poster":{"id":4339878,"username":"H3ntaiAdd1ct","slug":"h3ntaiadd1ct","avatar_url":"avatars/4339878.png?_=33b011bc7b8ecc00","is_superuser":false,"is_staff":false},"post_date":1634965845,"body":"\"I'm fine now\" has cut deeper than any Hollywood movie has ever cut my poor kokoro. Even my maso ass is hurt and I'm not enjoying it well. 8/10"},{"id":2093443,"gallery_id":289248,"poster":{"id":4597372,"username":"へんタイ か未ー差ま","slug":"hentai-kawei-chai-ma","avatar_url":"avatars/4597372.png?_=5fa0ebd6a4243509","is_superuser":false,"is_staff":false},"post_date":1634725565,"body":"Lol reminds me of school days the ace of our school basket ball team get NTR by a nerd lol its pretty similar in this but the bb ace of ours is just nah full of bullsht and the nerd guy is a true hidden chad abong chad also the nerd chad did 2 timing so thats different story sometime thx for reading my bullsht :)"},{"id":2089242,"gallery_id":289248,"poster":{"id":1593662,"username":"fappyboiii","slug":"fappyboiii","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634530442,"body":"\"at this point , despite what happened before. I'm not sure who is the real sex monster. It is clearly her.\""},{"id":2087103,"gallery_id":289248,"poster":{"id":4694862,"username":"shimizu asahi","slug":"shimizu-asahi","avatar_url":"avatars/4694862.png?_=e20d22d66acfa2a7","is_superuser":false,"is_staff":false},"post_date":1634452756,"body":"idc about that mc hes an idiot, anyways 7/10 will fap again"},{"id":2071253,"gallery_id":289248,"poster":{"id":3196454,"username":"Lucius_236","slug":"lucius_236","avatar_url":"avatars/3196454.png?_=78e6288ba75fbba7","is_superuser":false,"is_staff":false},"post_date":1633805755,"body":"Hope she got aids"},{"id":2071237,"gallery_id":289248,"poster":{"id":3196454,"username":"Lucius_236","slug":"lucius_236","avatar_url":"avatars/3196454.png?_=78e6288ba75fbba7","is_superuser":false,"is_staff":false},"post_date":1633804838,"body":"Dumb bitch"},{"id":2065682,"gallery_id":289248,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1633596275,"body":"ya guy should have noticed her more but girl isnt innocent either. shes for the streets. the other guy will just move onto the next and the girl will end up sleepign with someone random"},{"id":2056137,"gallery_id":289248,"poster":{"id":2898931,"username":"jajangnoel","slug":"jajangnoel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1633218249,"body":"when im in highschool, i'm that guy who has friends from different circles, and i see a lot ntr happens between them, so reading highschool ntr plot just reminding me of them makes me laugh really hard lol. "},{"id":2054468,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1633143541,"body":"Unlike some readers, I don't think she ends her life as a single mother ... as she can easily figure out the truth. That is why I mention the social aspect of the school: because from there you can easily reveal the profile of the fuckboy: his activities, his relationship with others, his grades, etc. The story would be very different if it happened between two strangers who meet in the city (a larger society and where there is no such strict control over people as in school)."},{"id":2054452,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1633142880,"body":"(...) 4) Therefore, two things can happen: the girl apologizes to the MC or is simply left alone as the MC. They both suffer, but I think MC will be able to recover because he has a broader social life. Finally, I agree with you on the ability of womanizers to hide their <nature>, but unfortunately the Fuckboy is still in the school where all his <conquests> coexist. That is why I say in the previous comment that she will discover the truth EARLY."},{"id":2054446,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1633142620,"body":"@leung_GW Well, to answer you I have to clarify a few things about the story. First, the story is unrealistic. I'm not saying it's impossible for the fuckboy to fuck an aching asshole girl like her, but what makes it unrealistic is the logic that <she'll be another of the Fuckboy's bitches> when it is impossible. To begin, 1) the girl will find out EARLY about the Fuckboy lie, since she will look more for the sweet attitude that he had. And Fuckboy won't be able to keep it up for long as all he's looking for is fucking. That is sure. 2) The girl knowing how he is really will feel like the most idiotic person in the world for believing in the lies of the Fuckboy 3) The girl belongs to another social circle, unlike the bitches of the Fuckboy, so she will look for  REFUGE in her social circle (where the MC is). "},{"id":2052017,"gallery_id":289248,"poster":{"id":4659744,"username":"federuizer","slug":"federuizer","avatar_url":"avatars/4659744.png?_=aab59d2d52ff9430","is_superuser":false,"is_staff":false},"post_date":1633026738,"body":"i love this"},{"id":2049899,"gallery_id":289248,"poster":{"id":3914078,"username":"Sleepy Rain","slug":"sleepy-rain","avatar_url":"avatars/3914078.png?_=bf2308811974238e","is_superuser":false,"is_staff":false},"post_date":1632935447,"body":"Suffering from Dumb bitch syndrome "},{"id":2049352,"gallery_id":289248,"poster":{"id":4609651,"username":"leung_GW","slug":"leung_gw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1632915716,"body":"@SchrodingerZ Still, from the looks of it I dont think MC would ever recover. And womanisers usually are great at concealing their true nature. "},{"id":2032616,"gallery_id":289248,"poster":{"id":1756244,"username":"AnonymousNeko69","slug":"anonymousneko69","avatar_url":"avatars/1756244.png","is_superuser":false,"is_staff":false},"post_date":1632269017,"body":"*mgtow monk"},{"id":2032611,"gallery_id":289248,"poster":{"id":1756244,"username":"AnonymousNeko69","slug":"anonymousneko69","avatar_url":"avatars/1756244.png","is_superuser":false,"is_staff":false},"post_date":1632268843,"body":"If this was me I'd get the apathy on the last page motown monk is the only way for\nHim needs to start lifting weights and bulk up start focusing on self improvement and in 10 20 years the fMC is going to be a broke single mom and she'd try monkey branching back to the Mc but he should tell her to get lost betrayed is unforgettable and unhealable"},{"id":2031797,"gallery_id":289248,"poster":{"id":4324959,"username":"Theartofhentai","slug":"theartofhentai","avatar_url":"avatars/4324959.png?_=6641ef04a0b29b3f","is_superuser":false,"is_staff":false},"post_date":1632239399,"body":"Hey at least he'll be more focused on soccer now "},{"id":2026243,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1632038745,"body":"@leung_GW From my experience, people who play sports in the school and, later, in the university are quite popular. They have a good appearance and can access certain academic benefits. Rather, guys who are just womanizers are already singled out by the rest as troublesome."},{"id":2018610,"gallery_id":289248,"poster":{"id":4609651,"username":"leung_GW","slug":"leung_gw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1631730063,"body":"That fuckboy has the looks and the skills...the sad thing is that he would probably not get his comeuppance in real life. He would probably grow up to be a gigolo and live off wealthy women, while our poor mc would work a low-paying job. "},{"id":2017499,"gallery_id":289248,"poster":{"id":4684386,"username":"Hachiman_Tomozaki16","slug":"hachiman_tomozaki16","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1631680691,"body":"needs a part 2 as well\nbut this time it’s a time-skip where fmc is broke af and our boy mc finally followed his dreams of becoming a soccer player\nthey meet and the mc sees the fmc broke af and pregnant \nmc helps her and raises her chidl then they seggs non stop\nremarried \ngood shit ngl the art is good"},{"id":2010724,"gallery_id":289248,"poster":{"id":4651256,"username":"Sousuke45","slug":"sousuke45","avatar_url":"avatars/4651256.png?_=1e56da7d7e33fea3","is_superuser":false,"is_staff":false},"post_date":1631427652,"body":"Here's a tip if u get netorare'd\nStep one : Bring the holy shotgun\nStep two : slide that holyshotgun\nStep three : *bangs* (I mean the shotgun firing)"},{"id":2010676,"gallery_id":289248,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1631425778,"body":"FMC is bitch"},{"id":2004932,"gallery_id":289248,"poster":{"id":4633892,"username":"WhoAmIz","slug":"whoamiz","avatar_url":"avatars/4633892.png?_=467ef3a2f02f0947","is_superuser":false,"is_staff":false},"post_date":1631191530,"body":"Finally found the mc where he's aware of himself. "},{"id":1999136,"gallery_id":289248,"poster":{"id":3657044,"username":"ZGundam64","slug":"zgundam64","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630960849,"body":"He should have recorded the conversation on the roof and showed it to Futaba and the other girl he was talking about. You cannot deny his voice."},{"id":1997653,"gallery_id":289248,"poster":{"id":4516268,"username":"your creepy uncle","slug":"your-creepy-uncle","avatar_url":"avatars/4516268.png?_=06e3985bc789cd71","is_superuser":false,"is_staff":false},"post_date":1630913387,"body":"Anybody wan't to come to my funeral????\nI have lose my hope to that MC!"},{"id":1996074,"gallery_id":289248,"poster":{"id":1016795,"username":"DamnMen","slug":"damnmen","avatar_url":"avatars/1016795.png","is_superuser":false,"is_staff":false},"post_date":1630860185,"body":"Wholesome!"},{"id":1984995,"gallery_id":289248,"poster":{"id":3360089,"username":"listen2pinkertonbyweezer","slug":"listen2pinkertonbyweezer","avatar_url":"avatars/3360089.png?_=79d766403ec98f44","is_superuser":false,"is_staff":false},"post_date":1630394802,"body":"\"Because I was clueless about why you cried\"\nHow the fuck do you hear a girl say \"Mommy\" and start crying after a phone call and not piece that shit together?"},{"id":1982936,"gallery_id":289248,"poster":{"id":3575692,"username":"baeleezy","slug":"baeleezy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630309168,"body":"This one was pretty good! I enjoyed how the ntr happened instead of becoming addicted to him she sought after him because he gave her affection nice change of pace."},{"id":1981773,"gallery_id":289248,"poster":{"id":3832795,"username":"Fuck The NTR","slug":"fuck-the-ntr","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630261929,"body":"People keep complaining it's all the girl fault lol . The girl have no father her mom is sick and she was lonely the boyfriend doesn't care about her and didn't support her as a bf ? See the last panels the bf admitted his fault . \nWell for me the two of them have fault the girl didn't say anything about her problem to the MC but mostly for me it's the MC's fault. Go play your soccer bitches!"},{"id":1981212,"gallery_id":289248,"poster":{"id":2088061,"username":"Big Breast for life","slug":"big-breast-for-life","avatar_url":"avatars/2088061.png?_=45fc6b870677f81b","is_superuser":false,"is_staff":false},"post_date":1630241543,"body":"Ah yes, reading NTR for a change of pace, its so good ngl. Im getting tired of nonstop read of vanilla. You need to change ur cup of tea sometimes. NTR is just perfect. Perfect balance between good and evil. Yin and Yang."},{"id":1976536,"gallery_id":289248,"poster":{"id":3141587,"username":"Atreus, The Pantheon","slug":"atreus-the-pantheon","avatar_url":"avatars/3141587.png?_=fc06f0944e9b251f","is_superuser":false,"is_staff":false},"post_date":1630060642,"body":"You know.... This Women here..ALL OF THEM...Let me tell you That ORGASM!! ISNT TRUE LOVE! ALL WHAT A BOY WANT IS F*CK YOU ALL UP! But a Man... A TRUE MAN... Will Fuck you BY HEART and LOYALTY! AND WHAT IT NEEDS TO THEM IS DOMINATION OVER THERE F*CKING MIND!"},{"id":1976213,"gallery_id":289248,"poster":{"id":4525288,"username":"serenash","slug":"serenash","avatar_url":"avatars/4525288.png?_=1a937f9b0655e436","is_superuser":false,"is_staff":false},"post_date":1630049236,"body":"Fuck that's why i don't trust anybody because of NTR i really hate you i wish that was happen to you "},{"id":1976174,"gallery_id":289248,"poster":{"id":4424126,"username":"キズネkizuneシロズネ","slug":"kizunekizuneshirozune","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1630048204,"body":"Stupid MC = GOT NTR'ed\nWeak assholes just give up to her already and fuck someone cant you see shes a bitch lmao"},{"id":1973860,"gallery_id":289248,"poster":{"id":1378861,"username":"yoleorosa","slug":"yoleorosa","avatar_url":"avatars/1378861.png","is_superuser":false,"is_staff":false},"post_date":1629956726,"body":"\"Invading her boundaries\" my ass. What if she's having suicidal thoughts? You didn't help her, she offs herself and you're gonna be like \"Well, at least I respected her boundaries\"???\nUseless clown"},{"id":1969791,"gallery_id":289248,"poster":{"id":2563413,"username":"hahaminato","slug":"hahaminato","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629807636,"body":"I really love the works of this author, very good ntr, though realistically it probably wont happen."},{"id":1967968,"gallery_id":289248,"poster":{"id":2573915,"username":"kennyu04","slug":"kennyu04","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1629743085,"body":"Ntr lovers are certainly ugly fat losers in real life... No need denying it."},{"id":1958772,"gallery_id":289248,"poster":{"id":4611358,"username":"1oeodo","slug":"1oeodo","avatar_url":"avatars/4611358.png?_=365dbedf4154f132","is_superuser":false,"is_staff":false},"post_date":1629423477,"body":"Man these make me feel hollow"},{"id":1948146,"gallery_id":289248,"poster":{"id":1905821,"username":"iLoveLoli3283","slug":"iloveloli3283","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629058334,"body":"Uhhh how is this the dude’s fault in any capacity? If you’ve ever been in a relationship you need to tread a careful like between asking if there’s anything wrong and pestering her and invading her boundaries. Guys are not mind-readers. We can’t tell what our partners are thinking. He asked her if anything was wrong and she said no. Admittedly he could’ve followed TPO; school was probably not the best tpo to inquire about serious issues but it’s still on her being a cheating hoe and not communicating. And the dude is a fuckboy so now she has no one to turn to after he gets bored of her lol."},{"id":1938583,"gallery_id":289248,"poster":{"id":3432371,"username":"Some random weeb","slug":"some-random-weeb","avatar_url":"avatars/3432371.png?_=542a5887a02f6470","is_superuser":false,"is_staff":false},"post_date":1628713307,"body":"In this case is completely the MC fault, even a man womanizer taked care better than him, he gato what he deserved, so pay attention to ur girl man"},{"id":1937672,"gallery_id":289248,"poster":{"id":2053379,"username":"unsinhei","slug":"unsinhei","avatar_url":"avatars/2053379.png?_=ef93101d74bb071d","is_superuser":false,"is_staff":false},"post_date":1628671110,"body":"this shit is fucking good"},{"id":1935238,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1628571961,"body":"@magic caco Yes, but we will rarely see the lesson for the bitch in an NTR doujin. In these stories, if she's with the Fuckboy, she's happy. LOL"},{"id":1932983,"gallery_id":289248,"poster":{"id":1772939,"username":"magi caco","slug":"magi-caco","avatar_url":"avatars/1772939.png?_=4e824a12d6c4696d","is_superuser":false,"is_staff":false},"post_date":1628482769,"body":"If you really dissect the antagonist, he only wants to smash her. So in the end, that relationship is going to be very toxic and she will regret her decision every second when it falls apart. While MC keeps honing his skills in soccer and focuses on his future. She will be hate her life while she stares at MC wishing she stayed with him."},{"id":1932248,"gallery_id":289248,"poster":{"id":3436005,"username":"quanbe","slug":"quanbe","avatar_url":"avatars/3436005.png?_=63b5f4b7ed24d5e2","is_superuser":false,"is_staff":false},"post_date":1628458465,"body":"lmao that's so fucking stupid the bf even asked her if she has some kind of problems after the phone call ....... that's bitch was doomed from the start to end up to the street "},{"id":1932144,"gallery_id":289248,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1628455403,"body":"Well, the story is stupid. Especially since the author mixes emotional comfort with sexual satisfaction. If the story had some logic: after having unfaithful sex (something exaggerated since she does not need sex but affection), she would look for emotional affection again but she would not obtain it since the Fuckboy is only interested in fucking with her. Then the lie would come out. Therefore, the girl would not end the MC (if he does not find out). On the contrary, she would continue with him, but regretting how stupid she was."},{"id":1929805,"gallery_id":289248,"poster":{"id":4536105,"username":"Doiv","slug":"doiv","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628364147,"body":"Spain without the S....."},{"id":1923961,"gallery_id":289248,"poster":{"id":3716431,"username":"flyingballsack","slug":"flyingballsack","avatar_url":"avatars/3716431.png?_=1c4ad934a166cab4","is_superuser":false,"is_staff":false},"post_date":1628167231,"body":"He should work his ass of for his career and use his money and fame to torture those demons especially that whore"},{"id":1918205,"gallery_id":289248,"poster":{"id":2191890,"username":"heteronimo","slug":"heteronimo","avatar_url":"avatars/2191890.png?_=0fd5264ddb4d666f","is_superuser":false,"is_staff":false},"post_date":1627970844,"body":"Good fap. I was enduring all the chapter until the deepthroat near the end, I just had to cum with that scene "},{"id":1913765,"gallery_id":289248,"poster":{"id":2721257,"username":"SoyBean","slug":"soybean","avatar_url":"avatars/2721257.png","is_superuser":false,"is_staff":false},"post_date":1627830006,"body":"One's a dumbass, the other's a shitbag. Poor girl deserves better like ffs her mother just got into a car accident. "},{"id":1906071,"gallery_id":289248,"poster":{"id":3073594,"username":"iamhero_303","slug":"iamhero_303","avatar_url":"avatars/3073594.png?_=5c4d9acfd4900950","is_superuser":false,"is_staff":false},"post_date":1627549017,"body":"Bruh this characters are dumb asf"},{"id":1903361,"gallery_id":289248,"poster":{"id":3268918,"username":"TheUser","slug":"theuser","avatar_url":"avatars/3268918.png?_=942e733b2b02265a","is_superuser":false,"is_staff":false},"post_date":1627439980,"body":"Remember kids, a dick to cry on, becomes a shoulder to ride on... Or something like that"},{"id":1899466,"gallery_id":289248,"poster":{"id":125017,"username":"banoiimmunes","slug":"banoiimmunes","avatar_url":"avatars/125017.png?_=7a1b35681562828c","is_superuser":false,"is_staff":false},"post_date":1627300827,"body":"This comment section enlightened me. The story wanted us to believe that it's the mc's fault for not knowing what she truly felt. Yes, he could do better but the girl did worse, regardless of her reason. So I'd say it was a good lesson for the mc. He just needs to focus on his goal and move on, just like what she did. Btw I'm not bashing on ntr with this comment. I'm a literature student and believe it or not, I rarely fapped while I'm on this site, and instead, I focus more on the story because some of them are interesting, ntr or not. And I always try to read the comments to see what the people think. You can learn a thing or two from them.\nOh yeah, if there is a continuation of this story, I hope the mc didn't go back to her if given the chance."},{"id":1898267,"gallery_id":289248,"poster":{"id":4429756,"username":"Fucked up day","slug":"fucked-up-day","avatar_url":"avatars/4429756.png?_=b3ab6542867b2b3b","is_superuser":false,"is_staff":false},"post_date":1627267170,"body":"It's always vanilla lover that destroy the comment, you know what I mean? It's because vanilla lover can't handle something like this they gonna stare at nothingness for an minute or even an hour but netorare lover is just different they can handle ntr and vanilla at the same time. Vanilla lover is so fucking loser, weak,wimp and small pp that they might have a heart attack if they read something like 312961 or that doujinshi that I'm reading rn. "},{"id":1893010,"gallery_id":289248,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1627084158,"body":"Would've been nice to have an epilogue where he comes across her after Takizawa threw her to the curb."},{"id":1892967,"gallery_id":289248,"poster":{"id":3470196,"username":"ninjashota","slug":"ninjashota","avatar_url":"avatars/3470196.png?_=4e467d0619ddc47a","is_superuser":false,"is_staff":false},"post_date":1627081930,"body":"Time to murder and rape the bodies. Or even better amputate their limbs and rape them."},{"id":1889306,"gallery_id":289248,"poster":{"id":2731365,"username":"26low","slug":"26low","avatar_url":"avatars/2731365.png?_=2afdee384bcc80ea","is_superuser":false,"is_staff":false},"post_date":1626946793,"body":"Ah You love to come back here every now and then"},{"id":1884956,"gallery_id":289248,"poster":{"id":4294347,"username":"HEN_400_HEN","slug":"hen_400_hen","avatar_url":"avatars/4294347.png?_=b7eeb03d7f76f01d","is_superuser":false,"is_staff":false},"post_date":1626753535,"body":"Bruh some of us can't handle it a safety blanket tbh "},{"id":1883007,"gallery_id":289248,"poster":{"id":1520013,"username":"Mephal","slug":"mephal","avatar_url":"avatars/1520013.png?_=e54c9ecc9ef94466","is_superuser":false,"is_staff":false},"post_date":1626680201,"body":"You know we all seen watched and readed a line like \"Men are wolf\" and it's true but while a majority like to howl in the moon, being rash and rape left and right, some a lil' itsy bitsy group like to think real hard how to make a prey come by itself, how to steal another prey from your bruv and how to cook. These wolf are terrifying"},{"id":1882491,"gallery_id":289248,"poster":{"id":4294347,"username":"HEN_400_HEN","slug":"hen_400_hen","avatar_url":"avatars/4294347.png?_=b7eeb03d7f76f01d","is_superuser":false,"is_staff":false},"post_date":1626663550,"body":"This is a total turn of bruh I didn't even get hard and that saying something I get hard to everything but I gotta remember that it's just a drawing and people don't actually lose themselves in highschool over one bitch guys take my advice and just a imagine a scenario where bro finds a quit girl who loves him motivates him and he succeeds in soccer make the national then they get married have a wonderful not ntr relationship. While the girl realizes what she miss out on after she watches him score the world cup finals game winning goal with her child that she has to support by herself while the boyfriend other guy died of aids"},{"id":1877869,"gallery_id":289248,"poster":{"id":66370,"username":"Nightwalker403","slug":"nightwalker403","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1626494097,"body":"I gotta say that girl is for the streets, she gave up on her boyfriend so quickly for a guy she knew for 2 days like seriously lol"},{"id":1876706,"gallery_id":289248,"poster":{"id":3841027,"username":"retar_dedkid","slug":"retar_dedkid","avatar_url":"avatars/3841027.png?_=c659290dd95990b9","is_superuser":false,"is_staff":false},"post_date":1626455880,"body":"The first ever Doujin that made me, an NTR lover Tremble with Fear and Anguish."},{"id":1869718,"gallery_id":289248,"poster":{"id":3959561,"username":"no longer human","slug":"no-longer-human","avatar_url":"avatars/3959561.png?_=aa0771374e2799af","is_superuser":false,"is_staff":false},"post_date":1626200375,"body":"Ah yes the despair on he's eyes "},{"id":1869710,"gallery_id":289248,"poster":{"id":3646061,"username":"That Other Guy","slug":"that-other-guy","avatar_url":"avatars/3646061.png?_=71f5b722bee23108","is_superuser":false,"is_staff":false},"post_date":1626200018,"body":"this was my first Doujin, and my first doujin to cry on and the first Hentai to give me Trauma. Now i have cameback and re-read this and go in depht in this manga. Bro the gf is a Slut big time, mc just want to focus on his career like the goodboy he is fucking other dude. . . He fucked but no hate Its the Fucking Girl why shit gone down hill"},{"id":1860456,"gallery_id":289248,"poster":{"id":3059885,"username":"fapboy123","slug":"fapboy123","avatar_url":"avatars/3059885.png","is_superuser":false,"is_staff":false},"post_date":1625814596,"body":"10/10 Masterpiece! Hands down the best plot I saw for NTR.  "},{"id":1854932,"gallery_id":289248,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1625564924,"body":"Chad Cucker gets GF through actual effort coz MC gets reckless by focusing on club activities"},{"id":1848639,"gallery_id":289248,"poster":{"id":4413261,"username":"Kinkybaloma69","slug":"kinkybaloma69","avatar_url":"avatars/4413261.png?_=bf5fb8af8bb5812b","is_superuser":false,"is_staff":false},"post_date":1625321237,"body":"Damn, first time crying on a doujin, this ntr hits different when your getting careless with your gf and somone might steal her from you. "},{"id":1844158,"gallery_id":289248,"poster":{"id":4329242,"username":"Eroiochi","slug":"eroiochi","avatar_url":"avatars/4329242.png?_=7378cae66d1b4f8a","is_superuser":false,"is_staff":false},"post_date":1625147008,"body":"This manga motivated me to not get a gf for some reason"},{"id":1842568,"gallery_id":289248,"poster":{"id":3907771,"username":"HornyBagel","slug":"hornybagel","avatar_url":"avatars/3907771.png?_=a5fe328161c047b8","is_superuser":false,"is_staff":false},"post_date":1625075071,"body":"This hurts man"},{"id":1841336,"gallery_id":289248,"poster":{"id":3874188,"username":"ILove_Makima","slug":"ilove_makima","avatar_url":"avatars/3874188.png?_=a736f08f6480d357","is_superuser":false,"is_staff":false},"post_date":1625024906,"body":"Wish a hero can make a time skip where he gets fame and shit bruh at least living successfully while their broke ass work 24/7 and still get no bands bruh"},{"id":1838691,"gallery_id":289248,"poster":{"id":4356039,"username":"MuXuanYin","slug":"muxuanyin","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1624918682,"body":"Come on brothers why the hate to Mc when he wants to focus on his career as a soccer player that could grant him fame and fortune? Besides he asked for a month to focus he didn’t asked her for 100 years man, besides if that’s the extent of the girls love and brain she isn’t even worth the pain when once the Mc succeed he will have whatever he wants women included and much better women than a petty first love which she will end in the streets as single mother mostly because the dude just wanted to fuck her and steal it from Mc and he already did it and we can see that the guy it’s already getting bored of her since she is already a cock slave."},{"id":1837389,"gallery_id":289248,"poster":{"id":2165628,"username":"Roshan_","slug":"roshan_","avatar_url":"avatars/2165628.png?_=c0577f81aa467169","is_superuser":false,"is_staff":false},"post_date":1624866355,"body":"one of the most stupid cuck, d isn't excited of how dumb is her bf..."},{"id":1830299,"gallery_id":289248,"poster":{"id":2978150,"username":"Vasto Lord","slug":"vasto-lord","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1624590647,"body":"what a stupid mother facker\n"},{"id":1829822,"gallery_id":289248,"poster":{"id":3022405,"username":"IamSofaKingWeToddEd","slug":"iamsofakingwetodded","avatar_url":"avatars/3022405.png?_=d97a6977c3df5e77","is_superuser":false,"is_staff":false},"post_date":1624569760,"body":"I feel my heart being suffacted by this one. "},{"id":1826496,"gallery_id":289248,"poster":{"id":4257824,"username":"Surpass your limits La","slug":"surpass-your-limits-la","avatar_url":"avatars/4257824.png?_=76a4227e0f860c60","is_superuser":false,"is_staff":false},"post_date":1624453296,"body":"Just let me rest for a very long time"},{"id":1819689,"gallery_id":289248,"poster":{"id":2132316,"username":"Eagle_Soldier","slug":"eagle_soldier","avatar_url":"avatars/2132316.png?_=ccd021c4fd095be2","is_superuser":false,"is_staff":false},"post_date":1624208946,"body":"no, just no"},{"id":1819667,"gallery_id":289248,"poster":{"id":3733463,"username":"deepfryer","slug":"deepfryer","avatar_url":"avatars/3733463.png?_=b77fbae2d9fff4bb","is_superuser":false,"is_staff":false},"post_date":1624208478,"body":"nah fuck that cheating ass hoe, go get yo money up boy "},{"id":1815755,"gallery_id":289248,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1624060615,"body":"i hate this to the very core! but that's wt every dense mc should get! -_- just hate em!"},{"id":1807559,"gallery_id":289248,"poster":{"id":4305227,"username":"Yoshikage kira","slug":"yoshikage-kira","avatar_url":"avatars/4305227.png?_=f26a3a6355310d05","is_superuser":false,"is_staff":false},"post_date":1623722623,"body":"Lol lol people at comment expecting the boyfriend to be mentalist, mature or mind reader, if he's mature in his teenage he's gonna have some really mental problem cuz being mature in early teenage is unhealthy + he got dumped + he heard the asshole steal his girlfriend + he witness her ex getting by other dude, i'm surprise he didn't kill himself or both of them, in the end the boy really lost people didn't understand that, they probably didn't know mental problem exist that's why they expecting the boyfriend to move on fast and focus on soccer and that's why i'm defending the dude cuz he didn't deserve that, i'm gonna share my story i'm still teenager i only got rejected once in my life (prolly never gonna happen again you will know what will happen) cuz i simp to a girl for 6 years but still get rejected + quarantine + reading some NTR/drama = lose interest in love i prolly become aromatic person that's my example lol."},{"id":1807518,"gallery_id":289248,"poster":{"id":4305227,"username":"Yoshikage kira","slug":"yoshikage-kira","avatar_url":"avatars/4305227.png?_=f26a3a6355310d05","is_superuser":false,"is_staff":false},"post_date":1623720653,"body":"Lol people at comment section defending a thot, she doesn't even know how to talk with her boyfriend but talk with some other guy that sign of being thot, and Shou can focus now in soccer ?dude he probably have mental problem now and prolly can't trust every one in the future."},{"id":1807496,"gallery_id":289248,"poster":{"id":4305227,"username":"Yoshikage kira","slug":"yoshikage-kira","avatar_url":"avatars/4305227.png?_=f26a3a6355310d05","is_superuser":false,"is_staff":false},"post_date":1623719909,"body":"Dude, you're ok dude if i were a woman i will fall in love with you, not to asshole cuz i know asshole move by reading NTR and i'm glad that you didn't show your self that you saw them because they're just gonna humiliate you, and your girlfriend is a thot not even worth of fucking, and i think she's never gonna find a guy like you because she's now a thot asshole love thot, and yeah I agree to comment be a thot slayer kill all cucks and thot!"},{"id":1806521,"gallery_id":289248,"poster":{"id":1326768,"username":"Eliot201","slug":"eliot201","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623678103,"body":"Damn dat was good "},{"id":1805784,"gallery_id":289248,"poster":{"id":4356636,"username":"KewlBuoy69","slug":"kewlbuoy69","avatar_url":"avatars/4356636.png?_=a2701c5ba0f7d28b","is_superuser":false,"is_staff":false},"post_date":1623648038,"body":"Murder them"},{"id":1804974,"gallery_id":289248,"poster":{"id":4073836,"username":"ShaineYD","slug":"shaineyd","avatar_url":"avatars/4073836.png?_=398e5c89c793d050","is_superuser":false,"is_staff":false},"post_date":1623616520,"body":"I really love art style but the plot makes me soo weak that my boner died out after reading something gold and awesome sex scene damn"},{"id":1798940,"gallery_id":289248,"poster":{"id":4420382,"username":"Hoshimiya Hitsuri","slug":"hoshimiya-hitsuri","avatar_url":"avatars/4420382.png?_=e26a856eb9710617","is_superuser":false,"is_staff":false},"post_date":1623360103,"body":"I like Ntr and the art is good but bro. I can't even fap because of the plot :v"},{"id":1795328,"gallery_id":289248,"poster":{"id":1262388,"username":"RayZn","slug":"rayzn","avatar_url":"avatars/1262388.png?_=caf44ab5a4c67299","is_superuser":false,"is_staff":false},"post_date":1623219329,"body":"Her bf was dense af"},{"id":1790523,"gallery_id":289248,"poster":{"id":2941719,"username":"deletusfeetus45","slug":"deletusfeetus45","avatar_url":"avatars/2941719.png","is_superuser":false,"is_staff":false},"post_date":1623077479,"body":"like even if you like ntr its hard to swallow jesus"},{"id":1788958,"gallery_id":289248,"poster":{"id":3354234,"username":"NNnewFag","slug":"nnnewfag","avatar_url":"avatars/3354234.png?_=fe0e9c0644d8b918","is_superuser":false,"is_staff":false},"post_date":1623030302,"body":"Woman need to learn their place in this world at this point them acting out and acting like they should be the center of their boyfriends attention is retarded and that also makes them easier to manipulate. Fuck ntr. "},{"id":1788940,"gallery_id":289248,"poster":{"id":3354234,"username":"NNnewFag","slug":"nnnewfag","avatar_url":"avatars/3354234.png?_=fe0e9c0644d8b918","is_superuser":false,"is_staff":false},"post_date":1623029747,"body":"This is on another level of fucked the fact he doesn't give a shit about her other than sex while shes going through a genuinely hard time is fucked imagine this scenario in real life and call it fappable just a straight boner killer my god just insane amount of manipulation just disapointing "},{"id":1784725,"gallery_id":289248,"poster":{"id":4340589,"username":"EndinGuy","slug":"endinguy","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1622884229,"body":"@...I got a Boner dumbass"},{"id":1783492,"gallery_id":289248,"poster":{"id":3747832,"username":"UnknownGhoul","slug":"unknownghoul","avatar_url":"avatars/3747832.png?_=3fe6bf7f9262d305","is_superuser":false,"is_staff":false},"post_date":1622850629,"body":"Don't blame yourself king blame that dumb thot ass bitch and learn from this DTB 🙏"},{"id":1775043,"gallery_id":289248,"poster":{"id":402451,"username":"gamelord","slug":"gamelord","avatar_url":"avatars/402451.png","is_superuser":false,"is_staff":false},"post_date":1622519008,"body":"absuletly dick killer."},{"id":1773073,"gallery_id":289248,"poster":{"id":4250926,"username":"ulquiorraStare","slug":"ulquiorrastare","avatar_url":"avatars/4250926.png?_=cb8fe42be69e04f7","is_superuser":false,"is_staff":false},"post_date":1622412904,"body":"dumb bitch smh"},{"id":1770729,"gallery_id":289248,"poster":{"id":3411341,"username":"ny_merky","slug":"ny_merky","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622307138,"body":"I didn't even read, just scroll through and it killed my boner lol... "},{"id":1770431,"gallery_id":289248,"poster":{"id":1930749,"username":"G4rry","slug":"g4rry","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622294972,"body":"Emotional manipulation for the win!"},{"id":1767492,"gallery_id":289248,"poster":{"id":3546255,"username":"queefbender","slug":"queefbender","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1622160041,"body":"What a stupid bitch bro"},{"id":1761286,"gallery_id":289248,"poster":{"id":1646600,"username":"Syrion","slug":"syrion","avatar_url":"avatars/1646600.png?_=3347dd19cd2bf769","is_superuser":false,"is_staff":false},"post_date":1621901170,"body":"I back @orange18"},{"id":1755091,"gallery_id":289248,"poster":{"id":3387811,"username":"orange18","slug":"orange18","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621657759,"body":"Be a man and start commit murder"},{"id":1746862,"gallery_id":289248,"poster":{"id":944109,"username":"...I got a Boner","slug":"i-got-a-boner","avatar_url":"avatars/944109.png","is_superuser":false,"is_staff":false},"post_date":1621322434,"body":"Sure the dude is a playboy and douchebag, but he has invested in getting to know her and help her when she's down. That's a lot better than some asshole out there, even if he broke up with her later(no way, he love dat pussy) she have become stronger and can pull through the heartbreak. "},{"id":1745821,"gallery_id":289248,"poster":{"id":3710302,"username":"deathmonster105143","slug":"deathmonster105143","avatar_url":"avatars/3710302.png?_=edd833112f793fc7","is_superuser":false,"is_staff":false},"post_date":1621278534,"body":"Guys is there pt 2 of this"},{"id":1744673,"gallery_id":289248,"poster":{"id":3464496,"username":"Thicc thigh","slug":"thicc-thigh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621236967,"body":"Welp now shou would have time to focus on soccer make it to nationals or whatever match in there, find a better woman when hes successful and fucking move on to hos ex, i dont want to point fingers because both of them have made mistakes"},{"id":1743960,"gallery_id":289248,"poster":{"id":3392233,"username":"Athetos-Kun","slug":"athetos-kun","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621217090,"body":"wow this made me hate myself even more and ntr"},{"id":1738198,"gallery_id":289248,"poster":{"id":3679453,"username":"padaczkalkoholowa","slug":"padaczkalkoholowa","avatar_url":"avatars/3679453.png?_=46c80866aa0cbae0","is_superuser":false,"is_staff":false},"post_date":1621035078,"body":"It's good, even as ntr it have good story"},{"id":1736581,"gallery_id":289248,"poster":{"id":4239557,"username":"nevermind12","slug":"nevermind12","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620962226,"body":"stupid shou, act like his gonna do training 24 hours per day lmao. "},{"id":1728170,"gallery_id":289248,"poster":{"id":3022021,"username":"JoJoSwagger","slug":"jojoswagger","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620606186,"body":"Maybe I didn't love you quite as often as I could have"},{"id":1714998,"gallery_id":289248,"poster":{"id":2879900,"username":"coolboxess","slug":"coolboxess","avatar_url":"avatars/2879900.png?_=e8ebf3ed4b598722","is_superuser":false,"is_staff":false},"post_date":1620063550,"body":"God tier ntr fair and square no rape bullshit"},{"id":1697914,"gallery_id":289248,"poster":{"id":3872764,"username":"rasscal.09","slug":"rasscal-09","avatar_url":"avatars/3872764.png?_=be4d67a65f1f40ef","is_superuser":false,"is_staff":false},"post_date":1619325062,"body":"@Camikazefreakyboi the first half of that is actually an amazing idea. it would turn that \"if you aren't there for your loved one, someone's gonna take your place\" message right back towards Futaba"},{"id":1681323,"gallery_id":289248,"poster":{"id":3386460,"username":"FckThsMHrn","slug":"fckthsmhrn","avatar_url":"avatars/3386460.png?_=356b481eb5919783","is_superuser":false,"is_staff":false},"post_date":1618551648,"body":"That art 9.69/10 fappable. That girl, I don't know what to say but it's Shou win because he can focus on soccer then he can find woman who have better communication and ignore the ex hoes that can ruin his life in the future."},{"id":1679853,"gallery_id":289248,"poster":{"id":2380641,"username":"TnTxxx","slug":"tntxxx","avatar_url":"avatars/2380641.png","is_superuser":false,"is_staff":false},"post_date":1618474935,"body":"Okay, this one kinda made me feel like shit"},{"id":1675723,"gallery_id":289248,"poster":{"id":3394278,"username":"S1rFr0sty","slug":"s1rfr0sty","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1618268237,"body":"Damn a NTR that, just as other NTRs, is shit "},{"id":1673682,"gallery_id":289248,"poster":{"id":2587213,"username":"killmenow1","slug":"killmenow1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1618177007,"body":"Dont get why people are ripping on the dude. Literally an average teenager. Plus the hoe has zero communication skills. Goes and fucks around instead of saying something."},{"id":1671408,"gallery_id":289248,"poster":{"id":3722036,"username":"nhwith","slug":"nhwith","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1618065092,"body":"For all guys thinking this is normal, it is not. If girl doesn't get attention she could easily go tell bf that she doesn't love him anymore, she may be seeing another guy, beforehand. That is what honest girl would do."},{"id":1656397,"gallery_id":289248,"poster":{"id":2328191,"username":"TamTam_it","slug":"tamtam_it","avatar_url":"avatars/2328191.png","is_superuser":false,"is_staff":false},"post_date":1617395450,"body":"I don't know why there is so much salt in the comments, I don0t really like NTR in this case the cuck really deserved it, I understand that your girlfriend shouldn't be your top priority and that your world shouldn't spin arround her but when you can't even spare a second of your time to check up on her to the point where you ask for a temporal break up just to train a bit more and you are so oblivious to your gf feels that even a careless playboy noticed easily then it's no wonder the chick asked for the breal up to be permanent. All this guys saying shit like \"she's gonna regret this\" or \"she just love the love of her life just to get fucked\" are projecting like crazy, the \"MC\" was a dumb, shitty boyfreind through an through and the girl lost nothing of value when she ended things with him even if the playboy dumps her later, at least he got the message at the end, he isn't sad that he lost her, he's just mad he couldn't smash."},{"id":1649854,"gallery_id":289248,"poster":{"id":2883805,"username":"F̶̠͕͗̒͊l̶͈̊̌͠e̴͕̎̀â̶ͅͅk̶͍̱̽̌̂","slug":"f-l-e-a-k","avatar_url":"avatars/2883805.png?_=655cdbb47800fc4d","is_superuser":false,"is_staff":false},"post_date":1617102790,"body":"Yo what??? This is dumb af. "},{"id":1649081,"gallery_id":289248,"poster":{"id":3812036,"username":"Xxeed","slug":"xxeed","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617075280,"body":"I mean wtf guy ask him if theres anything wrong she said no her moms in the hospital then she fucks with some other guy\n\nFucking slut\nMc king"},{"id":1646444,"gallery_id":289248,"poster":{"id":2879900,"username":"coolboxess","slug":"coolboxess","avatar_url":"avatars/2879900.png?_=e8ebf3ed4b598722","is_superuser":false,"is_staff":false},"post_date":1616974333,"body":"Well this indeed a great ntr but still all ntr is trash"},{"id":1634320,"gallery_id":289248,"poster":{"id":3724131,"username":"academic boy here","slug":"academic-boy-here","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1616451202,"body":"Bruh yo ass dumb for not caring about your girl, this why you give your girl all your attention"},{"id":1633448,"gallery_id":289248,"poster":{"id":1301492,"username":"Trashboat","slug":"trashboat","avatar_url":"avatars/1301492.png","is_superuser":false,"is_staff":false},"post_date":1616412116,"body":"Giving my gf all my attention tomorrow and staying out of the ntr tag"},{"id":1631813,"gallery_id":289248,"poster":{"id":3872764,"username":"rasscal.09","slug":"rasscal-09","avatar_url":"avatars/3872764.png?_=be4d67a65f1f40ef","is_superuser":false,"is_staff":false},"post_date":1616337657,"body":"a lot of ppl are saying that he could pursue his dream now. but he probably can't even play, at least for a while. this shit was probably traumatic as fuck for him, and a poor mentality can affect how you play"},{"id":1626008,"gallery_id":289248,"poster":{"id":3219074,"username":"Shheerrlleeffff","slug":"shheerrlleeffff","avatar_url":"avatars/3219074.png?_=1d83770ebed37079","is_superuser":false,"is_staff":false},"post_date":1616084658,"body":"This muscle boy right here is so fuckin ugly brah haahhahahahahahahaahha how did he get this girl hahahahahahahaha damn ntr really is fucking funny haahahahahaha"},{"id":1617340,"gallery_id":289248,"poster":{"id":708813,"username":"ardipahlawan88","slug":"ardipahlawan88","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1615693846,"body":"ntr cliche\n\nwhen with the mc always in complicated situation\nwhen with the antago always accept everything irrationally\n"},{"id":1615690,"gallery_id":289248,"poster":{"id":891102,"username":"Khanquistador","slug":"khanquistador","avatar_url":"avatars/891102.png?_=75e0528a559f864c","is_superuser":false,"is_staff":false},"post_date":1615612536,"body":"Trash girls like these will realize the value of boys like MC when the fuckboys they had chosen will end up cheating on them and treating them like crap later on. "},{"id":1606989,"gallery_id":289248,"poster":{"id":1814594,"username":"CutThroatTheActivist","slug":"cutthroattheactivist","avatar_url":"avatars/1814594.png?_=ad583f41daa45e88","is_superuser":false,"is_staff":false},"post_date":1615249229,"body":"Bro, I literally can't read it. Because when i was away working my ass off to get bright future for me so i can see my girl, she literally ditched me over some other guy who could lay all attention to her. It just painful to read that shit, the entire situation makes me put into guys shoes..."},{"id":1602716,"gallery_id":289248,"poster":{"id":3859622,"username":"God of war kratos","slug":"god-of-war-kratos","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615075101,"body":"He did push her away and another boy give her the attention she wanted thats what women want just attention its like you can't focus on your future it has to be her no matter what "},{"id":1596674,"gallery_id":289248,"poster":{"id":758099,"username":"Anzu101","slug":"anzu101","avatar_url":"avatars/758099.png?_=43c275e6841d87ab","is_superuser":false,"is_staff":false},"post_date":1614787931,"body":"That's a win for my boy Shou. He can devoted himself to soccer, go pro and be successful. That hoe can go fuck herself."},{"id":1591105,"gallery_id":289248,"poster":{"id":3140270,"username":"Pencari Bacol","slug":"pencari-bacol","avatar_url":"avatars/3140270.png?_=c1bafec70fdd500f","is_superuser":false,"is_staff":false},"post_date":1614511965,"body":"Woaahhh that was epic, never in my life so excited about netorare, for some reason it doesn't feel pain at all, that kinda wierd cause whenever i read something like this my heart kinda feel pain"},{"id":1587607,"gallery_id":289248,"poster":{"id":1657228,"username":"SirBlankface","slug":"sirblankface","avatar_url":"avatars/1657228.png?_=d83916c403748682","is_superuser":false,"is_staff":false},"post_date":1614338083,"body":"You see, this DOESN'T (capitalized because of glitch text) feel too bad. For one, she broke up with him so it isn't exactly cheating and he sort of pushed her AWAY with being too caught up in his dream. I take this more as a cautionary tale than another NTR that stole your spouse by fucking them silly WITH AN insanely huge dick. If you aren't attentive to your girl, some other guy, whether a douche fuck boi or not, will come along and steal her away FROM you. This is something that realistically and understandably happens which could have been avoided."},{"id":1579005,"gallery_id":289248,"poster":{"id":1313042,"username":"pixograme","slug":"pixograme","avatar_url":"avatars/1313042.png?_=6f8ba4fd1c54aa64","is_superuser":false,"is_staff":false},"post_date":1613940845,"body":"well , this is not 100% ntr since she already broke up with him and he didn't care to much about her"},{"id":1576824,"gallery_id":289248,"poster":{"id":2254639,"username":"Desolator","slug":"desolator","avatar_url":"avatars/2254639.png","is_superuser":false,"is_staff":false},"post_date":1613838671,"body":"Keikaku doori !! Ẽ̴̡̧̢̡̡̡̡̨̢̡̡̡̨̢̢̨̡̡̢̢̡̧̨̨̨̨̛̛̛̛̛̛̛̛̛̩̭̬̩͖̱̺͙̱̹̙̙͙͎̙̮̯͎̯͍̱͍̮̟̝̻̼̘̲̦̱̞̜̗̜̱̫̣̱͎̘̥̥̠̝̜͚͓̖̗̯̫̥͉̥͍̠͔͔̩̩̳̞͚̪̩̘̘̙͍̙͚̻̥̯̜̩̱̤̞͈̦͇͚͓̘͉͙͕̯͎͙͇̩̗̞̱͙̜̟̣̳̭͉͎̣͔̳̜͇̪̳̜̣̮̬͎̹̠̱̤̖̲̭̦̼̰̼̻͚̜̻̯̹͎̲̦̱̲͓̼̥̘̺̪̻͎̭̬̯̱̝͔̦̜͖͖̣̯̲̯̣̘̣̭̝͕͔͈̺̥̰͇̤͍̺̮͙̘͇̯̘͇̭̩͙̤̅͑̀̊̌̈͊̍̀͑̃̇͐̂͊͐̎͒̎̋̈́̈́͋̾͊̋͆̿̽̈́̅͋̂́̿̅͌̈́̈́̀̂͂͗̆͗͌̎̿̇̓͆̉̇͋̉̓̌̊̑̅̃̾̀̊̈́̀̑̅͗̌̈́̿͐̑̐͆͑͑̈̈́̀͆̈́̀̅̾̔̇̈́́̋̀̌̅͊̔̎͆̈́̓͂̆̽̂̓̾̓́̌́̉͌̿̂̈͛͂̄̍̃͒͑͋̈́̑̑͗̅̾͊͆̀̈́́̾̑̒͛̈͛̍́͒̓͒̇͋̄̀̈́̈̽̈́̋̈́̃͛͗̈́͌̆̉͋̈́̌̎͊̃̍͑̍̏̀͐́́̕̚͘̚͘̕̚̚̕͘̕̕͜͜͜͝͝͠͠͝͝͠͝͠͝͝ͅͅͅͅX̶̡̨̢̢̧̢̡̧̡̨̨̡̧̧̨̛̛̣̹̗̦̻͍̼̺̼̹͚̼͙̜̱̖͔̺̥̲͚̟̬̬̪̺̻̖̮͈͈̲̝̗͉̖͙̪̱̪͚̳̼̱̻̜̼͈̜͎̖̬̝͔̻̹̱͔͓̤̮͓̦̥̺̗̣͖̟̝̺͔̼̖̦̯̱̼̥̪̼̺͈̫͔͎͉̣͇̫̹̬̬̲̣͈̻̼̀́͌͗̏͋͂̊̐̐̋͋̆͑͋̂̋̉̅̊͒̏͋̈́̑̑̿͂͌̌͑̈̃̈́̑̏̔͒̇̇́͗̅̾͑̎͑̇̏͂̆͊̒̆͆̐̎́̉͒͆̈̌͒̈́͋̉̾́̅͊͊̌̔̓͊̅̋̍̆̓͗̉̈̂͆̎̈́̽̇̎̿́̆̽̅̐̍̏̑̓̽̂̑̊͘̚̕̚͘͘͘̚͘͘͜͜͝͝͝͝͝͠͝ͅƯ̶̡̢̨̨̡̧̨̢̨̧̛̤̣̱̰̲̟͖̮̬̦͉̤͔̺̭̖͉͔̜̣̹̮͖̬͕̱͚͙̞̗̳̹̘̞̩̖͍̻͕̞̖̳̙̱̝̼̦͍͖̳̜̰̤̥̥͈̯͇̖͙̻̳̯̥̤͍̙̪̼̻̲̱̹̭̮̣̬̻̫̮̙̙̯͍̺̫̖͓̤̪̻̖̳̞͎̮̖͇̗͉̻̝̺͓̺̺̗̫͓̜̝͓̩̖̤̪̼͚̰̭͕̮͔̊̋͑̄̈́̊͛̈́̈̎̾̐̊͛͌͌͛̈́̑̽͐̉̃̾̓̾̈́͗̀̆̅̒̆́̊͐̍̐̇̅̒̃͌͒̀̿̑̒̃̉̓͗͗́̄͋̃̽̈̂͑͐̊̆̒̑͋̓̾̏̅̿̒͊̅̎́͂̂̀̊͊͆̋̃͛̀̃́͐̀̓́̀̓̍̀͌̂̐̎̔͌͑͐̐̋͛̃̀̐̏͗̒̽̉̒̂͗̿̒̽͗̒̃̈́̄̓̓̈͑̉̃̌̍͑͛̉́̈̈̈́̿́͒͆̇"},{"id":1576139,"gallery_id":289248,"poster":{"id":3305096,"username":"Camikazefreakyboi","slug":"camikazefreakyboi","avatar_url":"avatars/3305096.png?_=e0cc712fbfa87d23","is_superuser":false,"is_staff":false},"post_date":1613806610,"body":"I usually don't care about NTR but this shit is hard hitting it might be caus of the development. It would be cool that there is a second part with a redemption for shou, he goes visit futaba's mother and she dies next to shou and futaba sees that shou saw the dying minutes of her mother, and then bluffs about knowing it for too long but didn't want to trouble her and he tested her trust, so futaba as the horny slut she became tries to rape him of course he refuses, heart broke in every possible way futaba goes back in tears to see her other boyfriend for sexy times she sees Him with another hoe and she runs crying, the boyfriend (not shou) gets triggered of her always sticking into his business, one day at school futaba tries to win him over (again not shou i forgot the guys name) explaining why while crying with a slutty smile he rejects her sadisticly and told her why he approached her in the first place, futaba becomes beyond saving she did the same with shou and... "},{"id":1575451,"gallery_id":289248,"poster":{"id":3921680,"username":"I_Asked_For_The_Sauce","slug":"i_asked_for_the_sauce","avatar_url":"avatars/3921680.png?_=ec44856b0d79b6fe","is_superuser":false,"is_staff":false},"post_date":1613771165,"body":"They say it was his fault but not really. She pushed him away made sure him didn’t help. Can’t be be mad when she says don’t worry about it and he doesn’t."},{"id":1574570,"gallery_id":289248,"poster":{"id":3405898,"username":"Pap1 Dom","slug":"pap1-dom","avatar_url":"avatars/3405898.png?_=cf2221bbb08fc837","is_superuser":false,"is_staff":false},"post_date":1613723902,"body":"It didn't really look that bad. (I didn't read it) like he never did anything with her. The only reason why you feel bad is because the give the dud a back story if there was no back story you wouldn't feel bad. That's why when is a milf type you don't feel bad because you never see the husband"},{"id":1574377,"gallery_id":289248,"poster":{"id":3364533,"username":"idiotperson","slug":"idiotperson","avatar_url":"avatars/3364533.png?_=b571238cfe585ee2","is_superuser":false,"is_staff":false},"post_date":1613715633,"body":"I read 3 or so NTR over the course of tonight, never took my dick out once, so you can imagine that I, a vanilla-fag at heart, will leap into the warm comfort of a wholesome, vanilla doujin, and you'd be right.  Whenever I read shit like this I get a pit in my stomach, partly because this perhaps is a worry for some men out there (not to say their worry is justified, just that it is out there).  I think I'll read something by Pochi or Herio.  That's all"},{"id":1574372,"gallery_id":289248,"poster":{"id":3364533,"username":"idiotperson","slug":"idiotperson","avatar_url":"avatars/3364533.png?_=b571238cfe585ee2","is_superuser":false,"is_staff":false},"post_date":1613715492,"body":"Holy shit this one hurt.  It was really good (technical wise, tbh I didn't even read it as porn) but man did it hurt.  You have the boyfriend who's a bit of a wet blanket that doesn't know exactly what to do in a relationship, but then you have this cunning, manipulative asshole who essentially does the shit that Dennis from It's Always Sunny does.  I liked the irony that they were both competing for the same spot in the soccer team, which shou won, and they are, unbeknownst to shou, competing for the same girl, which the other guy wins.  It would be better if the guy was actually in love with her, and not just manipulating her for sex and out of spite, but that makes it all the more tragic, which I feel is one of the goals of NTR works. \nI'm glad shou was able to accept it, as he realized he didn't really understand her, and may have just convinced himself to love her, so good on him I guess. "},{"id":1574194,"gallery_id":289248,"poster":{"id":3545646,"username":"danidesired","slug":"danidesired","avatar_url":"avatars/3545646.png?_=6e1bffb6b8437029","is_superuser":false,"is_staff":false},"post_date":1613708117,"body":"make pain\nso much pan man not worth"},{"id":1572294,"gallery_id":289248,"poster":{"id":1581013,"username":"Hentai Is No Sin","slug":"hentai-is-no-sin","avatar_url":"avatars/1581013.png?_=e4dee508f64d3d54","is_superuser":false,"is_staff":false},"post_date":1613626076,"body":"@NekoInspector. Revenge sequel? Why? The guy wanted to play ball more than taking care of his gf. Now he has all the time in the world to dedicate himself to soccer. Should be a win for him. And revenge isn't needed anyway because she's just a side hoe now, she'll realize it in the future. She wanted support, a shoulder to lean on. She wanted to feel wanted, and that's what she got even if it won't last forever. Boy gets to persue his dream and Girl gets the attention she craved. Everyones a winner.... sort of lol. So keep this in mind folks: It's best if you balance your dream and love life, cuz if you don't you go broke lol"},{"id":1569755,"gallery_id":289248,"poster":{"id":3656433,"username":"Iru.","slug":"iru","avatar_url":"avatars/3656433.png?_=388dd83f2727c626","is_superuser":false,"is_staff":false},"post_date":1613521825,"body":"So is the author gonna create a part 2? \n"},{"id":1569305,"gallery_id":289248,"poster":{"id":3569287,"username":"NekoInspector","slug":"nekoinspector","avatar_url":"avatars/3569287.png?_=65dc43447b06a7c0","is_superuser":false,"is_staff":false},"post_date":1613496633,"body":"We need a revenge sequel."},{"id":1568614,"gallery_id":289248,"poster":{"id":3519325,"username":"✨Tachibana Rui✨","slug":"tachibana-rui","avatar_url":"avatars/3519325.png?_=d76564927be8c973","is_superuser":false,"is_staff":false},"post_date":1613460245,"body":"Man everytime I read some NTR trash I feel depressed."},{"id":1567532,"gallery_id":289248,"poster":{"id":3907508,"username":"jennierubiejayne","slug":"jennierubiejayne","avatar_url":"avatars/3907508.png?_=ad0d6bd578285d77","is_superuser":false,"is_staff":false},"post_date":1613415945,"body":"Fuck Shou you deserve to lose the girl. But man, Futaba being just some game also hurts - though fucking Takizawa played it so fucking well that I can't even get angry at him. I mean that level of emotional manipulation is so goddamn 4D chess even Shou didn't seem to grasp what he did and deciphed it as \"him earning her love\". Great art; made me respect the antagonist's game: this is how you write an NTR story without resorting to the usual \"Stockholm Syndrome\" tropes. 7/10"},{"id":1567433,"gallery_id":289248,"poster":{"id":3680365,"username":"ooferdonald000","slug":"ooferdonald000","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1613411944,"body":"Y'all ain't got shit on my man shou. He doesn't need to give up his career for some dw of a woman. Keep playing soccer, keep getting those months off, keep pursuing what you want. No matter how many hours or minutes you spend with her, quality counts first. If she's a real one, she'll understand your motives. Everyone needs time for themselves. Even if it takes months, years to see eachother. If she can see that you've cared for her even in small moments, she can stick. If she fails to see that in you my kings, then you know what to do."},{"id":1566940,"gallery_id":289248,"poster":{"id":3891824,"username":"jettcal10","slug":"jettcal10","avatar_url":"avatars/3891824.png?_=0fa34127a622c53a","is_superuser":false,"is_staff":false},"post_date":1613390961,"body":"All I feel is pain\n"},{"id":1560502,"gallery_id":289248,"poster":{"id":2472372,"username":"tallflighost","slug":"tallflighost","avatar_url":"avatars/2472372.png","is_superuser":false,"is_staff":false},"post_date":1613131300,"body":"That soccer dude should've ran out and bought a gun. And gun down the faggot and rape his girlfriend back to being his. Thats at least what I'd do. No faggot steals my girl from me."},{"id":1556446,"gallery_id":289248,"poster":{"id":1562493,"username":"helogram","slug":"helogram","avatar_url":"avatars/1562493.png?_=09cb453e3665fafe","is_superuser":false,"is_staff":false},"post_date":1612937945,"body":"This a win my bros. This a good one. "},{"id":1556054,"gallery_id":289248,"poster":{"id":3871904,"username":"CLOWNOFHENTAI","slug":"clownofhentai","avatar_url":"avatars/3871904.png?_=0518b06693acc8c9","is_superuser":false,"is_staff":false},"post_date":1612918711,"body":"Yeah I’m a fucking loser yeah I’m a social outcast but goddamn did it feel good seeing his face in despair oh my lord that’s the greatest fucking part "},{"id":1555512,"gallery_id":289248,"poster":{"id":3961722,"username":"Bro why am I here?","slug":"bro-why-am-i-here","avatar_url":"avatars/3961722.png?_=c70ff24b601efd27","is_superuser":false,"is_staff":false},"post_date":1612892015,"body":"Delete NTR"},{"id":1552593,"gallery_id":289248,"poster":{"id":3156209,"username":"Bushyy","slug":"bushyy","avatar_url":"avatars/3156209.png?_=5a3a53a10d0ce09c","is_superuser":false,"is_staff":false},"post_date":1612768563,"body":"Welp no matter how hard it was for her she's still a slut. One time comfort = sex lol "},{"id":1552562,"gallery_id":289248,"poster":{"id":3667118,"username":"Al's Grey ghost","slug":"al-s-grey-ghost","avatar_url":"avatars/3667118.png?_=493aeb45d3833b57","is_superuser":false,"is_staff":false},"post_date":1612767562,"body":"Now this is the reason why i don't get a girlfriend"},{"id":1551269,"gallery_id":289248,"poster":{"id":3949263,"username":"animebest7","slug":"animebest7","avatar_url":"avatars/3949263.png?_=a50679b51ba3ca83","is_superuser":false,"is_staff":false},"post_date":1612718654,"body":"She a slut"},{"id":1551266,"gallery_id":289248,"poster":{"id":3949263,"username":"animebest7","slug":"animebest7","avatar_url":"avatars/3949263.png?_=a50679b51ba3ca83","is_superuser":false,"is_staff":false},"post_date":1612718509,"body":"She belongs to streets!"},{"id":1550157,"gallery_id":289248,"poster":{"id":3434799,"username":"marckennet","slug":"marckennet","avatar_url":"avatars/3434799.png?_=b13e92d92a8b674b","is_superuser":false,"is_staff":false},"post_date":1612674813,"body":"pain......"},{"id":1548976,"gallery_id":289248,"poster":{"id":3734835,"username":"mythashu","slug":"mythashu","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1612631400,"body":"And oh cmon don't blame the boy..He was just dumb I get that he ignored when futaba cried but you can't just leave your career for a slut...Futaba was the one at fault she was just a attention craving horny teenager...I don't feel sad for the boy cuz he was just dumb so he should mature up and get over that slut. Cuz he has a bright future while I bet futaba will be shown as a whore in the next chapter."},{"id":1548948,"gallery_id":289248,"poster":{"id":3734835,"username":"mythashu","slug":"mythashu","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1612629973,"body":"Welp..they are teenagers the girl will be devastated after the playboy dumps her...if this gets another chapter they'll probably show her as a complete whore...\nBut in accordance to irl logic she'll grow...This was only sad bcoz she got taken by a trash playboy...\nI don't feel one bit sad for the boyfriend."},{"id":1548876,"gallery_id":289248,"poster":{"id":3545976,"username":"meiko-san","slug":"meiko-san","avatar_url":"avatars/3545976.png?_=7e55c6c756448d40","is_superuser":false,"is_staff":false},"post_date":1612627377,"body":"i haven't read it yet but this shit is already giving me depression"},{"id":1547471,"gallery_id":289248,"poster":{"id":3548412,"username":"henryman3945","slug":"henryman3945","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612568933,"body":"I remember reading this as my first hentai and feeling so empty when I had finished it. This shit gives me ptsd..."},{"id":1545808,"gallery_id":289248,"poster":{"id":3689723,"username":"JasonAkiu","slug":"jasonakiu","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612491504,"body":"Well we’ll well"},{"id":1543184,"gallery_id":289248,"poster":{"id":3625842,"username":"DonkeyDong","slug":"donkeydong","avatar_url":"avatars/3625842.png?_=408d49a0204489c8","is_superuser":false,"is_staff":false},"post_date":1612365173,"body":"That guy hair looks so bad and why does he death grip boobs like that "},{"id":1542913,"gallery_id":289248,"poster":{"id":3832486,"username":"xxxmoumou","slug":"xxxmoumou","avatar_url":"avatars/3832486.png?_=f260d9d2ac3586d8","is_superuser":false,"is_staff":false},"post_date":1612353954,"body":"this is why i got trust issues look at this my guy look at this i didnt not even get boner i was actually near crying at the end i felt the emoiton of shou i realy hope that the creator at least makes a redemption of this with revenge for shou where his fake ass girlfriend broke up after cheating gets exposed and becomes rather of a slut and make her cry a hole lot or make her mom die with i hope you and shou will have kids and such and make her realise what she did was wrong"},{"id":1542443,"gallery_id":289248,"poster":{"id":3877823,"username":"ghosthoon","slug":"ghosthoon","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612337340,"body":"He can take your girl but he can’t take a bullet"},{"id":1541137,"gallery_id":289248,"poster":{"id":2833134,"username":"Blakshet320","slug":"blakshet320","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612281795,"body":"Ummm, could someone recommend me an NTRedemption doujin...just so I could feel better from this?\n"},{"id":1525099,"gallery_id":289248,"poster":{"id":3721988,"username":"SESU KUN SENPAI","slug":"sesu-kun-senpai","avatar_url":"avatars/3721988.png?_=4c8e3085e9cf9b67","is_superuser":false,"is_staff":false},"post_date":1611554474,"body":"I'm didn't even react to this all I feel is pain and the feels"},{"id":1508374,"gallery_id":289248,"poster":{"id":3470102,"username":"RiceEater","slug":"riceeater","avatar_url":"avatars/3470102.png?_=126ebed33b4a547a","is_superuser":false,"is_staff":false},"post_date":1610885430,"body":"idk why, but out of all the NTR I've read, this is the only one I have ever been mad about"},{"id":1487805,"gallery_id":289248,"poster":{"id":3990968,"username":"xZexalx","slug":"xzexalx","avatar_url":"avatars/3990968.png?_=424c7286effc50a8","is_superuser":false,"is_staff":false},"post_date":1610650497,"body":"Nigga give another one where he fucks that Niggas mom or rapes his sister for payback"},{"id":1480804,"gallery_id":289248,"poster":{"id":4008127,"username":"Sakamoto69420","slug":"sakamoto69420","avatar_url":"avatars/4008127.png?_=a3ba573833b01a1f","is_superuser":false,"is_staff":false},"post_date":1610410821,"body":"Fucken trash piece of shit then again I'm piece of shit too. Should of known he was getting cucked. Would of stabbed him. 3/5 story. "},{"id":1479259,"gallery_id":289248,"poster":{"id":2587213,"username":"killmenow1","slug":"killmenow1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610347559,"body":"Cucks out here writing paragraphs and shit"},{"id":1478370,"gallery_id":289248,"poster":{"id":3950116,"username":"spottedme","slug":"spottedme","avatar_url":"avatars/3950116.png?_=d89d25b7d1f80e15","is_superuser":false,"is_staff":false},"post_date":1610314271,"body":"I must say, I’m glad he realized his mistakes, but it was too late, she’d already lost herself with that guy. If it were sooner, this wouldn’t have happened, but these guys are teenagers, and bound to make mistakes, I know he’ll be in pain for a while, but he’ll move on and grow to be a good man. As for the guy, he probably won’t make it till 40, he seems smart, athletic, but he seems to lack the proper ability to lead and grow, so I take it that heel end up poor, or living rough, but hey at least he’ll still have girls to fuck. For the girl, she’s fucked, once he moves on to the next girl, she’s a goner, maybe shell grow, but I doubt it. "},{"id":1474816,"gallery_id":289248,"poster":{"id":2478164,"username":"Yoshida Matty","slug":"yoshida-matty","avatar_url":"avatars/2478164.png?_=178b455b8a7feb04","is_superuser":false,"is_staff":false},"post_date":1610186500,"body":"This MC Just WANT to be the New Neymar...\nI fell Very bad for him..."},{"id":1469608,"gallery_id":289248,"poster":{"id":3837794,"username":"Hyuse","slug":"hyuse","avatar_url":"avatars/3837794.png?_=71491634cc863c01","is_superuser":false,"is_staff":false},"post_date":1610001261,"body":"just wait And see the mc get succesful at Soccer XD "},{"id":1467558,"gallery_id":289248,"poster":{"id":2508178,"username":"9lilac","slug":"9lilac","avatar_url":"avatars/2508178.png?_=784978ddc53903dc","is_superuser":false,"is_staff":false},"post_date":1609932621,"body":"MC is a pussy"},{"id":1467467,"gallery_id":289248,"poster":{"id":1307294,"username":"InfernoHomura","slug":"infernohomura","avatar_url":"avatars/1307294.png?_=ca18dd3f7ca7f56e","is_superuser":false,"is_staff":false},"post_date":1609929829,"body":"Yeh go play soccer 😡😡😡"},{"id":1467173,"gallery_id":289248,"poster":{"id":708813,"username":"ardipahlawan88","slug":"ardipahlawan88","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609921212,"body":"how much favorites and overal rating this creation not match each other"},{"id":1467168,"gallery_id":289248,"poster":{"id":2492158,"username":"tr00p3r","slug":"tr00p3r","avatar_url":"avatars/2492158.png?_=33c49feedc30e2fc","is_superuser":false,"is_staff":false},"post_date":1609921094,"body":"But meh idk how to score this..."},{"id":1467162,"gallery_id":289248,"poster":{"id":2492158,"username":"tr00p3r","slug":"tr00p3r","avatar_url":"avatars/2492158.png?_=33c49feedc30e2fc","is_superuser":false,"is_staff":false},"post_date":1609920973,"body":"Some deep stuff tbh... 3.8/5 just because the protagonist is legit shit"},{"id":1463693,"gallery_id":289248,"poster":{"id":3804560,"username":"Black Swan","slug":"black-swan","avatar_url":"avatars/3804560.png?_=e99292e6c211e380","is_superuser":false,"is_staff":false},"post_date":1609833497,"body":"For all of you saying this is trash you have to look deeper Mc said it himself at the end that he was at fault because he wasn’t there for her when she needed him. "},{"id":1463650,"gallery_id":289248,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1609832518,"body":"Oh shit, GO PLAY YOUR SOCCER"},{"id":1461715,"gallery_id":289248,"poster":{"id":3307421,"username":"Sakamotoo","slug":"sakamotoo","avatar_url":"avatars/3307421.png","is_superuser":false,"is_staff":false},"post_date":1609788363,"body":"This Doujinshi Torture me."},{"id":1459304,"gallery_id":289248,"poster":{"id":3365183,"username":"notsurnamelol","slug":"notsurnamelol","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609728035,"body":"She broke up with the dude because he was focused on sports, maintaining a stable career in the future? due to this the GF felt left out, alone and needed consolation and pamper through sex? a guaranteed slut and problematic in the future, glad this man got ntrd so he can come back with a crown, all he need is a dose of spits from a nigga in da hood. \"Go play your soccer\" excellent motivation i must say. hoes aint loyal\n"},{"id":1453952,"gallery_id":289248,"poster":{"id":3783017,"username":"Bruce008","slug":"bruce008","avatar_url":"avatars/3783017.png?_=316471a2020a8fe4","is_superuser":false,"is_staff":false},"post_date":1609576852,"body":"One of the NTR where I don't find female lead to be a hoe. Like she said, shou was partly to be blamed and I agree on that part. Another thing, it's a fap material so stop taking it serious ffs🙄I fapped on it any times "},{"id":1449447,"gallery_id":289248,"poster":{"id":3943398,"username":"bonzow","slug":"bonzow","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609447635,"body":"the mc is better off without that hoe, considering the fact that takizawa literally has sex with anything that has a pussy, he has a higher chance of conducting an sti, therefore also passing it to the thicc retarded autistic girl"},{"id":1445444,"gallery_id":289248,"poster":{"id":3343234,"username":"MF_DOOM_FANATIC","slug":"mf_doom_fanatic","avatar_url":"avatars/3343234.png?_=d03bad3186fa1a06","is_superuser":false,"is_staff":false},"post_date":1609332747,"body":"\"He who commits adultery lacks sense; he who does it destroys himself.\"\n - Proverbs 6:32"},{"id":1437956,"gallery_id":289248,"poster":{"id":3594725,"username":"Azzyeru","slug":"azzyeru","avatar_url":"avatars/3594725.png?_=c9248952753ac42b","is_superuser":false,"is_staff":false},"post_date":1609123091,"body":"Good doujin, i love it"},{"id":1436249,"gallery_id":289248,"poster":{"id":3951443,"username":"Fuck U","slug":"fuck-u","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609068355,"body":"Btw......\nthe artists is kinda sucks "},{"id":1436226,"gallery_id":289248,"poster":{"id":3951443,"username":"Fuck U","slug":"fuck-u","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609067595,"body":"actually i like reading ntr,\ni you don't want hurt your feelings just focus on hentai,not on side story of this kind doujins"},{"id":1428042,"gallery_id":289248,"poster":{"id":3661712,"username":"pyaezayar","slug":"pyaezayar","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608796656,"body":"မင်းမေစောက်ဖုတ်\n"},{"id":1422883,"gallery_id":289248,"poster":{"id":2101212,"username":"behoty","slug":"behoty","avatar_url":"avatars/2101212.png?_=30c7699ccdf1917d","is_superuser":false,"is_staff":false},"post_date":1608616036,"body":"Well he's going to leave her eventually later because that guy is a player, and the girl will be left alone. While the MC can just focus on his career and success later and find a better girl."},{"id":1419646,"gallery_id":289248,"poster":{"id":3635459,"username":"AidenZenZen","slug":"aidenzenzen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608485426,"body":"This reminds me of Son Heung Min (famous soccer/football player from South Korea). His parents forbid him to have a girlfrind or even even married yet, cuz it will interfere his career. His parents want him to focus to be a football/soccer player first. And some days ago, he got a puskas award 2020 (awards for the best goal of the year), and he bring his parents with him in that awards. \n\nSo yeah, sometimes you must sacrifice your love life for your career. In football/soccer case, there are many players that ruined their career cuz of this. But there are also many players who met their lover after his success. Like the story of Iker Casillas who met his wife when he won the World Cup in 2020."},{"id":1416816,"gallery_id":289248,"poster":{"id":1688014,"username":"ukatonut","slug":"ukatonut","avatar_url":"avatars/1688014.png","is_superuser":false,"is_staff":false},"post_date":1608363696,"body":"Btw, one thing, I hate and appreciate at the same time, is that it is a reasonable NTR. I have to admit that. But im not gonna put this in my favorite anyway."},{"id":1415967,"gallery_id":289248,"poster":{"id":2512306,"username":"Venom43","slug":"venom43","avatar_url":"avatars/2512306.png?_=74837c7c24ddeb2f","is_superuser":false,"is_staff":false},"post_date":1608332009,"body":"I think MC must stay focus on his career and forgetting ever problem, who can destroy his career everytime... Just find another girl if MC get a famous or popular as soccer player there many beauty girl who wanted relationship with soccer player and take her right afterwards so that never happens again "},{"id":1414644,"gallery_id":289248,"poster":{"id":322092,"username":"emurder99","slug":"emurder99","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1608282193,"body":"all i can say is that the MC is not dumb in this chapter he is smart work your way up in the sports ranking. soccer mainly and don't worry about the dumb fuck girlfriend and the fuckface friend who probably got aids or HIV for fucking the dumbass whore and died weeks later and had his funeral the dumb as whore cries over his grave then later she hangs herself and MC got top tier markings in soccer later he hears about his friend and dumb whore who hung herself and said well thats life not my problem anymore and continue to be popular in the sports world and lived the good life"},{"id":1407676,"gallery_id":289248,"poster":{"id":1688014,"username":"ukatonut","slug":"ukatonut","avatar_url":"avatars/1688014.png","is_superuser":false,"is_staff":false},"post_date":1608028427,"body":"Imagine their life in next ten years, our NTRed boy will have a new gf and a proper job, as a pro soccer player or else. Also, he got a good lesson from this and really take a good care for his family. The chad will live like a gigolo or shit tard, and he may make one of his sex gfs pregnant, but can he take a good care of them? Nah, I dont think he can. His child will be a mc for more bitter stories. For the girl, I really dont wanna think about her. If her mom died and her life turned into shit depressing plot, what will you expect from that?"},{"id":1396598,"gallery_id":289248,"poster":{"id":1122987,"username":"uterus invader","slug":"uterus-invader","avatar_url":"avatars/1122987.png?_=421f46ef21a229d6","is_superuser":false,"is_staff":false},"post_date":1607610495,"body":"Forget her bro trust me just buy cyberpunk. It'll solve your problems /s"},{"id":1389678,"gallery_id":289248,"poster":{"id":3891975,"username":"ketchop","slug":"ketchop","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607331319,"body":"The mc and fmc is so pathetic, the playboy is cool lol"},{"id":1389668,"gallery_id":289248,"poster":{"id":3891975,"username":"ketchop","slug":"ketchop","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607330898,"body":"I see......"},{"id":1389479,"gallery_id":289248,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607323912,"body":"To be fair, I don't feel sympathy for the MC in this case. I mean, work/ activity/ study/ etc. are important, but your significant one is too. It's all about balancing the life activity, and MC is just naive to think he can have both. Also, FMC is in a devastating mind b/c of a family issue, and she needs comfort and a strong shoulder to rely on. She did care about MC at first b/c she didn't want MC to lose focus on his soccer play, however, distress can make people do irrational things, like this case. And the antagonist is right. The MC doesn't deserve the girl b/c he prioritizes his soccer play over his GF. That's a final nail to the coffin for FMC b/c when she needs him the most, the MC is nowhere to be found. Ok, it's enough a lesson for vanillafags!!! CIAO!!!"},{"id":1385268,"gallery_id":289248,"poster":{"id":3349469,"username":"playboi carti","slug":"playboi-carti","avatar_url":"avatars/3349469.png?_=736e01a4bcdc2fce","is_superuser":false,"is_staff":false},"post_date":1607166483,"body":"to this day I don’t think a more toxic place than a NTR comment section exists, more insults are thrown in these comments alone than the entirety of all of MW2s S&D gamechat logs"},{"id":1383551,"gallery_id":289248,"poster":{"id":3560810,"username":"kunimitsu","slug":"kunimitsu","avatar_url":"avatars/3560810.png?_=96a00edc8d323a0a","is_superuser":false,"is_staff":false},"post_date":1607103213,"body":"Nakokonsensya na ako pota"},{"id":1382831,"gallery_id":289248,"poster":{"id":3883663,"username":"Condooooms","slug":"condooooms","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607071169,"body":"Break up then fuck another guy. This is relatable irl."},{"id":1382481,"gallery_id":289248,"poster":{"id":3414507,"username":"whitedude122","slug":"whitedude122","avatar_url":"avatars/3414507.png?_=745e5f1bde2dba5a","is_superuser":false,"is_staff":false},"post_date":1607058552,"body":"Stopped by just to say this shit is fucking aids. The ending atleast like you really just gonna turn the other cheek and admit defeat like a pussy?! Atleast kill the bastard or start a fight  to spice things up a bit. But no this fucking artist decided to be cliche AF and have the protagonist accept his fate and wear the cuck medal of beta like a proud pussy. Atleast the art / sex scenes are good, other than that the ending is shit."},{"id":1376403,"gallery_id":289248,"poster":{"id":168735,"username":"NTRMaane","slug":"ntrmaane","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1606860628,"body":"Everyone in this story kind of sucks. The girl for not communicating and bf for not even trying to care and the player just using her as a fuck toy. She's the biggest lover because he won't be around when she gets pregnant. "},{"id":1374900,"gallery_id":289248,"poster":{"id":3338109,"username":"ygdr","slug":"ygdr","avatar_url":"avatars/3338109.png?_=ef8dc94864f6e2c9","is_superuser":false,"is_staff":false},"post_date":1606801634,"body":"Moral of the story: Communicate properly "},{"id":1368110,"gallery_id":289248,"poster":{"id":708813,"username":"ardipahlawan88","slug":"ardipahlawan88","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1606563014,"body":"fuck possible and impossible...NTR always happen conveniently "},{"id":1361514,"gallery_id":289248,"poster":{"id":3858403,"username":"no pain no gain","slug":"no-pain-no-gain","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606322571,"body":"This gave us life lessons to notice their pain and not to make the same mistake as the male mc in the story and don't let the kindness betrayed you"},{"id":1360361,"gallery_id":289248,"poster":{"id":3382219,"username":"Ramza_","slug":"ramza_","avatar_url":"avatars/3382219.png?_=3d9a2bc0eb61397d","is_superuser":false,"is_staff":false},"post_date":1606281663,"body":"Alinsamoila, ur a dumbass. The amount of times I've seen chicks flip on their BF on college because they put more time into classes or sports over them is insane. If you don't give her what she needs she'll find it somewhere else. Simple as that. Ur comment makes u sound like u have never been in a real relationship b4... "},{"id":1358363,"gallery_id":289248,"poster":{"id":1998672,"username":"surumeotoko","slug":"surumeotoko","avatar_url":"avatars/1998672.png?_=f80806124869b4f5","is_superuser":false,"is_staff":false},"post_date":1606203103,"body":"Good ntr But putting soccer above your girlfriend is well deserved idiotic"},{"id":1352447,"gallery_id":289248,"poster":{"id":3847009,"username":"DevineTheNigga","slug":"devinethenigga","avatar_url":"avatars/3847009.png?_=03d971b73e9b88c4","is_superuser":false,"is_staff":false},"post_date":1605985866,"body":"This is Fucking fire my G, Revenge Part 2 when?"},{"id":1350798,"gallery_id":289248,"poster":{"id":1809533,"username":"Alinsamoila","slug":"alinsamoila","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605929467,"body":"So, You telling me, the guy that plays soccer got fucked up by his friend or who ever the fuck he was.\nThe guy that fucked his crush looks out of shape, looks like one punch can make him sleep.\nmeanwhile. This other dude plays soccer, Normally should have a strong muscle build and can easily kick the other fuckers ass.\nBut no, This soccer dude would rather get in the house. stay in FRONT of the door those fuckers was getting at it and he didn't do anything?\nEven a retard with half a brain can get in that room and do chaos.\nJealousy, cheating. Those aren't some insignificant emotions. Only one of them can make a person turn into a wild animal. And you telling me this dude just left out the house crying like a little bitch?\nThis is another explanation why NTR makes 0 fucking sense. I don't piss me of because of cheating not at all. It pisses me off because half of this shit is impossible to happen in reality. Fucking stupid NTR... Who ever created it should forever burn in hell. \n"},{"id":1347359,"gallery_id":289248,"poster":{"id":3602884,"username":"hornifella","slug":"hornifella","avatar_url":"avatars/3602884.png?_=63fa486cc54d7239","is_superuser":false,"is_staff":false},"post_date":1605791609,"body":"@Prf.NTR someone gets it"},{"id":1342914,"gallery_id":289248,"poster":{"id":3758329,"username":"Spynner987","slug":"spynner987","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605616718,"body":"@sikamura doing the Lord's work"},{"id":1342889,"gallery_id":289248,"poster":{"id":3635459,"username":"AidenZenZen","slug":"aidenzenzen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605615281,"body":"Don't worry guys, in my canon theory, Shou will become a world class soccer player later on. "},{"id":1341083,"gallery_id":289248,"poster":{"id":2062926,"username":"ihatekneegrows","slug":"ihatekneegrows","avatar_url":"avatars/2062926.png?_=5db164042403f95b","is_superuser":false,"is_staff":false},"post_date":1605538683,"body":"40 (forty) keks"},{"id":1341026,"gallery_id":289248,"poster":{"id":3825600,"username":"Prf.NTR","slug":"prf-ntr","avatar_url":"avatars/3825600.png?_=f791d735ed572eb0","is_superuser":false,"is_staff":false},"post_date":1605535892,"body":"I'm not totally saying that Shou deserve that thing but if you analyze the situation of Futaba ,she really needs someone to comfort her while Shou is wasting his time practicing soccer and being clueless and because of that Takizawa makes his move , Also Shou is aware that Takizawa is a fvking dickhead but Shou didn't mind it at all and as a result of ignoring Futaba and being clueless of Shou \nTakizawa wins Futaba\nI agree that Shou is a kind of airhead boyfriend\n\n\n\n\n\n\nPlease don't hate me folks I'm just saying my point of view🙂"},{"id":1340330,"gallery_id":289248,"poster":{"id":3605980,"username":"N1cr4xxx","slug":"n1cr4xxx","avatar_url":"avatars/3605980.png?_=9f96920d383fd2b1","is_superuser":false,"is_staff":false},"post_date":1605507280,"body":"What did Shou did wrong, my man didn’t deserved being NTR’ed I wish Takizawa and Shou’s ex (don’t remember that bitch name) burn in fucking hell, The author should make a part 2 where Shou get revenge."},{"id":1334850,"gallery_id":289248,"poster":{"id":3534236,"username":"The93%HentaiZone","slug":"the93-hentaizone","avatar_url":"avatars/3534236.png?_=1b2c3a06e21a189e","is_superuser":false,"is_staff":false},"post_date":1605303770,"body":"there better be a part 2 where shou gets fucking ripped and beats the shit out of Takizawa. This better be the origin story for the most goated character in hentai, Chad Shou"},{"id":1331240,"gallery_id":289248,"poster":{"id":3811857,"username":"chiganiga","slug":"chiganiga","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605163873,"body":"Shou a mf king he don’t deserve it. Y’all better give us a part 2 where this mf has a successful future "},{"id":1328772,"gallery_id":289248,"poster":{"id":3602884,"username":"hornifella","slug":"hornifella","avatar_url":"avatars/3602884.png?_=63fa486cc54d7239","is_superuser":false,"is_staff":false},"post_date":1605057382,"body":"sorry for the long comment just wanted to say my thoughts on why I liked this"},{"id":1328769,"gallery_id":289248,"poster":{"id":3602884,"username":"hornifella","slug":"hornifella","avatar_url":"avatars/3602884.png?_=63fa486cc54d7239","is_superuser":false,"is_staff":false},"post_date":1605057207,"body":"I think this one of my favorite authors cause he has some good but bittersweet stories and has some lessons you should learn. In here, you may think that the girl is easily manipulated she may be but just put yourself in her shoes, you just heard that your mother got into an accident and cried and your boyfriend told you what is wrong but because you don't him to worry you told him nothing but in reality you want him to know and help you and now here is the bf got things wrong. Instead of him worrying about her and persistently asking her if she is ok he just stopped asking and was insensitive to her and the girl literally cried. So the NTR part is actually understandable and that's why I like it. It can give you a bittersweet and a true NTR story yet still give a lesson that if you want true love or don't want to get cucked you have to persistently understand and love the other person and if you want to know if im on NTR or Vanilla, im completely neutral on the side."},{"id":1328762,"gallery_id":289248,"poster":{"id":2306978,"username":"StrikerFulminata","slug":"strikerfulminata","avatar_url":"avatars/2306978.png","is_superuser":false,"is_staff":false},"post_date":1605056776,"body":"Stand up Shou. Kings don’t deserve easily manipulated sluts. "},{"id":1326104,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1604940024,"body":"The worst part of this is the boyfriend legitimately cared to his girl, it's just that the girl wouldn't tell him what's wrong with her. He kept asking her what's wrong but she doesn't want him to be distracted. And this is how I got my name."},{"id":1324478,"gallery_id":289248,"poster":{"id":93940,"username":"Little Turtle","slug":"little-turtle","avatar_url":"avatars/93940.png","is_superuser":false,"is_staff":false},"post_date":1604874465,"body":"This my friends is a masterpiece."},{"id":1323294,"gallery_id":289248,"poster":{"id":27426,"username":"dafater","slug":"dafater","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604832346,"body":"I'd say the MC dodged a bullet.\n\nGirl's a born slut lol. Guess only regret would be he didn't get to do her"},{"id":1323077,"gallery_id":289248,"poster":{"id":3808803,"username":"WorstCritique","slug":"worstcritique","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604823371,"body":"I agree that the girl was easily manipulated. BUT if an accident like that happened to your mother that made you really sad to the point of tears and there was that one girl that was there for you the whole time cared for you (even as an act) would you not fall in love? The MC was not even a good character he didn't cared enough when his gf cried in front of him like wtf atleast consult her even tho she said no be persistent his your gf for fucks sake a totally weak MC "},{"id":1321430,"gallery_id":289248,"poster":{"id":2925656,"username":"dirty shark","slug":"dirty-shark","avatar_url":"avatars/2925656.png?_=f7023e951e1a88b6","is_superuser":false,"is_staff":false},"post_date":1604759854,"body":"Bitch just wants attention"},{"id":1320561,"gallery_id":289248,"poster":{"id":3468421,"username":"JabGP","slug":"jabgp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604724197,"body":"You know what they say, to lose the battle but win the war. Bitch was easy to manipulate, she wasnt worth a damn thing. MC will be fine considering his hard working nature"},{"id":1318441,"gallery_id":289248,"poster":{"id":1368699,"username":"Doko8","slug":"doko8","avatar_url":"avatars/1368699.png","is_superuser":false,"is_staff":false},"post_date":1604642887,"body":"bueno almeno lo entendió talves se deprima por un tiempo pero se recuperara xD \nlol hay uno que escribió toda una historia imaginándose como continuaron sus vidas\nbien por el"},{"id":1317177,"gallery_id":289248,"poster":{"id":2628644,"username":"ReyLxx","slug":"reylxx","avatar_url":"avatars/2628644.png","is_superuser":false,"is_staff":false},"post_date":1604593428,"body":"Remember kids like what a Great man name Johnny used to say \"a shoulder to cry on can become a dick to ride on\""},{"id":1316200,"gallery_id":289248,"poster":{"id":2181037,"username":"otomono","slug":"otomono","avatar_url":"avatars/2181037.png","is_superuser":false,"is_staff":false},"post_date":1604549623,"body":"Art is good...Well that's about it..\nThe story is the usual .Just skimmed through it.Bait cuckery at its modest."},{"id":1314533,"gallery_id":289248,"poster":{"id":1209426,"username":"Yoshitsunecr","slug":"yoshitsunecr","avatar_url":"avatars/1209426.png","is_superuser":false,"is_staff":false},"post_date":1604480450,"body":"@sikamura i liked you after story buddy, good read, not perfect but good atleast."},{"id":1314080,"gallery_id":289248,"poster":{"id":3796216,"username":"madxx","slug":"madxx","avatar_url":"avatars/3796216.png?_=8e81f6c1953e18bf","is_superuser":false,"is_staff":false},"post_date":1604464085,"body":"Fuck her, she’s not good enough for Shou"},{"id":1313070,"gallery_id":289248,"poster":{"id":2398352,"username":"llik lla skcuc","slug":"llik-lla-skcuc","avatar_url":"avatars/2398352.png?_=21dc69ae8cd4c9cf","is_superuser":false,"is_staff":false},"post_date":1604425673,"body":"That girl will never be happy because the one she sleep with is a playboy. MC is at fault but he work hard so he is fine. You can tell what their future is. Playboy Win, MC lose, Bitch lose. So be simp to your gf, ok? Wait, you here at NTR mean you don't even have gf XD"},{"id":1312355,"gallery_id":289248,"poster":{"id":3793678,"username":"cursednibba","slug":"cursednibba","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604389211,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. Sorry y'all i got cursed too, you can't underestimate random people curse"},{"id":1312277,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604385713,"body":"I just posted after story in comment section with alternate ending . If you are interested you can read it . NOTE : IF YOU ARE READING IT READ IT FROM DOWNWARSDS  TO UPWARDS . THANK YOU ."},{"id":1312270,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604385418,"body":"And shou and tamako was known as famous soccer couple of Japan worldwide . with their whole family having great soccer players (later their 2 sons became famous just like their parents ) .  THE END .  Author's note you can never NTR a hard-working guy because his 2nd waifu will give you NTR reverse suppllex . Thank if you made it till the end . "},{"id":1312267,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604385177,"body":"After many years later  a luxury car arrives in front of a 5 star hotel . The cars parks in parking lot . In parking lot there was a women in her 30's begging for money . A gentleman comes out of the cars front door and a beautiful lady comes out of ther door with a baby in her hands . 4 children comes out of back door . Yes that's right it was shou and tamako and their 5 kids . They came to restaurant to have dinner. Shou sees the lady who was begging so he asks his first son takemu to give some money to the beggar takkemu gives and returns to the family, they all go inside the restaurant . The beggar women cries after receiving the money.  Yes that's right she was futaba . And this time her tears were  of sadness and regret . After seeing shou and tamako with their kids all happy and smiling . She crys she imagines it could have been her. She regrets for leaving shou alone to suffer but it was too late . And thus in the end futaba lived and died as prostitue. (Next paragraph)"},{"id":1312261,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604384459,"body":"She wanted a real dick so she finds out that there was neighborhood ugly uncle . She goes to him for sex and then they have sex she enjoys herself with him year passed the husband returns to surprise her ( futaba ) but when he comes home futaba wasn't there and house was mess . He was confused seeing the house . Soon he starts hearing mourning voice in neighbour house  and he identifys it was futaba's he rush toward the next house and there he was shocked to see futaba having sex with two men . He cries she cries but her tears was of pleasure.  The guy get mentally sick so he tries to commit suicide on bridge but the cops stop him later he was put to mental ward . Futaba became sex freak she became a prostitue after divorce with her husband ."},{"id":1312253,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604384060,"body":"There was another person that was watching the success of shou ,that was futaba . She was married to the same guy . She married him because of sex addict she was leaving in small normal house . No children her husband was in office she was watching TV seeing how successful shou and tamako became and how they have 2 children . She was raged and jealous at the same time she imagines she could have been standing next to shou instead of tamako but it's too late . Later her husband comes . And when futaba ask for sex he says he is bit tired and they have little fight and they have sex for about 5mins and they sleep . The next day when they wake-up husband says he have transfer of one year in other country so he won't there for a year . Futaba was scared how she can control her sex drive when he is. Not there . Later it was finally decided and her husband went abroad . Futaba tried to relive her self by masturabing herself with toys . Months has passed she couldn't control herself she wanted"},{"id":1312242,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604383505,"body":"1 year later tamako while playing started vomitting . Later she came to know that a new life was born . She surprised shou they both cried . Tamako was pregnant with shous child and shou always spend time with tamako he always took care of her . And after giving birth . Shou proposed tamako for marriage tamako cried and said yes . Whole social media went on fire . After hearing the famous japnese football player was getting married ( the wedding was sweet and heart warming ) . So in an interview during awards night  he was asked why he choose tamako ? And there were many other women , even actrors and models who wanted him . And he replied \" when I was in depression and was covered in darkness she was the light that shined my life the reason I'm here is because of her . He calls tamako to stage to accept award with him and at that time she was pregnant with his second child . They both accepted the award together with their 1st child takemu next to them .( Next chapter )"},{"id":1312234,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604382973,"body":" down in the comment section I have posted after story read if you are interested this is the 4th part down you can read 1,2,3 part ) after 6 years( completing study's and graduation ( tamako and shou were still dating  ) shou was   popular and soon he was selected for national trophy . Shou became the top goal scorer in the national League . And tamako was there in front bench to support his every match . Shou was getting fame day by day . Tamako was playing for women's team . And shou was there to watch her match . And finally the day came FIFA world cup . Shou was playing for Japnese team . He became quite famous by getting rank 3 in fifaa tournament top scorer Japan reached the quarter finals but lost against Brazil . There shou met his idols Ronaldo and Messi and neymar . Japan might have lost the tournament but at the same time a new legend was born . Shou got offers from many clubs . So he started playing for Barcelona . Alongside the legend Messi .  (Next chapter in comment sec"},{"id":1312223,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604382366,"body":"Down in comment section I have posted after story  read if you are interested this is the 3rd part down you can check the 1st and 2nd part ) so the guy who fucked futaba thought he can also steal tamako from shou so he tried to flirt with her and grabbed her shoulder *** tamako did reverse suppllex . Guy got his ass kicked and there were his friends they tried to attack tamako but right at time shou came and beat the shit out of them . Everyone heard the news how school bully got his ass kicked by the famous soccer couples . So there were many supporters of shou and tamako . Futaba heard that shou beat her current bf so she tried to confront him and when she was about slap him tamako grabbed her and ***poff German suplex even futaba got her ass kicked by tamako ( next part in comment section )"},{"id":1312216,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604381967,"body":"(Down in comment section I have posted after story read if u are interested ) . So after shou came out of depression he started focusing on soccer and tamako also did the same they both focused on soccer .and when they have free time they spend time together .  ( Tamako came to realise that shou had something big in his pants that even futaba didn't know and he was king in bed ). And this cycle repeated shou also started working out and he grew some muscles and also grew tall . Soon the words spread to school that shou and tamako are dating. After shou won the trophy for his school he became quite popular not only that many girls started likeing him for his looks and body . But they couldn't compete to tamako she was on other level . So they were known as the famous soccer couples . Futaba also came to know about the news of shou . And she was also bit jealous of tamako but she was still addicted to sex ( little did she know how dominating shou was in bed ) ( next part in comment sect)"},{"id":1312200,"gallery_id":289248,"poster":{"id":3793372,"username":"sikamura","slug":"sikamura","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604381499,"body":"Ok I'll tell you the after story , after shou got cheated he was depressed for a week . And futaba got addicted to sex . Shou saw futaba with the other guy they were dating . Whole school came to know that shou and futaba broke up . Shou thought it was the end . But no there was someone else who loved shou but couldn't tell her feelings . Her name was tamako . She was also a football player . She was playing for women's team . She always loved watching shou play  and how cool he looks . She tried talking to shou many times but she couldn't because futaba was there so she kept her love a secret . But after hearing the news of breakup and seeing shou in depression tamako went to shou and confessed her feelings right then she told everything she kept in her mind . And tamako became the light for shou too shine the darkness that futaba left for him . So tamako cheered him up and they started dating . (2nd part next comment ) "},{"id":1303608,"gallery_id":289248,"poster":{"id":2952629,"username":"spiderscout","slug":"spiderscout","avatar_url":"avatars/2952629.png","is_superuser":false,"is_staff":false},"post_date":1604018779,"body":"I blacklist NTR yet I do this shit to myself"},{"id":1299885,"gallery_id":289248,"poster":{"id":3776461,"username":"wally1620","slug":"wally1620","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603881941,"body":"People saying boyfriend is dumb for chosing football, but im with him. You dont have to give up everything to be with a girl, u just have to manage it. People in here dont understand what it feels like to be in love with a sport. However, he is still dumb, because no one in their right minds would chose a guy that doesnt play as a part of The main team, so he didnt have to play more to be chosen. I think that The title to The dumbest should Be given to The girl, cuse the bf was worried about her and she just ignored his help"},{"id":1292917,"gallery_id":289248,"poster":{"id":1901064,"username":"Lenmiwinks","slug":"lenmiwinks","avatar_url":"avatars/1901064.png","is_superuser":false,"is_staff":false},"post_date":1603603752,"body":"Wow, this shit is really hard to read, al characters are dumbs af"},{"id":1291038,"gallery_id":289248,"poster":{"id":3681550,"username":"¢","slug":"_","avatar_url":"avatars/3681550.png?_=cf0094db37c78a09","is_superuser":false,"is_staff":false},"post_date":1603524490,"body":"If I was into necrophilia and Yandere shit if i was the MC i will kill the guy and fuck the bitch with no holding back at all after that i will make her choose.Do you want to be with me? Or Do you want to be with him?"},{"id":1289637,"gallery_id":289248,"poster":{"id":2010968,"username":"Aimer05","slug":"aimer05","avatar_url":"avatars/2010968.png?_=95cc33929c8a4bd6","is_superuser":false,"is_staff":false},"post_date":1603470920,"body":"Two things the Mc is too dumb and the guy picks a girl is also dumbass whos lusting for sex i guess in real life happens in similar life sucks for the MC soccer aint important if your Girl forced to have sex with someone what I meant he trick/fool her thats why. This is the first time i read something like this im new to this..."},{"id":1284279,"gallery_id":289248,"poster":{"id":3423205,"username":"blooper99","slug":"blooper99","avatar_url":"avatars/3423205.png?_=1db4d1c6daf61498","is_superuser":false,"is_staff":false},"post_date":1603249528,"body":"I say the boyfriend is a dumbass for not caring about his gf and the other dudes just an ass"},{"id":1282939,"gallery_id":289248,"poster":{"id":1410942,"username":"KenjongKilawogg","slug":"kenjongkilawogg","avatar_url":"avatars/1410942.png?_=9fbe7c335c1d1e63","is_superuser":false,"is_staff":false},"post_date":1603189030,"body":"Man you niggas really like torturing your feelings with NTR huh, I'm basking into it"},{"id":1278958,"gallery_id":289248,"poster":{"id":3262304,"username":"JoeBlader","slug":"joeblader","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1603028710,"body":"This is a god tier NTR, but still it's a NTR.\nI think that the guy takes part of the blame but that bastard still used her when she was vulnerable so eh. The blame is distributed"},{"id":1277496,"gallery_id":289248,"poster":{"id":3494683,"username":"mangasword","slug":"mangasword","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602960734,"body":"God tier NTR. Hands down. B r a v o"},{"id":1276392,"gallery_id":289248,"poster":{"id":3741466,"username":"Flashpoint1002","slug":"flashpoint1002","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602911783,"body":"Can you make A Part 2 PLEASE"},{"id":1275683,"gallery_id":289248,"poster":{"id":3445035,"username":"Robofer","slug":"robofer","avatar_url":"avatars/3445035.png?_=c95f872b2222c237","is_superuser":false,"is_staff":false},"post_date":1602876601,"body":"Dumbass MC doesnt react and follow her when she say that nothing was wrong... that was the fatal mistake of their relationship, mc its foccusing on football and neglects the girl, the girl its also somewhat guilty for not tell him about her mother or how lonely feels sometimes, enter the assholish playboy that says what she desire to listen and the mc just keep quiet and do nothing."},{"id":1272420,"gallery_id":289248,"poster":{"id":3734093,"username":"genesisnama23","slug":"genesisnama23","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602725048,"body":"Rise my boi get your revenge kill them both plss :( plss pt 2 kill that two assholes the mc don't deserve that slutty bastard"},{"id":1269003,"gallery_id":289248,"poster":{"id":3444159,"username":"ABCGOODBOY","slug":"abcgoodboy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602562164,"body":"This shit is deep as hell dude. I feel the pain he feels man. Hope he gets his revenge if their is ever a part 2."},{"id":1267183,"gallery_id":289248,"poster":{"id":3547646,"username":"Bitch baby","slug":"bitch-baby","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602486770,"body":"Make a part 2 man "},{"id":1266761,"gallery_id":289248,"poster":{"id":3724110,"username":"wyknson","slug":"wyknson","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602473367,"body":"please make a part two, i want to see the mc kill the guy n the girl but before killing them i want them to be tortured first. please notice me "},{"id":1266654,"gallery_id":289248,"poster":{"id":3338064,"username":"Boudey","slug":"boudey","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602469623,"body":"Whoever make this, fuck you"},{"id":1266601,"gallery_id":289248,"poster":{"id":3661802,"username":"CHUBZZ","slug":"chubzz","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602467159,"body":"Come now shou, let me tech you the ways of the great apostles Future, and Drake"},{"id":1266522,"gallery_id":289248,"poster":{"id":3723792,"username":"mmredrice","slug":"mmredrice","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602462770,"body":"I need a part 2, justice for my homie."},{"id":1266514,"gallery_id":289248,"poster":{"id":3612848,"username":"oyasumi_melon","slug":"oyasumi_melon","avatar_url":"avatars/3612848.png?_=6328078fbc24a368","is_superuser":false,"is_staff":false},"post_date":1602462363,"body":"I need a part 2 where he kills both of them in the most gruesome way possible "},{"id":1265899,"gallery_id":289248,"poster":{"id":3723004,"username":"jb66","slug":"jb66","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602437512,"body":"Will the author ever make a part 2???"},{"id":1263345,"gallery_id":289248,"poster":{"id":3485639,"username":"afvnit","slug":"afvnit","avatar_url":"avatars/3485639.png?_=1dba2d383d20d516","is_superuser":false,"is_staff":false},"post_date":1602336417,"body":"you cant help but feel bad for the guy"},{"id":1262571,"gallery_id":289248,"poster":{"id":3451937,"username":"Pounder","slug":"pounder","avatar_url":"avatars/3451937.png?_=7aeb5663b35106ba","is_superuser":false,"is_staff":false},"post_date":1602305956,"body":"Oh I wouldn't get mad no I'mma do everything I can to make their lives a living hell and the fun part is they would be too stupid to know who's doing it to them"},{"id":1262105,"gallery_id":289248,"poster":{"id":3125236,"username":"Cat-tto","slug":"cat-tto","avatar_url":"avatars/3125236.png?_=e5fc2e46613fae1b","is_superuser":false,"is_staff":false},"post_date":1602286123,"body":"I saw this on Facebook saying that It was not ntr, not ntr my ass"},{"id":1261805,"gallery_id":289248,"poster":{"id":3643163,"username":"Kufo","slug":"kufo","avatar_url":"avatars/3643163.png?_=38edc99dfdec5ce1","is_superuser":false,"is_staff":false},"post_date":1602271701,"body":"Tiktok got me on some depressed sauce"},{"id":1261723,"gallery_id":289248,"poster":{"id":3717112,"username":"YOURMOMOHHHHHH","slug":"yourmomohhhhhh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602268177,"body":"This hurts I thought this was a regular but it made me cry like damn after your mom dies you have sex with a dude who’s gonna forget about you soon and your bf sees that’s just depressing dude "},{"id":1261695,"gallery_id":289248,"poster":{"id":3717072,"username":"iISp1R1TIi","slug":"iisp1r1tii","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602266938,"body":"He should opened the door and shot him "},{"id":1260880,"gallery_id":289248,"poster":{"id":700714,"username":"reyuzami","slug":"reyuzami","avatar_url":"avatars/700714.png?_=a2ba3224c549d94d","is_superuser":false,"is_staff":false},"post_date":1602227821,"body":"he got a girl, and mc got a great future of soccer, hmm nice one"},{"id":1257897,"gallery_id":289248,"poster":{"id":1264840,"username":"Fazeduwang","slug":"fazeduwang","avatar_url":"avatars/1264840.png","is_superuser":false,"is_staff":false},"post_date":1602086534,"body":"Chase a bag king. "},{"id":1256679,"gallery_id":289248,"poster":{"id":3520728,"username":"PakiSlayer9000","slug":"pakislayer9000","avatar_url":"avatars/3520728.png?_=2c7eab4e32fcfb0a","is_superuser":false,"is_staff":false},"post_date":1602023153,"body":"Get destroyed 16001 Favorite"},{"id":1255635,"gallery_id":289248,"poster":{"id":3437594,"username":"I.love.anal","slug":"i-love-anal","avatar_url":"avatars/3437594.png?_=fa557b1f76eb5199","is_superuser":false,"is_staff":false},"post_date":1601973902,"body":"Nah she's just plain mental. WHO HAS SEX AFTER THEIR MOM PASSES AWAY!!! THAT AINT EVEN A FETISH!!! "},{"id":1252610,"gallery_id":289248,"poster":{"id":474129,"username":"aamro","slug":"aamro","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601845266,"body":"don't worry about it too much kid. chick gave in to a guy after only 2 days >.> i dont care if her entire family got executed, that shit is weak sauce yo. "},{"id":1245763,"gallery_id":289248,"poster":{"id":3420503,"username":"bruh7355","slug":"bruh7355","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601529216,"body":"Damn this shit made me regret busting a nut to this. Pain"},{"id":1231498,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1601007335,"body":"But shit like happens IRL and that's what makes this IMO the best NTR I've ever read."},{"id":1231492,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1601007214,"body":"Can't people see how MC even asked his girlfriend what's wrong? He kept prodding her since he notices something's wrong with her but the girl kept hiding it from him!"},{"id":1225183,"gallery_id":289248,"poster":{"id":3666059,"username":"crowslens","slug":"crowslens","avatar_url":"avatars/3666059.png?_=1a1add1ca2ef5171","is_superuser":false,"is_staff":false},"post_date":1600754957,"body":"Its funny how a doujin becomes a topic for a debate about social standing and mental health issues "},{"id":1225158,"gallery_id":289248,"poster":{"id":3666059,"username":"crowslens","slug":"crowslens","avatar_url":"avatars/3666059.png?_=1a1add1ca2ef5171","is_superuser":false,"is_staff":false},"post_date":1600754304,"body":"I didnt fapped but I must admit this is funny as hell. Tbh why would you look forward to a relationship if you can't even commit to it.  "},{"id":1221946,"gallery_id":289248,"poster":{"id":3613625,"username":"shelovemyglizzy","slug":"shelovemyglizzy","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1600623729,"body":"am I the only one who found this funny lmaoo"},{"id":1221879,"gallery_id":289248,"poster":{"id":3120598,"username":"weeb_kun","slug":"weeb_kun","avatar_url":"avatars/3120598.png?_=2804e3703416fd2e","is_superuser":false,"is_staff":false},"post_date":1600620842,"body":"haha i want a sequel just to see what happened to that bitch"},{"id":1219379,"gallery_id":289248,"poster":{"id":3459571,"username":"Pekopekopeko","slug":"pekopekopeko","avatar_url":"avatars/3459571.png?_=7922baaf46d20758","is_superuser":false,"is_staff":false},"post_date":1600500503,"body":"Ntr but it has surprisingly good execution. The dude is a true chad winning a girl's heart that easily. Bookmarked."},{"id":1216726,"gallery_id":289248,"poster":{"id":1948736,"username":"pppppp6","slug":"pppppp6","avatar_url":"avatars/1948736.png","is_superuser":false,"is_staff":false},"post_date":1600376815,"body":"I legit found this ntr to be funny after finishing"},{"id":1216176,"gallery_id":289248,"poster":{"id":825179,"username":"IDragslayer","slug":"idragslayer","avatar_url":"avatars/825179.png","is_superuser":false,"is_staff":false},"post_date":1600355556,"body":"@RiceEater mood"},{"id":1214314,"gallery_id":289248,"poster":{"id":2166327,"username":"nightheathen","slug":"nightheathen","avatar_url":"avatars/2166327.png?_=feffde093f75db0a","is_superuser":false,"is_staff":false},"post_date":1600275274,"body":"lol i just came here from the meme"},{"id":1212160,"gallery_id":289248,"poster":{"id":3400532,"username":"jofzki01","slug":"jofzki01","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600180021,"body":"i need ntr revenge 🤣😂 all i know soccer player have a nice body so if they make ntr revenge then this is so lit "},{"id":1212156,"gallery_id":289248,"poster":{"id":1264840,"username":"Fazeduwang","slug":"fazeduwang","avatar_url":"avatars/1264840.png","is_superuser":false,"is_staff":false},"post_date":1600179729,"body":"Spit those facts nerogang."},{"id":1208250,"gallery_id":289248,"poster":{"id":3133944,"username":"Nerogang","slug":"nerogang","avatar_url":"avatars/3133944.png","is_superuser":false,"is_staff":false},"post_date":1599995163,"body":"They didnt show the part where he leaves her, then she becomes a single mom, and then she blames all men, \"all men are trash\" lollll. This type of stuff happens irl all the time, if she does this then she is trash, he missed a bullet. She acts as if cheating 1 time is ok, when it isn't, 1 time is no different than 100 times, trash is trash. "},{"id":1207999,"gallery_id":289248,"poster":{"id":3470102,"username":"RiceEater","slug":"riceeater","avatar_url":"avatars/3470102.png?_=126ebed33b4a547a","is_superuser":false,"is_staff":false},"post_date":1599984541,"body":"everytime i read ntr, im like \"oh shit, my dick bout to break fapping to this\" then post nut clarity hits and I'm just laying here naked like \"well the story is a lil fucked, dumbass bitch is retarded, and mc is a dumb mother fucker too, they both retarded holy shit\""},{"id":1207637,"gallery_id":289248,"poster":{"id":1220756,"username":"Dunkaccino","slug":"dunkaccino","avatar_url":"avatars/1220756.png?_=61e397133f8105be","is_superuser":false,"is_staff":false},"post_date":1599970105,"body":"Oh well, you dodged a huge bullet football guy. Keep your chin up king!"},{"id":1205290,"gallery_id":289248,"poster":{"id":2551546,"username":"animo_kun","slug":"animo_kun","avatar_url":"avatars/2551546.png","is_superuser":false,"is_staff":false},"post_date":1599859091,"body":"@Onion-Eggs, homie first of all I wanna apologize  because I looked at  your  bio and what I understand From it is that u like the plot,  characters, art in NTR story's but you hate NTR in general? I mean what? Make up your mind first because it's looks like you like NTR but you doesn't realize it yet."},{"id":1201791,"gallery_id":289248,"poster":{"id":2551546,"username":"animo_kun","slug":"animo_kun","avatar_url":"avatars/2551546.png","is_superuser":false,"is_staff":false},"post_date":1599687990,"body":"This is just another generic NTR shit, I'm just board reading these same shit again and again. I don't feel it anymore. That bitch would realize soon enough what she did and regret her entire life and for the guy 1 year sadness and then he's good to go."},{"id":1200273,"gallery_id":289248,"poster":{"id":1827550,"username":"щшщшщш","slug":"shchshshchshshchsh","avatar_url":"avatars/1827550.png?_=e12afb89e682c8e5","is_superuser":false,"is_staff":false},"post_date":1599622777,"body":"Fuck ntr. Who tfuck made this tag exist"},{"id":1197885,"gallery_id":289248,"poster":{"id":3303282,"username":"really man?","slug":"really-man","avatar_url":"avatars/3303282.png?_=234606020dfd1607","is_superuser":false,"is_staff":false},"post_date":1599508716,"body":"shit hits hard man "},{"id":1193336,"gallery_id":289248,"poster":{"id":3571197,"username":"Naetsevu","slug":"naetsevu","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599310980,"body":"@METROID 2.00 Just not good enough. Didn't even tickle my balls a little. Just sound like a 15 year old kid going for mom insults. Probably do need someone fucking your girl in front of you to get that cuck lord brain of yours working. Tell her to leave the backdoor open for me and you can come watch"},{"id":1193241,"gallery_id":289248,"poster":{"id":1387175,"username":"a drop of virtues.","slug":"a-drop-of-virtues","avatar_url":"avatars/1387175.png?_=36d1c341684b4d47","is_superuser":false,"is_staff":false},"post_date":1599306082,"body":"Utter garbage... should be put in the proper place, . . . . . . . . the Art is good tho, "},{"id":1191593,"gallery_id":289248,"poster":{"id":3056431,"username":"its God","slug":"its-god","avatar_url":"avatars/3056431.png?_=e7c158ec7667ae15","is_superuser":false,"is_staff":false},"post_date":1599230818,"body":"its kinda his fault for being such a beta"},{"id":1190636,"gallery_id":289248,"poster":{"id":1002833,"username":"nhenrap08","slug":"nhenrap08","avatar_url":"avatars/1002833.png","is_superuser":false,"is_staff":false},"post_date":1599192106,"body":"FUCKING NTR WHO THE FUCK MADE THIS "},{"id":1190289,"gallery_id":289248,"poster":{"id":1273285,"username":"barni2212","slug":"barni2212","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599174885,"body":"Well I don't like NTR usually but once a wise man said \"You get what you fucking deserve!\" MC chose football above his GF. Fuck your football than.\n"},{"id":1189478,"gallery_id":289248,"poster":{"id":3210270,"username":"deucexmachina","slug":"deucexmachina","avatar_url":"avatars/3210270.png?_=4b2694d49e55caa0","is_superuser":false,"is_staff":false},"post_date":1599141413,"body":"ey my man out here makin the world a better place"},{"id":1189422,"gallery_id":289248,"poster":{"id":2992918,"username":"Vikala","slug":"vikala","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599138550,"body":"all he had to do is be a good football player like messi/cr7 and girls will come to him "},{"id":1186725,"gallery_id":289248,"poster":{"id":3571197,"username":"Naetsevu","slug":"naetsevu","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599026584,"body":"@METROID 2.00 That was shit, try again you can do better. If you got a girl i'll give her a nice dicking while you think up a better response since you seem to be into that shit"},{"id":1185799,"gallery_id":289248,"poster":{"id":2349425,"username":"ImABot","slug":"imabot","avatar_url":"avatars/2349425.png","is_superuser":false,"is_staff":false},"post_date":1598987454,"body":"after i nut to this shit:*What have i done* "},{"id":1185039,"gallery_id":289248,"poster":{"id":3185439,"username":"Pizzalover","slug":"pizzalover","avatar_url":"avatars/3185439.png?_=f02f4e2760dfb78d","is_superuser":false,"is_staff":false},"post_date":1598956976,"body":"Fuckboy bitch"},{"id":1179104,"gallery_id":289248,"poster":{"id":3192515,"username":"Alex andrite","slug":"alex-andrite","avatar_url":"avatars/3192515.png?_=9a5c71e2a6872ad6","is_superuser":false,"is_staff":false},"post_date":1598714176,"body":"Urrrgghh reading this makes me feel bad, and the fact that i find this kind of shit stimulating is even worse"},{"id":1174533,"gallery_id":289248,"poster":{"id":1143166,"username":"bakaAF","slug":"bakaaf","avatar_url":"avatars/1143166.png","is_superuser":false,"is_staff":false},"post_date":1598505321,"body":"I wanna do this to someone's gf soooo baddd 😍"},{"id":1173550,"gallery_id":289248,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1598460827,"body":"But hey, good shit, I cane here to fap anyway"},{"id":1173544,"gallery_id":289248,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1598460705,"body":"Are Japanese girls really this retarded? Lmao it's so easy"},{"id":1173347,"gallery_id":289248,"poster":{"id":3291363,"username":"macocute","slug":"macocute","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598452241,"body":"Trash no part 2 i wanna see revenge"},{"id":1171392,"gallery_id":289248,"poster":{"id":3446354,"username":"Oppai_ lover","slug":"oppai_-lover","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1598363741,"body":"Trash i hate ntr "},{"id":1170874,"gallery_id":289248,"poster":{"id":3338297,"username":"tallflipkick","slug":"tallflipkick","avatar_url":"avatars/3338297.png?_=5e733a7fd663f39c","is_superuser":false,"is_staff":false},"post_date":1598338291,"body":"Well this was an awful doujin. I would've not ran out and cried. I'd murder that man and steal her back. For all we know. The MC could be bigger than the mother fucker. So he could've murdered that womanizer and rape his girlfriend back to him. That's how it really ended"},{"id":1170770,"gallery_id":289248,"poster":{"id":775605,"username":"sakuna000","slug":"sakuna000","avatar_url":"avatars/775605.png","is_superuser":false,"is_staff":false},"post_date":1598334219,"body":"I mean ''corrupted''"},{"id":1170768,"gallery_id":289248,"poster":{"id":775605,"username":"sakuna000","slug":"sakuna000","avatar_url":"avatars/775605.png","is_superuser":false,"is_staff":false},"post_date":1598334092,"body":"Sh*t like this is exactly why Japan's birthrate went down. You have to have a corrected mind to even enjoy a trash like this."},{"id":1169037,"gallery_id":289248,"poster":{"id":2854771,"username":"Hunk095","slug":"hunk095","avatar_url":"avatars/2854771.png","is_superuser":false,"is_staff":false},"post_date":1598271970,"body":"Bru the mc can learn about this relationshi´p to dont be an asshole whith his girlfriend and F for the girls she will be suffer because she is only a toy for the other guy plus the situation on her family mmmm a lot of pain for dont have a good time to talk about your troubles. the only winner is the fuck boy......"},{"id":1168882,"gallery_id":289248,"poster":{"id":3343265,"username":"ForsakenPotato","slug":"forsakenpotato","avatar_url":"avatars/3343265.png?_=4d80c9d5cf41ab68","is_superuser":false,"is_staff":false},"post_date":1598264905,"body":"She's a whore and belong to the streets, he's better off without her."},{"id":1167849,"gallery_id":289248,"poster":{"id":3578217,"username":"Lovelykake","slug":"lovelykake","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1598225824,"body":"Wow, I'm not even upset. All FMC in ntr are sluts. He's better off without her. "},{"id":1167169,"gallery_id":289248,"poster":{"id":2572918,"username":"Kon Rori","slug":"kon-rori","avatar_url":"avatars/2572918.png","is_superuser":false,"is_staff":false},"post_date":1598200321,"body":"Ahh, I see ... I need to noted it down so I won't make my girl feel sad ... While she's mine of course, I have no right after she's taken by someone, right ? ... Ahahaha ..."},{"id":1166882,"gallery_id":289248,"poster":{"id":3576716,"username":"Reybars","slug":"reybars","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598188460,"body":"They're already lucky to even have a girlfriend"},{"id":1165648,"gallery_id":289248,"poster":{"id":3445361,"username":"VolareVia","slug":"volarevia","avatar_url":"avatars/3445361.png?_=e9bc193d42ca999d","is_superuser":false,"is_staff":false},"post_date":1598142250,"body":"Still fapped lol i wont resist a good pussy"},{"id":1165645,"gallery_id":289248,"poster":{"id":3445361,"username":"VolareVia","slug":"volarevia","avatar_url":"avatars/3445361.png?_=e9bc193d42ca999d","is_superuser":false,"is_staff":false},"post_date":1598142119,"body":"This wouldn't happen if the bf straight out asked her whats wrong, if the girl just consulted her bf or if we just kill the other guy fuck you all if i have ger ill put the 3 of them in a death loop"},{"id":1164934,"gallery_id":289248,"poster":{"id":3573819,"username":"7quwuwuuw","slug":"7quwuwuuw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598115776,"body":"I just gotta press f for the man"},{"id":1164832,"gallery_id":289248,"poster":{"id":3404965,"username":"Heart Heater","slug":"heart-heater","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598112349,"body":"sad man  i feel bad "},{"id":1164363,"gallery_id":289248,"poster":{"id":2098520,"username":"Legjend","slug":"legjend","avatar_url":"avatars/2098520.png?_=40e96a502b6a3b37","is_superuser":false,"is_staff":false},"post_date":1598094684,"body":"I think what usually makes people dislike NTR is that they try to visualize themselves in the story but they'll relate to the person getting cucked too much and it'll conflict with their own fantasies."},{"id":1164196,"gallery_id":289248,"poster":{"id":3468559,"username":"BootyStank","slug":"bootystank","avatar_url":"avatars/3468559.png?_=fd96df2cfdfe17ff","is_superuser":false,"is_staff":false},"post_date":1598088318,"body":"Both dumb, but its a highschool relationship so it mean trash. My mans young so he doesn't understand shit, but still I blame both of them and a little more on mc. My mans gonna go pro and he will be making money when he become a soccer star while other guy will be selling ass on the streets making petty cash while the girl will become a druggy who whores on the street for cash since she is so easy to be manipulated and controlled. Fuck her and the other guy."},{"id":1163800,"gallery_id":289248,"poster":{"id":1553297,"username":"The Kingslayer","slug":"the-kingslayer","avatar_url":"avatars/1553297.png","is_superuser":false,"is_staff":false},"post_date":1598075014,"body":"@Metroid 2.00  Fucking Imposter. No matter how good it is a fake will never comapare to the Original. Change your name it's a disgrace to Metroid."},{"id":1163537,"gallery_id":289248,"poster":{"id":2283721,"username":"pantzu","slug":"pantzu","avatar_url":"avatars/2283721.png?_=e1277a48ca67415a","is_superuser":false,"is_staff":false},"post_date":1598066096,"body":"@METROID 2.00 you really are a pathetic parasite on this website. do you get off on insulting people that disagree with you from behind your keyboard? is it all the frustration from not having the balls to stand up to your bullies? you act like you're above everyone else here but really you're just trying to distract yourself from your sad pathetic excuse of a life. keep typing away worm, cant wait to see you shoot up a school. "},{"id":1163529,"gallery_id":289248,"poster":{"id":2283721,"username":"pantzu","slug":"pantzu","avatar_url":"avatars/2283721.png?_=e1277a48ca67415a","is_superuser":false,"is_staff":false},"post_date":1598065669,"body":"I dont feel bad for the mc in the slightest, he valued a ball more than his girlfriend, she deserved better. Like seriously man you see her cry and you dont even bother to call? Give me a break, it's all his fault. "},{"id":1163115,"gallery_id":289248,"poster":{"id":3561584,"username":"ggggffff","slug":"ggggffff","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598047781,"body":"I don't like these kinds of hentai but really good art and good scenes"},{"id":1163068,"gallery_id":289248,"poster":{"id":3571197,"username":"Naetsevu","slug":"naetsevu","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598046300,"body":"Highschool relationships don't amount to shit most of the time. He's better off focusing on his soccer. Practice, get good, go pro and make bank. Dude will be loaded and pussy will be jumping at him left and right, while the ex will end up standing on the corner of some shady store while saying \"massagey?\" to every foreigner that walks by."},{"id":1163035,"gallery_id":289248,"poster":{"id":2302446,"username":"cottonm","slug":"cottonm","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598044215,"body":"Yeah she’s a bitch for cheating but if you feel too bad for the mc you’re probably a shitty boyfriend 🤷‍♂️"},{"id":1162827,"gallery_id":289248,"poster":{"id":3430710,"username":"Fakenamelal","slug":"fakenamelal","avatar_url":"avatars/3430710.png?_=4cbe0cecfe4c3fa1","is_superuser":false,"is_staff":false},"post_date":1598036402,"body":"He finna light the whole school up\n"},{"id":1162582,"gallery_id":289248,"poster":{"id":2480859,"username":"Shazamer","slug":"shazamer","avatar_url":"avatars/2480859.png","is_superuser":false,"is_staff":false},"post_date":1598028637,"body":"Pretty fuckin weird how people are mad at the girl but not at the mc lmao. Both are equally dumb but the mc was dumber and insensitive. It was his fault for not noticing his girlfriend's feelings and just focused way too much in his career. But, his hardwork and the other guys hardwork is different. Mc can just move on and learn his lesson and just continue his career and make a living out of it, while the other guy's hardwork is just temporary and it's just the same repetitive shit. Mc can grow more, the other dude is just stuck(not sure) on the same shit. Hope this will be a good lesson for him."},{"id":1162564,"gallery_id":289248,"poster":{"id":3430710,"username":"Fakenamelal","slug":"fakenamelal","avatar_url":"avatars/3430710.png?_=4cbe0cecfe4c3fa1","is_superuser":false,"is_staff":false},"post_date":1598028174,"body":"He should have beat his ass"},{"id":1162525,"gallery_id":289248,"poster":{"id":1998672,"username":"surumeotoko","slug":"surumeotoko","avatar_url":"avatars/1998672.png?_=f80806124869b4f5","is_superuser":false,"is_staff":false},"post_date":1598026984,"body":"Reddit link please"},{"id":1162445,"gallery_id":289248,"poster":{"id":3421234,"username":"Swaraj","slug":"swaraj","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598024263,"body":"Ahhhh cheating without good reason another shit not just little they completely shit on this who is this much stupid to crate this"},{"id":1162413,"gallery_id":289248,"poster":{"id":2214825,"username":"GODDAMN eye penetration","slug":"goddamn-eye-penetration","avatar_url":"avatars/2214825.png?_=7f89b2c1791d01f9","is_superuser":false,"is_staff":false},"post_date":1598023251,"body":"This bitch and mc be tripping"},{"id":1162396,"gallery_id":289248,"poster":{"id":696495,"username":"conscript117","slug":"conscript117","avatar_url":"avatars/696495.png?_=c15333a79568e0f8","is_superuser":false,"is_staff":false},"post_date":1598022542,"body":"I can say that his thought process is correct even if it's wrong..in the way he treated her to win her over... As much as I hate to admit, this has happened...not to me tho, I've never gotten into a serious relationship because of my fear of it..."},{"id":1162236,"gallery_id":289248,"poster":{"id":1895011,"username":"bruh_guy118","slug":"bruh_guy118","avatar_url":"avatars/1895011.png","is_superuser":false,"is_staff":false},"post_date":1598016374,"body":"Fuck this bitch bruh. Just tell the nigga about your mom. I swear bruh bitches be wildin.\nShe belong to the streets"},{"id":1161836,"gallery_id":289248,"poster":{"id":1594722,"username":"Japanzai","slug":"japanzai","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1598001094,"body":"Well mate... What can I say? You choose soccer over your girlfriend. He put a pause on the relationship for what reason? Damn the author wrote the MC naive Your girlfriend cries I front of you and you how it off to go practice? That gigolo looking fucker took advantage, and won.\n\nWill if he focuses on his oh so important soccer he wouldn’t need to worry about finding another."},{"id":1161794,"gallery_id":289248,"poster":{"id":3307884,"username":"Skels","slug":"skels","avatar_url":"avatars/3307884.png?_=78bbeb26e3f5a711","is_superuser":false,"is_staff":false},"post_date":1598000023,"body":"bro focus on your career my dude in 10 years your gonna be a superstar while she gonna be in the streets don't give up your dreams for a slut they gonna break up after that anyways she ain't gonna be happy and her life will be shit find a better girl periodt."},{"id":1161742,"gallery_id":289248,"poster":{"id":1074205,"username":"HentaiFanJoe","slug":"hentaifanjoe","avatar_url":"avatars/1074205.png","is_superuser":false,"is_staff":false},"post_date":1597998482,"body":"She's still a dumb whore whether the MC is shit or not."},{"id":1161431,"gallery_id":289248,"poster":{"id":1211799,"username":"alguienmirando","slug":"alguienmirando","avatar_url":"avatars/1211799.png","is_superuser":false,"is_staff":false},"post_date":1597986846,"body":"Oh well, the boyfriend was a waste of time anyway, didn't care for her, didn't fuck her or anything. Trash.\n\nThe other dude may only want to fuck her and be an asshole, but at least he's an attractive, smart and competent asshole. Girl got a good deal!"},{"id":1161202,"gallery_id":289248,"poster":{"id":3568519,"username":"5spices","slug":"5spices","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597978979,"body":"It's a slice of life folks. Can't deny that. For those who looking for a better outcome: https://www.reddit.com/r/doujinshi/comments/eafnxf/surumenium_taniguchi_daisuke_kimi_no_namida_no/ \n\nP/s: It's too long to post the whole story written by timtaasticsnpg, so I just post a link."},{"id":1161133,"gallery_id":289248,"poster":{"id":2708954,"username":"aizenhux","slug":"aizenhux","avatar_url":"avatars/2708954.png","is_superuser":false,"is_staff":false},"post_date":1597976406,"body":"I kinda relate in a way lol this sucks but its still high quality no doubt "},{"id":1161124,"gallery_id":289248,"poster":{"id":1412004,"username":"onomaxrhsth","slug":"onomaxrhsth","avatar_url":"avatars/1412004.png?_=90f2b34ec0e24b32","is_superuser":false,"is_staff":false},"post_date":1597976129,"body":"That was fun"},{"id":1161112,"gallery_id":289248,"poster":{"id":3563367,"username":"Sellzore8","slug":"sellzore8","avatar_url":"avatars/3563367.png?_=660793adc7a01a17","is_superuser":false,"is_staff":false},"post_date":1597975232,"body":"@METROID 2.00 You know despite how much I enjoy harassing you, I agree with you. People need to realize that these are just fictional stories and to stop sympathizing with the cucked protagonists. "},{"id":1161097,"gallery_id":289248,"poster":{"id":3338118,"username":"AnonMan88","slug":"anonman88","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597974649,"body":"I would rather be a vanillafag than a pathetic incel like you.\n\nBTW, both Steve Jobs and Bill Gates are on the autism spectrum, so I suggest you get a new insult 😁"},{"id":1161077,"gallery_id":289248,"poster":{"id":3407292,"username":"Mito-iinchou","slug":"mito-iinchou","avatar_url":"avatars/3407292.png?_=20f3b344685c1aeb","is_superuser":false,"is_staff":false},"post_date":1597973954,"body":"Lol, the author read too much eroge"},{"id":1161017,"gallery_id":289248,"poster":{"id":747898,"username":"ayami123","slug":"ayami123","avatar_url":"avatars/747898.png?_=cc4978cd112629f7","is_superuser":false,"is_staff":false},"post_date":1597972454,"body":"@MeAndTheBoy\n\nDude they are kids, most of the time these kind of events happen to people who are emotionally poor.\n:D \nyou know people who haven't experience emotion situations :D\nthat's why things like these happen.\n\nit's common than what people think"},{"id":1161008,"gallery_id":289248,"poster":{"id":645718,"username":"Serrakura","slug":"serrakura","avatar_url":"avatars/645718.png","is_superuser":false,"is_staff":false},"post_date":1597971969,"body":"@Karalox i cant find it on reddit, can you give the link?"},{"id":1160963,"gallery_id":289248,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1597970255,"body":"GO PLAY YOUR SOCCER, hahaha that's why if you have gf/wife, you must pay attention to her even a small thing. "},{"id":1160900,"gallery_id":289248,"poster":{"id":2790100,"username":"epicseven","slug":"epicseven","avatar_url":"avatars/2790100.png","is_superuser":false,"is_staff":false},"post_date":1597967124,"body":"A continuation where the girl gets dumped and has no where to go except her former boyfriend?"},{"id":1160824,"gallery_id":289248,"poster":{"id":3366422,"username":"Hen-tai-Lord69","slug":"hen-tai-lord69","avatar_url":"avatars/3366422.png?_=93bc8ae516167ebb","is_superuser":false,"is_staff":false},"post_date":1597963976,"body":"FUCK i like this Story!!!! It's not a supernatural thing in my pants so all women love me immediately, no it's simple real logic how to stretch a woman without any drug or laser or as already written a thing that is so extraordinary that every woman after that first time in love with you, it's simple real logic! I really like that"},{"id":1160806,"gallery_id":289248,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1597963195,"body":"meh... this would only work if the boyfriend is absolutely simp and retarded... and girl is easy than slut, there's many moment where MC can actually get her back such as recording the conversation between how that 3rd dude only want to bang her... also she should know that he's a playboy. There's no way that any right in the head guy would just let they girlfriend cry and don't even attempt to figure that out or girl friend just keep something that important from her boyfriend. The plot is too forced, sex scene and art wasn't that great. I better than generic NTR but still too bad."},{"id":1160798,"gallery_id":289248,"poster":{"id":2232481,"username":"JoG","slug":"jog","avatar_url":"avatars/2232481.png?_=0bce781b6e80766b","is_superuser":false,"is_staff":false},"post_date":1597962673,"body":"@Kalorax Sir I need a link to that pls."},{"id":1160787,"gallery_id":289248,"poster":{"id":1464603,"username":"Lawli","slug":"lawli","avatar_url":"avatars/1464603.png","is_superuser":false,"is_staff":false},"post_date":1597961834,"body":"I can understand why she left and that MC did a booboo but MC is at middle schooler levels of naïvette and the competition is an asshole with brains and balls. I see no chance of winning."},{"id":1160650,"gallery_id":289248,"poster":{"id":3567807,"username":"AraAraOnechan","slug":"araaraonechan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597956769,"body":"This is the first ntr i read just to see why people hate it so much. My heart is completely broken now and i don't know what to do with myself. I'm strictly sticking to vanilla after this shit.\n"},{"id":1160624,"gallery_id":289248,"poster":{"id":2446464,"username":"Udon","slug":"udon","avatar_url":"avatars/2446464.png?_=587cb4b437b4b08b","is_superuser":false,"is_staff":false},"post_date":1597955558,"body":"Hm this is the third time (first after the comment is back) i came here and i want to say that she will regret her decision and i really wish there is a sequel"},{"id":1160349,"gallery_id":289248,"poster":{"id":3560130,"username":"Kalorax","slug":"kalorax","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1597947802,"body":"There is an after story in the reddit for this where the boy becomes a famous footballer and gets a cute girl.. Whereas the girl there was ditched and alone and when she tried to message to congratulate him she found out she was blocked by him..."},{"id":1159843,"gallery_id":289248,"poster":{"id":74597,"username":"saber666","slug":"saber666","avatar_url":"avatars/74597.png?_=1d467a785774b623","is_superuser":false,"is_staff":false},"post_date":1597932320,"body":"I really feel bad for MC and he know his mistakes, but she is wrong too... why she never tell the MC and why she so easily trust a stranger... and now she become a slut and a bitch... she pick wrong person too... Man if there is a sequel, i really a want a redemption when the bitch got thrown out by that playboy chad."},{"id":1159646,"gallery_id":289248,"poster":{"id":3200140,"username":"Skurple","slug":"skurple","avatar_url":"avatars/3200140.png?_=e62c7a8527ec06f1","is_superuser":false,"is_staff":false},"post_date":1597925249,"body":"This is kind sad"},{"id":1146876,"gallery_id":289248,"poster":{"id":2818073,"username":"Monarchh","slug":"monarchh","avatar_url":"avatars/2818073.png?_=f9edca7cb204b7b2","is_superuser":false,"is_staff":false},"post_date":1597463733,"body":"Some good stuff here"},{"id":1146272,"gallery_id":289248,"poster":{"id":2195403,"username":"animangafan342","slug":"animangafan342","avatar_url":"avatars/2195403.png","is_superuser":false,"is_staff":false},"post_date":1597438069,"body":"Yea. When u do a sports team or club, u don't really got time for a relationship. U either already married or u stick to single. One of my senpais from the wrestling team got done dirty like this. He'd been with this girl for 3 years. He went to the college in our town so he could stay with her since she was one grade below him. I'm 2. So he'd graduated but he was still going hard at the gym. Meanwhile, she hooked up with a wrestler from her year from the same grade. Ugly dude and a nobody from the team. So my bro was heartbroken. This happened around 2013. It's 2020 & he's never had another girl since. Man can be tough as nails but a hoe can end up being his weakness. "},{"id":1142966,"gallery_id":289248,"poster":{"id":1312141,"username":"syy","slug":"syy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597314692,"body":"and of course some illegal drugs,and Im taking part as the anonymous witness of the investigation by the police,yeah in the end he was expelled,imprisoned for 1 year and as high school dropout his career is over and since that experience,i'm enjoying sleeping with girl who has a boyfriend"},{"id":1142960,"gallery_id":289248,"poster":{"id":1312141,"username":"syy","slug":"syy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597314442,"body":"just a little story from mine. (sorry for my grammar,english is my 3rd language)I once made a mistake the same as mc did 6 years ago,well in my case is i was too focused to something else but the difference when i got dumped i proactively went out to find the reason. and yes the one who sleep with my gf was my best friend at that time,moreover he has good looking ,good grades and one step to get schoolarship he wanted,perfect personality at the outside but he has twisted personality in the inside same attitude and chara like takizawa .well i did cry back then but i want my revenge bcause i knew that girl is fell in love with him. i gave everything i had to expose his dirty secret,i even bought a drone to tailgate him. after 2 months, 1 week before the announcement of  the students who get the scholarship to overseas,I'm release the kraken, i print 260 photos of his dirty secret including dating 3 girls at the same time,entering the pub/night club, a sex orgy at the rooftop of his house"},{"id":1142836,"gallery_id":289248,"poster":{"id":3421445,"username":"czeai","slug":"czeai","avatar_url":"avatars/3421445.png?_=5c587b6cb8c966ad","is_superuser":false,"is_staff":false},"post_date":1597309076,"body":"Take this as a life lesson ma bois "},{"id":1142781,"gallery_id":289248,"poster":{"id":3421445,"username":"czeai","slug":"czeai","avatar_url":"avatars/3421445.png?_=5c587b6cb8c966ad","is_superuser":false,"is_staff":false},"post_date":1597306937,"body":"Oof I forgot +20 points to the mc for realizing his mistakes, you don’t see that often"},{"id":1142757,"gallery_id":289248,"poster":{"id":3421445,"username":"czeai","slug":"czeai","avatar_url":"avatars/3421445.png?_=5c587b6cb8c966ad","is_superuser":false,"is_staff":false},"post_date":1597306275,"body":"Bruh lmao, so the bf should’ve dig deeper into why she was sad, so there’s like -2 points for the mc. Although why the fuck would you rather tell a fucking playboy that your mother died and let the mans fuck the same night instead of telling ur fucking boyfriend who you could’ve easily asked for comfort.  -69 points for the dumb slut (I know she’s seen that nigga groping 2 bitches at once)  As much as I hate to say it +99 points for the mf playboy. Big brain plays all day. "},{"id":1140421,"gallery_id":289248,"poster":{"id":3428324,"username":"yashiii","slug":"yashiii","avatar_url":"avatars/3428324.png?_=8cd907c3a309cde9","is_superuser":false,"is_staff":false},"post_date":1597222137,"body":"I think of this as a good doujin cuz this shit can happen to anyone like getting carried away with\nsex not even your feelings well it hurts to read this shit but i think this is good for other people who experienced this kind of shit"},{"id":1139071,"gallery_id":289248,"poster":{"id":1800705,"username":"SCP-49","slug":"scp-49","avatar_url":"avatars/1800705.png?_=2457c9c46ce83aab","is_superuser":false,"is_staff":false},"post_date":1597168345,"body":"This one hurts. I had the same circumstances so I know what and how the dude feels. If only she told me at first..."},{"id":1138920,"gallery_id":289248,"poster":{"id":107852,"username":"darkpussyslayer","slug":"darkpussyslayer","avatar_url":"avatars/107852.png?_=ffb572bba74c062f","is_superuser":false,"is_staff":false},"post_date":1597162656,"body":"I like it because the MC realized that it's partly his fault that his girlfriend left him."},{"id":1137593,"gallery_id":289248,"poster":{"id":2918315,"username":"GotMegaMilk","slug":"gotmegamilk","avatar_url":"avatars/2918315.png?_=2d00ef1fe84657c2","is_superuser":false,"is_staff":false},"post_date":1597111826,"body":"Good shit, love it"},{"id":1133912,"gallery_id":289248,"poster":{"id":3454009,"username":"fataztroll_yt","slug":"fataztroll_yt","avatar_url":"avatars/3454009.png?_=b429788a02ee5410","is_superuser":false,"is_staff":false},"post_date":1596963271,"body":"This needs to burn in fire"},{"id":1133513,"gallery_id":289248,"poster":{"id":3530448,"username":"Von Stroheim","slug":"von-stroheim","avatar_url":"avatars/3530448.png?_=7a4e574acce9f6e1","is_superuser":false,"is_staff":false},"post_date":1596948709,"body":"Imagine being raised essentially by your parents, then by your single mother n afterwards just to be lived as f*ck toy for the playboy chad...what a great day for the fmc😯"},{"id":1130976,"gallery_id":289248,"poster":{"id":2914867,"username":"plasmaflame","slug":"plasmaflame","avatar_url":"avatars/2914867.png","is_superuser":false,"is_staff":false},"post_date":1596851882,"body":"If the Artist needs an idea that isn’t NTR maybe they could make a sequel about redemption "},{"id":1130970,"gallery_id":289248,"poster":{"id":2914867,"username":"plasmaflame","slug":"plasmaflame","avatar_url":"avatars/2914867.png","is_superuser":false,"is_staff":false},"post_date":1596851539,"body":"I genuinely believe that shou ( the guy who got cucked) would have cared about her troubles over soccer  it is just he never pressed about it. I think this story would have panned out differently if she told home her parent had died or if he pressed and consulted her"},{"id":1125790,"gallery_id":289248,"poster":{"id":4049,"username":"qohank","slug":"qohank","avatar_url":"avatars/4049.png?_=79837ed153a5ed25","is_superuser":false,"is_staff":false},"post_date":1596639697,"body":"Is it just me or NTR genre has a lot more comments than other genre."},{"id":1124677,"gallery_id":289248,"poster":{"id":144324,"username":"ofan1908","slug":"ofan1908","avatar_url":"avatars/144324.png?_=b1e280257b6c1e4e","is_superuser":false,"is_staff":false},"post_date":1596586927,"body":"Does this classified as NTR? Isn't it the proper way to get a girl? By paying attention to her troubles?\n\nBecause I just pulled of this shit some years ago."},{"id":1122645,"gallery_id":289248,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1596494731,"body":"This story has meaning to it,  she should had told her boyfriend wtf happen with her mom, he would have consoled her reguardless of soccer, but since this is Ntr they needed the what we Alpha dogs called \"the in\". Chad befriends her and got her to tell him things the boyfriend should know, gets her guard down and fucks her. She just a slut now, to just get fucked when he in the mood....stupid bitch"},{"id":1122109,"gallery_id":289248,"poster":{"id":3514013,"username":"no1vanillafag","slug":"no1vanillafag","avatar_url":"avatars/3514013.png?_=5e91f1282d4b0dc6","is_superuser":false,"is_staff":false},"post_date":1596474109,"body":"This shit is fuckin sad but I went to the comments and I remembered to keep my head up. But what kinda bitch fucks a dude on the first day right after her parents fucking died?? Thought I was gonna fap to some hot big ass hentai but this shit just turned me off. So yeah keep your head up kings. This shit is just another bump in the road. And for the niggas calling us incels, you guys play with your chodes while self-inserting your ugly asses into scumbags that you’ll never be in real life."},{"id":1119482,"gallery_id":289248,"poster":{"id":1576024,"username":"luekely","slug":"luekely","avatar_url":"avatars/1576024.png?_=caa530e06ce9b87a","is_superuser":false,"is_staff":false},"post_date":1596378711,"body":"@Chronius404 Hey King, you dropped this 👉👑"},{"id":1118738,"gallery_id":289248,"poster":{"id":1819493,"username":"Chronius404","slug":"chronius404","avatar_url":"avatars/1819493.png?_=3e72f4053e4a2a22","is_superuser":false,"is_staff":false},"post_date":1596348081,"body":"DON'T TAKE THIS SERIOUSLY BROTHER 😎✌️, KEEP YOUR HEADS UP AND DON'T LET THIS TAKE OVER YOUR HEAD\n\nTAKE WHAT COULD BE TAKE FROM THE STORY AND IMPLEMENT IT TO YOUR LIFE\n\nNEVER GIVE UP KING 😎✌️"},{"id":1118656,"gallery_id":289248,"poster":{"id":1800930,"username":"subarulife","slug":"subarulife","avatar_url":"avatars/1800930.png?_=9e16bfbd7fbe893c","is_superuser":false,"is_staff":false},"post_date":1596343732,"body":"Keep your head up kings it's just a story to tilt our crowns always keep your head up."},{"id":1115031,"gallery_id":289248,"poster":{"id":3444939,"username":"dedsecking1","slug":"dedsecking1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596186489,"body":"This teaches us a lesson first off pay attention to your girl and second off its okay to be selfish and talk you partner about your shit and third fight for your love ñígga that fool may be a chad but damn it hes a fucked up one"},{"id":1115023,"gallery_id":289248,"poster":{"id":3444939,"username":"dedsecking1","slug":"dedsecking1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596186284,"body":"This teaches us a lesson first off pay attention to your girl and second off its okay to be selfish and talk you partner about your shit and third fight for your love ñígga that fool may be a chad but damn it hes a fucked up one"},{"id":1113504,"gallery_id":289248,"poster":{"id":3393222,"username":"smilegaming","slug":"smilegaming","avatar_url":"avatars/3393222.png?_=75031ece0db50949","is_superuser":false,"is_staff":false},"post_date":1596120315,"body":"To be honest, the playboy has talent of manipulating girls anyway( as we all see the picture of those girls so happy being creampied).Both the MC and heroin cannot win over him except trusting each other. But as Thanos said: \" Reality is often disappointing\".\nEdit: I was dumb"},{"id":1111356,"gallery_id":289248,"poster":{"id":2743996,"username":"@doujin.heaven on ig","slug":"doujin-heaven-on-ig","avatar_url":"avatars/2743996.png?_=3469d3105c3ec48a","is_superuser":false,"is_staff":false},"post_date":1596053354,"body":"This guy beneath me spitting some facts"},{"id":1111252,"gallery_id":289248,"poster":{"id":3499241,"username":"RadiantAether","slug":"radiantaether","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596048791,"body":"If you think about it. It teach us a leason how to avoid Ntr irl 😃"},{"id":1110472,"gallery_id":289248,"poster":{"id":3444939,"username":"dedsecking1","slug":"dedsecking1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596016698,"body":"@chink0n you genius fucking love it love the life sucks part"},{"id":1106034,"gallery_id":289248,"poster":{"id":2300348,"username":"lolislaya791 (HACKED)","slug":"lolislaya791-hacked","avatar_url":"avatars/2300348.png?_=b02d666173dd55a8","is_superuser":false,"is_staff":false},"post_date":1595834199,"body":"rarely get to see a fairplayed ntr hentai like this. glad i did "},{"id":1105811,"gallery_id":289248,"poster":{"id":3291363,"username":"macocute","slug":"macocute","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595826602,"body":"no part 2?"},{"id":1103046,"gallery_id":289248,"poster":{"id":2492878,"username":"weidenfeller","slug":"weidenfeller","avatar_url":"avatars/2492878.png?_=974e29a10785b192","is_superuser":false,"is_staff":false},"post_date":1595737969,"body":"Takizawa my man, true womanizer"},{"id":1100675,"gallery_id":289248,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1595647063,"body":"This is why NTR stories like these are always fetishes and nothing more. If you give it just 10% of real-life reasoning, then the story breaks and makes no logical sense to a point when you start to realize that this is made solely to get the readers jealous/angry/feel negatively. And lastly, ladies and gents, that is what NTR is all about. So, even if you felt some of that \"injustice\", then this author is happy to know that he succeded in making you, the reader, to \"enjoy\" his work."},{"id":1100446,"gallery_id":289248,"poster":{"id":3485383,"username":"slvpff","slug":"slvpff","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595635226,"body":"Nay the MC wasnt in the wrong, the girl herself didnt even try to say her problems to the MC as to try \"to be considerate of the MC's dream\" but got swayed by the fuckboy and said that the MC didn't care for her? She was the one who kept silent about it and played the victim wtf. The MCs better off without the girl and he shouldn't have felt sorry for what happened"},{"id":1098435,"gallery_id":289248,"poster":{"id":2512306,"username":"Venom43","slug":"venom43","avatar_url":"avatars/2512306.png?_=74837c7c24ddeb2f","is_superuser":false,"is_staff":false},"post_date":1595555191,"body":"That guy who fucked futaba is care about her as well than MC it was like a reality, when you have an girlfriend and having carrier too you must had a choice between them so then you choose your carrier than her while she needs together with you so, don't blame her if she was cheating on you and looking better than you, Blame yourself to think about what you did before, that was I learn from this doujin "},{"id":1095961,"gallery_id":289248,"poster":{"id":3337592,"username":"Ralliart98","slug":"ralliart98","avatar_url":"avatars/3337592.png?_=f8a27a2fb7a6125f","is_superuser":false,"is_staff":false},"post_date":1595461443,"body":"Issue with the MC is that he dedicated too much time for his own interests without dedicating time for his Girl. And even when he knew something was wrong and clearly saw Futaba crying he didn’t act on it, Takizawa the other hand was easily able to recognize from the word Futaba muttered that something must’ve happened within her family. Takizawa went above and beyond to make her happy (even if his reasoning behind it was purely for sex). Takizawa let Futaba explain the issues she’s been dealing with and made her more comfortable with him than the MC, who was too interested in his own goals to the point of pushing away his girlfriend."},{"id":1085236,"gallery_id":289248,"poster":{"id":3452311,"username":"pickle_rick_6666","slug":"pickle_rick_6666","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595040989,"body":"I personally don't like ntr and I hate it but I can appreciate it like this story it's really good and how everything was setup "},{"id":1085003,"gallery_id":289248,"poster":{"id":3109637,"username":"heroes618","slug":"heroes618","avatar_url":"avatars/3109637.png?_=bbb455462e3ab380","is_superuser":false,"is_staff":false},"post_date":1595032624,"body":"A good dilemma story, that makes you think maybe mr chad wasn't completely wrong there. The mc could have done better to noticed something is wrong about his girlfriend. At the same time why was she hiding something so important to her boyfriend(shou), and if she really cared about Shou then Sheating on him just means she really doesn't give a damn about him. In conclusion I really enjoyed the story, and mr chad here can truly giving us weebs here some advice about about being a chad"},{"id":1083532,"gallery_id":289248,"poster":{"id":2142803,"username":"your deadman","slug":"your-deadman","avatar_url":"avatars/2142803.png","is_superuser":false,"is_staff":false},"post_date":1594976179,"body":"don't fap to shit w/ ntr in it so i was just reading this for the plot, and yeah everyone in this except the mc can fuck off. Pimp is obviously a shit person and chick is also kinda shitty since she chose to rely on another dude instead of just talking to her bf."},{"id":1082235,"gallery_id":289248,"poster":{"id":3460029,"username":"Mr. Blood","slug":"mr-blood","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594920956,"body":"Does it have continuation? "},{"id":1080863,"gallery_id":289248,"poster":{"id":3118320,"username":"PrinceOzel","slug":"princeozel","avatar_url":"avatars/3118320.png?_=ca374de371205fb5","is_superuser":false,"is_staff":false},"post_date":1594863909,"body":"Yeah... honestly its a good story...it make sense thanks to the people who give their opinions and stuff..but damn man... what should i do now...? who can enjoy this... im certain most of the reader didn't get the right feeling from reading such a doujin...i am conflicted."},{"id":1080796,"gallery_id":289248,"poster":{"id":1699643,"username":"Gley","slug":"gley","avatar_url":"avatars/1699643.png?_=d59deb26456b7a3c","is_superuser":false,"is_staff":false},"post_date":1594860123,"body":"There's no reason to blame the MC, I mean, Imagine if this was in real life, what would be best: reaching your goal or throwing away your dream because of a girl?"},{"id":1080523,"gallery_id":289248,"poster":{"id":2681344,"username":"eren_jizzer","slug":"eren_jizzer","avatar_url":"avatars/2681344.png?_=b41e2ee32c1bd5cd","is_superuser":false,"is_staff":false},"post_date":1594847292,"body":"for some reason i don't feel bad at all i mean MC's so clueless and probably FMC would have a breakdown if Takizawa wasn't there... welp that's why he shouldn't have focused on a single goal"},{"id":1079479,"gallery_id":289248,"poster":{"id":3455899,"username":"sorachin23","slug":"sorachin23","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594799897,"body":"NGL i hate ntr, but this one is special due to the people in the comments section trying to tell what happened, what should've been done, and what they deserved. if only doujins like these have the same kind of people in the comments."},{"id":1077793,"gallery_id":289248,"poster":{"id":2269564,"username":"DirtyMud101","slug":"dirtymud101","avatar_url":"avatars/2269564.png?_=3c643cfb11a6df0a","is_superuser":false,"is_staff":false},"post_date":1594723205,"body":"Day 1 - I felt bad for nutting "},{"id":1077555,"gallery_id":289248,"poster":{"id":708813,"username":"ardipahlawan88","slug":"ardipahlawan88","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594713803,"body":"yeah NTR always with unfairness and so boring"},{"id":1077509,"gallery_id":289248,"poster":{"id":1577502,"username":"psychobratt","slug":"psychobratt","avatar_url":"avatars/1577502.png?_=d1b57c19251e30d0","is_superuser":false,"is_staff":false},"post_date":1594712228,"body":"The amount of incels in these comments ,,,, lmfao"},{"id":1073993,"gallery_id":289248,"poster":{"id":3439050,"username":"pettam2.0ㅤ","slug":"pettam2-0","avatar_url":"avatars/3439050.png?_=f505341ef5ad9fb6","is_superuser":false,"is_staff":false},"post_date":1594561885,"body":"@hustlers13 Spoken like a true vanillafag at heart who will stay  a beta virgin until the day he dies. Good job."},{"id":1072949,"gallery_id":289248,"poster":{"id":2768590,"username":"hustlers13","slug":"hustlers13","avatar_url":"avatars/2768590.png?_=3fbd0fbd5b6a1503","is_superuser":false,"is_staff":false},"post_date":1594526282,"body":"If i will put my shoes in shou, i would thank takizawa for stealing my girl, because of him he bring out the real nature of the girl, cause i will know that the girl is not really for me, shes not down for me y'know what im saying?, What i will do is just focus on playing soccer until i become the top 1 on the league, if i come out on the top the girls will come automatically, cause you can always find girl with huge racks or you can find a hot dude stealing other people's girl but you cant always find a guy who becomes successful"},{"id":1072315,"gallery_id":289248,"poster":{"id":3444939,"username":"dedsecking1","slug":"dedsecking1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594498215,"body":"There one word for the mc is that dumbass"},{"id":1072307,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1594497744,"body":"Shou even clearly asked if something is wrong, but that bitch just kept it from him. What do you expect him to be? A mind reader? If you have a problem you're dealing with right now, it's best to open up to your boyfriend and he'll understand, but no, she just kept it to herself and was manipulated by a playboy who'll dump her once he's bored. I would've agreed that Shou was to blame but even he himself sensed there is something wrong, she just didn't open up to him."},{"id":1071643,"gallery_id":289248,"poster":{"id":3443987,"username":"zapamarcos","slug":"zapamarcos","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594472943,"body":"The MC wasn't really at fault in this case, given that he already communicated his intent on focusing on his budding career as an amateur soccer player. While the MC was merely being gullible and his girlfriend far too shocked to even build anything resembling rational choice, the blame was all on the chad. Sure, he might shown that he 'cares' for Futaba, but what else? In the end he was a manipulative prick, nothing more than that. If I was the MC, I'd rather fight the asshole rather than being stomped to the ground just like that."},{"id":1070701,"gallery_id":289248,"poster":{"id":2981489,"username":"IceIceIceBaby69","slug":"iceiceicebaby69","avatar_url":"avatars/2981489.png?_=266f5d25279b2893","is_superuser":false,"is_staff":false},"post_date":1594441261,"body":"Gotta respect the dudes skillset the best way to a womans heart is through her stomach "},{"id":1069590,"gallery_id":289248,"poster":{"id":3441468,"username":"Degenerate112","slug":"degenerate112","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594399675,"body":"@Altazumith here is the thing. in the actual relationship, you need to balanced your personal goal, hobby, whatever the fuck you want to do and your RELATIONSHIP with loved one. the lack of intention can easily lead to a breaking up or cheating really fast. the dude fucking say \"oh i want to focus on soccer\" and doing so without a single fuck gives to his actual girlfriend when she clearly in a shock and say \"mom\". not even a word of \"hey what's wrong? you can talk and tell me. i'm here for you\" not to mentioned. he doing so for a fucking whole month. A MONTH, yeah it might seems to not long right, for someone that presumably have only her mom to rely on a whole month feels like a whole fucking years.\n\ni'm sorry to say this, but if anyone in the relationship solely focus on something they wants to do without giving a fuck to manage their relationship properly, that person have that coming for them. not that i'm saying NTR is good tho."},{"id":1068962,"gallery_id":289248,"poster":{"id":1550755,"username":"DixieNormous","slug":"dixienormous","avatar_url":"avatars/1550755.png?_=81365efde5fedc7b","is_superuser":false,"is_staff":false},"post_date":1594374874,"body":"this is one of the best NTR unlike blackmail/rape NTR this one is more impactful where it's realistic if a chad steals your girlfriend instead of a fat guy stealing your girlfriend"},{"id":1068206,"gallery_id":289248,"poster":{"id":3439601,"username":"chink0n","slug":"chink0n","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594350047,"body":"Then after 10 years, Futaba saw Shou in tv became a soccer superstar and Takizawa ignored futaba after many sex. Futaba's mom died, became pregnant , she was in debt, she didn't finished school, no jobplace is accepting her. One day, Shou and Futaba met accidentaly, Futaba was really ashamed of what she did and tried to apologize but Shou didn't lend her an ear. She forgot that his contact number is still in her phone, she tried to call Shou many times but not answering. After a while, Shou was doing a fan meet and greet and Futaba went there expecting Shou would talk to her, after the event, she ran towards Shou and hugged him then a woman's voice called Shou's name and said \"Darling we have to go to our son's schoolplay\". Futaba let go of Shou and was shocked hearing that. Then Shou whispered to Futaba \"Life sucks huh\""},{"id":1068130,"gallery_id":289248,"poster":{"id":2431368,"username":"Altazimuth","slug":"altazimuth","avatar_url":"avatars/2431368.png","is_superuser":false,"is_staff":false},"post_date":1594348196,"body":"@IncestLover_FuckALLShotaDIE! \"Guess is was the boyfriend's fault\"\nYou stupid or something? The man was trying to follow his dreams, the girl refused to come to him when something sad happened, the went with another man for some dick. Meanwhile, the dude she went with was just manipulating her for her puss puss from the start and took advantage of the sitch. The girl is a whore, and the other dude is a scumbag, both are beneath contempt. It wasn't MC dude's fault."},{"id":1066512,"gallery_id":289248,"poster":{"id":3274599,"username":"IncestLover_FuckALLShotaDIE!","slug":"incestlover_fuckallshotadie","avatar_url":"avatars/3274599.png?_=b2cb4a38f63c787d","is_superuser":false,"is_staff":false},"post_date":1594298230,"body":"lol how can you guys beg for ''no ntr'' ''why does NTR exist'' when you are on a hentai site"},{"id":1066506,"gallery_id":289248,"poster":{"id":3274599,"username":"IncestLover_FuckALLShotaDIE!","slug":"incestlover_fuckallshotadie","avatar_url":"avatars/3274599.png?_=b2cb4a38f63c787d","is_superuser":false,"is_staff":false},"post_date":1594298003,"body":"Guess is was the boyfriend's fault, You can enjoy this but you really cant fap to it you just cant"},{"id":1066311,"gallery_id":289248,"poster":{"id":3269748,"username":"QooP","slug":"qoop","avatar_url":"avatars/3269748.png?_=83bb571978a97d80","is_superuser":false,"is_staff":false},"post_date":1594288772,"body":"Shit, no fap today. Im done with this "},{"id":1065404,"gallery_id":289248,"poster":{"id":3436466,"username":"Wizardguy68","slug":"wizardguy68","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594260391,"body":"How many cry-babies in this comment section, at the end the cuckold did realize that he was the one who made the mistake and you fools should stop idealizing relationships, there are many like that one. If that happen to you, deal with the feelings and keep going and never forget Women aren't alone, they're picky "},{"id":1065031,"gallery_id":289248,"poster":{"id":3165105,"username":"MoistHaru","slug":"moistharu","avatar_url":"avatars/3165105.png?_=e7a163f5f50fc40a","is_superuser":false,"is_staff":false},"post_date":1594247295,"body":"Damn although i love ntr, i hate this one "},{"id":1064754,"gallery_id":289248,"poster":{"id":3435681,"username":"sadboy88","slug":"sadboy88","avatar_url":"avatars/3435681.png?_=d26612f91f3480f0","is_superuser":false,"is_staff":false},"post_date":1594237801,"body":"Met a girl 1year ago we have a good conversation. she's younger than me 2 years for me she's like an angel I like her so much that Im so excited that I want to tell my mom about her until we talk about her ex bf  I dunno what she up to and she has a freakin best friend  and she told me that she send some nude pictures to him that's why they broke up  and his ex bf talk trash about her and that time I was there with her I totally respect her I don't want to see her nude photos. but she insists to send it to me at that time I dont know what to do in that situation anymore so I started playing some sport to forget about that play vball that time. I didn't send her messages because of how busy training for the team and school our team made it to the championship I wanted to see her but pride got me then our team won in the tournament so our game is over so we gona watch the girls vball game then I saw her with that guy I don't know anymore At first got the victory but realized total defeat"},{"id":1064641,"gallery_id":289248,"poster":{"id":2761470,"username":"ulquiorra_no4","slug":"ulquiorra_no4","avatar_url":"avatars/2761470.png","is_superuser":false,"is_staff":false},"post_date":1594233123,"body":"GodLevel  NTR alert"},{"id":1064542,"gallery_id":289248,"poster":{"id":3402974,"username":"LowDeath","slug":"lowdeath","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594229923,"body":"she deserves this  little bitch \nshe forgets about her mom either\nshe no worth shou \n"},{"id":1064383,"gallery_id":289248,"poster":{"id":3435194,"username":"IFuckingHateNtr","slug":"ifuckinghatentr","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594224146,"body":"Press f to forget. Fuck"},{"id":1064368,"gallery_id":289248,"poster":{"id":3096136,"username":"albedosama","slug":"albedosama","avatar_url":"avatars/3096136.png","is_superuser":false,"is_staff":false},"post_date":1594223730,"body":"I CAME HERE TO FAP NOT TO CRY"},{"id":1064113,"gallery_id":289248,"poster":{"id":3434823,"username":"kazumasenpai","slug":"kazumasenpai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594215833,"body":"I came here so i can be happy and left the real world but even here it's depressing "},{"id":1063476,"gallery_id":289248,"poster":{"id":3426256,"username":"shigeo kageyama","slug":"shigeo-kageyama","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594191655,"body":"I dont know about the artist but please dont make any of these cheating hentai please i beg you i was depresed when i read this...cause ive suffereng from that feeling few months ago when my girlfried broke up with me... i was gonna kill myself when i realize that life is important."},{"id":1062047,"gallery_id":289248,"poster":{"id":3416400,"username":"IHateNtR","slug":"ihatentr","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594146371,"body":"Someday i will be a manga artist and i will change all the ugly bastard men and every bad ending of hentai.\n\nBy the way IHateNtR"},{"id":1061445,"gallery_id":289248,"poster":{"id":3210917,"username":"FerdHs","slug":"ferdhs","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594127242,"body":"Bro What the f*ck,Why did you make it this way I feel bad now,I want to be a criminal\n"},{"id":1060298,"gallery_id":289248,"poster":{"id":3050489,"username":"barack obama","slug":"barack-obama","avatar_url":"avatars/3050489.png?_=c686011f7bf7db26","is_superuser":false,"is_staff":false},"post_date":1594091279,"body":"@Zerobero12 damn bro, feel bad for you 😔😔✊✊"},{"id":1059657,"gallery_id":289248,"poster":{"id":1594155,"username":"Hentong Boi","slug":"hentong-boi","avatar_url":"avatars/1594155.png","is_superuser":false,"is_staff":false},"post_date":1594065995,"body":"Lesso I Learn After read this code: Be Better Carefully Open heart Boyfriend "},{"id":1059363,"gallery_id":289248,"poster":{"id":2804064,"username":"autozawey","slug":"autozawey","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594056003,"body":"If you like them cock.Just stay with them.If you can't wait just break up.Go fucked yourself with trash cock."},{"id":1058667,"gallery_id":289248,"poster":{"id":451328,"username":"BennyTay","slug":"bennytay","avatar_url":"avatars/451328.png","is_superuser":false,"is_staff":false},"post_date":1594032709,"body":"This makes me horny as fck ... as well as angry somehow even though I'm a fan of NTR ..."},{"id":1058303,"gallery_id":289248,"poster":{"id":1510893,"username":"polijoligon","slug":"polijoligon","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594021440,"body":"comments are back and the debaters also returned...."},{"id":1057730,"gallery_id":289248,"poster":{"id":2479433,"username":"YangisDead","slug":"yangisdead","avatar_url":"avatars/2479433.png?_=c158e8cbe8e79452","is_superuser":false,"is_staff":false},"post_date":1594008533,"body":"Anyway, the girl doesn't even care about her mom anymore, does she? What a hor"},{"id":1057722,"gallery_id":289248,"poster":{"id":2479433,"username":"YangisDead","slug":"yangisdead","avatar_url":"avatars/2479433.png?_=c158e8cbe8e79452","is_superuser":false,"is_staff":false},"post_date":1594008395,"body":"@Zerobero12 damn man, that was sad. This might hurt you to read, didn't it? Hoping you for the best bro"},{"id":1057713,"gallery_id":289248,"poster":{"id":2479433,"username":"YangisDead","slug":"yangisdead","avatar_url":"avatars/2479433.png?_=c158e8cbe8e79452","is_superuser":false,"is_staff":false},"post_date":1594008271,"body":"@Euphorism dude you're making me feel better. As one would expect from a person with a Euphoria profile picture. "},{"id":1057160,"gallery_id":289248,"poster":{"id":3371255,"username":"atleast Satan supports me","slug":"atleast-satan-supports-me","avatar_url":"avatars/3371255.png?_=e06d9d358f40a866","is_superuser":false,"is_staff":false},"post_date":1593988358,"body":"Ok, the girl's probably gonna get tossed when she becomes too clingy. He probably should just focus on his career if he just wants to one- up a dude to impress a girl who he is already dating that only needs his time and affection. "},{"id":1054813,"gallery_id":289248,"poster":{"id":1985154,"username":"zucc zucc zucc","slug":"zucc-zucc-zucc","avatar_url":"avatars/1985154.png?_=0baafdb922621e2e","is_superuser":false,"is_staff":false},"post_date":1593891851,"body":"Soccer boy was cuter ngl"},{"id":1051809,"gallery_id":289248,"poster":{"id":3409585,"username":"riothegreat","slug":"riothegreat","avatar_url":"avatars/3409585.png?_=71d129d066b75f02","is_superuser":false,"is_staff":false},"post_date":1593772101,"body":"Ahhhh shit this doujin is so perfect but it gives me little bit depression."},{"id":1051755,"gallery_id":289248,"poster":{"id":3209768,"username":"exknight","slug":"exknight","avatar_url":"avatars/3209768.png?_=aa4d2431547da17f","is_superuser":false,"is_staff":false},"post_date":1593770059,"body":"I must say it's a win-win situation for the fuckboy and the coward boy, about the woman? Well she just fucked her life up"},{"id":1051427,"gallery_id":289248,"poster":{"id":1794081,"username":"Morpheuseus","slug":"morpheuseus","avatar_url":"avatars/1794081.png?_=47a21bb119b4d06c","is_superuser":false,"is_staff":false},"post_date":1593758043,"body":"Anyway,F for whoever have the same experience as this.😂Dont worry boys,there is always a better one for you."},{"id":1051422,"gallery_id":289248,"poster":{"id":1794081,"username":"Morpheuseus","slug":"morpheuseus","avatar_url":"avatars/1794081.png?_=47a21bb119b4d06c","is_superuser":false,"is_staff":false},"post_date":1593757763,"body":"This can be related in real life.Same thing happen with my first ex before,hard to move on because she is my first love and all.Also,same as this,she cheat on me with some douche and i had a hard time to move on from her for 1 yrs."},{"id":1051379,"gallery_id":289248,"poster":{"id":1633393,"username":"IV","slug":"iv","avatar_url":"avatars/1633393.png?_=1c13ef6cdfa2d493","is_superuser":false,"is_staff":false},"post_date":1593756345,"body":"I need a part 2 for the girl to get pregnant and the guy leaving her, then to see her ex moving on. That will really teach these girls with issues"},{"id":1051343,"gallery_id":289248,"poster":{"id":477004,"username":"FresshLikeLettuce","slug":"fresshlikelettuce","avatar_url":"avatars/477004.png","is_superuser":false,"is_staff":false},"post_date":1593754809,"body":"well the only one here with poor character development was the girl  , the playboy did pretty well his work investing time and plots to reach the girl,the cucked boyfriend also got good growth at the end  accepting that he  didnt noticed his GF  was stepping away from him and he did well accepting what was happening and not cling to her, and the GF well just cause the BF said that he wanted to focus in soccer for a month  She chose to rely in another guy  instead his BF and instead of BREAKING with him  once she realized that she was in love with the playboy she continued  fucking with the playboy, oh well seeing   the character growth of the 3 of them.\n1-PLAYBOY will throw the girl aside once he is tired of her after all he didnt loved her in the first place he only wanted to fuck the girl of his classmate.\n2-CUCKED BF  will probly succed in his soccer career and  marry  a better girl  and live a luxury life while sometimes  recalling that he lost a girl cause he didnt  took care well"},{"id":1051156,"gallery_id":289248,"poster":{"id":3401354,"username":"toryoki","slug":"toryoki","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593747294,"body":"Fuck me panel 89 is amazing"},{"id":1051039,"gallery_id":289248,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1593742900,"body":"Well, the truth of the matter is that these kids are too naive and seriously lack adults in their life that bring them back to reason. In the long run, the main boy advanced his soccer career and ended up dodging a girl with issues. Girl is fucked over and will probably get pregnant and the player has to pray the girl doesn't involve him later on."},{"id":1048956,"gallery_id":289248,"poster":{"id":2479433,"username":"YangisDead","slug":"yangisdead","avatar_url":"avatars/2479433.png?_=c158e8cbe8e79452","is_superuser":false,"is_staff":false},"post_date":1593653527,"body":"Having an ugly and distorted face is the fittest punishment he deserves since not a single girl is gonna willing to fuck him anymore. Castration is a good option too"},{"id":1048925,"gallery_id":289248,"poster":{"id":2479433,"username":"YangisDead","slug":"yangisdead","avatar_url":"avatars/2479433.png?_=c158e8cbe8e79452","is_superuser":false,"is_staff":false},"post_date":1593652438,"body":"The dude should've pulled an Ishigami move, at least I want to see the fuckboy's face all beaten up. Fuck the girl anyway"},{"id":1048875,"gallery_id":289248,"poster":{"id":3409444,"username":"plllzno","slug":"plllzno","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593650444,"body":"Also shou man up and kill him"},{"id":1048843,"gallery_id":289248,"poster":{"id":3409444,"username":"plllzno","slug":"plllzno","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593649254,"body":"In the end she finds out she got used and kills her self probs"},{"id":1046678,"gallery_id":289248,"poster":{"id":3370370,"username":"iketor151","slug":"iketor151","avatar_url":"avatars/3370370.png?_=2d09a11d285a5678","is_superuser":false,"is_staff":false},"post_date":1593567375,"body":"@deadfish. True af "},{"id":1045904,"gallery_id":289248,"poster":{"id":1907072,"username":"orgasmaniac","slug":"orgasmaniac","avatar_url":"avatars/1907072.png","is_superuser":false,"is_staff":false},"post_date":1593537842,"body":"@deadfish 100% agreed."},{"id":1040984,"gallery_id":289248,"poster":{"id":3292513,"username":"ristarte","slug":"ristarte","avatar_url":"avatars/3292513.png?_=b16966751a203aa9","is_superuser":false,"is_staff":false},"post_date":1593361322,"body":"@kellypearlx lol"},{"id":1039463,"gallery_id":289248,"poster":{"id":3142544,"username":"Deadfish","slug":"deadfish","avatar_url":"avatars/3142544.png","is_superuser":false,"is_staff":false},"post_date":1593300315,"body":"This is the only doujin i am rooting the fuckboy. Unlike other stupid cuck who only use his dick, this dude here really did an effort to get what he want. "},{"id":1037906,"gallery_id":289248,"poster":{"id":3209445,"username":"aslongastheartisgood1007","slug":"aslongastheartisgood1007","avatar_url":"avatars/3209445.png","is_superuser":false,"is_staff":false},"post_date":1593239248,"body":"Hm, good art and its full colored, nice"},{"id":1034264,"gallery_id":289248,"poster":{"id":2386466,"username":"uglybastardd","slug":"uglybastardd","avatar_url":"avatars/2386466.png?_=044c846e15479a7a","is_superuser":false,"is_staff":false},"post_date":1593100779,"body":"saat pacar cowonya tanya ke cewenya ada apa tpi jwbnya \"gpp\", giliran fakboi yg tanyain langsung dijawab, cewe Lonte:v"},{"id":1031543,"gallery_id":289248,"poster":{"id":1911399,"username":"C. I. A","slug":"c-i-a","avatar_url":"avatars/1911399.png?_=4f6d8df6987dcb7b","is_superuser":false,"is_staff":false},"post_date":1592997600,"body":"Press F for our fallen Brother "},{"id":1029690,"gallery_id":289248,"poster":{"id":3381403,"username":"kawaiimanga","slug":"kawaiimanga","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592936207,"body":"Ahhh i need his revenge for that fucking guy "},{"id":1029517,"gallery_id":289248,"poster":{"id":2818073,"username":"Monarchh","slug":"monarchh","avatar_url":"avatars/2818073.png?_=f9edca7cb204b7b2","is_superuser":false,"is_staff":false},"post_date":1592930331,"body":"Is there any NTR that the mc gets revenge?"},{"id":1022727,"gallery_id":289248,"poster":{"id":3379821,"username":"Jue_Viole-Grace","slug":"jue_viole-grace","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1592689576,"body":"The guy was an insensitive asshole or anything he cared and the bitch never opened up he asked and show caring but she decided to open up to the Player ain’t the guy fault all the bitch if she didn’t keep her problems a secret this could have been avoided"},{"id":1021653,"gallery_id":289248,"poster":{"id":3378576,"username":"Otaku_King123","slug":"otaku_king123","avatar_url":"avatars/3378576.png?_=e26c51999f4d6df2","is_superuser":false,"is_staff":false},"post_date":1592654760,"body":"WTF First of all that girl was too insensitive her fucking boyfriend was helping her and she declined and she fucking told her problem to a fucking slutty boy and thats what makes her a slut too and the problem of the boy is he is fucking too busy with his soccer other than finding out whats the problem of her girlfriends but he dont really deserve that shit awwww fck ima rate this manga a 7/10"},{"id":1019915,"gallery_id":289248,"poster":{"id":1343863,"username":"Jabby","slug":"jabby","avatar_url":"avatars/1343863.png","is_superuser":false,"is_staff":false},"post_date":1592587204,"body":"MC didnt really understand the girl"},{"id":1019615,"gallery_id":289248,"poster":{"id":2135305,"username":"IFeelAshamed","slug":"ifeelashamed","avatar_url":"avatars/2135305.png","is_superuser":false,"is_staff":false},"post_date":1592577107,"body":"This was good, but honestly fucking sad. I can say this is one of the few ntr I actually like and most of it boils down to the fact that the player is not an ugly piece of shit."},{"id":1017988,"gallery_id":289248,"poster":{"id":897897,"username":"Tarantula","slug":"tarantula","avatar_url":"avatars/897897.png","is_superuser":false,"is_staff":false},"post_date":1592519406,"body":"@Shoudidnothingwrong @Berkel english is not my first language sorry if it is bad. She is not a bitch she was manipulated, and the guy served as an emotional support for him besides her, and she seems to be someone very naive. And it doesn't matter if she didn't say what she felt because a guy who didn't know her was able to realize that there was something wrong with her and the boyfriend of three months did not. And for the love of god how do you think the girl is a bitch when she is clearly doing dirty talk."},{"id":1014410,"gallery_id":289248,"poster":{"id":1164546,"username":"EcchiMechanic","slug":"ecchimechanic","avatar_url":"avatars/1164546.png","is_superuser":false,"is_staff":false},"post_date":1592406525,"body":"his mistake on page 16."},{"id":1012285,"gallery_id":289248,"poster":{"id":2434200,"username":"hikiＮＥＥＴ","slug":"hikineet","avatar_url":"avatars/2434200.png","is_superuser":false,"is_staff":false},"post_date":1592331407,"body":"If i was shou, i would definitely rent/buy a fkin gun and kill him, futaba, and the myself"},{"id":1012281,"gallery_id":289248,"poster":{"id":3365748,"username":"Nakashima Iroha","slug":"nakashima-iroha","avatar_url":"avatars/3365748.png?_=bd9330d039129915","is_superuser":false,"is_staff":false},"post_date":1592331330,"body":"\"You have now certified as the clown, your life was now a joke\""},{"id":1012194,"gallery_id":289248,"poster":{"id":2256100,"username":"crazypenguin","slug":"crazypenguin","avatar_url":"avatars/2256100.png?_=64a4f12a00cb859e","is_superuser":false,"is_staff":false},"post_date":1592328605,"body":"I hate ntr hehehe "},{"id":1011068,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1592293018,"body":"Futaba should be able to trust Shou that she can share her problems with him, which she didn't, and instead opened it up to someone Shou warned him about being a player who was obviously emotionally manipulating her, which she did.\n\nAnd I'm pretty sure Shou can't hear what's inside people heads, nor is a mind reader."},{"id":1011051,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1592292513,"body":"Not to mention, Shou did try to ask her if something's wrong, and Futaba denied it. I don't care if your he's too dense to notice the problem, but she should've told him if there is a problem or not, sooner or later. And the worse part of it? They're in a relationship. And I'll repeat my defense here: people are not mind readers.\n\nI don't want people to think Shou's in the wrong here just because Futaba cheated on him. Because that's what she did to him. She cheated on him, broke his trust for keeping her own problem a secret. And that is the root of the problem here.\n\nI said it before and I'll say it again: PEOPLE ARE NOT MIND READERS"},{"id":1011025,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1592291985,"body":"@Berkel I would've agreed to your case, if Shou and Futaba had NOT made a clear agreement that they'll stay away from each other for a month, which they did, and then things will go back to normal. And as I said before, people, not just boyrfriends, are not mind readers. There's supposed to be mutual trust between each other and Futaba clearly didn't. What even worse is she's in a relationship with him. She should be able to trust him, her boyfriend of all things, that she'd be able to share these things with him.\n\nEven worse is Futaba's mindset on this: \"I'll keep this problem from my boyfriend in order to not distract him from his soccer since he is clearly doing this for me while some open pimp fucks with my emotions both literally and physically. I have a terrible boyfriend.\""},{"id":1010958,"gallery_id":289248,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1592290405,"body":"Part 2 because of limited letters: if she would talk to him about all the problems instead of staying silence like idiot. That would be ez and smart. Well that story was really something, but Futaba is a bitch hoe and Shou didn't understand any signals at start and didnt pay too much attention to her."},{"id":1010932,"gallery_id":289248,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1592289894,"body":"@Shoudidnothingwrong Good message from you, i agree mostly with it and yeah Futaba changed to a bitch hoe after that incident. That fucker douche player was worst person by organize all of it to take her. I understand you defend him, but i think Shou have his faults here too, like i said he should make more attention and love to her. It's sometimes not that hard to understand your gf needs you emotionally. Especially after she cried and was a little broken because of that mother accident, he done NOTHING that day and later never asked what's going on and why she cried. Thats why i think we should kinda blame him too. Like i mentioned oh yeah Futaba is stupid that she didn't talk what is the problem, what happening, that she needs him and about mother accident. She was easy manipulated and fall for that fucker. She just changed into stupid bitch hoe. If they only would talk about their problems, if shou would notice that she needs him after all that moments,"},{"id":1010684,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1592284555,"body":"PS: I actually like this doujin but Futaba's a hoe and I'll fight for Shou's honor here if I have to."},{"id":1010665,"gallery_id":289248,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1592284053,"body":"Look at my username. Here's why:\n\nShou made it clear that he's going to focus on his soccer activities for one month and then things will be back to normal again. Futaba failed to communicate to Shou that she needed him emotionally and denied that something's wrong. Sorry to spit facts here but boyfriends are not mind readers, she should've told him what happened to her mother instead of making him guess what's wrong. I mean, they're already in a  relationship, so she should be able to talk her problems with him but no. She kept it from him, thinking it would distract him from his soccer because if she's her true boyfriend, he should be able to figure it out that something's wrong. No, just no. Not to mention, in the first two pages, it's clear that she's totally fine with their agreement that they won't be dating for one month, so she has no excuse."},{"id":1010645,"gallery_id":289248,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1592283701,"body":"A additional a bit to previous messages. That fucker douche \"player\" manipulated her and toy with her feelings for sex that he only care about. He probably will dumb her in few weeks/months and GG for her. "},{"id":1010185,"gallery_id":289248,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1592271316,"body":"For continue, I want to tell it's always when women says \"it's nothing, nothing happened\" etc. and that means \"something really happening/happened\" so we must just understand that. Especially when he saw his gf cried after phone call and done NOTHING about this so nice stupid idiot. I wonder what she told him after \"break up\" because author gives us MC shock thing. She probably told him that \"you don't care about me\"... She also was easy manipulated by that fucker douche, and she don't ever care about that he can just toying with her and only care about sex. She changed to dumb bitch after that first incident. Well that's probably all from me and all characters here are just stupid in they own way."},{"id":1010149,"gallery_id":289248,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1592270283,"body":"I can say that was really something and maybe would happen irl. This is his and her fault. HE was too focused on soccer, barely paying attention to her and never noticed that she needs his love, attention,\"intimacy\"and support(look at end of page 87 and full 88) especialy when she really needed it most. Especially and core moment was when she cried after that call when her mother was in hospital. He DIDN'T even tried to ask her twice, call or talk to her what happening and why she cried, just NOTHING like idiot... SHE seems low mentally and sensitive so that mother thing broke her more, but she stopped talking after \"My...\"(because of his soccer...)saying mother called her and that was stupid. She didn't try to talk to him seriously about what is the problem or what happening etc. She was easy manipulated by that fucker \"player\"(who will 100% dumb her after bored of her) and turned down by him so he got her. She changed to a dumb bitch from here. We should blame both of them."},{"id":1006751,"gallery_id":289248,"poster":{"id":1953503,"username":"roster","slug":"roster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592171873,"body":"NTR is just like drugs...once you start you can't quit... nothing makes you high as this shit... Nothing else can satisfy as much as this..."},{"id":1006160,"gallery_id":289248,"poster":{"id":3273261,"username":"Nick3072","slug":"nick3072","avatar_url":"avatars/3273261.png?_=aa7f9008122ad9ae","is_superuser":false,"is_staff":false},"post_date":1592155782,"body":"This is pretty good thing it's pretty much like reality"},{"id":1005810,"gallery_id":289248,"poster":{"id":858169,"username":"belrog","slug":"belrog","avatar_url":"avatars/858169.png","is_superuser":false,"is_staff":false},"post_date":1592147162,"body":"This is actually pretty fucking good, it's make sense"},{"id":1004587,"gallery_id":289248,"poster":{"id":1365669,"username":"GreedsLove","slug":"greedslove","avatar_url":"avatars/1365669.png?_=b1aa953a6508cf55","is_superuser":false,"is_staff":false},"post_date":1592106707,"body":"Girl is just a dumb bitch."},{"id":1000037,"gallery_id":289248,"poster":{"id":2038931,"username":"KaiserYamato","slug":"kaiseryamato","avatar_url":"avatars/2038931.png","is_superuser":false,"is_staff":false},"post_date":1591974598,"body":"this is some good shit"},{"id":998508,"gallery_id":289248,"poster":{"id":2841455,"username":"Unrelated Topic","slug":"unrelated-topic","avatar_url":"avatars/2841455.png?_=c270f43a71bb3941","is_superuser":false,"is_staff":false},"post_date":1591929870,"body":"This is sad , at least they didn't notice him or it would be more fucked "},{"id":998468,"gallery_id":289248,"poster":{"id":2492185,"username":".mark17","slug":"mark17","avatar_url":"avatars/2492185.png?_=d1980d219023bf5d","is_superuser":false,"is_staff":false},"post_date":1591928754,"body":"Poor guy gets cucked, still girls fault"},{"id":997155,"gallery_id":289248,"poster":{"id":1497200,"username":"KinsKindred","slug":"kinskindred","avatar_url":"avatars/1497200.png","is_superuser":false,"is_staff":false},"post_date":1591895127,"body":"The guy dodged a bullet right there"},{"id":992157,"gallery_id":289248,"poster":{"id":76058,"username":"mikelitoris","slug":"mikelitoris","avatar_url":"avatars/76058.png?_=65f9cc7a44c35610","is_superuser":false,"is_staff":false},"post_date":1591789855,"body":"YES COMMENTS ARE BACK THIS IS SOME GOOD SHIT MUNG"},{"id":991758,"gallery_id":289248,"poster":{"id":1795265,"username":"Slivko","slug":"slivko","avatar_url":"avatars/1795265.png","is_superuser":false,"is_staff":false},"post_date":1591781745,"body":"Glad the comments are back. Now... Disgusting, though the guy actually worked for it."},{"id":990888,"gallery_id":289248,"poster":{"id":2774999,"username":"Chinnyuwu","slug":"chinnyuwu","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1591767835,"body":"this is lowkey sad ngl, great full color art tho 9/10"}]