[{"id":1671587,"gallery_id":289736,"poster":{"id":3092411,"username":"Zenou","slug":"zenou","avatar_url":"avatars/3092411.png?_=aae361dce83507a0","is_superuser":false,"is_staff":false},"post_date":1618073548,"body":"Her dirty talk about \"do as you please and ravage her throat pussy\" ......A1 WAIFU ❤❤❤❤ my dick will riot in her warm mouth 🌰🌰🌰🌰🌰🌰"},{"id":1642414,"gallery_id":289736,"poster":{"id":1923629,"username":"nopor27","slug":"nopor27","avatar_url":"avatars/1923629.png?_=566ad211bc26427d","is_superuser":false,"is_staff":false},"post_date":1616812268,"body":"https://nhentai.net/g/241228/ part 1"},{"id":1591138,"gallery_id":289736,"poster":{"id":3129532,"username":"Lerkin","slug":"lerkin","avatar_url":"avatars/3129532.png","is_superuser":false,"is_staff":false},"post_date":1614514210,"body":"\"マリファナケーキのレシピ使用するマリファナバター：100グラムのバター; 8グラムの医療用マリファナ。マリファナケーキの場合：卵4個;バニラエッセンスシュガー2カップ（オプション）;牛乳1カップ; 2カップ小麦粉1杯;化学酵母1杯;これらはマリファナケーキ生地を作るための基本的な成分です。チョコレート風味のマリファナケーキを作りたい場合は、粉末チョコレート2杯を追加するだけです（チョコレートパウダーを使用している場合は、4杯に増やします）。もう1つのヒントは、緑色の食品着色料を購入し、マリファナケーキバターに約10滴滴下することです。ケーキマリファナ。マリファナケーキの作り方ステップ1：大麻バター最初に、THCを脱炭酸することが重要です。マリファナバターを作るには、バターを入れて弱火で水を入れ、沸騰し始めたらマリファナを加えます。水はバターが過熱するのを防ぎ、保存します。\" is what they said"},{"id":1537561,"gallery_id":289736,"poster":{"id":2332491,"username":"Begone","slug":"begone","avatar_url":"avatars/2332491.png?_=9e315fb257e55024","is_superuser":false,"is_staff":false},"post_date":1612113172,"body":"\"Marijuana Cake Recipe For marijuana butter we will use: 100 grams of butter; 8 grams of Medical Marijuana. For the Marijuana Cake we will need: 4 eggs; 2 cups of vanilla essence sugar (optional); 1 cup of milk; 2 cups of flour; 1 tablespoon of chemical yeast; These are the basic ingredients for making the marijuana cake dough. If you want to make a chocolate flavored marijuana cake just add 2 tablespoons of powdered chocolate (if using chocolate powder, increase to 4 tablespoons). Another tip is to buy green food coloring and drip about 10 drops into your marijuana cake batter. Cake Marijuana. How to Make Marijuana Cake Step 1: Cannabis Butter First, it is important to decarboxylate THC. To make marijuana butter just put the butter and water on low heat and when it starts to boil add the marijuana. The water will keep the butter from overheating, preserving\" is what he said"},{"id":1216178,"gallery_id":289736,"poster":{"id":3653223,"username":"corninho_miaw_miaw","slug":"corninho_miaw_miaw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600355652,"body":"Receita de Bolo de Maconha\nPara a manteiga de maconha iremos usar:\n\n100 gramas de manteiga;\n8 gramas de Maconha Medicinal.\n \n\nPara o Bolo de Maconha iremos precisar de:\n\n4 ovos;\n2 xícaras de açúcar\nEssência de Baunilha (opcional);\n1 xícara de leite;\n2 xícaras de farinha;\n1 colher de sopa de fermento químico;\n \n\nEstes são os ingredientes base para fazer a massa do Bolo de Maconha. Se você quiser fazer um bolo de maconha sabor chocolate basta adicionar 2 colheres de sopa de chocolate em pó (se for usar achocolatado, aumente para 4 colheres de sopa). Outra dica é comprar corante alimentício verde e pingar cerca de 10 gotas na massa do seu bolo de maconha.\n\n \n\n\nMaconha para Bolo.\nComo fazer Bolo de Maconha\n \n\nPasso 1: Manteiga Cannábica\n\n \n\nPrimeiro é importante realizar a descarboxilação do THC.  Para fazer a manteiga de maconha basta colocar a manteiga e a água no fogo baixo e quando começar a ferver adicionar a maconha. A água irá fazer com que a manteiga não se aqueça demais, preservan"},{"id":1019250,"gallery_id":289736,"poster":{"id":1993285,"username":"oops you're not mom","slug":"oops-you-re-not-mom","avatar_url":"avatars/1993285.png?_=49fed59a8c810c98","is_superuser":false,"is_staff":false},"post_date":1592561713,"body":"At first it looked like a loli and then it wasn't, i got bamboozled, neat"}]