[{"id":2319043,"gallery_id":290225,"poster":{"id":1388793,"username":"Lemmings","slug":"lemmings","avatar_url":"avatars/1388793.png?_=3b702e3e6eb0bb51","is_superuser":false,"is_staff":false},"post_date":1644301008,"body":"Bro that's rough"},{"id":1982781,"gallery_id":290225,"poster":{"id":674664,"username":"TheUnsaid","slug":"theunsaid","avatar_url":"avatars/674664.png?_=2ba2c1af13b0bab8","is_superuser":false,"is_staff":false},"post_date":1630304201,"body":"First story is Heavy NTR. Start at Page 26 to avoid it.\nSecond story is fine.\nThird story is NTR+Aggressive Rape. Everyone involved in the story is a piece of shit, so the NTR is pretty light. The situation is pretty ridiculous too so you won't even feel it. It starts at page 46 and ends on page 66.\nFourth story is great. Pure love. It's all maledom though.\nFifth story is kinda ok until the end. I didn't like it because it was all maledom and some girls were always unhappy. The end is aweful too. It starts on page 82 and ends on 102\nSixth story is good. Oh damn... hmmm I'm seeing a pattern. Kind of worried about the seventh story now.\nSeventh story starts on 122 and ends on 142. It's aweful. Rapist ugly bastard creep gets what  he wants while the girls have their lives ruined.\nEighth story is the weirdest one here. It's kinda fun and the protagonist is likeable.\n\nAnd that's it. Skip every other \"chapter\" and you'll be fine. They're in increments of 20 so it's easy to skip."},{"id":1735126,"gallery_id":290225,"poster":{"id":361429,"username":"koreanBBK","slug":"koreanbbk","avatar_url":"avatars/361429.png?_=a22384e6f1823741","is_superuser":false,"is_staff":false},"post_date":1620906372,"body":"its a little disgusting in a good way. when horny a hole is a hole"},{"id":1575338,"gallery_id":290225,"poster":{"id":3422241,"username":"VASH THE STAMPEDE","slug":"vash-the-stampede","avatar_url":"avatars/3422241.png?_=e5c94cf55e21e257","is_superuser":false,"is_staff":false},"post_date":1613764008,"body":"The sex scenes are kinda repetitive but decent overall"},{"id":1554659,"gallery_id":290225,"poster":{"id":2492158,"username":"tr00p3r","slug":"tr00p3r","avatar_url":"avatars/2492158.png?_=33c49feedc30e2fc","is_superuser":false,"is_staff":false},"post_date":1612849098,"body":"I do like his way of drawing, BUT I'm disappointed on how little he used on sex position. I know it's hard to draw on certain angles, but it does not mean it's impossible. I would give this a 4/5, but for now, I would give it a 3.5/5"},{"id":1079308,"gallery_id":290225,"poster":{"id":2843006,"username":"Geruma18UP","slug":"geruma18up","avatar_url":"avatars/2843006.png?_=e54e1ef88e87f6bc","is_superuser":false,"is_staff":false},"post_date":1594792201,"body":"I can't stop laughing at how oblivious this author makes the women this tankoban. there are some chapters that are just icky for me but the there were some chapters worth taking a look at if that is your cup of tea."}]