[{"id":1933445,"gallery_id":290821,"poster":{"id":3092433,"username":"Default Dan","slug":"default-dan","avatar_url":"avatars/3092433.png?_=7db0fd794043eb5c","is_superuser":false,"is_staff":false},"post_date":1628499753,"body":"I love the word ladyboy so much i may adopt it for myself"},{"id":1701685,"gallery_id":290821,"poster":{"id":781809,"username":"Valkjxhsu","slug":"valkjxhsu","avatar_url":"avatars/781809.png","is_superuser":false,"is_staff":false},"post_date":1619498666,"body":"@The King Gilgamesh, Why you ask?\n\nBecause, glasses are really versatile. First, you can have glasses-wearing girls take them off and suddenly become beautiful, or have girls wearing glasses flashing those cute grins, or have girls stealing the protagonist's glasses and putting them on like, \"Haha, got your glasses!\" That's just way too cute! Also, boys with glasses! I really like when their glasses have that suspicious looking gleam, and it's amazing how it can look really cool or just be a joke. I really like how it can fulfill all those abstract needs. Being able to switch up the styles and colors of glasses based on your mood is a lot of fun too! It's actually so much fun! You have those half rim glasses, or the thick frame glasses, everything! It's like you're enjoying all these kinds of glasses at a buffet. I really want Luna to try some on or Marine to try some on to replace her eyepatch. We really need glasses to become a thing in hololive and start selling them for HoloComi. D"},{"id":1699138,"gallery_id":290821,"poster":{"id":3152226,"username":"HornyHighScholor","slug":"hornyhighscholor","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1619378806,"body":"To get them clean"},{"id":1335310,"gallery_id":290821,"poster":{"id":3389774,"username":"The King Gilgamesh","slug":"the-king-gilgamesh","avatar_url":"avatars/3389774.png?_=0002f1bd07890dd2","is_superuser":false,"is_staff":false},"post_date":1605324207,"body":"Why tf is he taking a shower with his glasses?"}]