[{"id":2131386,"gallery_id":291664,"poster":{"id":4180705,"username":"autodesk inventor","slug":"autodesk-inventor","avatar_url":"avatars/4180705.png?_=1bede91e0c4d4ab4","is_superuser":false,"is_staff":false},"post_date":1636365341,"body":"@I'mALoser satoru is coming from the future to save gaku from his (gakus) loneliness. he doesn't wanna make it obvious so he says it's abt the others too. or he could just be tryna save from from gakus bro.. The book and the comments about loneliness are all things that relate to gaku (in erased's manga).\nsatoru is tryna make a connection with gaku in that way... after he brought out the book, he rlly got gaku's interest :p he's trying stop gaku from becoming a murderer in the future... in this dj he does love gaku imo, yandere end "},{"id":1589525,"gallery_id":291664,"poster":{"id":3152209,"username":"FDraco","slug":"fdraco","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1614433655,"body":"Can we call it “pedo”, since Satoru is actually an adult man trapped in shota’s body?"},{"id":1519720,"gallery_id":291664,"poster":{"id":3630149,"username":"Pandesal","slug":"pandesal","avatar_url":"avatars/3630149.png?_=d3a908e1c5f03cbe","is_superuser":false,"is_staff":false},"post_date":1611328208,"body":"oh my god."},{"id":1201690,"gallery_id":291664,"poster":{"id":3610082,"username":"I’mALoser","slug":"i-maloser","avatar_url":"avatars/3610082.png?_=34fed6369364b17c","is_superuser":false,"is_staff":false},"post_date":1599683284,"body":"After reading back I think Satoru has the same goal as Gaku? Gaku lures little girls for his brother out of fear that his brother will beat him up. And Satoru lures little girls for sensei who he’s presumingly in love with and calls it ”curing loneliness”. But after Satoru discovered Gaku had the same goal he needed to get rid of Gaku so he could continue “curing loneliness” so he went and lured Gaku in I think? Jeez I’m really over analysing this but I just didn’t see that plottwist coming. "},{"id":1201681,"gallery_id":291664,"poster":{"id":3610082,"username":"I’mALoser","slug":"i-maloser","avatar_url":"avatars/3610082.png?_=34fed6369364b17c","is_superuser":false,"is_staff":false},"post_date":1599682982,"body":"Holy fuck I didn’t see that coming. Can anyone explain what happened at the ending? I got kinda confused. My guess is that Satoru wasn’t actually in love with Gaku because in one of the last panels he said “From now on we’ll be together forever sensei”. So maybe he was doing the same as Gaku, but instead of luring little girls to his brother he lures little boys to that sensei person? It would make sense because in the last panel you can see Gaku is missing. So maybe that was what he meant with “curing loneliness” Jesus that fucked up lol."},{"id":1067397,"gallery_id":291664,"poster":{"id":1337645,"username":"Kenny Omega","slug":"kenny-omega","avatar_url":"avatars/1337645.png","is_superuser":false,"is_staff":false},"post_date":1594322206,"body":"Chale que loco"}]