[{"id":1580280,"gallery_id":291891,"poster":{"id":3576290,"username":"Skarbrand","slug":"skarbrand","avatar_url":"avatars/3576290.png?_=21083bc74c9771f5","is_superuser":false,"is_staff":false},"post_date":1613993559,"body":"His friends just basically straight murdered him? Like he said they forcefully pushed him in, into his death, that would acctually be an interesting thing to discuss in some manga, like ishuzoku reviewers done some similar things before, a vore chapter with the boundry between murder and fetish discussed would be interesting"},{"id":1459833,"gallery_id":291891,"poster":{"id":2317287,"username":"Thirsty Doctor","slug":"thirsty-doctor","avatar_url":"avatars/2317287.png?_=230ebaf2ebe884e8","is_superuser":false,"is_staff":false},"post_date":1609743009,"body":"TL;DR\n\nThe untranslated version of this doujin, She pit him out "},{"id":1393156,"gallery_id":291891,"poster":{"id":1972867,"username":"fijaqy","slug":"fijaqy","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607478130,"body":"The untranslated version is this https://nhentai.net/g/211192/\n\nThe part where the guy is spit out is not included with the rest of the story. It’s only at the very end of the entire anthology. I’m pretty sure it’s one of those “author statement + cute bonus panel” things that authors put in to promote themselves or comment on their experience with writing for the anthology.\n\nThe creator of this has created stuff with explicit digestion and death before, such as this https://nhentai.net/g/120291/ which also has an author statement at the end with the character looking cute and happy even though she melted to death with only an arm left behind.\n\nThis means that the last panel is questionably canon. It could go either way depending on what you prefer."},{"id":1173195,"gallery_id":291891,"poster":{"id":3586003,"username":"drkwraith99","slug":"drkwraith99","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598444779,"body":"The guy's not dead, the ones who translated this omitted the last panel where she spits him out, if you don't believe me go check the untranslated version."},{"id":1156820,"gallery_id":291891,"poster":{"id":2100325,"username":"Jndlel_Kun","slug":"jndlel_kun","avatar_url":"avatars/2100325.png","is_superuser":false,"is_staff":false},"post_date":1597831172,"body":"I personally don't care much for Vore. But I have 2 thoughts that could change how it's seen. 1: His seniors forcibly pushed him into the store with them, If I know humans and seniors in any form of education, it's that they are assholes. With that being said, it's likely they ditched it after her both ordered and entered the room instead of doing the same. And it's likely this was a cruel joke if the vore doesn't kill him, or if the vore does kill him (which knowing how digestion works it very likely will) it was probably a plan from the start to kill him and make it seem like it was a fetish thing. 2: The fact the establishment is running with the Vore services, both suggests that at the very least Snake Girls are in this world and that it's perfectly legal to vore someone, which suggesting before, causing them to die with basically assisted suicide which is legal in that world if it's a fetish. - But what do I know? I'm just a guy with a keyboard and an opinion."},{"id":1106255,"gallery_id":291891,"poster":{"id":2326755,"username":"Solar404","slug":"solar404","avatar_url":"avatars/2326755.png","is_superuser":false,"is_staff":false},"post_date":1595843219,"body":"what in tarnation"},{"id":1081729,"gallery_id":291891,"poster":{"id":3455154,"username":"beepatriot","slug":"beepatriot","avatar_url":"avatars/3455154.png?_=f23aca70c945b913","is_superuser":false,"is_staff":false},"post_date":1594900743,"body":"Boy, you should add tag \"thriller\" on your Comic"},{"id":1019433,"gallery_id":291891,"poster":{"id":790513,"username":"Terra1125","slug":"terra1125","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1592570638,"body":"Good shit this one is"}]