[{"id":2064113,"gallery_id":294594,"poster":{"id":4187043,"username":"femboyshotamaid","slug":"femboyshotamaid","avatar_url":"avatars/4187043.png?_=ac91566470ab3fd0","is_superuser":false,"is_staff":false},"post_date":1633538540,"body":"I surrender"},{"id":1775207,"gallery_id":294594,"poster":{"id":2723215,"username":"marioforever97","slug":"marioforever97","avatar_url":"avatars/2723215.png?_=b25d7ad9404bd540","is_superuser":false,"is_staff":false},"post_date":1622524361,"body":"@I don't like tomboys Omg I that's so hot! my friends already see me as weakling so it'd be great if I were you at that match, femdom girls are great!"},{"id":1626900,"gallery_id":294594,"poster":{"id":3619023,"username":"Suck a Duck","slug":"suck-a-duck","avatar_url":"avatars/3619023.png?_=66a1893c99b41c03","is_superuser":false,"is_staff":false},"post_date":1616122723,"body":"This guy sounds like he needs a little bit of therapy."},{"id":1541763,"gallery_id":294594,"poster":{"id":2085547,"username":"intithesungod","slug":"intithesungod","avatar_url":"avatars/2085547.png","is_superuser":false,"is_staff":false},"post_date":1612308932,"body":"what is this dude on about"},{"id":1508009,"gallery_id":294594,"poster":{"id":3919055,"username":"i am a retard","slug":"i-am-a-retard","avatar_url":"avatars/3919055.png?_=ade1ff3c95408fcc","is_superuser":false,"is_staff":false},"post_date":1610872034,"body":"I started to crawl off the mat and I tried to get up and run but I couldn’t get up you know why? BECAUSE THIS BITCH GRABBED MY FUCKING LEG AND PULLED ME BACK INTO THE RING! And then she got back on top of me and I did my best the whole round not to fail but the moment I got a glance not even a good look just a glance she had the face of not someone who is struggling of trying to win BUT the face of someone who is having fun playing and tormenting a toy that they can easily destroy. She looked me dead in my eye and smiled. All of my strength just vanished and I lost she got up and said “did I win?”. My teammates just did not a say word to me and said “yo bro did you just lose””you good man””need some water”. The next day at school my whole grade was roasting and making fun of me and I just felt the weight embarrassment on top of my shoulders that I quit the team. (But I never gave them back their hoodie we were supposed to return)"},{"id":1507987,"gallery_id":294594,"poster":{"id":3919055,"username":"i am a retard","slug":"i-am-a-retard","avatar_url":"avatars/3919055.png?_=ade1ff3c95408fcc","is_superuser":false,"is_staff":false},"post_date":1610871529,"body":"So I was terrified all sorts of thought went through my head like “what if someone got the wrong idea””what if I hurt the girl””what if my dick gets hard”. You also might be wondering how is she near 200 pounds if she’s a girl (not to be sexist or anything a lot of the girls at my school were super thin) well here’s why. when I finally came face to face with my opponent I just shit my pants. Because this bitch was 6ft,had like fuckin c or d cup titties and here ass was the equivalent to a fuckin dump truck ( atleast that’s how I remember because I was fuckin scared). Have any of you guys felt true fear as in youll actually you’ll die kinda fear because on that day I learned that a girl is not weak and that a girl can send you to have a meet and greet with Jesus. As soon as the match started she fuckin tackled me she had me in all sorts of fuckin positions and I managed to break free and I saw an opening to strike and possibly win but did I take that opening. NO OF COURSE THE FUCK NOT!"},{"id":1507956,"gallery_id":294594,"poster":{"id":3919055,"username":"i am a retard","slug":"i-am-a-retard","avatar_url":"avatars/3919055.png?_=ade1ff3c95408fcc","is_superuser":false,"is_staff":false},"post_date":1610870585,"body":"Ok story time, I used to be in a wrestling team in 6th grade that was also the first team I ever got in (cause I’m fat and lazy) and I was bad but not too bad. Heads up I only participated in 2 matches JUST 2 THE WHOLE SEASON THEN I JUST QUIT ON THE SECOND AND WILL NEVER DO SPORTS AGAIN but I’ll get to why later. so the second match was at another school and so my team practiced and left for the game. And by the time we were all seated the coach started telling us who our matches were. I wasn’t supposed to get a match because again I’m was and still am too fat and that no one matched my weight class P.S I was almost 200 pounds. After the first 2 people finished their matches the coach came to me and said “hey sorry this is last minute but you got a match get ready”. At first I was like sweet I finally get a match and I might be able to redeem my self from the last game but the coach also said “oh yeah it’s a girl by the way”. I froze and said “a fuckin WAHT!?”."},{"id":1389396,"gallery_id":294594,"poster":{"id":3307589,"username":"eloquency","slug":"eloquency","avatar_url":"avatars/3307589.png?_=a08906d59672b626","is_superuser":false,"is_staff":false},"post_date":1607321340,"body":"omigod the men are so grosssss lol"},{"id":1174928,"gallery_id":294594,"poster":{"id":3589244,"username":"jfjdidjhjdkduvhdkdvyudkx","slug":"jfjdidjhjdkduvhdkdvyudkx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598522184,"body":"Girls-\"We are going to teach the arrogant boys their place.\"\nBut all the boys already have girlfriend or were gey.\nGirls-\"Shit.\""},{"id":1115856,"gallery_id":294594,"poster":{"id":2435024,"username":"s1ghly","slug":"s1ghly","avatar_url":"avatars/2435024.png","is_superuser":false,"is_staff":false},"post_date":1596220041,"body":".jjgjngyijbt"},{"id":1107684,"gallery_id":294594,"poster":{"id":3051038,"username":"St. Thiccolas","slug":"st-thiccolas","avatar_url":"avatars/3051038.png","is_superuser":false,"is_staff":false},"post_date":1595898917,"body":"Top tier thunder thighs on page 8"},{"id":1090110,"gallery_id":294594,"poster":{"id":3471032,"username":"browulf","slug":"browulf","avatar_url":"avatars/3471032.png?_=df57ae685f573f2e","is_superuser":false,"is_staff":false},"post_date":1595231728,"body":"Metanme contra esas hijas de la chingada y me las truneo yo solo"}]