[{"id":1867097,"gallery_id":295857,"poster":{"id":3337748,"username":"SuCCulent","slug":"succulent","avatar_url":"avatars/3337748.png?_=c42a7c06bc97ce1a","is_superuser":false,"is_staff":false},"post_date":1626098740,"body":"(cont) The big drop of the Rona happened. People were sent home and had less to do outside. Now they had to do something while staying indoors. Be it video games, online work, or, you guessed it, porn. While it took a while for people to fully accept that they had to stay home, some people went along with the tide. But people have to eventually let off some steam, so they turned to online entertainment. Anime and Hentai were two of them. More people found about anime and subsequently, hentai. All forms of online entertainment got so many new users from the surge of people bored af in their own homes. Veterans also came back to their old habits and hangouts. NHentai is just one of the million sites to gain popularity again. However, this was still during the time of Disabled-Comments, so the site still felt like a ghost town, but you saw more influence in the favorites. You were no longer alone. And then, as if Nhentai knew it is was the perfect time, they Enabled the Comments again."},{"id":1867079,"gallery_id":295857,"poster":{"id":3337748,"username":"SuCCulent","slug":"succulent","avatar_url":"avatars/3337748.png?_=c42a7c06bc97ce1a","is_superuser":false,"is_staff":false},"post_date":1626097945,"body":"I truly believe that hentai dropped during the Disabled-Comments Era made so many good hentai underrated\nComments actually help the popularity of a hentai. Sometimes the hentai looks good enough to generate its own popularity, but in other cases, people coming to talk in the comment section give the hentai some traffic, which can be seen as popularity. However, when the Comments were Disabled, this really affected how people used this site. Nhentai has a really unique environment where people can socialize and talk about hentai, though not as group chat but as a forum. People who comment also become infamous and gain popularity which also provides its own entertainment. That's why when the comments were disabled, it's like the site became a ghost town. No one to talk to, only you by yourself in this hentai wasteland. So I think people did leave. You also see how small the amount of active people were when you check the favorites of hentai from that era. But then it happened."}]