[{"id":1293973,"gallery_id":297010,"poster":{"id":2407545,"username":"hentaitigas","slug":"hentaitigas","avatar_url":"avatars/2407545.png","is_superuser":false,"is_staff":false},"post_date":1603646416,"body":"It has an english translation in hentai cafe"},{"id":1033088,"gallery_id":297010,"poster":{"id":1769963,"username":"Shiro Ecchi","slug":"shiro-ecchi","avatar_url":"avatars/1769963.png?_=10f6b076542f3552","is_superuser":false,"is_staff":false},"post_date":1593053769,"body":"good thing i dont know a gram of japanese"},{"id":1024366,"gallery_id":297010,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1592744695,"body":"She fell in love w/ glasses guy due to his chivalrous act but it seems to be all an act between him and the delinquents. Childhood friend got NTR in a proper way but the guy who stole her from his is a scum. Girls wasn't forced to have sex w/ him. They started dating and then for their first date the glasses guy already wanted to have sex and she gave consent. Our protagonist is down at the family restaurant as he knew about their date as girl told him the day before then he heard the plan of the evil guys on the same day the planned date which would happen.\n"},{"id":1018122,"gallery_id":297010,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1592523308,"body":"Man, that story was SO sad, rough and fucked up here, also can hit you hard. I can tell art is freaking hot. NTR, rape and drugs to the fullest here. Yes she was hard intoxicated by drugs by these guys and gang raped later, and she enjoyed it thoughtlessly because of high amount of drug she taken, well what a kind of story... ENDING is really interesting and... good? Gives us questions: Does she recovered from it? What happened to her later? I wonder if author will write sequel to this or just leaves us like that. Btw this squirt on page 48 was really arousing, but 49 wasn't with that hand... I think this would be something in anime adaptation by good studio. Also that worst fucker(her \"boyfriend\"...) who arranged it all deserve to shot a bullet in the head lol. You can read this in english on hentai.cafe"}]