[{"id":2001401,"gallery_id":29732,"poster":{"id":3260081,"username":"lbnrPtk","slug":"lbnrptk","avatar_url":"avatars/3260081.png?_=304e9a23b9842b75","is_superuser":false,"is_staff":false},"post_date":1631043308,"body":"Masaki, Just slap that bitch and insult her in front of bunch of people.\nI wan't that bitch to commit suicide or something."},{"id":1724977,"gallery_id":29732,"poster":{"id":3896388,"username":"Codevine","slug":"codevine","avatar_url":"avatars/3896388.png?_=1a41eeccf6eb9bc7","is_superuser":false,"is_staff":false},"post_date":1620467319,"body":"i mean the son is fucked in the head beyond repair but his mother is much worse that bitch is pure slut"},{"id":1705798,"gallery_id":29732,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619663545,"body":"But again, I am still glad to see Tsuya write a rather intelligent FMC that made strong choices in the past, even though she falls into depravity again, the background setup is there where it makes her choices understandable. Flawed, but understandable. And Masaki and Yamane working together through all this making decisions to look for her and getting involved really makes this feel like a thrilling story with actual characters in play and not just basic cut outs of characters that are just there who don't react to anything. And at least, Masaki is being comforted by Yamane to help him through this situation, and she is quite the detective herself too lol, great characters."},{"id":1705789,"gallery_id":29732,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619663304,"body":"she no longer felt the spark with Makoto. It truly shows that he was just a rebound guy for her hidden subconscious desires form the past that spilled into the present. What is unfortunate in all this, is that she feels that she does not have the strength to reject these impulses anymore since the young boy Masaki she did this for no longer exists, and I don't believe this is the case due to him just getting older, but her probably realizing that her \"scent\" as a lewd woman made her son assault her like he did last volume, thus making her believe the young boy she rejected this impulses for, no longer exists. And she continues to avoid him in the end, again trying to run away from her problems, probably believing she is no longer fit to be his mother. And damn, Sakaki really out here making chess moves with the decisions he makes and questions he asks, quite the formidable NTR antagonist."},{"id":1705780,"gallery_id":29732,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619662977,"body":"We finally learn why she chooses the pleasures of a woman by going with Makoto here, because she experienced this long ago, and suppressed her desires, and believed she was finally allowed to do so since her son Masaki was old enough and thought he would no longer be affected by her choices. However, I was incredibly angry with her choices of not even answering her son when he called just to be with Makoto and even called Masaki when she needed to in order to create an alibi with Sakaki and not deal with Makoto. Again, forget betraying Makoto, I didn't really care about that, she called Masaki just so she would not have to call Makoto. But I guess we can attribute her ignoring of her son to her just simply wanting to run away from her problems at home with her son and just wanted to lose herself in the pleasure. But we see that her going with Sakaki again truly confirms what Masaki said last volume to Makoto, that he was just being used for sex, because once Sakaki came back, "},{"id":1705764,"gallery_id":29732,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619662658,"body":"Finally we get some background info on Miharu as a character, and I have to say I give props to her as a character and Tsuya as an author for giving the FMC a will of her own and enough thinking where once she realized how engrossed and far she fell into the sexual depravity she was \"enjoying\" with Sakaki and was putting her son's emotional health and relationship with him at risk, and decided to report him to their boss and got him to face repercussions for his manipulation of power as her boss in a company and somewhat coerced her, even though she admits she fell \"in love\" with him, since she was alone after her husband left and he made her feel confident as a worker and woman. Sakakit, was not just big dick wins all, but truly helped her become a better woman at work and fulfilled her as a woman in bed, feeling loved. "},{"id":1693106,"gallery_id":29732,"poster":{"id":36732,"username":"jokerXY","slug":"jokerxy","avatar_url":"avatars/36732.png","is_superuser":false,"is_staff":false},"post_date":1619099236,"body":"I remember this Series, where the mother chose to be return to being a whore over her child, I say return because some of the extra chapters revealed she fucked the dude even when her son was small often leaving him at aftercare until late "},{"id":1690792,"gallery_id":29732,"poster":{"id":3776196,"username":"EDHOLLA","slug":"edholla","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1618990014,"body":"This ntr is garbage and I love ntr but the son should get the mom the author is moron I’m done not continuing any further "},{"id":1520165,"gallery_id":29732,"poster":{"id":3322860,"username":"shinjixx","slug":"shinjixx","avatar_url":"avatars/3322860.png?_=d38e3aa62f9843bc","is_superuser":false,"is_staff":false},"post_date":1611345609,"body":"so sad, URE-004 is the live adaptation"},{"id":1341524,"gallery_id":29732,"poster":{"id":3720159,"username":"avinashsewathapa","slug":"avinashsewathapa","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605559143,"body":"Why the fuck he's so into his whore mother just leave her to do anything she wants to either she wants to every goddamn men in that area fuck why he's so simping over his mom "},{"id":1111304,"gallery_id":29732,"poster":{"id":3499299,"username":"xrestha","slug":"xrestha","avatar_url":"avatars/3499299.png?_=9f6ee2bd9f628572","is_superuser":false,"is_staff":false},"post_date":1596051063,"body":"ano sumimasen @uMad dono \nuntil now i haven't really commented in any of the doujins ,but this doujin it really broke my heart. Even though i have read countless NTRs this one broke my heart really bad. and i am here to know if the characters makeup at last or will it just be fucked up cuz i cant seem to continue reading this, but i really want to read too. So, if anyone knows what happens in end and if the characters makeup and have a happy ending pls do tell me.That will be a big help and thank you in advance "},{"id":137655,"gallery_id":29732,"poster":{"id":1221483,"username":"uMad","slug":"umad","avatar_url":"avatars/1221483.png","is_superuser":false,"is_staff":false},"post_date":1499409388,"body":"i'm crying on both. . but i can't stop reading"}]