[{"id":2257800,"gallery_id":298327,"poster":{"id":289707,"username":"shadow wings","slug":"shadow-wings","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641925026,"body":"Author of the original series made his work anti-NTR. Sakurai is hung as a horse, and mama's husband is a muscular chad gym trainer himself. It also seems that the hubby is sexually active cuz he ask the wife for another kid. so this kind of scenario is basically impossible that it is laughable. "},{"id":1518814,"gallery_id":298327,"poster":{"id":2410570,"username":"nikhiro","slug":"nikhiro","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611291656,"body":".ie\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์์ฏ์์์์์์์์์์์์์์์์์์์์์์์์์"},{"id":1219674,"gallery_id":298327,"poster":{"id":3337748,"username":"SuCCulent","slug":"succulent","avatar_url":"avatars/3337748.png?_=c42a7c06bc97ce1a","is_superuser":false,"is_staff":false},"post_date":1600518587,"body":"I didn't even realize she gave birth until the last page. I blank out everything except the dp. I'm just gonna take that as a W. 300/10"},{"id":1199709,"gallery_id":298327,"poster":{"id":3535653,"username":"ก็็็็็็็็็็็็็็็็็็็็็็็ SEAM","slug":"k-seam","avatar_url":"avatars/3535653.png?_=3c64f08e41e298ac","is_superuser":false,"is_staff":false},"post_date":1599592934,"body":"Good shit... But this is not what we needed... Fuck this"},{"id":1126571,"gallery_id":298327,"poster":{"id":3413723,"username":"RedHawk01","slug":"redhawk01","avatar_url":"avatars/3413723.png?_=7855f2011fb3dcc8","is_superuser":false,"is_staff":false},"post_date":1596669505,"body":"I don’t know what to think, she already have a more muscle husband who can more satisfy her than this guy . This is nonsense . "},{"id":1081523,"gallery_id":298327,"poster":{"id":3098937,"username":"Ragnaruk Zone","slug":"ragnaruk-zone","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594891312,"body":"Giving birth.😶"}]