[{"id":1045438,"gallery_id":301444,"poster":{"id":3409538,"username":"Carmine_Galante","slug":"carmine_galante","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593523903,"body":"Son after speaking to principle finds them fucking, principle finds too, beats the teacher, fires him. \nScene 4)\nSon walking back home, really sad that girl fucking ugly teacher, comes home to see hot mom cooked dinner waiting for him. In other place, teacher finds a website where the hot woman resembles the hot mother. Woman getting fingered by some idiot or maybe the principle. Teacher applies to the website.\n\nThe End. "},{"id":1045432,"gallery_id":301444,"poster":{"id":3409538,"username":"Carmine_Galante","slug":"carmine_galante","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593523709,"body":"Story derived from pictures as I can't read Japanese. \n\nScene 1)\nNerd is browsing some porn website, sees a hot woman with big tits, eyes censored but she resembles his mother. Nerd is sure it's her. The milf is actually his step mom, his real mother has passed away it seems, father has remarried to the milf. Milf and Nerd have an investors relationship, engaging in sexual acts.\nScene 2)\nMilf called to school to meet with teacher. Speaking about the nerd, teacher is eyeing her big tits, gets a hard-on, wants to fuck her. Makes a move, she rejects. Teacher starts dreaming, loves her tits. Son snaps him out of it, discussion ends they move away.\nScene 3)\nIn the hallroom they find the Girl Classmate. Girl speaking to principle, mother looks at son, thinks son is attracted. Principle seems to want to speak with them now. Scene change where girl now speaking with teacher. Girl looks like a whore, has slept with principle and now fucks the teacher. Son after speaking to principle finds them "},{"id":1031922,"gallery_id":301444,"poster":{"id":2480743,"username":"I'm the loli imposter","slug":"i-m-the-loli-imposter","avatar_url":"avatars/2480743.png?_=a85db0cd22ee6bd1","is_superuser":false,"is_staff":false},"post_date":1593011216,"body":"English translation pls "}]