[{"id":2325190,"gallery_id":301533,"poster":{"id":2325114,"username":"pembaca slurr","slug":"pembaca-slurr","avatar_url":"avatars/2325114.png?_=d87836da3cb49933","is_superuser":false,"is_staff":false},"post_date":1644551710,"body":"Where's the english?"},{"id":2232927,"gallery_id":301533,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1640918290,"body":"She ran to that guy not because she wants his dick though. Asahi found out, and rather than force her to give him explanation, he wants to accept all of her. Waka actually asks to break up because she can't stand feeling guilty of taking advantage from his kindness. A month later, Asahi waited for her under the rain, to propose her on her birthday. She run away again, this time to that guy. She told him to ask no question and just fuck her until she can't think of anything else. Asahi had been the only person in her life, so she had nobody else to turn to. In the end, that guy told her, Asahi loves her and she loves Asahi too. If Asahi will accept her dirty self, then she should accept the proposal. They marry in April (after her pregnancy is confirmed) with nobody congratulating. Gave birth in December, then graduate (her parents won't let her drop out). Asahi's colleague actually worried if she will cheat on him, because people their age would still want to have fun."},{"id":2152001,"gallery_id":301533,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637332793,"body":"she's btich..."},{"id":1421694,"gallery_id":301533,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608565890,"body":"Honestly, better to imagine an ending where he moves on. I like both NTR and vanilla but I don’t like disappointing NTR. The best ones have a satisfying conclusion to the drama they stir up. Or they’re unrealistic enough that you don’t care."},{"id":1421687,"gallery_id":301533,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608565620,"body":"The girl is awful though. If she really cared for the guy, she should have completely broken off their relationship and told him to move on. It would have been better for him, he’d be sad but then he could get better with time. The last panel where they show him, he looks depressed, a forced smile. Seriously, she’s abusing his dependency. "},{"id":1421680,"gallery_id":301533,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608565437,"body":"Damn. That sucks so much. I thought they broke up and she starts a new life with the NTR guy. It looked like they moved on and she had regret. That would have at least been satisfying. For a series trying for some drama and a shade of realism by H standards, this is damn disappointing. And what the hell. She runs away from him to be with the NTR guy. You know one thing about these NTR women, pretty unrealistic already since people are most turned on by people they’re attracted to, but ask them to choose one or the other, The dick or their SO, they’ll choose the dick."},{"id":1343677,"gallery_id":301533,"poster":{"id":1697820,"username":"blackscar","slug":"blackscar","avatar_url":"avatars/1697820.png","is_superuser":false,"is_staff":false},"post_date":1605642491,"body":"Cliché... Seriously, it would be nice to have something different from the happy couple, some son of a bitch shows up and starts to fuck the girl, she gets addicted to his dick and the son of a bitch fucks her until she gets pregnant, the cuckold finds out he doesn't nothing and still forgives the girl, happy ending (at least that's what the cuckold wants to think.), the son of a bitch keeps showing up in the couple's life even after they get married and keeps fucking the girl addicted to dick. Cliche!!!!!!!!\nThe beginning may be cliché and such, but the end could at least vary from story to story."},{"id":1028692,"gallery_id":301533,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1592898343,"body":"The girl is still in loved with the protagonist guy but she can't escape the dick of the ntr guy. They are living as husband and wife yet the ntr guy still visits and she complies... "},{"id":1028681,"gallery_id":301533,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1592898156,"body":"My. The boyfriend took responsibility to a child which isn't his. He knew but his love for her is so heavy that he can't let her go or maybe he's just pathetically stupid...\nThe friends found it odd that the child looked like his lover but the hair color doesn't match any of them. The one w/ glasses says so and the other friend told him to shut it as they both knew that the girl probably cheated but kept silent as they know how much their friend loved her.  "},{"id":1015371,"gallery_id":301533,"poster":{"id":485357,"username":"up234","slug":"up234","avatar_url":"avatars/485357.png?_=703e4af9433b0161","is_superuser":false,"is_staff":false},"post_date":1592435347,"body":"Nice wuhan virus shade"}]