[{"id":1697387,"gallery_id":302443,"poster":{"id":2807505,"username":"D u b b y","slug":"d-u-b-b-y","avatar_url":"avatars/2807505.png?_=f4e3a247d2f9177d","is_superuser":false,"is_staff":false},"post_date":1619292009,"body":"-sperm!\" ||| Page 8: \"I'm sorry, Yu-kun.\" \"Your sister already can't stand it.\" \"Will you please do your sister a favor... will you mate with me?\" \"Yes here, you can put it in.\" ||| Page 9: \"Aaaaah!\" \"Yu-kun's dick is going inside!\" \"Good! I'm feeling so good!\" \"Getting fucked by my younger brother feels so good...\" ||| Page 10: \"Your body is so warm! (not sure)\" \"Yu's stomach rubbing me feels good!\" \"My dick also feels good. I'll do it, sister!\" \"Let's come at the same time...\" ||| Page 11: \"Yu-kun! Yu-kun! Yu-kun!\" (screaming intensifies) ||| Page 12: (screaming intensifies more) \"Thank you, Yu. I feel better now. I'm sorry, Yu...\" \"Don't worry. For you sister, I'd do anything.\" \"Thank you Yu...\""},{"id":1697373,"gallery_id":302443,"poster":{"id":2807505,"username":"D u b b y","slug":"d-u-b-b-y","avatar_url":"avatars/2807505.png?_=f4e3a247d2f9177d","is_superuser":false,"is_staff":false},"post_date":1619291324,"body":"[[rough translation from interpreting what my phone's translator says]] Page 3 & 4: *moaning/screaming* ||| Page 5: [ A dozen years ago, a strange illness came that affected only women. The illness would change a living person into a fantastical creature, such as a mermaid, lamia, or centaur. When one finished changing, a sharp increase in libido and sexual desire occurs. But such a thirst cannot be satisfied by masturbation alone. This troublesome syndrome could only be temporarily relieved by having sex with a loved one. ] \"I'm so sorry you have to do this for me Yu-kun. I'm such a terrible, perverted sister.\" \"No, it's okay!\" \"It's not your fault, and I love my mermaid sister too!\" ||| Page 6: \"Your mermaid dick is so unlike mine, it's so big and smooth and beautiful.\" \"Yu-kun...\" \"Ah...\" \"Oh, did I make you hard again? Then...\" ||| Page 7: \"Aaah! Yu-kun!\" \"Going to come, sister?\" \"Yu-kun's mouth is so good!\" \"You've improved! Take my dick!\" \"My mermaid dick! Yu, drink all of my-\n\n"},{"id":1137598,"gallery_id":302443,"poster":{"id":1308549,"username":"ARandomUserGuaGua","slug":"arandomuserguagua","avatar_url":"avatars/1308549.png?_=ab5e27a0ea6796c8","is_superuser":false,"is_staff":false},"post_date":1597112117,"body":"is this really a fucking futa mermaid doujin?"}]