[{"id":1808926,"gallery_id":30585,"poster":{"id":2871983,"username":"sakatagintoki35","slug":"sakatagintoki35","avatar_url":"avatars/2871983.png?_=1adb8cb9ec9f7fe0","is_superuser":false,"is_staff":false},"post_date":1623784165,"body":"Guys...don't comment from here onwards. Everyone needs to read bbdo's analysis."},{"id":1705868,"gallery_id":30585,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619665901,"body":"It was unfortunate to see Yamane leave, but it appears she realized she fulfilled her part in helping Masaki deal with his problem, and is now returning to her old life, almost like a minor reflection of Miharu and how she returns with someone, not knowing what the future holds, and just does not want to be alone. Miharu does not realize that she is just filling her self with sex to not feel alone and even wonders why her son is still trying to get her back, maybe worried that she does not want to fall further into depravity with her son, scared of the societal repercussions but also realizes that she has become the weird one, with how far she has fallen. No longer being fulfilled with Makoto, but at the same time does not know what she wants for her life. Let us continue as we see the climax soon and how the story will end."},{"id":1705853,"gallery_id":30585,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619665602,"body":"I just love seeing Masaki being strong and assertive, not taking crap from anyone and dealing with the situation from all possible fronts, while Makoto grovels to him looking for help after literally taking Masaki's mother from him without a care in the world, truly unaware of the situation at hand. You almost feel bad for him, until you remember how much of pompous jerk he was throwing his \"excellent relationship\" with Miharu at Masaki's face for his own enjoyment, like some competition. But we also see Miharu's attempt at trying to finish this relationship with Sakaki during the 3 day vacation, but fails to even answer Makoto and only indulges even further in her desires. Then we have Masaki going to where they are seeing his mother's other side as a woman. Then in a way, gets an \"encouraging push from Sakaki to stick it in."},{"id":1705840,"gallery_id":30585,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619665382,"body":"What a volume this was! She is lying to herself regarding her relationship with Makoto and it is eating her away, and she is leading two different lives, one of crazy depraved sex with one man, and trying to fulfill an emotionally happy love life with another, but she cannot do either of them properly. It was great to see Masaki go through his own little character arc and growth where he has gotten used to smoking with Yamane and is dealing with the situation from different angles. He confronts Sakaki to learn the truth about his relationship with Miharu, something we don't see in other NTR stories, and he even tells off his estranged \"friend\" Makoto throwing it in his face how he should know Miharu and trust her, and if that was the case, why does he not know where she is and what she is doing. He becomes so insecure and is slowly realizing that he does not know her like he thought he does. "},{"id":1520173,"gallery_id":30585,"poster":{"id":3322860,"username":"shinjixx","slug":"shinjixx","avatar_url":"avatars/3322860.png?_=d38e3aa62f9843bc","is_superuser":false,"is_staff":false},"post_date":1611345935,"body":"Very good, URE-004 is the live adaptation"},{"id":880903,"gallery_id":30585,"poster":{"id":2085189,"username":"explicit_desire","slug":"explicit_desire","avatar_url":"avatars/2085189.png","is_superuser":false,"is_staff":false},"post_date":1555823335,"body":"Well damn, at page 111 he looks a bit more confident, nice indeed"}]