[{"id":1705943,"gallery_id":30786,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619669055,"body":"Sakaki's wife Midori appears to be a huge player in all this as she as acting as the third party outside force to motivate Masaki to go after his mother so that she does not fall for Sakaki. He is hesitant to trust Midori, but wants to save his mom, so he goes for it and learns that Miharu was the only one to reject Sakaki that last time many years ago, so he has a bit of a bone to pick with Miharu, quite the dynamics and plays at hand here. Plus it was nice to see Yamane give our boy Masaki a little bit of a pep in his step for his final battle lol. But now with Miharu not wanting to fall into depravity with her son, she decides to return to Sakaki, thinking that is all but I do wonder how she plans on doing it all and keeping up the lies with all of them. And Makoto just being a stalker since he is unable to obtain any info by himself, sad life "},{"id":1705937,"gallery_id":30786,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619668834,"body":"However she probably didn't push the subject anymore with Masaki since he did not push either and just accepted her wholeheartedly, since he knew of the agreement already prior due to Sakaki telling him after their sexual escapade together at the apartment. It just left a weird taste in my mouth how she is just so oblivious to the damage that was done, but I guess since Makoto easily believed the broken phone story, she though she was in the clear. However, she has begun to awaken to her son's desire for her as a woman and is feeding it little by little, as we see her masturbate at the doorway and is conflicted with her feelings. And in order to salvage what remains of their relationship, she falls into Sakaki's teasing of her potential desire for her son, and how she is no longer satisfied with Makoto, thus leaving Sakaki her only option."},{"id":1705927,"gallery_id":30786,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619668523,"body":"What bothered me the most though was how even though Masaki welcomed his mother back without a fight and questioning her choices regarding Makoto, she immediately thought that everything returned back to normal and did not even bother to see if he was doing alright regarding all of it, considering she left him for more than two weeks without a word and only called him twice trying to deceive Sakaki, again no communication whatsoever, and just somehow comes back randomly and does not even try to explain anything to him. But this is most likely due to her mindset of how far she has fallen to her carnal desires that she just tries to fulfill her obligation as a mother with Masaki and as a lover with Makoto and as a subordinate to Sakaki, no strings attached, the perfect life she thought she was returning to."},{"id":1705925,"gallery_id":30786,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619668338,"body":"We are approaching the rubicon! Crazy roller coaster of a series! Now we have the introduction of Sakaki's wife Midori who had the unfortunate opportunity to marry a complete sadist of a man who enjoys nothing more than to break woman down to their most basic impulses. Now we see for what he truly is and some how convinced Miharu, Masaki's mom, to go back to her original home in order to not cause more rumors to spread at work for going out with such a young employee of the same company. I still wonder how Makoto and Miharu both thought that was a good idea, but it is quite strange to see her still try to fulfill her part in that relationship with Makoto after everything that happened. Somehow, Sakaki's condition on leaving her alone as long as she went back home was strange to her but we know he is playing some 4D chess on all of them to get her to desire him of her own will and not push her into anything, which he does here, by playing with her emotions regarding her son. "},{"id":1520191,"gallery_id":30786,"poster":{"id":3322860,"username":"shinjixx","slug":"shinjixx","avatar_url":"avatars/3322860.png?_=d38e3aa62f9843bc","is_superuser":false,"is_staff":false},"post_date":1611346598,"body":"the best of the series, URE-005 is the live adaptation"},{"id":137665,"gallery_id":30786,"poster":{"id":1221483,"username":"uMad","slug":"umad","avatar_url":"avatars/1221483.png","is_superuser":false,"is_staff":false},"post_date":1499413361,"body":"ok last more volume to end this torture"}]