[{"id":2209747,"gallery_id":30783,"poster":{"id":4043388,"username":"k-pop","slug":"k-pop","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1640035659,"body":"I don't know why vanilla fans are angry? this story shows that, having sex with someone you truly loves is the best sex. Miharu leaving sakaki also shows that big dick isn't always the best. NTR and incest were there for the plot. For a hentai this plot is S- tier. I stopped fapping and just read the story but when masaki didn't stop Makoto NGL they had me."},{"id":2209724,"gallery_id":30783,"poster":{"id":4043388,"username":"k-pop","slug":"k-pop","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1640034618,"body":"let's just all agree that Makoto should die by getting cucked "},{"id":2156267,"gallery_id":30783,"poster":{"id":2275702,"username":"wxyz.zxab","slug":"wxyz-zxab","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1637551118,"body":"Why every women in this series always cheating? Could author gives us a single woman? 😪"},{"id":2126389,"gallery_id":30783,"poster":{"id":3064166,"username":"R7venger","slug":"r7venger","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636137358,"body":"So many part of thus series where do i start? From the 1 or the extra ? This look good to watch"},{"id":2052147,"gallery_id":30783,"poster":{"id":3260081,"username":"lbnrPtk","slug":"lbnrptk","avatar_url":"avatars/3260081.png?_=304e9a23b9842b75","is_superuser":false,"is_staff":false},"post_date":1633035865,"body":"Makoto is a piece of shit."},{"id":2011831,"gallery_id":30783,"poster":{"id":3341146,"username":"Frankie222","slug":"frankie222","avatar_url":"avatars/3341146.png?_=07503ec1e79cd03f","is_superuser":false,"is_staff":false},"post_date":1631469903,"body":"I can die now in peace, thank you everyone"},{"id":1809073,"gallery_id":30783,"poster":{"id":2871983,"username":"sakatagintoki35","slug":"sakatagintoki35","avatar_url":"avatars/2871983.png?_=1adb8cb9ec9f7fe0","is_superuser":false,"is_staff":false},"post_date":1623790437,"body":"@bbdo\nDon't worry. I hate Makoto as well XD"},{"id":1723187,"gallery_id":30783,"poster":{"id":36732,"username":"jokerXY","slug":"jokerxy","avatar_url":"avatars/36732.png","is_superuser":false,"is_staff":false},"post_date":1620390673,"body":"Not a big fan of the ending being a fan of corruption endings myself but yes this series was good and is a good one to return to"},{"id":1706061,"gallery_id":30783,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619673674,"body":"I know I wrote a lot all across this series, but I just needed to put my thoughts down in writing and read over the story to truly understand all the little details. I felt we could have used a little less of Miharu's scenes with Makoto and maybe some other scenes to cut down on the length, but it was forgivable, I guess that's just me despising Makoto as a character and just wanting to get the why's of their actions. Either way, I had blast reading this as a story and some good fap material. A lot of the times, the dialogue left much to be desired for, but I guess I give it to Tsuya for trying to use the characters expressions to tell us all we need to know, and not have every little thing said, because it did feel a bit confusing at times, but a 2nd time reading it helped me understand the character motivations better, I did not like or agree with them, but I understood them and I am just glad to have a happy ending between Miharu and Masaki. What a trip!"},{"id":1706050,"gallery_id":30783,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619673381,"body":"I get why people are bothered by the constant sex of Miharu with the other men all the way until the last chapter where Masaki finally gets to be with his mom, but again, this was more a story being told with hentai elements, and I am all here for a good story by Tsuya. And besides, Masaki was still able to get some girls with him as well so it wasn't like he was never winning, it just made the ending more satisfying once he was able to win over his mom completely. He was still getting action in between, almost like appetizers before the main course. I'll leave a link for an extended version of ch.49 here for others to see and a link to the extra side stories, all of which I have yet to read completely, but have been enjoying some nonetheless.\nhttps://nhentai.net/g/30888/\nhttps://nhentai.net/g/119814/\nhttps://nhentai.net/g/50032/\n"},{"id":1706041,"gallery_id":30783,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619673011,"body":"The only thing we can assume is that these feelings were dormant within them ever since they began their lives just them two after the husband left and they grew even more as they got older. And like @King_Galahad said, the NTR was used to drive the story, and not some fetish or kink just placed in. Sakaki was not big dick wins over woman, it was a mix of sexual and emotional manipulation, and Masaki was the one to fulfill his mother in both body, mind, and soul. Masaki loved her regardless, and like he said, Sakaki was incapable of loving anyone. Then we Midori coming in with undercover detective work of getting her husband turned in for illegal possession of drugs, what a power move, just loved how the characters all had a role in the story and did something significant. \n"},{"id":1706034,"gallery_id":30783,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619672777,"body":"Although the incest was never truly at the forefront of the story like a kink or fetish, but more so as a drive for story and was actually introduced subtly in the background from a strong love that Masaki and Miharu felt for each other after her husband left into something more and was further realized when Masaki started going out with girls, Miharu felt that she needed to be with someone else, almost like her son, same as for him going out with older women like his mom. Since volume 1, we see Masaki being conscious of his mom as a woman, and soon after coming to the house, she became conscious of her son as a man. It was not clear exactly at one point when they realized their feelings for each other, besides this chapter when they had sex, but it did feel a little strange when they showed tendencies but not explained."},{"id":1706028,"gallery_id":30783,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619672529,"body":"Then we have Midori reminding Masaki that he was the only who could save his mother from Sakaki, because he already saved her once as a child when Midori went looking for her to kill her for the love affair. That was really beautiful and how Masaki gave his mother the time she needed to end things with Sakaki, thus saving herself in the long run. With this in his heart, Masaki revealed to his mom in the shower and the bedroom, that regardless of all that has happened, and no matter how defiled she may feel, she is the most important person in Masaki's life, ever since he was little, after his father left, all throughout school, even through all the depravity, he knew that his mother just wanted to be accepted wholeheartedly in body and heart. And in a way, he was always there for her, never forgetting about her. "},{"id":1706014,"gallery_id":30783,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619672192,"body":"It truly made their sex scene more of a revenge rape and it was truly uncomfortable all the way through, his rage and her crying just really made everything so tense, especially when he called her bitch, it was like something in Miharu's brain snapped and broke her, confirming her doubts: she was not a person deserving of love, but just some onahole to be used by men for their own pleasure. The icing on the whole encounter was Masaki punching Makoto across the hallway and making him realize he never truly loved her, nor even knew her. Spectacular performance! Then with Masaki coming in with the blanket to cover and comfort her, was truly the move to make in said situation. He pretty much told her \"mom, I'll be here, when you need me.\" Loved it all!"},{"id":1706006,"gallery_id":30783,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1619672030,"body":"And it is complete! What a roller coaster of a story this was! I was really impressed with how Tsuya reflected Makoto's rejection with Masaki's rejection back in volume 2 when she pushed him away as he came, realizing that it's over. I do have to say though I wonder why Masaki waited until Miharu rejected Makoto's advances towards the end, but I do feel it was necessary for him to understand that things were over between them. Makoto truly only ever saw Miharu as an object to conquer for his own pleasure of owning his friend's mother, like some sick contest and never actually cared for who she was or her past. He never gave a choice to explain when all the lies came out and just punished her with physical abuse. "},{"id":1702901,"gallery_id":30783,"poster":{"id":3776196,"username":"EDHOLLA","slug":"edholla","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1619552612,"body":"I love NTR but this story is a convulted mess even for NTR stories never got into it and I didn’t want his stupid friend to have a happy ending screw that dude"},{"id":1520208,"gallery_id":30783,"poster":{"id":3322860,"username":"shinjixx","slug":"shinjixx","avatar_url":"avatars/3322860.png?_=d38e3aa62f9843bc","is_superuser":false,"is_staff":false},"post_date":1611347080,"body":"Finally the end of the series, URE-005 is the live adaptation"},{"id":880927,"gallery_id":30783,"poster":{"id":2085189,"username":"explicit_desire","slug":"explicit_desire","avatar_url":"avatars/2085189.png","is_superuser":false,"is_staff":false},"post_date":1555825469,"body":"The NTR here are soft i would say.\nBut shit, the fuck with that Makoto guy punchin' the Masaki?\nDude, really?\nLike they said, enemy tomorrow could be ally, and friends tomorrow could be the enemy.\nSeriously, this is fuckin hilarious hahahaha"},{"id":768825,"gallery_id":30783,"poster":{"id":2019477,"username":"King_Galahad","slug":"king_galahad","avatar_url":"avatars/2019477.png","is_superuser":false,"is_staff":false},"post_date":1546062778,"body":"Read this once before about two years ago, still a pretty good story for a hentai. Though NTR is still not really my cup of tea but at least this served as a purpose for a plot rather than solely just cause it's a kink. I found that I just binged this series rather than beat off to it much like last time. I'll favorite the series just in case I find myself wanting another good read on this sometime in the future."},{"id":673791,"gallery_id":30783,"poster":{"id":1904278,"username":"palir kajung","slug":"palir-kajung","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1535847282,"body":"The best Autor doujin ntr tduya tsuya"},{"id":140853,"gallery_id":30783,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1500116006,"body":"Vanillafags bitching as usual "},{"id":135760,"gallery_id":30783,"poster":{"id":30317,"username":"est430","slug":"est430","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1498959422,"body":"Damn. Atleast it's a happy ending. Ugh. Too much fcking other guys."},{"id":62392,"gallery_id":30783,"poster":{"id":189041,"username":"lovehentai5567","slug":"lovehentai5567","avatar_url":"avatars/189041.png","is_superuser":false,"is_staff":false},"post_date":1474061065,"body":"As much as I hate ntr, I appreciate artist like tsuya tsuya, in couple of his/her work, at least there's some happiness for the MC either with the original woman, or someone else, well I like the first rather than the latter tho lol XD"},{"id":48356,"gallery_id":30783,"poster":{"id":33724,"username":"chefscoccer","slug":"chefscoccer","avatar_url":"avatars/33724.png","is_superuser":false,"is_staff":false},"post_date":1465680773,"body":"this guy even dared to call him \"my best friend\"  really nobody needs a friend like you ."},{"id":48283,"gallery_id":30783,"poster":{"id":33724,"username":"chefscoccer","slug":"chefscoccer","avatar_url":"avatars/33724.png","is_superuser":false,"is_staff":false},"post_date":1465639156,"body":"too much fucking other guys . the son is stupid for letting thaat happen"},{"id":47761,"gallery_id":30783,"poster":{"id":586194,"username":"hornyforhentai1","slug":"hornyforhentai1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1465250862,"body":"took too long to get to the incest, couldn't bear to read it after first chapter"}]