[{"id":2361398,"gallery_id":309907,"poster":{"id":3986298,"username":"Houkka","slug":"houkka","avatar_url":"avatars/3986298.png?_=6b539a98116d5329","is_superuser":false,"is_staff":false},"post_date":1645857993,"body":"Relax you cunt.\n\nThe pedo cunt got executed and the dweeb ended up becoming a CHAD with a harem.\nSo all ended well."},{"id":2352070,"gallery_id":309907,"poster":{"id":789032,"username":"LaLover","slug":"lalover","avatar_url":"avatars/789032.png","is_superuser":false,"is_staff":false},"post_date":1645443213,"body":"yeah get cucked you fucking loser, that's what you get when you are an insecure cunt, now thanks to you she gets her child pussy bred by a better man"},{"id":2041299,"gallery_id":309907,"poster":{"id":187691,"username":"Neuralyzed","slug":"neuralyzed","avatar_url":"avatars/187691.png?_=4fd0d2337a1a3d45","is_superuser":false,"is_staff":false},"post_date":1632600330,"body":"bruh she did the MC dirty. fuck that bitch"},{"id":1942453,"gallery_id":309907,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628863598,"body":"Why did he say that it all ened okay? What happened to the girl? Blonde guy doesnt seem like he'll stay with her"},{"id":1901803,"gallery_id":309907,"poster":{"id":746275,"username":"baobo1216","slug":"baobo1216","avatar_url":"avatars/746275.png?_=f551f0dee8114694","is_superuser":false,"is_staff":false},"post_date":1627376380,"body":"Good end i guess"},{"id":1720775,"gallery_id":309907,"poster":{"id":1388793,"username":"Lemmings","slug":"lemmings","avatar_url":"avatars/1388793.png?_=3b702e3e6eb0bb51","is_superuser":false,"is_staff":false},"post_date":1620284381,"body":"Bruh all hentai I see of Ragnarok Online is ntr lmao"},{"id":1658351,"gallery_id":309907,"poster":{"id":1218593,"username":"kayosblade","slug":"kayosblade","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617486549,"body":"I love how the girl immediately abandons the mc and screws the other guy instead of letting the mc cool down, explain the situation, and have mc feel like a heel later. I hope her operator gets isakai'd to some terrible place."},{"id":1614312,"gallery_id":309907,"poster":{"id":1539140,"username":"stylecontent","slug":"stylecontent","avatar_url":"avatars/1539140.png?_=979f588540ee7e59","is_superuser":false,"is_staff":false},"post_date":1615545756,"body":"Lowlife girl, she slapped mc, but other man allowed to do her. Fucc her life, fucc the antagonist, fucc the author, fuc all of you"},{"id":1278580,"gallery_id":309907,"poster":{"id":3731107,"username":"drnam645","slug":"drnam645","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603010708,"body":"@june024 hey there is something I don't understand (I'm not familiar with RO so please forgive my ignorance) He keeps saying that she did this for his sake. So you guess that Tomoko's class is a Soul Linker, so my question is can a character get a skill from a different class and can you then share them??? because then the ending will make sense if she got the Assassins Soul skill for You/Kou and that is why she need to stick to the RK to farm for this skill. Thanks for you time"},{"id":1201636,"gallery_id":309907,"poster":{"id":816502,"username":"june024","slug":"june024","avatar_url":"avatars/816502.png?_=6e59be68a5ca8eaf","is_superuser":false,"is_staff":false},"post_date":1599680914,"body":"If you'll ask why didn't Tomoko ask for You/Kou for help instead, Kou/You is an Assassin class character.\n\nNormally, Assassins are dodgers. Having the highest flee and dodge rate in-game. Makes sense to use him as a tanker right? Not really. As a flee or dodger, the more the monsters come to beat you, the lesser your flee gets effective as a defensive tool. Assassins are normally offensive characters than defensive and are normally called to become character killers (Yay! EDP for the win) or emperium breakers (EDP again).\n\nHowever, leveling an Assassin is tough. It takes time and patience since they don't have the best damage output until they reach the later levels unlike RK's which are basically damage absorbers but can still wallop some damage against characters. \n\nThey do kneel down later on to Assassins because well, in later stages, Sins deal more damage than RK's..."},{"id":1201625,"gallery_id":309907,"poster":{"id":816502,"username":"june024","slug":"june024","avatar_url":"avatars/816502.png?_=6e59be68a5ca8eaf","is_superuser":false,"is_staff":false},"post_date":1599680594,"body":"Now, if you'll ask why he mentioned that Tomoko got the skill for him in exchange for sleeping with the Rune Knight, allow me to indulge you to some RO knowhow...\n\nRune Knights or RK as we call them, are one of the sturdiest characters you can face. Enemies can go hit them and they'll just consider it as a poke to them. Having one of the highest defense in-game, it's no wonder other characters ask them to help them in leveling up. Normally they tank for the party or guild while the others keep beating the monsters to level up faster."},{"id":1201617,"gallery_id":309907,"poster":{"id":816502,"username":"june024","slug":"june024","avatar_url":"avatars/816502.png?_=6e59be68a5ca8eaf","is_superuser":false,"is_staff":false},"post_date":1599680280,"body":"I'm not sure if the girl was a Soul Linker. As a Soul Linker, the character has the most supportive skill of all characters in-game. They have alot of awesome offensive skills but their main attribute is to \"link\" with other characters to boost their skills and efficiency.\n\nIn terms of the story, the skill \"Assassin's Soul\" or \"Assassin Spirit\" allows the Assassin class (Assassin, Assassin Cross and Guillotine Cross) to gain access to  his hidden skills. More importantly, it improves one of his dominant skill \"Sonic Blow\" which allows him to hit an enemy eight consecutive times. The improvement comes with the skill getting double damage plus it gets it's cool down halved."},{"id":1107458,"gallery_id":309907,"poster":{"id":1048210,"username":"Kazuchi","slug":"kazuchi","avatar_url":"avatars/1048210.png","is_superuser":false,"is_staff":false},"post_date":1595888706,"body":"I need more like this "},{"id":1089641,"gallery_id":309907,"poster":{"id":529124,"username":"fallenFromMeaning","slug":"fallenfrommeaning","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595214601,"body":"@dizzy_jizzy well, ntr might give the opportunity for an interesting story but i honestly do not feel like it actually raises the probability of the story being good. there is so much opportunity to be taken by a creative mind or wasted by a less gifted one, regardless of the particular genre. its like saying having a rope increases the chance of suicide. sure, you can kill yourself with it, but you will only do it if you are really hellbent on doing it, and then you would have done it some way anyhow. if there is some property that is consistently associated with higher quality story, i would say it is the theme of aging. everything i can think of right now spanning multiple generations or even just following the development of one usually is moving. the story i liked most on the whole was https://nhentai.net/g/118855/ because it has a bit of everything with a healthy dose of self aware humor. concerning the other end of the spectrum, almost all hypnosis stuff is just incredibly bland"},{"id":1060430,"gallery_id":309907,"poster":{"id":3365502,"username":"Shoudidnothingwrong","slug":"shoudidnothingwrong","avatar_url":"avatars/3365502.png?_=a65e32785e4c73e4","is_superuser":false,"is_staff":false},"post_date":1594095228,"body":"Ragnarok online sure has a lot of NTR"},{"id":1005555,"gallery_id":309907,"poster":{"id":934674,"username":"dizzy_jizzy","slug":"dizzy_jizzy","avatar_url":"avatars/934674.png?_=c29c0c338eafd670","is_superuser":false,"is_staff":false},"post_date":1592139415,"body":"Thanky you kind stranger. Also yeah this is why i like ntr, way better than \"everything's great\" bullshit "},{"id":998443,"gallery_id":309907,"poster":{"id":529124,"username":"fallenFromMeaning","slug":"fallenfrommeaning","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1591928071,"body":"it is nice how game mechanics can be used to tell such an engaging story. also if i am getting this right he moved on, found his way, and could even feel nostalgic bitter sweetness for his love long gone, which is an unusually wholesome ending to the tragic \"for his sake\"-ntr type"},{"id":998431,"gallery_id":309907,"poster":{"id":529124,"username":"fallenFromMeaning","slug":"fallenfrommeaning","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1591927845,"body":"@dizzy_jizzy me neither, but from the context it seems that it is a powerful skill or item that one can acquire through marriage, which is only useful for an assassin class, which is kous class, so he could conclude it was meant for him"},{"id":993368,"gallery_id":309907,"poster":{"id":934674,"username":"dizzy_jizzy","slug":"dizzy_jizzy","avatar_url":"avatars/934674.png?_=c29c0c338eafd670","is_superuser":false,"is_staff":false},"post_date":1591813003,"body":"Can anyone explain to me what this 'assassin soul' is? Never played ragnarok online."}]