[{"id":2412187,"gallery_id":310855,"poster":{"id":4344728,"username":"LI∆","slug":"li","avatar_url":"avatars/4344728.png?_=fcaaff20f3dd5f9e","is_superuser":false,"is_staff":false},"post_date":1647984755,"body":"baysideThe1st you are too based"},{"id":1939499,"gallery_id":310855,"poster":{"id":4457288,"username":"Still_Under_Age","slug":"still_under_age","avatar_url":"avatars/4457288.png?_=d2b1ac26ebf7ec53","is_superuser":false,"is_staff":false},"post_date":1628748402,"body":"Huh.... I can't say much.... Pretty sad "},{"id":1383252,"gallery_id":310855,"poster":{"id":1767738,"username":"Sheza","slug":"sheza","avatar_url":"avatars/1767738.png","is_superuser":false,"is_staff":false},"post_date":1607090633,"body":"I..... what....... . . . .. im speechless"},{"id":1382873,"gallery_id":310855,"poster":{"id":2395675,"username":"DeMon","slug":"demon","avatar_url":"avatars/2395675.png","is_superuser":false,"is_staff":false},"post_date":1607072553,"body":"Cool      "},{"id":1206443,"gallery_id":310855,"poster":{"id":1515068,"username":"Shoukaku6781","slug":"shoukaku6781","avatar_url":"avatars/1515068.png?_=97724d90dbad88eb","is_superuser":false,"is_staff":false},"post_date":1599912737,"body":"that breast expansion on last page tho"},{"id":1100086,"gallery_id":310855,"poster":{"id":2385102,"username":"BaysideThe1st","slug":"baysidethe1st","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595615395,"body":"She may have been slapped for accidentally using her teeth but good grief she isn't cuffed all the time and she can easily go for a low blow with all that muscle she's carrying and knock his fat ass out with a blunt instrument once she's got him stunned by literally hitting him where it hurts. After hitting him she can force him to open the door or she can break a plate and threaten him so that way he'll comply and not to mention those windows look like they can be broken by tossing something at them and once she's out she can go back home. and report him to the authorities or She can kill him herself since literally no one will miss him.  Please for the love of dog remake this or atleast continue it with him dying."},{"id":1100071,"gallery_id":310855,"poster":{"id":2385102,"username":"BaysideThe1st","slug":"baysidethe1st","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595614990,"body":"Where is the logic behind this? 6 months? A whole year has passed? There is no way a mother would allow this charade to go on. No to mention he's filthy rich and all he had to do was invest time into learning how to talk to women. This is inhumane how the police would just ignore this from happening. Some police force can take that door down and the detectives can trace suspicious purchases down to that fucking cabin. Also how would that abomination of a fucking \"Family\" work? Clearly from her giving birth the child would need schooling and from staying indoors your entire life you would have a suspicion that you would want to go outside and see the world. His god damn \"plan\" has so many faults and he has to swing. I'm sorry but this just has to continue with the tomboy escaping and there has to be a way for her to fight back and not just sit there and take it. She's a tomboy for chrissake. She's clearly packing some muscle and can take him down with some force and escape. "},{"id":1100038,"gallery_id":310855,"poster":{"id":2385102,"username":"BaysideThe1st","slug":"baysidethe1st","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595614153,"body":"There has to be a continuation of this, what happens to the \"couple\"? I have to see this son of a bitch liberated for his actions. Treating someone like this just isn't right. I want him to suffer and die in pain. There is absolutely no way they would turn a blind eye to this and I would be willing to commission an ending to this story just for that fat fuck. There's no way in Hell I would accept this. Please continue this and make sure the bastard pays."},{"id":1096582,"gallery_id":310855,"poster":{"id":3480069,"username":"Gedang goreng","slug":"gedang-goreng","avatar_url":"avatars/3480069.png?_=ddcb1f7b05ac5d03","is_superuser":false,"is_staff":false},"post_date":1595484106,"body":"I need more"},{"id":1001593,"gallery_id":310855,"poster":{"id":519200,"username":"Hilldog","slug":"hilldog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592018159,"body":"The one realistic part of this whole doujin is that Japan winning a gold medal in running only happened in her fucking dreams."}]