[{"id":1543922,"gallery_id":311190,"poster":{"id":1649066,"username":"LettuceZ","slug":"lettucez","avatar_url":"avatars/1649066.png?_=89001055fe6888e7","is_superuser":false,"is_staff":false},"post_date":1612393085,"body":"Lol why do so many Utaha doujins feel so bitter/sad. Almost every single one has her doin shut like this just to get mcs attention and he never really cares. Nigga got Kato vision and she can't handle it to the point where she self destructs. \n\n She basically told this nigga that pickin best girl kato fucked her up so bad she became a mega hoe and that nigga aint give a single shit. Even nonchalantly begged that man to fuck and said she wouldn't tell anybody and he said nah. Lmao "},{"id":1380539,"gallery_id":311190,"poster":{"id":3206078,"username":"Generaldxd","slug":"generaldxd","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606984371,"body":"Welp i have come down to deep for myself\nBut its seems the hole is far more deeper...\nAnd redhawk comment might ring a bell \nTo it...."},{"id":1180806,"gallery_id":311190,"poster":{"id":3413723,"username":"RedHawk01","slug":"redhawk01","avatar_url":"avatars/3413723.png?_=7855f2011fb3dcc8","is_superuser":false,"is_staff":false},"post_date":1598790568,"body":"People like that are just beta man like all people who like ntr . They are just beta dicks who  can’t satisfy their woman’s, so to find some dignity and get out of reality where their lovers always cheat on them and go to hostel with random guys, they draw this kind of shit manga .\nRead manga before draw this kind of shit "},{"id":1074410,"gallery_id":311190,"poster":{"id":1781700,"username":"LongNoseTribe","slug":"longnosetribe","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594575197,"body":"Awwww, I wish he broke down and suddenly died. Sick and tired of seeing harem animes, which there was an anime where some black niggas steal a harem from some dumbass MC."}]