[{"id":1219558,"gallery_id":313294,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600512142,"body":"I meant their apartment not house xD"},{"id":1219552,"gallery_id":313294,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600511785,"body":"@shadowvanitas1 did some translation with my phone cause I was curious on what happened. \n\nBasically the wife led a fairly successful/rich life and got married to a younger dude to start a family she thought he could support their family but instead he's pretty broke and not working, their house which I think she thought he had bought was instead inherited. So he pretty much tells her to sell are her expensive clothes so they can get some more money so he can buy games/drink/etc basically just fool around and mooch of her. Then the sex is terrible with him cumming in less then a minute / few minutes after inserting and doesn't do anything to pleasure her.\n\nThen they meet the ugly dude, the husband is 32, wife is 42 and ugly dude to the wives suprise is in his twenties, he is also the owner of the apartment complex they live in. While mad and feeling sexually frustrated with husband the ugly dude comes over and shows her his notebook that he's filthy rich and willing to pay her "},{"id":1219549,"gallery_id":313294,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600511640,"body":"a fortune for sex, she at first say's no cause she's no cheap skank, but then after seeing the amount of money he's willing to pay she goes for it. Ugly takes out a huge dick and then bones her for hours, later on she say's she'll never do it again only for her no good husband phoneing her to tell her he's not coming home cause he'll be out all night drinking and partying with friends. Wife then instantly goes to sleep with the ugly dude, fast forward a bit she tells husband she wants a child but get's him drunk and sleeps with ugly. Then a few months forward and it's implied the husband is starting to shape up and got a job for their future child but by then it's already too late cause she's a slave to uglies cock now. "},{"id":1116892,"gallery_id":313294,"poster":{"id":1414713,"username":"ShadowVanitas1","slug":"shadowvanitas1","avatar_url":"avatars/1414713.png","is_superuser":false,"is_staff":false},"post_date":1596264668,"body":"Translation please 😶"}]