[{"id":1945932,"gallery_id":314398,"poster":{"id":2113184,"username":"mykys","slug":"mykys","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628998347,"body":"domination loss ?"},{"id":1823426,"gallery_id":314398,"poster":{"id":1581120,"username":"Belkin03","slug":"belkin03","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1624349836,"body":"Bruh the two dolls holding the heart was cute as fuck"},{"id":1719948,"gallery_id":314398,"poster":{"id":2340504,"username":"Adieb","slug":"adieb","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620245745,"body":"I hope this series will continue as fast as author can"},{"id":1691058,"gallery_id":314398,"poster":{"id":2802018,"username":"HarleyD","slug":"harleyd","avatar_url":"avatars/2802018.png?_=75089b9bf262f222","is_superuser":false,"is_staff":false},"post_date":1619002918,"body":"Lmao the Demon Lord has a crush on him. "},{"id":1330226,"gallery_id":314398,"poster":{"id":1209269,"username":"Fire Wolf","slug":"fire-wolf","avatar_url":"avatars/1209269.png?_=0bedd1dd63c454f2","is_superuser":false,"is_staff":false},"post_date":1605115367,"body":"Damn you fakku you bastards"},{"id":1129844,"gallery_id":314398,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1596807308,"body":"This is amazing and hot! Demon King stalker incoming to lose it against hero :D That series is orginally translated and licensed by Fakku that's why this isn't uploaded here. You can find it in English on hentainexus.com or hentai.cafe ,but now only up to chapter 3. I don't know why because all chapters are translated on Fakku and only 3 uploaded on these websites.\n"},{"id":1127811,"gallery_id":314398,"poster":{"id":2526489,"username":"ottesuhc","slug":"ottesuhc","avatar_url":"avatars/2526489.png","is_superuser":false,"is_staff":false},"post_date":1596719775,"body":"The Demon King is an stalker xDDDD"},{"id":1125065,"gallery_id":314398,"poster":{"id":1887819,"username":"King of Spades","slug":"king-of-spades","avatar_url":"avatars/1887819.png?_=4839e868f3714afb","is_superuser":false,"is_staff":false},"post_date":1596604603,"body":"Nutted twice and did not understand a word. The power of succubus."},{"id":1100405,"gallery_id":314398,"poster":{"id":3340899,"username":"Quinx1755","slug":"quinx1755","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1595632417,"body":"@SuperDementio Could you do summaries of the Gaiden chapter and chapter 4"},{"id":1023063,"gallery_id":314398,"poster":{"id":1192237,"username":"SuperDementio","slug":"superdementio","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592703874,"body":"Naoki remarks that it's unfortunate that the hero's powers don't work on demons and Teanne says that's not the case. Numerous heroes in the past have used their powers to enslave succubi. They realize that they need to cum inside them directly. Also, it turns out the succubi were both virgins. Naoki turns Dorothea, causing a mark to appear on her crotch. He turns his attention to Lyla but she refuses to submit. Teanne infuses Naoki's dick with light magic together they make her cum and submit to Naoki. Naoki wants to fuck Teanne as well, but as a cleric, she's hesitant with joining an orgy with demons. They fuck and the others come back, bringing gifts. At the end, Lyla sends a message to the demon king, notifiying her of their betrayal. The demon king is angry and says that they will use the hero's power to strengthen the demon army. Later, she reveals that's just a pretense as she is infatuated with Naoki and wants the hero to become her plaything."},{"id":1023060,"gallery_id":314398,"poster":{"id":1192237,"username":"SuperDementio","slug":"superdementio","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592703742,"body":"Plot summary: The group arrives at a market situated near the border and the ocean. Three of them go shopping while Tianne stays with Naoki to teach him how to read and write this world's language. Tianne was a teacher back at the church, and volunteered herself to go on the journey to defeat the demon king. Naoki falls asleep due to boredom and gets attacked by succubi, Lyla and Dorothea. They make him cum, stating that demons are immune to the hero's semen and that succubus fluids are an aphrodisiac. The demon king has been surveilling them and ordered the succubi to capture the hero alive. Lyla says they're going to play with him first and make him submit. The succubi fuck Naoki but he feels that something's off. After cumming in Dorothea a whole bunch, Lyla steps in and Naoki figures out what was wrong. The succubi were using an illusion to make it look like they were fucking him, but they were really using fleshlights instead. Teanne comes in and smites the succubi, sealing them"},{"id":1020099,"gallery_id":314398,"poster":{"id":961993,"username":"Mr. Ero-Jin","slug":"mr-ero-jin","avatar_url":"avatars/961993.png","is_superuser":false,"is_staff":false},"post_date":1592593283,"body":"Damn, even the Demon King or Queen also attracted to the supposed hero xD"}]