[{"id":1177582,"gallery_id":315451,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1598644555,"body":"No offense but this is bad. Story is ridiculous (comparable to a delusional teenager writer running wild with silly imagination), and even if we ignore story for the sake of only as fapping material, the art is pretty much mediocre. In other words, best rating this thing can get is a low-tier or C-grade for the effort."},{"id":1037621,"gallery_id":315451,"poster":{"id":3398957,"username":"wolfman24","slug":"wolfman24","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1593229115,"body":"Hey I’ve been trying to find a doujin for a while found it once but can’t find it again bout an old dude steals this guy’s girlfriend it’s like a series or something the one chapter I remember was the guy who lost his girl worked at a convenience store anybody know the name  "},{"id":1024977,"gallery_id":315451,"poster":{"id":900357,"username":"lolhentai101","slug":"lolhentai101","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592764589,"body":"The MC finds out that the mom has been prostituting herself to make money, which turned into some adult movies. The boy that bullied him let's MC know they are dating and gives him a link to something that turns out to be the boy filming the MC's mother as she started to enjoy having sex with him. A few years later the MC sometimes sees his mother in the city, (he began to enjoy crossdressing) and the last time he sees her she has 2 kids following her while also being pregnant with a 3rd kid. \n\nJust in case anyone wanted to know the basis of this story from not just the pictures"},{"id":1024963,"gallery_id":315451,"poster":{"id":900357,"username":"lolhentai101","slug":"lolhentai101","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592764228,"body":"The boy then squeezes the mom's butt which the mom does not like, and is about to leave but again feels sorry for the boy and so allows him ti have sex with her. (It shows the mom's point of view while she was talking on the phone with her son). The next day the boy wants to have sex again and the mom can't help but continue having sex with him. She slowly starts to enjoy it, and thinks that they are acting like lovers. The boy asks her to dye her hair which she agrees. Shortly after that she finds out that she is pregnant and doesn't know what to do. The boy asks her to give birth to their kid, which she eventually agrees to which leads to her divorce from her husband and moving in with the boy. "},{"id":1024947,"gallery_id":315451,"poster":{"id":900357,"username":"lolhentai101","slug":"lolhentai101","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592763753,"body":"The MC's mom starts to have sex with the person that bullied the MC, causing the mom to start being late and changing her appearance (dying hair). A few months later, the mom announces that she divorced MC's dad is moving out of their house, and is dating the classmate that bullied him (gets nipples pierced somewhere at this time). Fast forward like a year, MC goes to see mother (the mother is completely different, tanned skin, longer hair, more slutty), finds out that she had a baby with his classmate and I think she says that she is pregnant again. Then it goes back to what happened to the mom during her outings, she originally just came over to stop the classmate from bullying MC, but then feels sorry for the boy something about being thrown away by his own parents, and begins to come over everyday to cook him food. One of the days the boy asks the mom to stay the night, but the mom has a husband and child. Again the mom feels sorry for the boy and so stays longer than normal."}]