[{"id":1031665,"gallery_id":317412,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1593001905,"body":"@DoujinsRLove Your mom is already used to seeing my cock in her mouth and cunt qwhile my dog fucks her ass so no problem cock sucking shit eating ass licking whore's son and dont worry I will record the fuck session with the  loose onahole cunt  you call mother so you can jerk off to it as usual while dreaming my cock in your mouth or wast it yoru ass please specify bitch-ass faggot"},{"id":1027946,"gallery_id":317412,"poster":{"id":278162,"username":"DoujinsRLove","slug":"doujinsrlove","avatar_url":"avatars/278162.png","is_superuser":false,"is_staff":false},"post_date":1592870316,"body":"Glad to see DrNTR and his 12 year old mannerisms are back. Anyway, in pursuit of new content and discussion I have started inducting soft NTR doujins into my favorites, and so I shall be commenting on them more in the future, so you better get used to seeing me. "},{"id":1024581,"gallery_id":317412,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1592752532,"body":"@DoujinsRLove Nobody gives a shit what you like you faggot bitch so keep your shit to your shitty self"},{"id":1023442,"gallery_id":317412,"poster":{"id":278162,"username":"DoujinsRLove","slug":"doujinsrlove","avatar_url":"avatars/278162.png","is_superuser":false,"is_staff":false},"post_date":1592717367,"body":"This is on an extremely grey line for me. On one hand it is extremely good rape/mind break with exceptional art, on the other hand it is not only NTR, but seemingly dips its toe into “hard“ NTR a bit too much...even though the ending very much implies he was mind controlled and then had his memory of her wiped in the end.  I’m still never a fan of the MC finding out in NTR, and any amount of them “watching” the girl, especially when it focuses on the guys’ emotions over the sex, is still over the line for me. I’ll need to read a translation to see how conscious he was during the sex to decide if I can favorite or not, in the mean time I’ll see if this artist has anything more tolerable to me, cause their art truly is fantastic. "},{"id":1017639,"gallery_id":317412,"poster":{"id":989243,"username":"Mysterious Syringe Man","slug":"mysterious-syringe-man","avatar_url":"avatars/989243.png?_=00716be384458b98","is_superuser":false,"is_staff":false},"post_date":1592508864,"body":"I shall wait for the english version patiently...."},{"id":1017153,"gallery_id":317412,"poster":{"id":2922926,"username":"セイバーＸ","slug":"seibax","avatar_url":"avatars/2922926.png?_=f584e2ea4cd74a08","is_superuser":false,"is_staff":false},"post_date":1592495310,"body":"In honesty, I wish that whatever we blacklist a tag, the blacllisted tag doesn't show up at all rather than putting a \"-\" in the search bar."},{"id":1017066,"gallery_id":317412,"poster":{"id":2321609,"username":"erogami_","slug":"erogami_","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1592492203,"body":"@Admin: \n\nCan you add feature \"Long Strip\" Page Rendering Mode like on Mangadex where new pages automatically load as you scroll down? \n\nLike here for example: https://mangadex.org/chapter/928357/1 You can select Long Strip Page Rendering Mode from Settings.\n\nBetter than having to click to load next page. Hopefully you can add this feature to nhentai."}]