[{"id":1662301,"gallery_id":317739,"poster":{"id":2256318,"username":"Unnlo","slug":"unnlo","avatar_url":"avatars/2256318.png?_=4e90e9015801dfef","is_superuser":false,"is_staff":false},"post_date":1617655178,"body":"006 Oobayashi Mori / 大林森\n026 Drachef / ドラチェフ\n046 Akatsuki Akane / あかつき茜\n067 Ozy / オジィ\n086 Nico Pun Nise / 笑花偽\n102 Ameyama Denshin / 雨山電信\n122 Deinoji / デイノジ\n142 Teterun / ててるん\n166 PIero / PIえろ\n186 Chiku / 築\n206 Jean Louis / ジャン・ルイ\n226 Konmori / こんもり\n246 Yukiguni Omaru / 雪國おまる\n270 Yamazaki Kazuma / 山崎かずま\n290 Porutan / ぽるたん\n310 bowalia\n330 ICE"},{"id":1312622,"gallery_id":317739,"poster":{"id":1688924,"username":"GrayDarkness","slug":"graydarkness","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604404047,"body":"Artist who make the cover : drachef"},{"id":1230706,"gallery_id":317739,"poster":{"id":1299331,"username":"alonerone","slug":"alonerone","avatar_url":"avatars/1299331.png","is_superuser":false,"is_staff":false},"post_date":1600972734,"body":"I only like 2"},{"id":1147200,"gallery_id":317739,"poster":{"id":2010650,"username":"cumball","slug":"cumball","avatar_url":"avatars/2010650.png?_=25668883bb082406","is_superuser":false,"is_staff":false},"post_date":1597476603,"body":"Which artist made the cover?"},{"id":1046569,"gallery_id":317739,"poster":{"id":1329567,"username":"Thanatos825","slug":"thanatos825","avatar_url":"avatars/1329567.png?_=7614c4b0cb34dc17","is_superuser":false,"is_staff":false},"post_date":1593564398,"body":"Teterun made a piece that wasn't futa holy fk. "},{"id":1029600,"gallery_id":317739,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1592933055,"body":"\"Limitless\" I admit I hate NTR (Some cheating is passable, hence why I ONLY blacklised NTR) and I don't feel like arguing over my hatred of NTR (The rant from my first comment was an accident as when I think about NTR it just fires me into a rant! I didn't want to do that because I would be constantly ranting at something I hate and repeating myself....which was the point of blacklisting it!) My point was the fact \"they don't TAG SHIT PROPERLY!\" such as this has at least \"2-3\" (I only saw two) stories that are \"bluntly NTR\" (I mean the first NTR is TITLED \"NTR AV\" for god sake) yet It wasn't \"tagged\" NTR (just cheating despite the endings making and story in general MAKING IT CLEAR IT WAS NTR!) Those defending NTR can't really dismiss that anyone would get mad at accidentally reading NTR they hated \"because for some god damn reason \"taggers can't TAG properly!\" I'm pissed at the tags! Not the NTR (No point in the blacklist if this continues to happen am I wrong!) "},{"id":1028209,"gallery_id":317739,"poster":{"id":1297735,"username":"nagirou","slug":"nagirou","avatar_url":"avatars/1297735.png","is_superuser":false,"is_staff":false},"post_date":1592881641,"body":"Shut the fuck up delicate cunts"},{"id":1027604,"gallery_id":317739,"poster":{"id":3385917,"username":"stormem7","slug":"stormem7","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592855816,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me"},{"id":1025644,"gallery_id":317739,"poster":{"id":2644445,"username":"Massive Ass Lover","slug":"massive-ass-lover","avatar_url":"avatars/2644445.png?_=6f33c78a1d42fa9c","is_superuser":false,"is_staff":false},"post_date":1592789431,"body":"Drachef is unmatched with the muscular and thicc girls! Also @nutbuster69 paragraphs aren't a bad unless the argument is over trivial shit. Now I know Cheating ain't a cup of tea for some people but there are fools who will come in complaining about it knowing that they can blacklist it so unless you're not one of those people, you're alright. Simply be careful next time then. "},{"id":1025353,"gallery_id":317739,"poster":{"id":389578,"username":"nutbuster69","slug":"nutbuster69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592776586,"body":"so many paragraphs on a porn site we got some dumb nerds here"},{"id":1025234,"gallery_id":317739,"poster":{"id":3337748,"username":"SuCCulent","slug":"succulent","avatar_url":"avatars/3337748.png?_=c42a7c06bc97ce1a","is_superuser":false,"is_staff":false},"post_date":1592772366,"body":"That guy with the time to write an essay has time to check the tags. Blacklist \"Cheating\" as well as NTR. It should help."},{"id":1025095,"gallery_id":317739,"poster":{"id":2018066,"username":"Ank-E","slug":"ank-e","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1592767836,"body":"Pg 142 is it teterun if yes then where is the eng version or should i wait"},{"id":1025072,"gallery_id":317739,"poster":{"id":2692484,"username":"TheCrappyGod","slug":"thecrappygod","avatar_url":"avatars/2692484.png?_=8bdb4a789f6b37f3","is_superuser":false,"is_staff":false},"post_date":1592767309,"body":"This is disgusting so i will not uncover my pp"},{"id":1025014,"gallery_id":317739,"poster":{"id":1651553,"username":"iWebber","slug":"iwebber","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1592765490,"body":"Take it easy, it's just a drawing."},{"id":1024936,"gallery_id":317739,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1592763386,"body":"\"minecratthentai69\" Essay or no! \"DID YOU EVEN READ THE FIRST PART OF THE COMMENT!\" Or like other NTR defenders! Did you see my insults to NTR and focused completely on that! \n\nSigh! LET ME MAKE THIS CLEAR SO THE REST OF YOU UNDERSTAND WITHOUT AN \"ESSAY!\" I'm ranting at the fact \"this isn't tagged NTR\" because of a few of the stories \"acutally BEING NTR!\" By not tagging! You have \"no grounds to get mad\" if anyone insults NTR (since there's no \"If you hate NTR why are you in a NTR! Just blacklist it and fuck off!\" Sorry, if they don't tag it properly! Then one can't \"AVOID IT!\" My Comment is at the tagging not being done properly \"NOTHING MORE!\" I should NOT have ranted my feelings on NTR as it feels \"that's what's being commented on!\n\nSo \"minecrafthentai69\" \"stop getting triggered at people insulting your genre AND GET A LIFE YOU PATHETIC FUCK! There done, I will say no more or make the point I'm talking about tags So the \"next genius to make my comment about NTR is getting ignored!\" "},{"id":1024920,"gallery_id":317739,"poster":{"id":3353232,"username":"minecrafthentai69","slug":"minecrafthentai69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592762818,"body":"The guy below me that wrote an essay is a fucking loser get a fucking life instead of complaining about drawings you sad fuck"},{"id":1024145,"gallery_id":317739,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1592736700,"body":"Even though I slipped and ranted about my hate of NTR at the end of my comment \"HamburgerTime\". Did you completely ignore the part where \"I pointed out how NOT tagging the NTR properly WILL cause complainers of it to appear (Again, you can't say \"If you don't like NTR, why are you reading it!\" When the shit \"wasn't tagged!\" So my unsuspecting ass walked \"RIGHT INTO A NTR WITHOUT MEANING TOO!\" Maybe when they tag it right, you'll only see the one's who go on NTR simply to complain! Till then you'll get those like me who WANT TO AVOID STARTING A WAR OVER THE SUBJECT! Even though I'm more at war with \"why SHIT ISN'T PROPERLY TAGGED!\")"},{"id":1024128,"gallery_id":317739,"poster":{"id":746591,"username":"HamburgerTime","slug":"hamburgertime","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1592735575,"body":"Oh my God I'm so sick of dipshits complaining about NTR. Act like a normal person and move on when you find porn you don't like."},{"id":1024053,"gallery_id":317739,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1592733099,"body":"Can someone explain how \"NTRAV\" DIDN'T get this the NTR tag? I'm quite confused! (No I'm not! This is the typical \"not placing the correct Tag's as usual!\" I think the sites WANT the typical \"Vanillia vs NTR\" wars to happen in the comment sections! Can't tell \"Vanillia Fags\" to not look at the NTR they hate \"when the site doesn't TAG IT PROPERLY! That they see it by mistake because the Blacklist is fucking pointless if the doujins aren't tagged properly! I dislike NTR especially the crappy NTR like \"NTRAV\" that always have those crappy endings! Though the way it's end makes me think of a few NTR where the cheating bitch letting herself get filmed and assuming her hubby will never catch on backfired on her badly! I mean she made a fucking AV that might as well be a full on confession to the Divorce Courts that she cheated multiple times on her husband and even willingly got pregnant with another man's kid and willingly cuck her husband! Okay no more ranting! Made my Point already)"}]