[{"id":2451243,"gallery_id":319116,"poster":{"id":4130138,"username":"xClyd3","slug":"xclyd3","avatar_url":"avatars/4130138.png?_=5452b79fdc5e54c5","is_superuser":false,"is_staff":false},"post_date":1649661416,"body":"Ash be pullin baddies?? 🤨"},{"id":1438408,"gallery_id":319116,"poster":{"id":1861824,"username":"realfranke","slug":"realfranke","avatar_url":"avatars/1861824.png?_=6e337dc4c0dbc04c","is_superuser":false,"is_staff":false},"post_date":1609136016,"body":"nice stuff"},{"id":1055902,"gallery_id":319116,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1593937340,"body":"@Acearea\nThe idea I presented is simple, if it's considered a \"wholesum\" work, slap it with the \"vanilla\" tag. That's it. It's that simple, the comments section has always a bunch of \"wholesum\" acolytes and checkers that feel the physical need to gush all over the comments section about it (and rage &amp; seethe when it's not). What would qualify as a \"vanilla work\"? 1st, it obviously can't have any of the generally considered hardcore tags in it, so no rape, snuff/ryona/guro, NTR, mind control, blackmail, cheating, corruption, moral degeneration and etc (shit, I just described the current western world). 2nd, typical japanosuke gets his way with whatever girl the author has dreamed up itself with and fans consider \"cannon\" (fking hell...) with, may slightly vary, if it's the harem type of show (which most times, it is because jap authors can't help themselves in the daydream wish fulfillment aspect), 3rd, it ends \"well\". I'll blacklist it. You won't have to read my \"negativity\", win-win."},{"id":1055871,"gallery_id":319116,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1593936193,"body":"@Acearea\nHuh, well that was unexpected, what a surprise, vanilla types are usually very zealous over their preferences which has them being too hard locked into a \"toxic positivity\" (when the so perceived \"good\" does a 180° and becomes a minus itself, often without its victims realizing it) + \"seek &amp; attack/destroy\" mentality (which I've noticed that it more often manifests in sub 16y/o's as they tend to let their emotions assume command of their selves and go on a haywire \"shoot first, consider logic &amp; reason later\" stance in regards to things they feel attachment/relate to) which leads to over sensitivity and \"I don't like what you say, therefore, you're wrong!\" which makes it impossible to feel sorry. And yet... hey, it's fine, I am used to it on the internet and outside. About your point, NTR is already a \"hardcore tag\" as well as anything vanilla types don't like is generally considered hardcore (doesn't stop them from religiously dropping by and throwing their 2¢s)."},{"id":1054839,"gallery_id":319116,"poster":{"id":2135763,"username":"Acearea","slug":"acearea","avatar_url":"avatars/2135763.png","is_superuser":false,"is_staff":false},"post_date":1593892866,"body":"@Typical japanese MainCharacter I am sorry about my last comment as I didn't intend it to be as rude as i did, and for having misunderstood u'r comment. I understand that u only wanted to find u'r interests more easily on this website while having the luxury that we (vanilla watchers) do being able to blacklist the hardcore stuff. \nI only ment to stop the negetivity but seeing the rest of the coments on that vanilla manga no one eles did and i came off a bit rude. (they ether were oblivious to others interests pushing their own values as was I or they simply ignored it.) \nI will say though it is easier to create and enforce a tag that is hardcore since there is an act which is specific in nature while vanilla and mild tag may be a bit more hard to quantify. since somthing good end up good yet still be not vanilla. (baisically without a proper defenition that all can follow and uphold it would mean any not hardcore manga is vanilla). But yes if it had a tag it would be more convinient."},{"id":1053659,"gallery_id":319116,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1593847766,"body":"More like \"ash pedreiro\"."},{"id":1053568,"gallery_id":319116,"poster":{"id":3305054,"username":"xNaaza","slug":"xnaaza","avatar_url":"avatars/3305054.png?_=81497a84b228857a","is_superuser":false,"is_staff":false},"post_date":1593845078,"body":"This artstyle is something else i love it"},{"id":1053430,"gallery_id":319116,"poster":{"id":355316,"username":"ryder21","slug":"ryder21","avatar_url":"avatars/355316.png","is_superuser":false,"is_staff":false},"post_date":1593839661,"body":"Boi, this is the best "},{"id":1052608,"gallery_id":319116,"poster":{"id":616000,"username":"Ryuuzou Sonogami","slug":"ryuuzou-sonogami","avatar_url":"avatars/616000.png","is_superuser":false,"is_staff":false},"post_date":1593802871,"body":"Nice but could be longer"}]