[{"id":1156968,"gallery_id":319637,"poster":{"id":2258481,"username":"Nero Claudius Caesar Augustus","slug":"nero-claudius-caesar-augustus","avatar_url":"avatars/2258481.png?_=3c3f909dbe785a38","is_superuser":false,"is_staff":false},"post_date":1597838411,"body":"@taiki39 bless you for the summary my dude "},{"id":1071578,"gallery_id":319637,"poster":{"id":2064590,"username":"void acc","slug":"void-acc","avatar_url":"avatars/2064590.png?_=b852b8361caea401","is_superuser":false,"is_staff":false},"post_date":1594469363,"body":"Translated ver when. Also can someone tell me what's happening in page 192? "},{"id":1068753,"gallery_id":319637,"poster":{"id":2855659,"username":"FilthyBoiz","slug":"filthyboiz","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594366505,"body":"TrAnSlAtE pLs"},{"id":1061159,"gallery_id":319637,"poster":{"id":787902,"username":"taiki39","slug":"taiki39","avatar_url":"avatars/787902.png","is_superuser":false,"is_staff":false},"post_date":1594118450,"body":"and final arc, as mentioned previous, 1st, 2nd and 4th girl are triggered in same time, created a natural disaster level of chaos. Basically u are doomed if u see them, hear them or smell the odor from them. Supposedly it should be settle easily once MC cum inside them, but the effect is so high, u will back to horny mode if u get affected by another two girl's AOE, in the end MC had to cum inside three of them at once.\nMC almost KO-ed but managed to calm all of them with 5th girl's lactation milk. \nIt is interesting enough that MC mention that if the athletic girl is involved, this gonna be a endless horny disaster.  "},{"id":1061149,"gallery_id":319637,"poster":{"id":787902,"username":"taiki39","slug":"taiki39","avatar_url":"avatars/787902.png","is_superuser":false,"is_staff":false},"post_date":1594118064,"body":"Third girl, blessed with super athletic, yet when triggered she basically become a horny beast who will strike all guys and squeeze their balls out. MC had to cum inside her few times to calm her down.\nFourth girl, blessed with extreme smelling ability, which let she does her cooking in ultimate level like u watch shokugeki no soma. but in return, when she is triggered, she will release horny pheromone, ppl who smell it will automatically go into horny mode.\nFifth girl, supposedly considered as low-hazard level since she posses no AOE effect to surrounding ppl, here I need to mention that 1st, 2nd and 4th girl's triggered syndrome are considered Highest-hazard level which almost equal to natural disaster. However 5th girl is neither an ez target who will go down with one cum. her lactation milk will provide stamina recover to MC so he can work again  "},{"id":1061145,"gallery_id":319637,"poster":{"id":1068438,"username":"H0taku","slug":"h0taku","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594117893,"body":"Why Pomegranate syndrome ?\nDoes Pomegranate hold any meaning in myth or culture?"},{"id":1061133,"gallery_id":319637,"poster":{"id":787902,"username":"taiki39","slug":"taiki39","avatar_url":"avatars/787902.png","is_superuser":false,"is_staff":false},"post_date":1594117646,"body":"For those who are curious about this doujin story's context, its about \"Pomegranate Syndrome\" which about the girls in doujin are blessed with special abilities yet in return, if their syndrome is triggered, it will affect ppl around them into chaos.  I will summarize each of them and what kind of effect they will give when they are triggered (into horny mode). Their syndrome can be neutralize by MC's cum, what made MC special is his stamina and almost limitless cum power\nFirst girl, blessed with unique voice, ppl will get touched by how awesome she read the text out loud. but when she is triggered, she will make everyone horny if they hear her voice (basically she just spam lots of horny sexual expression)\nSecond girl, blessed with wonderful acting yet when she is triggered, ppl will automatically get horny if they see her physically when she is horny mode. \n"},{"id":1060613,"gallery_id":319637,"poster":{"id":540792,"username":"SilverLight","slug":"silverlight","avatar_url":"avatars/540792.png","is_superuser":false,"is_staff":false},"post_date":1594100409,"body":"Black bars but don't understand shit or English but full censorship? Hmm... "}]