[{"id":1505241,"gallery_id":319682,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610743358,"body":"@zikakuto I don't know what other one you're talking about. Most of Seto's NTR end with the MC ending up with the girl or something tragic happens while the girl tries to kill the bastard that \"stole\" her(like trying to burn him alive but not being aware that her beloved was also in the shed she was burning down). Also, Chitose doesn't get off on Hori watching her as most of the time he's not even watching her...she just tightens up at the MERE mention of him. Everything points at her just going along with Taka(as Mika said) and having feelings for Hori. You TakaxChitose people need to stop reading with your fucking asses, apparently."},{"id":1458912,"gallery_id":319682,"poster":{"id":1042284,"username":"ARGENT","slug":"argent","avatar_url":"avatars/1042284.png","is_superuser":false,"is_staff":false},"post_date":1609715960,"body":"wow, you guys thought clear my mind, some time i afraid to read this dojin, but now i feel free from my curious"},{"id":1190078,"gallery_id":319682,"poster":{"id":3580949,"username":"dragonnina642","slug":"dragonnina642","avatar_url":"avatars/3580949.png?_=27ae272402f25b65","is_superuser":false,"is_staff":false},"post_date":1599165909,"body":"@zikakuto YESS! why can't people realize this? for chitose anyone will do. the only reason why she don't want hori to leave her it's because she feels pleasure whenever hori is nearby when she fucked\n"},{"id":1069795,"gallery_id":319682,"poster":{"id":3439024,"username":"zikakutoㅤ","slug":"zikakuto","avatar_url":"avatars/3439024.png?_=2797168c495a3c00","is_superuser":false,"is_staff":false},"post_date":1594406841,"body":"\nI feel everyone is missing out on how much of a slut Chitose is. Also, Seto Yuuki tells atypical hentai stories. One of his old NTR plots, where the ugly bastard blackmails the girl so she can save her boyfriend’s life,  has the girl suck  and fuck his dick in front of her boyfriend  .His characters most of the time follow those NTR mindbreak tropes. So far what we’ve seen is that Chitose is attracted to Takayuki and  gets off on the thought of being watched by Hori, it seems she is a slut who enjoys being watched while getting fucked . She doesn’t seem to really be attracted to Hori besides just friendzoning him and using him for her fetish of being watched while fucked. Like the sister said, Chitose doesn’t want to see herself as a slut but deep down she knows she is one. She wants to be fucked by anyone other than Hori. I hope we get to see some more NTR  or at least satisfying ending."},{"id":1067258,"gallery_id":319682,"poster":{"id":2072260,"username":"lunchableloli","slug":"lunchableloli","avatar_url":"avatars/2072260.png","is_superuser":false,"is_staff":false},"post_date":1594318549,"body":"Why Th do I see essays on a doujin site? "},{"id":1065289,"gallery_id":319682,"poster":{"id":110084,"username":"zephyr77","slug":"zephyr77","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594256457,"body":"I need an uncensored version of this series"},{"id":1065100,"gallery_id":319682,"poster":{"id":3252350,"username":"AtemZ","slug":"atemz","avatar_url":"avatars/3252350.png?_=4ece7754fce64b48","is_superuser":false,"is_staff":false},"post_date":1594249905,"body":"never seen a fucking page of a script written in a nhentai comment section, bravo guys you outdid yourselves."},{"id":1065053,"gallery_id":319682,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594248023,"body":"lol All these people saying MC \"let it happen\"... No, the one that \"let it happen\" was Chitose. :/ Keisuke needs to just move on, honestly. Mika doesn't really seem to like him, either. She's just into sex like Chitose is now(or even at the beginning or she never would have let Gorilla fuck her). Hopefully, last chapter is Keisuke coming to grips with the fact that he should give up on Chitose and moving on...even better if he's shown meeting a new girl."},{"id":1064019,"gallery_id":319682,"poster":{"id":3031398,"username":"jimmyfriki","slug":"jimmyfriki","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594212600,"body":"Never thought of making comments gente but okay.\n\nI'm honestly cheering for the MC just leaving Chitose alone. She seems to like him and seems confused, but is with Takayuki, so why bother? Leave her be and move on. This one kind of reminds me of Ootsuka Kotora's Crossing Man and Woman.\nI honestly wish MC doesn't get as fucked over as Kotora's MC.\n\nDon't know, Just rambling hahaha"},{"id":1063741,"gallery_id":319682,"poster":{"id":2693129,"username":"poripodooppii","slug":"poripodooppii","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594200870,"body":"I doubt that keisuke and mika would hook up. Even though it's already past 4 chapters Mika didn't even drop a hint of interest keisuke and my proof to that is their conversation on the art club room. Judging by the lines Mika throw at keisuke, she's just telling that Keisuke shouldn't be indifferent on how he threats Chitose now that Keisuke know that Chitose choose to go out with Takayuki. Though I could tell that Mika knows something more than she tells on Keisuke, like how Keisuke likes Chitose for a long time and now that Keisuke is cockblock to confessing his true feelings to Chitose, Mika thought that Keisuke might threat her a whore, so she is being careful to her words in making Keisuke bitter towards Chitose and making sure that Keisuke realize that all things happen between Chitose and Takayuki is now normal since they started to see each other now. Though what is bothering is Chitose's side though. I'll hold my opinion about Chitose when Chapter 5 comes out"},{"id":1063371,"gallery_id":319682,"poster":{"id":1064327,"username":"TvManga2020","slug":"tvmanga2020","avatar_url":"avatars/1064327.png","is_superuser":false,"is_staff":false},"post_date":1594189091,"body":"I agree with you Lyralei he’s made a mistake of let it happen but when he find out it turn out to be more than relationship in Chapter 5 he’s going to be heartbroken and to her she will thinking’s that she betrayed him"},{"id":1063217,"gallery_id":319682,"poster":{"id":578579,"username":"Dorothea","slug":"dorothea","avatar_url":"avatars/578579.png?_=bb442de75295f22e","is_superuser":false,"is_staff":false},"post_date":1594184561,"body":"Reading this again, I don't think the main character had it that bad, he should take this as a lesson and move on."},{"id":1063084,"gallery_id":319682,"poster":{"id":408342,"username":"Nightseph","slug":"nightseph","avatar_url":"avatars/408342.png?_=eb24eb94c9baa81a","is_superuser":false,"is_staff":false},"post_date":1594181129,"body":"I want 5 more Chitose chapters"},{"id":1063078,"gallery_id":319682,"poster":{"id":2681344,"username":"eren_jizzer","slug":"eren_jizzer","avatar_url":"avatars/2681344.png?_=b41e2ee32c1bd5cd","is_superuser":false,"is_staff":false},"post_date":1594180999,"body":"I actually don't feel bad anymore. It seems like the last chapter will be a win for the MC rooting for him tho"},{"id":1063055,"gallery_id":319682,"poster":{"id":3165105,"username":"MoistHaru","slug":"moistharu","avatar_url":"avatars/3165105.png?_=e7a163f5f50fc40a","is_superuser":false,"is_staff":false},"post_date":1594180339,"body":"Wtf is with this girl "},{"id":1062877,"gallery_id":319682,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1594174162,"body":"Seto Yuuki’s NTR stories don’t follow the typical generic NTR story beats. His characters don’t follow those NTR mindbreak tropes. So far what we’ve seen is that Chitose is attracted to Hori or gets off on the thought of Hori catching her having sex, it seems just hearing his name makes her tighten up and get aroused. She doesn’t seem to really be attracted to Takayuki besides just dating him and going along with his sexual urges for the time being. \n\nI might be wrong, Chitose’s true feelings are left ambiguous because we can’t hear her inner thoughts. And although we keep getting these panels that imply she actually likes Hori, it’s never confirmed and could just be red herrings. Personally, I think it’s really good stuff, I feel bad for Hori and it’s not like more typical NTR where you can’t take the characters seriously and don’t feel anything for them. I’m hoping again for a good satisfying ending whichever way they go. Also Seto Yuuki followed me back on Twitter! Go follow himxD"},{"id":1062783,"gallery_id":319682,"poster":{"id":3432807,"username":"YorokobeShounen23","slug":"yorokobeshounen23","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594171730,"body":"@Inferector Yeah i guess your right, we will just have to see how Seto will end it."},{"id":1062777,"gallery_id":319682,"poster":{"id":613992,"username":"Valvrein","slug":"valvrein","avatar_url":"avatars/613992.png","is_superuser":false,"is_staff":false},"post_date":1594171641,"body":"It's just my wild guess, since the next chapter will be on the karaoke; 4 of them will likely going to have sex together the same room (?) And idk, Im just having a feeling that Hori will have the chance to fuck Chitosethere  (somehow with mika's help? idk) and the 'good/netural' ending will starts from there. Again, just my guess tho"},{"id":1062755,"gallery_id":319682,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1594171102,"body":"I've been getting a Triangle Cafe(Seto's previous work where the MC got the girl in the end) vibe from this, though I will say it seems a bit tough to see how Hori and Chitose end up together in the end. Hori has no real feelings for Mika, so unless Seto goes completely brain-dead, that route is probably closed off for good. I'm guessing Takayuki perving about his sister last chapter might factor into how this ultimately ends, but who the hell knows?   "},{"id":1062702,"gallery_id":319682,"poster":{"id":1601128,"username":"asjdnaosndoasjnd","slug":"asjdnaosndoasjnd","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594169268,"body":"@#FreeBobby pretty much this. Couldnt agree more."},{"id":1062642,"gallery_id":319682,"poster":{"id":613992,"username":"Valvrein","slug":"valvrein","avatar_url":"avatars/613992.png","is_superuser":false,"is_staff":false},"post_date":1594166882,"body":"@YorokobeShounen2323 Level series is an execption I guess. I think that one only focus on the ntr plot. since there  isn't really story there.. But like I said before, most of the previous works: the one about the mc being a sex watcher with the long tongue heroine, the one about the dude who write about lewd stuff on the notes with the maid heroines, the one about the maid services-soapland stuff etc. All of 'em are having similar ntr stuff and aren't really focusing on the cuckolding part. So imo, unlike the level series; this one is going to focus on the story and more likely end with the neutral end (?) Or at least that's what Im hoping"},{"id":1062637,"gallery_id":319682,"poster":{"id":1601128,"username":"asjdnaosndoasjnd","slug":"asjdnaosndoasjnd","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594166630,"body":"This really can't end badly for hori guys. He's pretty much done caring by the end of the chapter. He's gonna get a bittersweet ending at most. Seto doesn't usually give his MC's overly depressing endings."},{"id":1062628,"gallery_id":319682,"poster":{"id":613992,"username":"Valvrein","slug":"valvrein","avatar_url":"avatars/613992.png","is_superuser":false,"is_staff":false},"post_date":1594166338,"body":"@icycozy Yeah, he rarely tweet. Tweet only about his doujin proggress\n"},{"id":1062574,"gallery_id":319682,"poster":{"id":3432817,"username":"icycozy","slug":"icycozy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594165298,"body":"@Inferector Is Seto Yuuki not active on  twitter? cause his last post is on july 6.\n\nBtw thank you for telling me his twitter."},{"id":1062560,"gallery_id":319682,"poster":{"id":3432807,"username":"YorokobeShounen23","slug":"yorokobeshounen23","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594164939,"body":"You are right @Inferector about most having similar plots, but he also does have a few that do have bad endings especially with the level series. Which makes it kinda uneasy given what this chapter has done and also gives me reason that I shouldn't get my hopes up even for a neutral ending. And if the author does give it a bad ending for the MC I would most likely be disappointed since he could have ended it even in the second chapter "},{"id":1062453,"gallery_id":319682,"poster":{"id":613992,"username":"Valvrein","slug":"valvrein","avatar_url":"avatars/613992.png","is_superuser":false,"is_staff":false},"post_date":1594161101,"body":"@YorokobeShounen23 Im sure that the author wont leave things as it is, something is goin' to happen on the next chapt. Either it better or worst. Do you know the author's work, the one about the clerk girl on a bar (?) with an salary man (mc). Despite the ntr, it still got happy end. Well maybe it can't be called happy end, it was more like neutral end. Looking all the author's previous works; most of them having similar plot don't you think?"},{"id":1062452,"gallery_id":319682,"poster":{"id":681203,"username":"haviaumabelha","slug":"haviaumabelha","avatar_url":"avatars/681203.png?_=1ee7adef3ee350a2","is_superuser":false,"is_staff":false},"post_date":1594160936,"body":"Niiiice one"},{"id":1062448,"gallery_id":319682,"poster":{"id":1136734,"username":"GuitarFan01","slug":"guitarfan01","avatar_url":"avatars/1136734.png","is_superuser":false,"is_staff":false},"post_date":1594160586,"body":"Holy sh*t @nicojaewpunk, you really like to suffer... There is one called Out Of The Loop, and other of this same author called Level D. "},{"id":1062423,"gallery_id":319682,"poster":{"id":3432807,"username":"YorokobeShounen23","slug":"yorokobeshounen23","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594159358,"body":"I wouldn't really consider this NTR since from the MC facial expressions it looks like he is coming to terms about losing Chitose and I really don't see the point of having one more chapter if we already know how the MC would most likely react and plus they weren't even in a relationship to begin with unless the MC is gonna have some action with the sister but judging from the the authors past works, I doubt it. "},{"id":1062408,"gallery_id":319682,"poster":{"id":613992,"username":"Valvrein","slug":"valvrein","avatar_url":"avatars/613992.png","is_superuser":false,"is_staff":false},"post_date":1594158542,"body":"@icycozy it's @amfrosch"},{"id":1062398,"gallery_id":319682,"poster":{"id":3432817,"username":"icycozy","slug":"icycozy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594158241,"body":"@Inferector Can i ask what's Seto Yuuki official twitter is?"},{"id":1062269,"gallery_id":319682,"poster":{"id":1651867,"username":"ccjjkkaa","slug":"ccjjkkaa","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594153464,"body":"NTR nice! "},{"id":1062266,"gallery_id":319682,"poster":{"id":613992,"username":"Valvrein","slug":"valvrein","avatar_url":"avatars/613992.png","is_superuser":false,"is_staff":false},"post_date":1594153373,"body":"Yeah man, I usually like NTR\nBut this time, I kinda feel really sorry for the MC and can't help but rooting for him too.\n\nAnd for  those who can't really read the text\nHere's the summary:\nWhen Hori tried to confess to Chitose on the roof, Chitose stopping him and telling him that she's currenly dating with Takayuki. And she said \"At least dating for the time being\". Idk, so something must be happening after the hotel scene. Long story short, Mika's having an idea for the 4 peoples go to karaoke on the summer holiday. Then when Hori goes to the salon, Chitose's mom told to him that while the summer holiday; Chitose's been teaching an underclassman for a while. He's been going here everyday for that \"teaching\". And yeah that's it\n\nChitose's been turning into a bitch since the last chapt, man. Again, feel so sorry for the MC.\n\nBased on author's twitter, next chapter is the last chapt. I'm not really sure Hori will get happy end, but I hope..\n"},{"id":1062247,"gallery_id":319682,"poster":{"id":2243747,"username":"hitormiss21","slug":"hitormiss21","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594152711,"body":"My heart sank, though and it’s hard to get in the mood. Who knew that an innocent girl like chitose actually ended up with someone like him?"},{"id":1062237,"gallery_id":319682,"poster":{"id":1193347,"username":"netorareloverbbc","slug":"netorareloverbbc","avatar_url":"avatars/1193347.png?_=342af733c22a33c7","is_superuser":false,"is_staff":false},"post_date":1594152452,"body":"Pretty good story and fantastic art one can expect from Yuuki sensei"},{"id":1062234,"gallery_id":319682,"poster":{"id":2243747,"username":"hitormiss21","slug":"hitormiss21","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594152396,"body":"Been waiting for this but didn’t chitose and the dude would actually start dating. MC you better pull your shit together quick. I’m rooting for you, you bastard"},{"id":1062213,"gallery_id":319682,"poster":{"id":3267950,"username":"WildMadDawg","slug":"wildmaddawg","avatar_url":"avatars/3267950.png","is_superuser":false,"is_staff":false},"post_date":1594151722,"body":"Gotta say... got no sympathy for this MC. Problem would'e been solved in episode 1 if he'd have just maned up & told Chitose how he felt, Before meeting those two, before one of them asked for a blowjob & sex, and before they moved to a love hotel. Difference between any other NTR story... the girl has to be YOURS to start with... She was never HIS. BTW I liked those two together better anyway"},{"id":1062153,"gallery_id":319682,"poster":{"id":3056431,"username":"its God","slug":"its-god","avatar_url":"avatars/3056431.png?_=e7c158ec7667ae15","is_superuser":false,"is_staff":false},"post_date":1594149812,"body":"generic enough"},{"id":1062124,"gallery_id":319682,"poster":{"id":3020148,"username":"Horizon Wrks","slug":"horizon-wrks","avatar_url":"avatars/3020148.png?_=910fc3de2dbe63a7","is_superuser":false,"is_staff":false},"post_date":1594148652,"body":"I'd get more entertainment out of watching paint dry than reading an NTR doujinshi "},{"id":1062121,"gallery_id":319682,"poster":{"id":3246317,"username":"insertdeletehome","slug":"insertdeletehome","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594148558,"body":"There will be a finale chapter 5 but thats it. I don't think this is going to end happily for the guy in anyway, although so far he is probably the only unhappy guy in the story."},{"id":1062112,"gallery_id":319682,"poster":{"id":853901,"username":"NTR is love and life","slug":"ntr-is-love-and-life","avatar_url":"avatars/853901.png?_=a96a0a928ea38991","is_superuser":false,"is_staff":false},"post_date":1594148395,"body":"Nice one author, \nIt's so satisfying, would be best if Chitose getting fucked up super hard in front of MC. "},{"id":1062082,"gallery_id":319682,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1594147505,"body":"Dammit man keep looking at these panels chitose does seem to get hornier when she finds out Mc is around and her pussy goes crazy and her boyfriend cant handle it. I swear Mc has a shot if can fuck her next ch who is with me"},{"id":1062029,"gallery_id":319682,"poster":{"id":1506510,"username":"iwillbetheOne","slug":"iwillbetheone","avatar_url":"avatars/1506510.png","is_superuser":false,"is_staff":false},"post_date":1594146011,"body":"This feels like an end i wonder what the author is going to do for the second chapter "},{"id":1061954,"gallery_id":319682,"poster":{"id":23496,"username":"I Been To The Dark Side","slug":"i-been-to-the-dark-side","avatar_url":"avatars/23496.png","is_superuser":false,"is_staff":false},"post_date":1594143793,"body":"this chapter was not that satisfy for my taste compare to the previous one"},{"id":1061891,"gallery_id":319682,"poster":{"id":2290425,"username":"ET_Phone_Home","slug":"et_phone_home","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594141773,"body":"how is that ntr ? Having a crush on her doesn't mean she was with him or want his lame ass, the bro his way more fun anyway ! \nThey make a better pair anyway !\n"},{"id":1061872,"gallery_id":319682,"poster":{"id":22346,"username":"Maverickx","slug":"maverickx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594141375,"body":"MC getting with sister next chapter?"},{"id":1061871,"gallery_id":319682,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1594141373,"body":"I wonder what kind of ending Seto Yuuki is going to go for. I hope it’s a satisfying one, however the main leads end up, whether they decide to hook up or they go their own way. \n\nThe ML should have grabbed her and taken her away in the first chapter, worst that would have happened is she would have rejected him, best case would be they’d already be dating. I’m genuinely hooked. "},{"id":1061862,"gallery_id":319682,"poster":{"id":2413010,"username":"Admin [✅]","slug":"admin","avatar_url":"avatars/2413010.png?_=0ff478cf936f1944","is_superuser":false,"is_staff":false},"post_date":1594141139,"body":"Hey guys is there any recommendation hentai with plot like this series or entanglement?"},{"id":1061830,"gallery_id":319682,"poster":{"id":2221505,"username":"PapaH","slug":"papah","avatar_url":"avatars/2221505.png?_=7f1757b4c78013b2","is_superuser":false,"is_staff":false},"post_date":1594140385,"body":"bruh i think he got regeted or ssomethign thats why he wont show up his face to her and the nest oner will be the last also i confirm it to his twitter well deserve respect to sensei"},{"id":1061825,"gallery_id":319682,"poster":{"id":792911,"username":"That Guy 319","slug":"that-guy-319","avatar_url":"avatars/792911.png?_=230a595efe04ec92","is_superuser":false,"is_staff":false},"post_date":1594140176,"body":"I'll wait for the translation to make a complete judgement...but it seems that the dude didn't take it as hard as I thought or as hard as the author implied he would"},{"id":1061814,"gallery_id":319682,"poster":{"id":2413010,"username":"Admin [✅]","slug":"admin","avatar_url":"avatars/2413010.png?_=0ff478cf936f1944","is_superuser":false,"is_staff":false},"post_date":1594139844,"body":"You all guys can read fucking nihonggo? Wtf i can only wait translation"},{"id":1061808,"gallery_id":319682,"poster":{"id":3415307,"username":"AtomJoJo","slug":"atomjojo","avatar_url":"avatars/3415307.png?_=9d6bfe6e6c0be89e","is_superuser":false,"is_staff":false},"post_date":1594139629,"body":"Kinda boring after all the hype"},{"id":1061807,"gallery_id":319682,"poster":{"id":3224478,"username":"Sundereign","slug":"sundereign","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594139570,"body":"This chapter was wack as fuck.......... holy shit all this wait for this shit chapter?!"},{"id":1061761,"gallery_id":319682,"poster":{"id":1652256,"username":"Jeanne d'Arc","slug":"jeanne-d-arc","avatar_url":"avatars/1652256.png","is_superuser":false,"is_staff":false},"post_date":1594138367,"body":"After reading all the comments, i gonna say, the mc really took it like a champ. Pretty cool of him to just let it go and fuck off. But god damn the white censored is just too much. I much prefer a black line than full censored or mosaic. fuck this shit"},{"id":1061760,"gallery_id":319682,"poster":{"id":822889,"username":"arrog4nt","slug":"arrog4nt","avatar_url":"avatars/822889.png","is_superuser":false,"is_staff":false},"post_date":1594138332,"body":"easy girl, poor guy"},{"id":1061743,"gallery_id":319682,"poster":{"id":1652256,"username":"Jeanne d'Arc","slug":"jeanne-d-arc","avatar_url":"avatars/1652256.png","is_superuser":false,"is_staff":false},"post_date":1594137809,"body":"Well thats kinda lame? I expect a full blown sex scene. There isnt much sex in this probably because of the censored so i skippe through it. So there is another chapter huh? wonder whats its gonna be. Cant think of anything but bad ending? I mean, this is bad ending already right? so whats the point of chapter 5?\n? "},{"id":1061720,"gallery_id":319682,"poster":{"id":1998672,"username":"surumeotoko","slug":"surumeotoko","avatar_url":"avatars/1998672.png?_=f80806124869b4f5","is_superuser":false,"is_staff":false},"post_date":1594136842,"body":"This wa bored i think chitose will end with the womb elated"},{"id":1061706,"gallery_id":319682,"poster":{"id":3431595,"username":"justmadethisaccountforthislol","slug":"justmadethisaccountforthislol","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594136358,"body":"@asjdnaosndoasjnd Exactly what I was thinking bruh. People that are saying it’s gonna end very badly makes me think they’re solely judging the outcome based on this chapter and forgetting the build-up in the previous three. MC may not get fan service ending like some want, but I don’t see this ending horribly for him considering his response to what’s going on. Only way this ends badly is if Author just says fuck it and throws away all logic and development to make a forced ending which just wouldn’t be smart on his part."},{"id":1061693,"gallery_id":319682,"poster":{"id":1601128,"username":"asjdnaosndoasjnd","slug":"asjdnaosndoasjnd","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594135773,"body":"Also a bad ending for Hori seems out of the window. because \"Punished Hori\" doesn't seem to give much fuck anymore. He knows what is happening, he got rejected and doesn't care to much about Mika, so he cannot get cucked again. I think he's gonna get another shot at Chitose with Mika's help. Chitose herself on the other hand knows Hori's feelings now, reacts eroticly every time he's around and shows big relief when he said he's gonna remain in the club. I don't know, either they finally end up together or it's something unexpected. If it was going to be a sad end you could literally end it with last panel of chapter 4, without the need to write the next one. Hori going his own way and Takayuki being lovey-dovey with Chitose literally just happened. More of that seems redundant. I don't know, theres 1 chapter left, we'll have to see."},{"id":1061686,"gallery_id":319682,"poster":{"id":1601128,"username":"asjdnaosndoasjnd","slug":"asjdnaosndoasjnd","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594135548,"body":"Those glances that Chitose and Hori had to each other in the previous chapters and the fact that she cums instantly when Hori shows up is interesting. I hope its explored, but it could just be red herrings or something. Also judging by the dialogue between the chads sister and Hori, she says to hori that Chitose is only getting with the chad because she thinks it would be slutty not to go out with the guy you've slept with, that's Chitose's reasoning according to the chads sister. So we'll see were it goes. "},{"id":1061683,"gallery_id":319682,"poster":{"id":3209768,"username":"exknight","slug":"exknight","avatar_url":"avatars/3209768.png?_=aa4d2431547da17f","is_superuser":false,"is_staff":false},"post_date":1594135479,"body":"I do believe this isn't ntr at all, there's is no relationship involved. It was just first come first serve, anyway would gladly cut his dick for being such a pussy\n\nPS: the black haired guy have some amazing stamina btw"},{"id":1061648,"gallery_id":319682,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1594134070,"body":"Dam what throws me off in ch3 mc can keep up with this dude np he made his sister tap out while he was thinking of chitose plus he cofessed to her in this ch. He was rejected but at least he said something, i  still got hope for mc i think if he gets a chance to fuck her he is going to go super alpha on the pussy"},{"id":1061591,"gallery_id":319682,"poster":{"id":1697093,"username":"Wieczorny","slug":"wieczorny","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594132270,"body":"Looking at previous his series I think Mc will not have good ending xD"},{"id":1061582,"gallery_id":319682,"poster":{"id":3431739,"username":"jingsen","slug":"jingsen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594131795,"body":"Man, this series is both so great, yet so not great at the same time. I just hope that the MC can outfuck this alpha and take back his girl and also take the sister as well, but that will never happen I guess. Too bad, time to fap with a broken heart then "},{"id":1061550,"gallery_id":319682,"poster":{"id":932318,"username":"Shallchair Kinkyfallen","slug":"shallchair-kinkyfallen","avatar_url":"avatars/932318.png?_=e7afdcaf7975ff12","is_superuser":false,"is_staff":false},"post_date":1594130538,"body":"She is such a whore now."},{"id":1061535,"gallery_id":319682,"poster":{"id":1400370,"username":"starfox1234","slug":"starfox1234","avatar_url":"avatars/1400370.png?_=8fe9415a33f35edc","is_superuser":false,"is_staff":false},"post_date":1594130010,"body":"Am I the only one who thinks ntr guy looks like Reiner for AoT? XD"},{"id":1061521,"gallery_id":319682,"poster":{"id":1222807,"username":"Haise01","slug":"haise01","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594129479,"body":"@jesterxmusketeer what do you mean ''while it last''? is ntr gonna end or something? lol"},{"id":1061519,"gallery_id":319682,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1594129454,"body":"I guess this chapter was a little more plot-focused, cause in terms of sexual content, this was probably the worst chapter so far. Last chapter was crazy in terms of sexual content, so I can let it slide, but considering the interval between chapters, it's kinda meh. I do hope this ends somewhat different than your standard NTR plot though. The MC is already taking this a bit differently, which makes the NTR plot a little more realistic in that sense and hits harder as a result. Seto Yuuki is one of the better hentai writers I've seen in the industry so I do have faith. I just don't think it'd be a favorable ending for the MC, unfortunately, considering his endings are almost always crazy twists in spite of the MC."},{"id":1061490,"gallery_id":319682,"poster":{"id":3431595,"username":"justmadethisaccountforthislol","slug":"justmadethisaccountforthislol","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594128246,"body":"Just finished reading the previous chapters and this one. For those saying it could end with blonde guy fucking both fmc and his sister to ntr MC that wouldn’t do anything, MC isn’t in love with the sister so it wouldn’t matter to him and from what I’m seeing he’s not tripping over chitose by the end of this chapter. If blonde guy did that I don’t think MC would care. If it does happen tho that’s just bad writing on the authors part."},{"id":1061487,"gallery_id":319682,"poster":{"id":578579,"username":"Dorothea","slug":"dorothea","avatar_url":"avatars/578579.png?_=bb442de75295f22e","is_superuser":false,"is_staff":false},"post_date":1594128212,"body":"Well, not bad. I thought that the main character would go crazy and take her back based on the previous chapter but, looks like I was mistaken. not many good NTRs lately."},{"id":1061480,"gallery_id":319682,"poster":{"id":2075190,"username":"jesterxmusketeer","slug":"jesterxmusketeer","avatar_url":"avatars/2075190.png","is_superuser":false,"is_staff":false},"post_date":1594128144,"body":"Its funny to see some people complaining about ntr in author works. Ntr is his best genre imo. Just enjoy it while it last. "},{"id":1061458,"gallery_id":319682,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1594127589,"body":"My heart sunk for mc,on top of that he is in the freind zone she cares for him but only to that reguard. its sad that even the mother accepted him as a future boyfriend for her to send him upstairs only to hear her fuck dam im feeling the hurt😢.\n"},{"id":1061454,"gallery_id":319682,"poster":{"id":3243894,"username":"Otakufan14","slug":"otakufan14","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594127545,"body":"Bueno al menos el tipo no anda llorando ,al final lo acepta y sigue adelante,ahora  no se que más aportará el autor ,ojalá y lo haga de nuevo con la hermana del tipo y en frente de el pero duro contra el muro ya que en el anterior se vio que la de lentes se sorprendió al final y no pudo seguirle el ritmo lo que significa que tiene potencial\n"},{"id":1061432,"gallery_id":319682,"poster":{"id":1714571,"username":"j.day","slug":"j-day","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1594126889,"body":"The author did not confirm that ch5 would be the last on twitter tho. He just said there's a little more. That could be 1 or 2 chapters"},{"id":1061425,"gallery_id":319682,"poster":{"id":2580908,"username":"chetan72","slug":"chetan72","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594126737,"body":"So she has finally fallen "},{"id":1061420,"gallery_id":319682,"poster":{"id":635409,"username":"monochromelover","slug":"monochromelover","avatar_url":"avatars/635409.png?_=932a4a032cac2cf5","is_superuser":false,"is_staff":false},"post_date":1594126683,"body":"Seto is kinda misleading in the beginning where it hints that both the mc and chitose are in love but in this chapter she rejects the mc so it's just that the mc didn't get a happy ending with chitose with no real plot or anything except the awesome art."},{"id":1061408,"gallery_id":319682,"poster":{"id":2822749,"username":"HansRuediger85","slug":"hansruediger85","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594126338,"body":"Not gonna lie, i normally like ntr doujinshis but this kinda hurts to read."},{"id":1061406,"gallery_id":319682,"poster":{"id":3431518,"username":"IIXerebusXII","slug":"iixerebusxii","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594126251,"body":"Going by rough translation Chitose is dating the dude now the page where he's shocked that's why he's shocked,and going by Seto Yuuki he won't get to fuck Chitose or anything my bet is incest with sister next with out MC, Seto need's to do more happy ending's his story's are great but it get's boring after a while. "},{"id":1061370,"gallery_id":319682,"poster":{"id":1400370,"username":"starfox1234","slug":"starfox1234","avatar_url":"avatars/1400370.png?_=8fe9415a33f35edc","is_superuser":false,"is_staff":false},"post_date":1594125419,"body":"You snooze you lose kids, nothing else to say....."},{"id":1061368,"gallery_id":319682,"poster":{"id":2911552,"username":"Rurlock","slug":"rurlock","avatar_url":"avatars/2911552.png?_=d19477d7633e0437","is_superuser":false,"is_staff":false},"post_date":1594125278,"body":"Is it me or this chapter's art seems worse than the previous chapters?"},{"id":1061364,"gallery_id":319682,"poster":{"id":3431429,"username":"negropumpkins","slug":"negropumpkins","avatar_url":"avatars/3431429.png?_=75bd3ba920ebc38d","is_superuser":false,"is_staff":false},"post_date":1594125178,"body":"@kumaichi96 Ohh I see. Yeah a chapter after this one probably won’t be the best, we can only wait and see tbh"},{"id":1061345,"gallery_id":319682,"poster":{"id":2653922,"username":"MileistWeeb","slug":"mileistweeb","avatar_url":"avatars/2653922.png?_=ffc3cce98adf84b7","is_superuser":false,"is_staff":false},"post_date":1594124822,"body":"i hope MC move along without ending up with Chitose and accepting that his crush is a hoe.\nChitose ending up like a whore in her school, she loves it."},{"id":1061339,"gallery_id":319682,"poster":{"id":756048,"username":"kumaichi96","slug":"kumaichi96","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594124687,"body":"That's what I'm saying we don't need other chapter after this. What will that accomplish? Adding extra chapter into this series will add nothing more than misery for hori to see her getting fucked in front him. Do we actually need to see them fucking again? I clearly don't. Unless author pulls out reverse card out of his ass we won't get any better ending not \"good\" (We are way past the good ending in this series) than this. "},{"id":1061312,"gallery_id":319682,"poster":{"id":3431429,"username":"negropumpkins","slug":"negropumpkins","avatar_url":"avatars/3431429.png?_=75bd3ba920ebc38d","is_superuser":false,"is_staff":false},"post_date":1594124019,"body":"@kumaichi96 The author confirmed a ch 5 is in the works on Twitter and its the final one"},{"id":1061305,"gallery_id":319682,"poster":{"id":756048,"username":"kumaichi96","slug":"kumaichi96","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594123703,"body":"Why so we need another chapter tho? He confessed and she said no. Taka and chitose got together as a couple. This is the end isn't it. What else can author make out of this story? Have taka fuck his sister and chitose so he can send hori their threesome picture? \n\nNow we know she willingly fucked taka and not of peer pressure from his sister judging by how she let him come to her room giving kisses and shit. Let the story end. This is the end. It's  a good end. "},{"id":1061289,"gallery_id":319682,"poster":{"id":1745567,"username":"blackyblack","slug":"blackyblack","avatar_url":"avatars/1745567.png?_=9469b3457fad8909","is_superuser":false,"is_staff":false},"post_date":1594123139,"body":"HOT but sadly no nakadashi :/\nwelp ch.5 better be good"},{"id":1061287,"gallery_id":319682,"poster":{"id":3431429,"username":"negropumpkins","slug":"negropumpkins","avatar_url":"avatars/3431429.png?_=75bd3ba920ebc38d","is_superuser":false,"is_staff":false},"post_date":1594123109,"body":"The author never has good endings in most of his work, but I honestly don’t see how he can fuck this up beyond this point. There’s only two routes for a bad ending, one where the Mc watches them fucking but that already happened in the first two chapters and it doesn’t really seem to effect him much in this chapter, and the two would be them fucking behind MC back but MC already knows that they’re doing that and it doesn’t really seem to hurt him by the end of this chapter too, he looks like he coming to terms with it and moving on. I really don’t know how the author can fuck this up, all he has to do is keep MC with glasses next chapter and it’s gg. Also glasses is better than Chitose"},{"id":1061278,"gallery_id":319682,"poster":{"id":3431423,"username":"babatunde762","slug":"babatunde762","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594122703,"body":"Honestly don’t won’t MC to end up with Chitose, she’s a pushover. If blonde didn’t tell the other guys who were hitting on her to step off, they would’ve been fucking her too, she’s too easy"},{"id":1061273,"gallery_id":319682,"poster":{"id":2800146,"username":"redcrowbar","slug":"redcrowbar","avatar_url":"avatars/2800146.png?_=1f03dc9ac96a4153","is_superuser":false,"is_staff":false},"post_date":1594122610,"body":"Damn I wish I knew japanese!  I know mc is kinda guilty for not making a move first but damn it, is chitose dont have any willpower or smth like that?"},{"id":1061260,"gallery_id":319682,"poster":{"id":3431409,"username":"JuliaKyok","slug":"juliakyok","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594122338,"body":"Ch5 confirmed will be last chapter.\n\nHonestly Im over it now. Knowing Seto Yuuki there isnt a happy end for Hori with Chitose and Hori seems to be taking it in as well. We'll just have to see what ch5 brings"},{"id":1061256,"gallery_id":319682,"poster":{"id":2128197,"username":"Shreshth","slug":"shreshth","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594122188,"body":"I think last chapter end with glasses girl and chitose fucked by blonde and MC looking just looking at them"},{"id":1061245,"gallery_id":319682,"poster":{"id":3019308,"username":"vixen joker","slug":"vixen-joker","avatar_url":"avatars/3019308.png?_=c0ee14c673956e87","is_superuser":false,"is_staff":false},"post_date":1594121904,"body":"let the mc get a happy ending with the glasses girl. this girl is fucking slut. leave that shit already there is no more hope."},{"id":1061234,"gallery_id":319682,"poster":{"id":618966,"username":"Basic Instinct","slug":"basic-instinct","avatar_url":"avatars/618966.png?_=e3cb99a53c592b4e","is_superuser":false,"is_staff":false},"post_date":1594121420,"body":"Glasses girl only for next chapter plz. "},{"id":1061232,"gallery_id":319682,"poster":{"id":2398881,"username":"heavenfell","slug":"heavenfell","avatar_url":"avatars/2398881.png","is_superuser":false,"is_staff":false},"post_date":1594121373,"body":"I had hopes this will end well but doesnt look like it now. Atleast the previous chapters gave us hope that she might come to him. Also i dig the sis so he should just take her and leave this girl. She's so infatuated with the other guy or sex. "},{"id":1061231,"gallery_id":319682,"poster":{"id":3150096,"username":"BTS, bangladesh toilet service","slug":"bts-bangladesh-toilet-service","avatar_url":"avatars/3150096.png?_=2f84079bce19a5af","is_superuser":false,"is_staff":false},"post_date":1594121342,"body":"Is this even ntr tho? Like the blonde guy had much more spotlight than the mc himself lmfao"},{"id":1061229,"gallery_id":319682,"poster":{"id":3340408,"username":"pitlord777","slug":"pitlord777","avatar_url":"avatars/3340408.png?_=1caec07b2e424089","is_superuser":false,"is_staff":false},"post_date":1594121310,"body":"It's not a hentai - this is a masterpiece. Just look on those pictures"},{"id":1061216,"gallery_id":319682,"poster":{"id":3366221,"username":"Railroadman","slug":"railroadman","avatar_url":"avatars/3366221.png?_=62a6b81cacb7747b","is_superuser":false,"is_staff":false},"post_date":1594120733,"body":"Well goddamn "},{"id":1061205,"gallery_id":319682,"poster":{"id":660163,"username":"makeitrain","slug":"makeitrain","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594120378,"body":"Man there was no much hype surrounding this chapter it's insane and this is probably the calm before the storm cuz next chap is gonna be lit "},{"id":1061202,"gallery_id":319682,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1594120293,"body":"Dude actually deserve her at this point... artist kinda fuck it up. The other dude did what normally what MC would do if this is not NTR.  "},{"id":1061201,"gallery_id":319682,"poster":{"id":1441590,"username":"bebetojean","slug":"bebetojean","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594120152,"body":"The full censorship is killing me"},{"id":1061196,"gallery_id":319682,"poster":{"id":2911552,"username":"Rurlock","slug":"rurlock","avatar_url":"avatars/2911552.png?_=d19477d7633e0437","is_superuser":false,"is_staff":false},"post_date":1594120045,"body":"I waited so long for chapter 4, and what I got is... this? More netorare, just for the sake of it, and the dark hair sister didn't even appear? I feel cheated"},{"id":1061185,"gallery_id":319682,"poster":{"id":1122139,"username":"archer42","slug":"archer42","avatar_url":"avatars/1122139.png","is_superuser":false,"is_staff":false},"post_date":1594119819,"body":"fck this shit"},{"id":1061164,"gallery_id":319682,"poster":{"id":3431229,"username":"popo9191","slug":"popo9191","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594118743,"body":"i want see blood ,ntr with blood and killing is best"},{"id":1061146,"gallery_id":319682,"poster":{"id":1895076,"username":"saint.louisXI","slug":"saint-louisxi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594117983,"body":"I would choose the sister over chitose tbh. Hope the MC find happiness next chapter"},{"id":1061140,"gallery_id":319682,"poster":{"id":3431242,"username":"Paladin rates NTR Doujin","slug":"paladin-rates-ntr-doujin","avatar_url":"avatars/3431242.png?_=8a337061d3de310d","is_superuser":false,"is_staff":false},"post_date":1594117790,"body":"That was a good fap ngl. If the mc lost to the chad it's ok. Just get the glasses girl. She is so good compared to this girl"},{"id":1061134,"gallery_id":319682,"poster":{"id":2734913,"username":"HaruHiko","slug":"haruhiko","avatar_url":"avatars/2734913.png","is_superuser":false,"is_staff":false},"post_date":1594117658,"body":"need last chapter"},{"id":1061127,"gallery_id":319682,"poster":{"id":2128197,"username":"Shreshth","slug":"shreshth","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594117482,"body":"Is it mentioned that next chapter will be the last"},{"id":1061121,"gallery_id":319682,"poster":{"id":1873702,"username":"Miming","slug":"miming","avatar_url":"avatars/1873702.png?_=32dc31a0e95ac3c2","is_superuser":false,"is_staff":false},"post_date":1594117367,"body":"Her pussy is reacting whenever the mc is around... What a bitch. I nut though."},{"id":1061098,"gallery_id":319682,"poster":{"id":43026,"username":"Cheshiremoose","slug":"cheshiremoose","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594116749,"body":"This guy has been drawing hentai for at least 10 years and he has only made like 2 stories with a happy ending. The best possible ending that could happen now is the MC finds his own happiness with chad's sister."},{"id":1061093,"gallery_id":319682,"poster":{"id":2991294,"username":"Masho95","slug":"masho95","avatar_url":"avatars/2991294.png","is_superuser":false,"is_staff":false},"post_date":1594116575,"body":"Well, talk about making the first move lmao... gg for the mc. \nAnd there is one last chapter left. What else can happen here? lol"},{"id":1061070,"gallery_id":319682,"poster":{"id":1873702,"username":"Miming","slug":"miming","avatar_url":"avatars/1873702.png?_=32dc31a0e95ac3c2","is_superuser":false,"is_staff":false},"post_date":1594115797,"body":"Chapter 5 is the last one"},{"id":1061055,"gallery_id":319682,"poster":{"id":3224877,"username":"stormzsz","slug":"stormzsz","avatar_url":"avatars/3224877.png?_=9ee62efe15f993b9","is_superuser":false,"is_staff":false},"post_date":1594115202,"body":"LET'S FUCKING GOOOOOOOOOOOOOOOOOOOOOOOOOOOO"},{"id":1061040,"gallery_id":319682,"poster":{"id":630696,"username":"zombiekiss","slug":"zombiekiss","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594114875,"body":"Nah one more chapter"},{"id":1061034,"gallery_id":319682,"poster":{"id":3431147,"username":"Gaxkueno","slug":"gaxkueno","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594114737,"body":"Is this already end?"},{"id":1061031,"gallery_id":319682,"poster":{"id":630696,"username":"zombiekiss","slug":"zombiekiss","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594114685,"body":"Well he was about to confess but then the sister recommend an orgy out of nowhere, so everything is her fault.\nNext one is last chapter hopefully its a good ending.."},{"id":1061009,"gallery_id":319682,"poster":{"id":2707965,"username":"Kojirou Sasaki","slug":"kojirou-sasaki","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594113730,"body":"Nah, he got to fuck the sister, If I was him I'd fuck the sister everyday over Chitose. "},{"id":1061005,"gallery_id":319682,"poster":{"id":2279900,"username":"nazukixkurumi","slug":"nazukixkurumi","avatar_url":"avatars/2279900.png?_=eb6f1971016b8ce7","is_superuser":false,"is_staff":false},"post_date":1594113679,"body":"He certainly didnt deserve this but its his fault for not making a move on her. "},{"id":1060999,"gallery_id":319682,"poster":{"id":630696,"username":"zombiekiss","slug":"zombiekiss","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1594113498,"body":"Poor guy :( "}]