[{"id":2410794,"gallery_id":320147,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647924054,"body":"Also that last guy really gucking lucked out, he got both the girl and her slutty milf mother"},{"id":2410791,"gallery_id":320147,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647923805,"body":"This is solid fucking gold and all these stories are hot. I love how many happy endings there are. The author said originally he was going to make an all ntr book but then just decided he wanted happy endings instead. The only unhappy ending is that one cheating slut and I love that in the afterword the author shows her getting gangbanged and says she got abandoned by her affair partner and had to live as a whore, meanwhile her ex found a happy relationship so he gets a happy ending even if she doesn't. Lmfao. And all the other stories have sluts but lovable ones with happy endings, I love it. I hope this gets translated some day. "},{"id":1383318,"gallery_id":320147,"poster":{"id":1359961,"username":"duke1977","slug":"duke1977","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607092850,"body":"I see why it takes so long to translate these manga's to english it's because not only do you have to translate you have to kinda rewrite a lot of it. I've been translating some of these so i can read the raws and a lot of it doesn't make sense for example it will say \"He\" instead of \"She\" stuff like that. Some of it is so bad it's not worth translating because you would have to rewrite the whole thing."},{"id":1107585,"gallery_id":320147,"poster":{"id":3493518,"username":"inzestlover","slug":"inzestlover","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595894549,"body":"this is G.O.l.D"},{"id":1076267,"gallery_id":320147,"poster":{"id":3356562,"username":"maling_memek","slug":"maling_memek","avatar_url":"avatars/3356562.png?_=bbdaf07a1a9cbaa7","is_superuser":false,"is_staff":false},"post_date":1594655581,"body":"What is wrong with these woman they fuck anyone who have a dick"}]