[{"id":1758652,"gallery_id":321407,"poster":{"id":3555017,"username":"puige","slug":"puige","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621804002,"body":"This is shit. It’s not swinging, it’s full NTR. She clear enjoys sex with the friend more, they have sex behind the boyfriends back, the friend lies to her, and his dick is twice the size of the boyfriends. She even says she loves him during sex. This is not swinging. She clearly likes the friend more. At least sexually. And that’s really what makes NTR. and the whole birthday plot wasn’t resolved? And we rarely see any boyfriend action. This is honestly not good. It’s a stereotypical “swinging” hentai. If there ever is another chapter, I can almost guarantee she’ll leave the boyfriend. "},{"id":1661718,"gallery_id":321407,"poster":{"id":1571575,"username":"Aldyn","slug":"aldyn","avatar_url":"avatars/1571575.png?_=6b1988a6df0a01d5","is_superuser":false,"is_staff":false},"post_date":1617634953,"body":"And the fact that Shougo doesn't immediately see a million red flags when Rina says that he'll hate her if he watches the recording is just beyond me. And even after reading Shougo's messages on her birthday, you're telling me that Rina was absolutely fine with the fact that Kudou lied to her about the whole thing? Now let's fast forward and have some anal fun as if it never happened? I was initially fine with this story, but the more I think about it the more I hate it and its inconclusiveness."},{"id":1661699,"gallery_id":321407,"poster":{"id":1571575,"username":"Aldyn","slug":"aldyn","avatar_url":"avatars/1571575.png?_=6b1988a6df0a01d5","is_superuser":false,"is_staff":false},"post_date":1617634242,"body":"I think the last page where Rina talks in her sleep is adorable, but it's not enough to show that she's sexually SATISFIED with her boyfriend. He makes her cum, sure, but not as much as the other guy. On one hand I appreciate a swinging doujin that doesn't take itself seriously, but on the other it's frustrating how there is no conclusion and it feels like I just wasted my time waiting for an ending that never came, especially after everything that happened in Koibito Gokko 2. This girl cheated on her boyfriend because she thought he forgot about her birthday, trusted Kudou when he LIED about Shougo's surprise, allowed herself to be filmed, and even said that she loved Kudou multiple times. And what conclusion do we get? Nothing. She doesn't regret anything, doesn't face any consequences, doesn't tell Shougo what happened, and we don't even get to see how the whole birthday conflict ended. All we get is a plot vacuum between Koibito Gokko 2 and this, and everything is suddenly fine."},{"id":1661639,"gallery_id":321407,"poster":{"id":1571575,"username":"Aldyn","slug":"aldyn","avatar_url":"avatars/1571575.png?_=6b1988a6df0a01d5","is_superuser":false,"is_staff":false},"post_date":1617632407,"body":"Even if the next chapter was canon, I don't think it matters. It doesn't show anything that we haven't seen before. But honestly, though, how did the MC \"get his girl back\"? The first chapter (Koibito Gokko, not this one) makes it clear that Kudou has a bigger dick, and even in this one he is the only one who's capable of making Rina cum so much that she loses all of her strength. And she doesn't \"clearly show that she doesn't want to have sex with him\" at any point. This is hentai. Girls will say \"No ♡\" when they really mean yes. She could easily tell her boyfriend about it or just call the whole thing off, but she doesn't. She goes behind her boyfriend's back multiple times and doesn't show any signs of regret. Even swinging relationships have ground rules. If one party doesn't consent, it's cheating. So no, I don't think the author is just playing with our minds. This story as a whole is NTR. A lighthearted one, but still NTR nonetheless."},{"id":1209715,"gallery_id":321407,"poster":{"id":3623524,"username":"pettam4","slug":"pettam4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600066110,"body":"The start of this chap is an omake itself, anything that is sketched by the author is just alternate beginning/ending that fall from the main canon. So the start of this chapter was an omake or a seperate beginning to the main canon, so rest assured; they took out the ntr and cheating tag for a reason, since its no longer needed, the mc got his girl back in the end."},{"id":1208166,"gallery_id":321407,"poster":{"id":3623524,"username":"pettam4","slug":"pettam4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599991519,"body":"The chap after this, is most likely isnt part of the main canon since it has no chapter name or indication; based on the tags and, its name of being a continuation; i think he made it just for fun, since this chap is possible the final one which includes the end with its added omake. With all previous four combined."},{"id":1208155,"gallery_id":321407,"poster":{"id":3623524,"username":"pettam4","slug":"pettam4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599991303,"body":"Emailed taono today and, he said he respects the readers for wanting a sequal but, aslo says he wants to take options for the future so hes stopping it for now or likely forever. Imo i think the series might end completely soon or has ended. As he seems as he is running out of ideas."},{"id":1205135,"gallery_id":321407,"poster":{"id":3623524,"username":"pettam4","slug":"pettam4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599852225,"body":"Lol even in the first seven pages you can clearly see the gf get uneasy when ber bf is a bit too intimate with the guys girl; she takes peeks at them and she rushes to her bf and he shrugs her off saying its not her turn yet then they blow him at the same time; its a telling me they both are neutral about it and, it also shows how much she loves her bf. I Dont get a netorare vibe from this series; its just the author playing with our minds."},{"id":1204618,"gallery_id":321407,"poster":{"id":3623524,"username":"pettam4","slug":"pettam4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599828134,"body":"They even corrected it (finaly), there isnt  an ntr tag, its just that the writer emphasizes bf friends sex waay more that it comes off that way; in the 3rd and 4rth to last panel she sleeps at her bf for two days straight; having constant sex; pissing herself while cumming, it isnt ntr its just that the author wants it to look that way and, draws out her sex with her bf friend to make it seem like ntr, if you look at it shougo and and the other girl seem to not really care about them, actually his girlfriend shows more care for him than he cares for her, its just that she gives in to the bf friends lust cause shes a little horny at most times; shes not actually gonna leave the bf for the guy; read my past comment. I think she just likes the thrill of her bf not knowing shes having sex behind his back that turns her on more than the actual guy."},{"id":1203727,"gallery_id":321407,"poster":{"id":3623524,"username":"pettam4","slug":"pettam4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1599782241,"body":"Dont thi k she likes the bf friend, i just think she gets off to the thrill of getting caught doing it while her bf is near, its clear she loves shougo and IS plsed by him, im pretty sure shes more aroused due to her bf being there, imo she seems to like the thrill of having sex behind his back; but really doesnt like the bfs friend in a romantic way and, cleary shows in some scences she doesnt want to even have sex with him. The bf friend likes having sex with her because she matches his sex drive more, shes just horny but not \"im gonna ditch my bf horny\"; she still loves him deeply even in the latest chp; shes worried that her bf ex is coming back, if she didnt care she wouldnt look and spy on her bf. Swinging is healthy in most relationships to show likes and dislikes. Its just that she likes it too much that it seems like ntr."},{"id":1115162,"gallery_id":321407,"poster":{"id":3375125,"username":"JRod1108","slug":"jrod1108","avatar_url":"avatars/3375125.png?_=b31c5a1ac1a823fa","is_superuser":false,"is_staff":false},"post_date":1596191359,"body":"Why isn't the beginning translated? "},{"id":1097621,"gallery_id":321407,"poster":{"id":720156,"username":"LoneWizard2","slug":"lonewizard2","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1595523217,"body":"such a waste dude... dis timeline shit"},{"id":1091760,"gallery_id":321407,"poster":{"id":3429030,"username":"zero4079","slug":"zero4079","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1595305409,"body":"????????????? I can't understand anything"},{"id":1090265,"gallery_id":321407,"poster":{"id":2692484,"username":"TheCrappyGod","slug":"thecrappygod","avatar_url":"avatars/2692484.png?_=8bdb4a789f6b37f3","is_superuser":false,"is_staff":false},"post_date":1595238202,"body":"This god damn hoe needs to die"},{"id":1088948,"gallery_id":321407,"poster":{"id":2922926,"username":"セイバーＸ","slug":"seibax","avatar_url":"avatars/2922926.png?_=f584e2ea4cd74a08","is_superuser":false,"is_staff":false},"post_date":1595183197,"body":"Fucking hell the monkey is too obsessed with fucking the bros hoe. Even if they did consent there's a line not to cross ya damn ape. "},{"id":1088942,"gallery_id":321407,"poster":{"id":477004,"username":"FresshLikeLettuce","slug":"fresshlikelettuce","avatar_url":"avatars/477004.png","is_superuser":false,"is_staff":false},"post_date":1595182951,"body":"nice swapping  i really want to try it........ sadly my gf fucking kinky to do this kind of stuffs."},{"id":1088480,"gallery_id":321407,"poster":{"id":2075139,"username":"Xson","slug":"xson","avatar_url":"avatars/2075139.png","is_superuser":false,"is_staff":false},"post_date":1595169088,"body":"this is ntr\n"}]