[{"id":2025312,"gallery_id":322357,"poster":{"id":4688454,"username":"seeeguuurkeee","slug":"seeeguuurkeee","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1632004345,"body":"致作者：\n喜歡你的風格和理念。但是，我會要求你做一次同樣的事情，只有男性（男性和女性角色顛倒）。\n會好的\nZhì zuòzhě:\nXǐhuān nǐ de fēnggé hé lǐniàn. Dànshì, wǒ huì yāoqiú nǐ zuò yīcì tóngyàng de shìqíng, zhǐyǒu nánxìng (nánxìng hé nǚxìng juésè diāndǎo).\nHuì hǎo de"},{"id":1426131,"gallery_id":322357,"poster":{"id":1000545,"username":"小宏","slug":"xiao-hong","avatar_url":"avatars/1000545.png","is_superuser":false,"is_staff":false},"post_date":1608732305,"body":"更新可以快一点吗？拜托了"},{"id":1217148,"gallery_id":322357,"poster":{"id":3654637,"username":"MoanChomsky","slug":"moanchomsky","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600396272,"body":"Oh yeah, and btw.  This was a hot title.  The author is definitely very knowledgeable about the culture war present within most cultures these days. Eg \"alphas vs betas\" or S vs M men, and also the conspiracy theories of the alt-right w/respect to feminism and pizzagate-like idiocy.  (In my opinion, at least, the idea that Satan worshipers even exist at all is pretty unlikely. If you read up on the Founderof the Church of Satan you'll notice Anton LaVey is basically a hedonistic atheist who just likes to use the label Satan to fuck with Christian's fears. Its crazy how fearful they are, especially of terrorists.  Constipation kills more people than terrorists, guys. Conspitation. So why do we drop 60% of our budget on the War on Terror?  Cowardice is why. Cuckservative cowardice."},{"id":1217130,"gallery_id":322357,"poster":{"id":3654637,"username":"MoanChomsky","slug":"moanchomsky","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600395809,"body":"If you find somebody else's sexuality threatening, its because you are probably worried you might get \"infected\" with that kink yourself.   I guess many people are still in a type of inner battle with their own self, wanting to be dominant like mainstream culture demands of you- but still curious and perhaps turned on by female dominance.  A lot of you guys are still discovering your sexuality- and that is cool.  Its a lifelong process for many kinksters out there. Trying to figure out what turns you on and what offends you is part of that process.. \"When you are old and jaded like me\" (lol)  you find getting offended about a genre that disgusts you is silly. I don't like guro, so I don't read it often. And when I do, I don't complain because I knew what I was getting into.  "},{"id":1110322,"gallery_id":322357,"poster":{"id":1542378,"username":"X0X0P","slug":"x0x0p","avatar_url":"avatars/1542378.png?_=e6ae54b7e0b3256d","is_superuser":false,"is_staff":false},"post_date":1596011651,"body":"This is painful to read unless ur a M "}]