[{"id":1542928,"gallery_id":322825,"poster":{"id":3423516,"username":"user_A_exist","slug":"user_a_exist","avatar_url":"avatars/3423516.png?_=abb022accdee2e90","is_superuser":false,"is_staff":false},"post_date":1612354487,"body":"Well tbh, that MC deserve it."},{"id":1183676,"gallery_id":322825,"poster":{"id":3601934,"username":"Hachiman8","slug":"hachiman8","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598901446,"body":"3. Combine the 2 points of the above-mentioned. We shall understand that the author was trying to seperate love and sex, but at the same time, love and sex should be seen as a compound. The ex-gf cheated on MC because the MC lied on his feelings (and cheated as well) , and more or less she doesn’t want to lose (to the FMC), and thats why the NTR dude felt strange with the “finally i won” statement.\nSo i am pretty sure that the biggest reason why the ex-gf did not cum is that the MC did not genuinely fell for the exgf, instead, he just sinked on the FMC during the whole process. They both love each other, while the boy discovered after being an exbf, the girl just trying to hide her feelings because she doesnt want to destroy their relationship. Therefore, perhaps we could look forward to a good ending in this hentai manga."},{"id":1183661,"gallery_id":322825,"poster":{"id":3601934,"username":"Hachiman8","slug":"hachiman8","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598900788,"body":"For those who have came all the way long. I knew Dr.sleik had posted the plot before therefore I would just post something I am pretty sure about the story (and maybe some of you had already found out)\n\n1. Few chapters ago, MC’s girlfriend(ex now) said that MC did not pleased her to her climax. But then that NTR boy is able to please her. I can say that if you really read every part of this manga, you will find out that the NTR trash has a smaller dick than the MC’s. But meanwhile, the NTR trash are experienced to please every gals, nothing about love or romance, just sex techniques. \n\n2. Few chapters ago ( i think it’s chapter 21~23), the FMC had sex with the class rep and she generally found out that the class rep was just doing his own and just tried to please himself, rather than pleasing both at the same time. Thats why the FMC told the MC that he should not worry about his sex techniques, telling him his skills are great (right after the ex-gf told him that she did not cum)"},{"id":1141662,"gallery_id":322825,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1597266922,"body":"Its so cute having a personal troll again. - https://nhentai.net/users/3533037/sirrobin - Careful though. People are going to start thinking you love me too much."},{"id":1141605,"gallery_id":322825,"poster":{"id":3533037,"username":"SirRobin‏‏‎ ‎","slug":"sirrobin","avatar_url":"avatars/3533037.png?_=36fb1d10b5335960","is_superuser":false,"is_staff":false},"post_date":1597264715,"body":"@sleik  I just realized this is regular borderline-h manga with sex scenes not hentai that's why it's so long sorry for being so retarded before."},{"id":1141584,"gallery_id":322825,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1597263975,"body":"@sleik -- Thank you. Akitoh pointed me this way. You summary was fantastic. Question. Is hentai this long unusual? I'm used to manhwa getting this long but hentai seems to cap out around 200 pages. Most not even getting passed 100 pages. Is that true?"},{"id":1140393,"gallery_id":322825,"poster":{"id":2128197,"username":"Shreshth","slug":"shreshth","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597221121,"body":"I think this is now going to end in few more chapters maybe 34 or 35 the last one"},{"id":1120224,"gallery_id":322825,"poster":{"id":269245,"username":"handelshieh","slug":"handelshieh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596404961,"body":"現在市面上有許多「類似派生」的作品，千篇一律都是「雄性 動物化：雌性 機械化」\n\n例如「新田章：あそびあい」「世徒ゆうき 千歳 -chitose-」\n\n好像雌性都沒有生理上的煩惱與限制，如作愛機械般的自由生活，機械還要機油保養咧。而雄性除了無限性慾外，也無任何考量。\n"},{"id":1120215,"gallery_id":322825,"poster":{"id":269245,"username":"handelshieh","slug":"handelshieh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596404255,"body":"垃圾般的作品，畜生般的角色。"},{"id":1118801,"gallery_id":322825,"poster":{"id":1230299,"username":"ItsAtlas","slug":"itsatlas","avatar_url":"avatars/1230299.png?_=17a96b9c3a1d3145","is_superuser":false,"is_staff":false},"post_date":1596350593,"body":"@sleik thanks for the summary bc i didn't really understand what was going on other than her saying \"I won\"(or something like that) which made me even more confused, but not gonna like these 30 chapters were like a big mess... Imo."},{"id":1118246,"gallery_id":322825,"poster":{"id":317146,"username":"sleik","slug":"sleik","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596322792,"body":"The now ex-gf was also pissed that all the boys she likes or the ones who want to get with her seem to have the heroine as their first choice.  She liked the class rep, and later the mc.  Even the ntr dude initially outright stated he wanted to get with the heroine over her first.  This is speculation, but when she’s screams “I win” at the beginning of ch. 31, it was because she finally managed to get someone who wanted the heroine to genuinely like her more.  The ntr dudes confession and her lack of interest also helped her understand the bad mindset she had in relationship between mc and her (both She feels being one sided).  \nHope the relationship with the class rep doesn’t turn dark. So far he seems to be having trouble staying hard, so he may have some fetish...like a cuck fetish or some sadistic fetish that could bring the ntr dude back to rape the heroine..."},{"id":1117645,"gallery_id":322825,"poster":{"id":2126871,"username":"jidgeeboy","slug":"jidgeeboy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596299111,"body":"Thanks for the summary, Sleik. I read all of the translated chapters but had a hard time understanding what was currently going on. So...the now ex gf basically cheated just to get better at sex. That's...a fucked up reason to cheat on someone lol. This whole manga is just people cheating for a myriad of dumb reasons. Really hope the NTR dude doesn't show up anymore, but glad he got some kind of comeuppance. \n\nI really wonder why the heroine stays with the class rep guy if he can't please her sexually at all. Heroine and MC clearly have a thing for each other. I'd be surprised if things go bittersweet or dark. It seems to be gearing up for some drama with the class rep for sure, but in the end I think heroine and MC will have a sex marathon and realize they're perfect for each other."},{"id":1117448,"gallery_id":322825,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1596291375,"body":"@sleik You're doing god's job, I keep coming back to check if someone explained the story lol I love how mindless NTR story are, they legit horny monkeys. Sex beats everything for them lol I mean she cheat for training, is there anything more funny than that?"},{"id":1117360,"gallery_id":322825,"poster":{"id":3476935,"username":"scourge17","slug":"scourge17","avatar_url":"avatars/3476935.png?_=2a89f6b505647430","is_superuser":false,"is_staff":false},"post_date":1596284527,"body":"Pls pls pls i hope someone translate this in english"},{"id":1117317,"gallery_id":322825,"poster":{"id":3419576,"username":"Ehbm92","slug":"ehbm92","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596282432,"body":"After the girl has sex with the ntr dude, does she feel bad because she is pregnant or something and she has something in her hand when she is talking to the other bitch that gets with the ntr dude. Anybody know? "},{"id":1117300,"gallery_id":322825,"poster":{"id":3419576,"username":"Ehbm92","slug":"ehbm92","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596281822,"body":"Hopefully Chinese version comes out soon. Easier to translate on Google translate "},{"id":1116974,"gallery_id":322825,"poster":{"id":477004,"username":"FresshLikeLettuce","slug":"fresshlikelettuce","avatar_url":"avatars/477004.png","is_superuser":false,"is_staff":false},"post_date":1596267713,"body":"who cares who get with who?  MCL fucked the 2 girls  he liked  and MFH  fucked the 2 boys she liked , The GF of MC fucked the 2 boys she wanted, BF of MFH  fucked her, soooooo? i loved this twisted love ahahahhahaha and i fapped like 200 times along the 30 chapters so IM FUCKING SATISFIED HELL YEAHAAAAAA"},{"id":1116971,"gallery_id":322825,"poster":{"id":1708754,"username":"jaynejojo","slug":"jaynejojo","avatar_url":"avatars/1708754.png?_=358773cceeea2c3f","is_superuser":false,"is_staff":false},"post_date":1596267643,"body":"chinese plz"},{"id":1116838,"gallery_id":322825,"poster":{"id":317146,"username":"sleik","slug":"sleik","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596262958,"body":"Now that MC no longer has a girlfriend, the only obstacle is the relationship between the heroine and the class rep.  The class rep hasn't been shown to be shady, though he doesn't seem to be able to please the heroine at all in bed.  Hope the NTR dude doesn't make a comeback and rape the heroine in revenge as I don't think it was stated where the heroine was going with the class rep, so if they stay at the beach area... Feel bad for the ex-gf but the class rep being paired up with her in the end could work well as she could teach the class rep how to be better in bed with all the sexual experience she gained with the NTR dude.  That was supposedly one of the reasons she used to get with the NTR dude.  More characters could always be introduced I suppose, but this series is already getting pretty long for a hentai manga. This is all assuming the series ends up with the mc and the heroine getting together, and it doesn't go some bittersweet or dark route."},{"id":1116809,"gallery_id":322825,"poster":{"id":317146,"username":"sleik","slug":"sleik","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596262141,"body":"The gf believes that they're both at fault as they both cheated with people they didn't like, and feels that MC should be angrier with her.  \nShe then asks MC how long has he had feelings for the heroine. He reveals that it was pretty much from the first time they ever met as she got him out of a depressive funk with school, and made him feel like he could take on the world with her.  GF reveals how mad the heroine got at the NTR dude when she found her and NTR dude together couple days ago.  MC and his gf then break up, and she tearfully lies that she's got the NTR dude, so he should go get the heroine. MC knows she's lying, she denies it, and they part ways.\nThere's also a part in the beginning where the ex-gf states she only befriended the heroine as she knew the heroine's current bf liked the heroine.  The heroine retorts that she did the same as she knew that the MC liked the gf.  The heroine is staying with the class rep, so wasn't in the car. "},{"id":1116754,"gallery_id":322825,"poster":{"id":317146,"username":"sleik","slug":"sleik","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596260938,"body":"The MC's current gf ended breaking off with the NTR dude on the last night. While their bodies were compatible, she still hated him and the shitty things he did with girls in general. She also stated in the beginning that she was doing this so she could better please the MC sexually, and will confess to the cheating with the MC.  She ended up telling the blonde chick the bad shit he did (he confessed to doing shit like groping the heroine in her sleep), and the blond chick gets him kicked out from this place after listing off all the bad shit he's done.  NTR dude will get reported to the police if any sexual harassment happens.  (No idea why they didn't report him immediately, blond chick even states he's lucky that he's not being reported... )  MC's gf wants to break up with the MC after confessing to her cheating, and stating that she knew that he was cheating as well with the heroine.  MC is confused initially, but blames himself completely which shocks the GF. "},{"id":1116529,"gallery_id":322825,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1596254653,"body":"@diu613 It is in NTR lmao good sex means love for slut, this hentai is headed towards those kind of audiance, no intellect needed, just a good dumb NTR to fap on"},{"id":1116359,"gallery_id":322825,"poster":{"id":1378854,"username":"diu613","slug":"diu613","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596247097,"body":"Wtf.... the story is shit. The big tits girl basically is saying she falls in love with the ntr dude. Hows that possible. Good sex does not mean love. "},{"id":1116350,"gallery_id":322825,"poster":{"id":104978,"username":"NeutrinoPeace","slug":"neutrinopeace","avatar_url":"avatars/104978.png?_=27b1418d011385f2","is_superuser":false,"is_staff":false},"post_date":1596246526,"body":"Just because you didn't have sex in high school doesn't mean other people weren't ( ͡° ͜ʖ ͡°)"},{"id":1116316,"gallery_id":322825,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1596244902,"body":"Actuall relationship my ass lol as if people fuck whoever they see."},{"id":1116256,"gallery_id":322825,"poster":{"id":104978,"username":"NeutrinoPeace","slug":"neutrinopeace","avatar_url":"avatars/104978.png?_=27b1418d011385f2","is_superuser":false,"is_staff":false},"post_date":1596242177,"body":"I don't know why they call this NTR. This series is an actual reflection of relationships. They can get really messed up. Love this series."},{"id":1116198,"gallery_id":322825,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1596238381,"body":"Why is this not translated yet this is one of the best series in the cheating tag and it still has a ways to go, not fair i want to read this so bad\n"},{"id":1116195,"gallery_id":322825,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1596238262,"body":"@macocute Maybe in your next life. There like 30 chapters of this and still not one translation on this site."},{"id":1116193,"gallery_id":322825,"poster":{"id":3291363,"username":"macocute","slug":"macocute","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596237730,"body":"English please"},{"id":1116171,"gallery_id":322825,"poster":{"id":2730209,"username":"goxks","slug":"goxks","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596236348,"body":"I hope someone can make the summary... at least"},{"id":1116167,"gallery_id":322825,"poster":{"id":2302446,"username":"cottonm","slug":"cottonm","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596236047,"body":"Don’t know the full story, all I know is this girls the fucking worst"},{"id":1115995,"gallery_id":322825,"poster":{"id":97692,"username":"PVP.Eugeo","slug":"pvp-eugeo","avatar_url":"avatars/97692.png","is_superuser":false,"is_staff":false},"post_date":1596226455,"body":"ahhhh.... i can't understand what going on..."}]