[{"id":2467154,"gallery_id":323396,"poster":{"id":3748648,"username":"7TypesOfCum","slug":"7typesofcum","avatar_url":"avatars/3748648.png?_=d9110c1bd1e23476","is_superuser":false,"is_staff":false},"post_date":1650291383,"body":"When she came on her head the first time, that blank expression was sooo good. And just imagining getting to ram a girl like her like that man that would be paradise. Anyways, time to take my meds."},{"id":2349633,"gallery_id":323396,"poster":{"id":4256723,"username":"Centipide","slug":"centipide","avatar_url":"avatars/4256723.png?_=b402e46ae519f2dc","is_superuser":false,"is_staff":false},"post_date":1645354419,"body":"Lmao, i will do this on every doujinshi comment section."},{"id":2349623,"gallery_id":323396,"poster":{"id":4256723,"username":"Centipide","slug":"centipide","avatar_url":"avatars/4256723.png?_=b402e46ae519f2dc","is_superuser":false,"is_staff":false},"post_date":1645354243,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎"},{"id":2347067,"gallery_id":323396,"poster":{"id":4538786,"username":"MaisStockings","slug":"maisstockings","avatar_url":"avatars/4538786.png?_=1fbbfe9b64360f74","is_superuser":false,"is_staff":false},"post_date":1645262166,"body":"Ayo who tf cursed the comments"},{"id":2175134,"gallery_id":323396,"poster":{"id":309376,"username":"Nerevarine","slug":"nerevarine","avatar_url":"avatars/309376.png?_=e69b32a05a97dda0","is_superuser":false,"is_staff":false},"post_date":1638395490,"body":"Being able to cum from being throatfucked seems like it would be the most amazing thing. Fantastic doujin"},{"id":2135155,"gallery_id":323396,"poster":{"id":3012777,"username":"DeltaVPhoenix","slug":"deltavphoenix","avatar_url":"avatars/3012777.png","is_superuser":false,"is_staff":false},"post_date":1636529972,"body":"Ah yes, hell yeah."},{"id":2117959,"gallery_id":323396,"poster":{"id":3770531,"username":"top teir gamer","slug":"top-teir-gamer","avatar_url":"avatars/3770531.png?_=c0aa4a9ae3e61b9f","is_superuser":false,"is_staff":false},"post_date":1635741355,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":2109161,"gallery_id":323396,"poster":{"id":4176506,"username":"KuroRi","slug":"kurori","avatar_url":"avatars/4176506.png?_=d4d9755b76a05821","is_superuser":false,"is_staff":false},"post_date":1635367753,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":2083461,"gallery_id":323396,"poster":{"id":2936289,"username":"小鸡姬","slug":"xiao-ji-ji","avatar_url":"avatars/2936289.png?_=36633041f41be717","is_superuser":false,"is_staff":false},"post_date":1634313376,"body":"Ah yes this shit is great to use"},{"id":2044733,"gallery_id":323396,"poster":{"id":4001974,"username":"parzival101","slug":"parzival101","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1632724680,"body":"\"oh no wait here we are, \"warning, side effects may include; dizziness, dry throat, nausea and spontaneous formation of a penis that magically disappears after ejaculation.\" you really need to read the labels on these things before taking them, you never know whats gonna happen\""},{"id":2039775,"gallery_id":323396,"poster":{"id":4686113,"username":"Ghost Down Cool","slug":"ghost-down-cool","avatar_url":"avatars/4686113.png?_=8cabda5d5b93c3af","is_superuser":false,"is_staff":false},"post_date":1632544754,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1877332,"gallery_id":323396,"poster":{"id":2892244,"username":"JockOwe The Hootank Lord","slug":"jockowe-the-hootank-lord","avatar_url":"avatars/2892244.png?_=57e86ebcd2c6b34a","is_superuser":false,"is_staff":false},"post_date":1626477992,"body":"I cummed hard"},{"id":1844585,"gallery_id":323396,"poster":{"id":2918888,"username":"Gregory_II","slug":"gregory_ii","avatar_url":"avatars/2918888.png","is_superuser":false,"is_staff":false},"post_date":1625165612,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1799322,"gallery_id":323396,"poster":{"id":2444923,"username":"YAmIHere?","slug":"yamihere","avatar_url":"avatars/2444923.png?_=d2b4e865c8edb9e9","is_superuser":false,"is_staff":false},"post_date":1623377585,"body":"god DAMN, this author is Fucking amazing."},{"id":1772919,"gallery_id":323396,"poster":{"id":3862760,"username":"Running from the FBI","slug":"running-from-the-fbi","avatar_url":"avatars/3862760.png?_=a3c46fdc0dc8b769","is_superuser":false,"is_staff":false},"post_date":1622403819,"body":"I always forget that this comment section is cursed"},{"id":1746692,"gallery_id":323396,"poster":{"id":4088780,"username":"BenBenSoyBoy","slug":"benbensoyboy","avatar_url":"avatars/4088780.png?_=5dd77232d3c37c1f","is_superuser":false,"is_staff":false},"post_date":1621315430,"body":"Something about the eyes that just make the artstyle look amazing\n"},{"id":1720141,"gallery_id":323396,"poster":{"id":2934792,"username":"vantom253","slug":"vantom253","avatar_url":"avatars/2934792.png?_=34836bd142d4b947","is_superuser":false,"is_staff":false},"post_date":1620256023,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1639062,"gallery_id":323396,"poster":{"id":3424071,"username":"ImLookingForMCTutorials","slug":"imlookingformctutorials","avatar_url":"avatars/3424071.png?_=c77998d8e9b0e5b0","is_superuser":false,"is_staff":false},"post_date":1616671327,"body":"This does put a smile on my face"},{"id":1611277,"gallery_id":323396,"poster":{"id":3359844,"username":"SenjirouVEVO","slug":"senjirouvevo","avatar_url":"avatars/3359844.png?_=4c5e2e6bc3ae53f7","is_superuser":false,"is_staff":false},"post_date":1615432762,"body":"hell yeah this is the good shit"},{"id":1610768,"gallery_id":323396,"poster":{"id":2698008,"username":"slpbtm","slug":"slpbtm","avatar_url":"avatars/2698008.png?_=a3d98caa299b9662","is_superuser":false,"is_staff":false},"post_date":1615409560,"body":"damn! that shit good!"},{"id":1577413,"gallery_id":323396,"poster":{"id":2204857,"username":"Konnichiwa","slug":"konnichiwa","avatar_url":"avatars/2204857.png?_=5bceb00ac734d211","is_superuser":false,"is_staff":false},"post_date":1613868583,"body":"so this is \"The Raging Lesbians\" myth they were talking about"},{"id":1566924,"gallery_id":323396,"poster":{"id":3360527,"username":"WingDing","slug":"wingding","avatar_url":"avatars/3360527.png?_=341d14591a252abf","is_superuser":false,"is_staff":false},"post_date":1613390397,"body":"Guys, stop making the site have a stroke."},{"id":1543547,"gallery_id":323396,"poster":{"id":2520135,"username":"Emado","slug":"emado","avatar_url":"avatars/2520135.png?_=5dd8a29cc05d4604","is_superuser":false,"is_staff":false},"post_date":1612378207,"body":"Fฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1455446,"gallery_id":323396,"poster":{"id":1099936,"username":"Sackboy","slug":"sackboy","avatar_url":"avatars/1099936.png?_=936fb21a1507017f","is_superuser":false,"is_staff":false},"post_date":1609620302,"body":"Perfect, as always with loli&futa"},{"id":1404219,"gallery_id":323396,"poster":{"id":3559450,"username":"ChanChan!!","slug":"chanchan","avatar_url":"avatars/3559450.png?_=3306241101ebb9f5","is_superuser":false,"is_staff":false},"post_date":1607906170,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1379466,"gallery_id":323396,"poster":{"id":3446025,"username":"otakumix2","slug":"otakumix2","avatar_url":"avatars/3446025.png?_=564960f0059c2372","is_superuser":false,"is_staff":false},"post_date":1606949313,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1376871,"gallery_id":323396,"poster":{"id":1271063,"username":"arathoras12","slug":"arathoras12","avatar_url":"avatars/1271063.png?_=380f386abe211ba7","is_superuser":false,"is_staff":false},"post_date":1606875927,"body":"its good shit and I love the art style. but I quietly wish he would do something else than only lolis. well, a man can dream."},{"id":1368831,"gallery_id":323396,"poster":{"id":3426680,"username":"leojousama","slug":"leojousama","avatar_url":"avatars/3426680.png?_=41813a792aba9a2b","is_superuser":false,"is_staff":false},"post_date":1606592075,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1304398,"gallery_id":323396,"poster":{"id":2462962,"username":"Tifali2005","slug":"tifali2005","avatar_url":"avatars/2462962.png","is_superuser":false,"is_staff":false},"post_date":1604046436,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1274158,"gallery_id":323396,"poster":{"id":3467180,"username":"Victor.Okida[ FORSEN BAJS ]","slug":"victor-okida-forsen-bajs","avatar_url":"avatars/3467180.png?_=25085b1aa87f3fc9","is_superuser":false,"is_staff":false},"post_date":1602804931,"body":"Very good 9/10"},{"id":1269249,"gallery_id":323396,"poster":{"id":1250965,"username":"tsumiki1324","slug":"tsumiki1324","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602571459,"body":"I live only to read these masterpieces"},{"id":1244741,"gallery_id":323396,"poster":{"id":1412257,"username":"Whiskey Nine","slug":"whiskey-nine","avatar_url":"avatars/1412257.png?_=e8f81d03b2467682","is_superuser":false,"is_staff":false},"post_date":1601488502,"body":"The legend graces us again with their futa loli masterpiece"},{"id":1227664,"gallery_id":323396,"poster":{"id":1748918,"username":"vicctor","slug":"vicctor","avatar_url":"avatars/1748918.png?_=585c07dc704206b4","is_superuser":false,"is_staff":false},"post_date":1600838263,"body":"Rating each and every one of my favorites #32 8/10"},{"id":1220753,"gallery_id":323396,"poster":{"id":3411450,"username":"IHATEMYSELFSOFUCKINGMUCH","slug":"ihatemyselfsofuckingmuch","avatar_url":"avatars/3411450.png?_=9aa9e268339058a2","is_superuser":false,"is_staff":false},"post_date":1600567873,"body":"Musouduki never misses"},{"id":1174725,"gallery_id":323396,"poster":{"id":2826328,"username":"wankmaster","slug":"wankmaster","avatar_url":"avatars/2826328.png?_=4b8bd047899c2629","is_superuser":false,"is_staff":false},"post_date":1598512117,"body":"Pp went hard, pp let out man sauce, good experience"},{"id":1173777,"gallery_id":323396,"poster":{"id":871379,"username":"ilusion21","slug":"ilusion21","avatar_url":"avatars/871379.png?_=2c2099b1b967fa45","is_superuser":false,"is_staff":false},"post_date":1598470101,"body":"Love it when girls get wet with just giving fellation, even better if they can cum like this"},{"id":1172156,"gallery_id":323396,"poster":{"id":3062086,"username":"Bigotz","slug":"bigotz","avatar_url":"avatars/3062086.png?_=1b1d86fc9b33044a","is_superuser":false,"is_staff":false},"post_date":1598396321,"body":"I love the style of draw "},{"id":1164734,"gallery_id":323396,"poster":{"id":1607615,"username":"77Yandere77","slug":"77yandere77","avatar_url":"avatars/1607615.png","is_superuser":false,"is_staff":false},"post_date":1598108521,"body":"Needs impregnation tag like the japanese version "},{"id":1162195,"gallery_id":323396,"poster":{"id":1660631,"username":"OrientxPearL","slug":"orientxpearl","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598014536,"body":"staining the head is bad but doing it in the mouth is fine?\n\ni am completely sold on this."},{"id":1151782,"gallery_id":323396,"poster":{"id":1949842,"username":"SweetLemonBun","slug":"sweetlemonbun","avatar_url":"avatars/1949842.png?_=9f2c37842a693654","is_superuser":false,"is_staff":false},"post_date":1597644516,"body":"I need More Achromic doses "},{"id":1144008,"gallery_id":323396,"poster":{"id":3346056,"username":"procrastinated_fap","slug":"procrastinated_fap","avatar_url":"avatars/3346056.png?_=5a2210163eb55db6","is_superuser":false,"is_staff":false},"post_date":1597354800,"body":"it's so fucked up that i'm disgusted socially and personally after but it was 100% worth it"},{"id":1138929,"gallery_id":323396,"poster":{"id":2021687,"username":"XHunter212X","slug":"xhunter212x","avatar_url":"avatars/2021687.png?_=b9b48a4d67ca3136","is_superuser":false,"is_staff":false},"post_date":1597162953,"body":"I LOVE THIS SERIESS (；*ω*)"},{"id":1134841,"gallery_id":323396,"poster":{"id":3190731,"username":"Mr. man","slug":"mr-man","avatar_url":"avatars/3190731.png?_=804d29311857e3cb","is_superuser":false,"is_staff":false},"post_date":1597000523,"body":"Sock & sandals #151905? "},{"id":1133380,"gallery_id":323396,"poster":{"id":3363672,"username":"TacticalWatergun","slug":"tacticalwatergun","avatar_url":"avatars/3363672.png?_=5102f90e0206e8d4","is_superuser":false,"is_staff":false},"post_date":1596944066,"body":"Page 8 in a nutshell:\n\"Headshot!\""},{"id":1133216,"gallery_id":323396,"poster":{"id":2149695,"username":"青天白日满地红，一寸山河一寸血","slug":"qing-tian-bai-ri-man-di-hong-yi-cun-shan-he-yi-cun-xie","avatar_url":"avatars/2149695.png?_=eb155b6a7583195c","is_superuser":false,"is_staff":false},"post_date":1596935996,"body":"loli and futa is back yay "},{"id":1130545,"gallery_id":323396,"poster":{"id":1615768,"username":"Azitc","slug":"azitc","avatar_url":"avatars/1615768.png?_=1a470ddc03e13f40","is_superuser":false,"is_staff":false},"post_date":1596832884,"body":"Very good, nice facial expression from both of them showing how they feel, other than that nice way of conveying emotion and pleasure. I like it alot"},{"id":1130098,"gallery_id":323396,"poster":{"id":3526012,"username":"itsprivatenews","slug":"itsprivatenews","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596818388,"body":"Uncensored/decensored version where and when. Especially image 6 and 7"},{"id":1129675,"gallery_id":323396,"poster":{"id":3269174,"username":"namecantbebl0nk","slug":"namecantbebl0nk","avatar_url":"avatars/3269174.png?_=862260efc3f6b072","is_superuser":false,"is_staff":false},"post_date":1596799902,"body":"@Dipa Nusantara Aidit \"Amat\" jadi gini, \"age is just a number, jail is just a room\"\n"},{"id":1129639,"gallery_id":323396,"poster":{"id":3384962,"username":"Saiki K","slug":"saiki-k","avatar_url":"avatars/3384962.png?_=3c62307ceae431c8","is_superuser":false,"is_staff":false},"post_date":1596798156,"body":"hmmmm maybe futa isnt that bad..."},{"id":1129609,"gallery_id":323396,"poster":{"id":3396772,"username":"CannedRabies","slug":"cannedrabies","avatar_url":"avatars/3396772.png?_=884aeceef882e3a9","is_superuser":false,"is_staff":false},"post_date":1596796579,"body":"If its going to take another year for the next manga Im still in"},{"id":1129608,"gallery_id":323396,"poster":{"id":2544231,"username":"immagetdemlolis","slug":"immagetdemlolis","avatar_url":"avatars/2544231.png?_=b820fe8bda505f36","is_superuser":false,"is_staff":false},"post_date":1596796564,"body":"Busted a quality nut"},{"id":1129587,"gallery_id":323396,"poster":{"id":3432406,"username":"Harriii","slug":"harriii","avatar_url":"avatars/3432406.png?_=951b2ea030f7869f","is_superuser":false,"is_staff":false},"post_date":1596795404,"body":"Pasal 76D\n\nSetiap Orang dilarang melakukan Kekerasan atau ancaman Kekerasan memaksa Anak melakukan persetubuhan dengannya atau dengan orang lain.\n\n \n\nPasal 81\n\n(1)  Setiap orang yang melanggar ketentuan sebagaimana dimaksud dalam Pasal 76D dipidana dengan pidana penjara paling singkat 5 (lima) tahun dan paling lama 15 (lima belas) tahun dan denda paling banyak Rp5.000.000.000,00 (lima miliar rupiah).\n\n(2)  Ketentuan pidana sebagaimana dimaksud pada ayat (1) berlaku pula bagi Setiap Orang yang dengan sengaja melakukan tipu muslihat, serangkaian kebohongan, atau membujuk Anak melakukan persetubuhan dengannya atau dengan orang lain.\n\n(3)  Dalam hal tindak pidana sebagaimana dimaksud pada ayat (1) dilakukan oleh Orang Tua, Wali, pengasuh Anak, pendidik, atau tenaga kependidikan, maka pidananya ditambah 1/3 (sepertiga) dari ancaman pidana sebagaimana dimaksud pada ayat (1)."},{"id":1129438,"gallery_id":323396,"poster":{"id":1907072,"username":"orgasmaniac","slug":"orgasmaniac","avatar_url":"avatars/1907072.png","is_superuser":false,"is_staff":false},"post_date":1596789239,"body":"im honestly prefer futa on loli than dudes on loli"},{"id":1129365,"gallery_id":323396,"poster":{"id":3454681,"username":"Eunkio","slug":"eunkio","avatar_url":"avatars/3454681.png?_=9443a9ccc8886da5","is_superuser":false,"is_staff":false},"post_date":1596786292,"body":"dat was the good shit, tell me im wrong"},{"id":1129340,"gallery_id":323396,"poster":{"id":739235,"username":"JustME","slug":"justme","avatar_url":"avatars/739235.png?_=33c1348019003d5b","is_superuser":false,"is_staff":false},"post_date":1596785356,"body":"The Art is spot on"},{"id":1129150,"gallery_id":323396,"poster":{"id":2982304,"username":"Yukitai","slug":"yukitai","avatar_url":"avatars/2982304.png","is_superuser":false,"is_staff":false},"post_date":1596778360,"body":"I like this as much as a saimin doujinshi [a lot], which is confusing my peepee"},{"id":1129146,"gallery_id":323396,"poster":{"id":2982304,"username":"Yukitai","slug":"yukitai","avatar_url":"avatars/2982304.png","is_superuser":false,"is_staff":false},"post_date":1596778238,"body":"I know I shouldn't, but loli slut+big dick futa loli is adorable & a turn-on, there's no turning back now"},{"id":1129124,"gallery_id":323396,"poster":{"id":3370964,"username":"SkyVentus","slug":"skyventus","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1596777753,"body":"Musouduki is bac bois"},{"id":1129092,"gallery_id":323396,"poster":{"id":1168948,"username":"Fookin Laser Sights","slug":"fookin-laser-sights","avatar_url":"avatars/1168948.png?_=51f64285b2765d14","is_superuser":false,"is_staff":false},"post_date":1596776539,"body":"Loli with gigantic dick is my fetish.."},{"id":1128958,"gallery_id":323396,"poster":{"id":3344376,"username":"Doujin-Wholesome","slug":"doujin-wholesome","avatar_url":"avatars/3344376.png?_=1f1eff5f9f0b39f6","is_superuser":false,"is_staff":false},"post_date":1596770843,"body":"*HEADSHOT*"},{"id":1128951,"gallery_id":323396,"poster":{"id":1919770,"username":"Shikirashi","slug":"shikirashi","avatar_url":"avatars/1919770.png?_=ec9bcb2f4cd2d69a","is_superuser":false,"is_staff":false},"post_date":1596770415,"body":"LOLIFUTAAAAAAA"},{"id":1128823,"gallery_id":323396,"poster":{"id":3509596,"username":"28stabwound","slug":"28stabwound","avatar_url":"avatars/3509596.png?_=f0be85010e33b795","is_superuser":false,"is_staff":false},"post_date":1596764273,"body":"How many shits do you have to eat before you make you're self better \nEat to much and you'll die shits are pretty rich\n"},{"id":1128774,"gallery_id":323396,"poster":{"id":497460,"username":"jdogzero","slug":"jdogzero","avatar_url":"avatars/497460.png","is_superuser":false,"is_staff":false},"post_date":1596761625,"body":"Careful with those ahegeo's China is trying to trademark them XD. Can't get over how stupid China is for trying to trademark a facial expression THEY DIDNT COME UP WITH XD"},{"id":1128720,"gallery_id":323396,"poster":{"id":2987294,"username":"LewdEV0","slug":"lewdev0","avatar_url":"avatars/2987294.png?_=ad32eb2a90c36982","is_superuser":false,"is_staff":false},"post_date":1596758899,"body":"The legends spoke true!"},{"id":1128660,"gallery_id":323396,"poster":{"id":3346414,"username":"Zebina","slug":"zebina","avatar_url":"avatars/3346414.png?_=8879ca7339022074","is_superuser":false,"is_staff":false},"post_date":1596756488,"body":"This... This is it"},{"id":1128634,"gallery_id":323396,"poster":{"id":3514860,"username":"The Real Hulk Hogan","slug":"the-real-hulk-hogan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596755541,"body":"Hell Yeah Brother! Love seeing a smol body filled to the brim"},{"id":1128558,"gallery_id":323396,"poster":{"id":3421900,"username":"RealBondrewd","slug":"realbondrewd","avatar_url":"avatars/3421900.png?_=8fbe30e953ab47c5","is_superuser":false,"is_staff":false},"post_date":1596752194,"body":"Tho holy grail of hentai"},{"id":1128402,"gallery_id":323396,"poster":{"id":2479167,"username":"jual beli code nuklir","slug":"jual-beli-code-nuklir","avatar_url":"avatars/2479167.png?_=379f8b0f7848af95","is_superuser":false,"is_staff":false},"post_date":1596744837,"body":"Njirr 🤣🤣🤣🤣"},{"id":1128396,"gallery_id":323396,"poster":{"id":3450384,"username":"amartiniinmyeye","slug":"amartiniinmyeye","avatar_url":"avatars/3450384.png?_=e209ef6b5bbe7f46","is_superuser":false,"is_staff":false},"post_date":1596744468,"body":"Finally, I've found it. The Lamb Sauce."},{"id":1128368,"gallery_id":323396,"poster":{"id":3404006,"username":"King3576","slug":"king3576","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596742947,"body":"your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me"},{"id":1128320,"gallery_id":323396,"poster":{"id":1671472,"username":"TheNiceGuy","slug":"theniceguy","avatar_url":"avatars/1671472.png?_=1f0d286f033430a8","is_superuser":false,"is_staff":false},"post_date":1596741641,"body":"ah very nice.\n"},{"id":1128212,"gallery_id":323396,"poster":{"id":1597974,"username":"UNIX_XINU","slug":"unix_xinu","avatar_url":"avatars/1597974.png?_=ffb19a58c4d820ce","is_superuser":false,"is_staff":false},"post_date":1596736757,"body":"Follow me on insta @lewdnix if you like "},{"id":1128109,"gallery_id":323396,"poster":{"id":2164118,"username":"Aiko-ka?!","slug":"aiko-ka","avatar_url":"avatars/2164118.png?_=7768685d18333b8c","is_superuser":false,"is_staff":false},"post_date":1596733230,"body":"Ah, memories.   "},{"id":1128068,"gallery_id":323396,"poster":{"id":3168224,"username":"TheReviewer","slug":"thereviewer","avatar_url":"avatars/3168224.png?_=a8dd9f532c877231","is_superuser":false,"is_staff":false},"post_date":1596731443,"body":"It’s fucking backkkkk. The legendary Loli and futa, the perfect expression. Fuckkkkkk yeahhhh"},{"id":1128065,"gallery_id":323396,"poster":{"id":3456089,"username":"The Sun God Ra","slug":"the-sun-god-ra","avatar_url":"avatars/3456089.png?_=b9e48c87c1af2b56","is_superuser":false,"is_staff":false},"post_date":1596731388,"body":"You heathens have put this on popular"},{"id":1128022,"gallery_id":323396,"poster":{"id":3138735,"username":"BlackRose-","slug":"blackrose","avatar_url":"avatars/3138735.png?_=be395a4b517c3794","is_superuser":false,"is_staff":false},"post_date":1596729785,"body":"100% would fap again"},{"id":1127961,"gallery_id":323396,"poster":{"id":3471993,"username":"CindyFriends","slug":"cindyfriends","avatar_url":"avatars/3471993.png?_=2b717efb37b6d76b","is_superuser":false,"is_staff":false},"post_date":1596727193,"body":"Very well structured and a nice display of lolibitches. great work!"},{"id":1127948,"gallery_id":323396,"poster":{"id":3400823,"username":"Padre Damaso","slug":"padre-damaso","avatar_url":"avatars/3400823.png?_=a08f5cf620a7dd72","is_superuser":false,"is_staff":false},"post_date":1596726427,"body":"Even the pope watches this"},{"id":1127946,"gallery_id":323396,"poster":{"id":2286171,"username":"wetsmoothmeat","slug":"wetsmoothmeat","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1596726351,"body":"she should've known better futa cum is aphrodisiac"},{"id":1127939,"gallery_id":323396,"poster":{"id":3357764,"username":"Twik","slug":"twik","avatar_url":"avatars/3357764.png?_=0b1c1edc5ff26d20","is_superuser":false,"is_staff":false},"post_date":1596726183,"body":"dude I lost x4"},{"id":1127938,"gallery_id":323396,"poster":{"id":3518409,"username":"ThatGuyMark","slug":"thatguymark","avatar_url":"avatars/3518409.png?_=9d0d61404f714063","is_superuser":false,"is_staff":false},"post_date":1596726164,"body":"Dude i lost x3"},{"id":1127937,"gallery_id":323396,"poster":{"id":3357764,"username":"Twik","slug":"twik","avatar_url":"avatars/3357764.png?_=0b1c1edc5ff26d20","is_superuser":false,"is_staff":false},"post_date":1596726055,"body":"Dude I lost x2"},{"id":1127936,"gallery_id":323396,"poster":{"id":3518409,"username":"ThatGuyMark","slug":"thatguymark","avatar_url":"avatars/3518409.png?_=9d0d61404f714063","is_superuser":false,"is_staff":false},"post_date":1596726039,"body":"Dude i lost!"},{"id":1127925,"gallery_id":323396,"poster":{"id":3310369,"username":"HakaSaki00","slug":"hakasaki00","avatar_url":"avatars/3310369.png?_=7ae82fabb5c675d8","is_superuser":false,"is_staff":false},"post_date":1596725238,"body":"Translated by fan in just 2 days.. 👏👏👏 Sasuga Musouduki-sensei's creation..."},{"id":1127918,"gallery_id":323396,"poster":{"id":2325654,"username":"Shawreportingforduty","slug":"shawreportingforduty","avatar_url":"avatars/2325654.png?_=edfb0a7bccf88d96","is_superuser":false,"is_staff":false},"post_date":1596724921,"body":"When a loli has a bigger dick than you, sadpepe(Great doujin tho!)"},{"id":1127886,"gallery_id":323396,"poster":{"id":2463937,"username":"Deep Dark Fantasies","slug":"deep-dark-fantasies","avatar_url":"avatars/2463937.png?_=a845bc44a87ee406","is_superuser":false,"is_staff":false},"post_date":1596723534,"body":"Now that is what I wanna see"},{"id":1127818,"gallery_id":323396,"poster":{"id":3084062,"username":"MetalHeart","slug":"metalheart","avatar_url":"avatars/3084062.png?_=235c7afac02c89ec","is_superuser":false,"is_staff":false},"post_date":1596720165,"body":"This might be weird but futa is better than trap"},{"id":1127800,"gallery_id":323396,"poster":{"id":3443136,"username":"UGgranpops","slug":"uggranpops","avatar_url":"avatars/3443136.png?_=81ceef1ba9f77d0b","is_superuser":false,"is_staff":false},"post_date":1596719326,"body":"that dick's the size of a water bottle\nsomething to think about the next time you drink"},{"id":1127796,"gallery_id":323396,"poster":{"id":2268766,"username":"imaxxx","slug":"imaxxx","avatar_url":"avatars/2268766.png","is_superuser":false,"is_staff":false},"post_date":1596719216,"body":"im not really into futa but this one was great oof"},{"id":1127784,"gallery_id":323396,"poster":{"id":632176,"username":"Rokingfrost","slug":"rokingfrost","avatar_url":"avatars/632176.png","is_superuser":false,"is_staff":false},"post_date":1596718371,"body":"Oh yes... so fucking good"},{"id":1127749,"gallery_id":323396,"poster":{"id":2061364,"username":"hentaienthusiast424","slug":"hentaienthusiast424","avatar_url":"avatars/2061364.png?_=1c3c2bff85a7f074","is_superuser":false,"is_staff":false},"post_date":1596716822,"body":"@sanduíche get that Reddit shit out of here 😂 I'm joking 😆 "},{"id":1127694,"gallery_id":323396,"poster":{"id":1584362,"username":"AbsolutelyNOT","slug":"absolutelynot","avatar_url":"avatars/1584362.png?_=6de19fd3f81cbab0","is_superuser":false,"is_staff":false},"post_date":1596714064,"body":"How tf is this one give me a boner"},{"id":1127655,"gallery_id":323396,"poster":{"id":2192791,"username":"Mikblues","slug":"mikblues","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596711448,"body":"This got translated real fast, holy"},{"id":1127652,"gallery_id":323396,"poster":{"id":2344617,"username":"uwuowo69","slug":"uwuowo69","avatar_url":"avatars/2344617.png?_=f1844152c860bccc","is_superuser":false,"is_staff":false},"post_date":1596711316,"body":"@LazyEro because it's good why else"},{"id":1127645,"gallery_id":323396,"poster":{"id":2637551,"username":"LazyEro","slug":"lazyero","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596710991,"body":"Why do you guys like this?"},{"id":1127635,"gallery_id":323396,"poster":{"id":2587287,"username":"Dixxy","slug":"dixxy","avatar_url":"avatars/2587287.png?_=b91886db18c1917d","is_superuser":false,"is_staff":false},"post_date":1596710480,"body":"Right, forgot this author is good at making loli futa yuri doujins"},{"id":1127630,"gallery_id":323396,"poster":{"id":2587287,"username":"Dixxy","slug":"dixxy","avatar_url":"avatars/2587287.png?_=b91886db18c1917d","is_superuser":false,"is_staff":false},"post_date":1596710360,"body":"Legally Its questionable, Morally it's disgusting, Personally I like it"},{"id":1127613,"gallery_id":323396,"poster":{"id":2862282,"username":"mothercomplex","slug":"mothercomplex","avatar_url":"avatars/2862282.png?_=e7c7f7a352e0ab34","is_superuser":false,"is_staff":false},"post_date":1596709341,"body":"Damn that bitch is in heat lmao"},{"id":1127605,"gallery_id":323396,"poster":{"id":2126195,"username":"BiggerGiraffe","slug":"biggergiraffe","avatar_url":"avatars/2126195.png?_=3266a1579c11f044","is_superuser":false,"is_staff":false},"post_date":1596708875,"body":"This is always great now I have a reason to live again \n"},{"id":1127520,"gallery_id":323396,"poster":{"id":1476768,"username":"Tohru Kobayashi","slug":"tohru-kobayashi","avatar_url":"avatars/1476768.png?_=7a4d50b3ba9672fd","is_superuser":false,"is_staff":false},"post_date":1596705931,"body":"@daniloxidao You're definitely in to futa Stfu lier"},{"id":1127514,"gallery_id":323396,"poster":{"id":291986,"username":"Ein_","slug":"ein_","avatar_url":"avatars/291986.png?_=add2a9b0254bd75b","is_superuser":false,"is_staff":false},"post_date":1596705494,"body":"......yes."},{"id":1127500,"gallery_id":323396,"poster":{"id":3274599,"username":"IncestLover_FuckALLShotaDIE!","slug":"incestlover_fuckallshotadie","avatar_url":"avatars/3274599.png?_=b2cb4a38f63c787d","is_superuser":false,"is_staff":false},"post_date":1596704598,"body":"yes officer these little girls right here"},{"id":1127479,"gallery_id":323396,"poster":{"id":3070138,"username":"gorno","slug":"gorno","avatar_url":"avatars/3070138.png","is_superuser":false,"is_staff":false},"post_date":1596703939,"body":"this is wild"},{"id":1127464,"gallery_id":323396,"poster":{"id":3077211,"username":"SansIsAngry","slug":"sansisangry","avatar_url":"avatars/3077211.png?_=cd30064dd540d7ba","is_superuser":false,"is_staff":false},"post_date":1596703522,"body":"Sorry doesnt fix anything samuel, you are going to get raped in extra hell"},{"id":1127453,"gallery_id":323396,"poster":{"id":3522126,"username":"samuel34","slug":"samuel34","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596703048,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. Sorry y'all i got cursed too, you can't understimate random people curse"},{"id":1127410,"gallery_id":323396,"poster":{"id":917686,"username":"Hirose","slug":"hirose","avatar_url":"avatars/917686.png?_=ddc589e44dcea9c0","is_superuser":false,"is_staff":false},"post_date":1596701843,"body":"This is god tier work, musouduki is so good at this"},{"id":1127406,"gallery_id":323396,"poster":{"id":2251034,"username":"daniloxidao","slug":"daniloxidao","avatar_url":"avatars/2251034.png?_=4a7942c8449e47c6","is_superuser":false,"is_staff":false},"post_date":1596701756,"body":"im not into FUTA, but this is fucking gold, amazing artstyle and ahegaos."},{"id":1127326,"gallery_id":323396,"poster":{"id":3522004,"username":"janembaisbae","slug":"janembaisbae","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596699432,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me"},{"id":1127305,"gallery_id":323396,"poster":{"id":2342694,"username":"Lord Lolicon","slug":"lord-lolicon","avatar_url":"avatars/2342694.png?_=f9b8d2ff8163c752","is_superuser":false,"is_staff":false},"post_date":1596698938,"body":"Why im hard"},{"id":1127268,"gallery_id":323396,"poster":{"id":2242260,"username":"Sweet69","slug":"sweet69","avatar_url":"avatars/2242260.png","is_superuser":false,"is_staff":false},"post_date":1596697788,"body":"Your entire doujin collection is my treasure. MAKE MOOORRREE PLS!"},{"id":1127262,"gallery_id":323396,"poster":{"id":3001032,"username":"Adune","slug":"adune","avatar_url":"avatars/3001032.png?_=6cfe540fd3f48022","is_superuser":false,"is_staff":false},"post_date":1596697663,"body":"That shit is good"},{"id":1127248,"gallery_id":323396,"poster":{"id":1868195,"username":"Firsan Shishou","slug":"firsan-shishou","avatar_url":"avatars/1868195.png?_=e0c65f9161c57d03","is_superuser":false,"is_staff":false},"post_date":1596697341,"body":"Ahh... Yes, Achromic Strike Again"},{"id":1127174,"gallery_id":323396,"poster":{"id":3258275,"username":"tsuchiii","slug":"tsuchiii","avatar_url":"avatars/3258275.png?_=4e2e887625969cf4","is_superuser":false,"is_staff":false},"post_date":1596694173,"body":"Finally Some Good Fucking Food (✧∀✧)"},{"id":1127161,"gallery_id":323396,"poster":{"id":3014179,"username":"Sandoor","slug":"sandoor","avatar_url":"avatars/3014179.png","is_superuser":false,"is_staff":false},"post_date":1596693190,"body":"Achromic the best, guys"},{"id":1127149,"gallery_id":323396,"poster":{"id":3330962,"username":"The Wet Kitsune","slug":"the-wet-kitsune","avatar_url":"avatars/3330962.png","is_superuser":false,"is_staff":false},"post_date":1596692651,"body":"Great stuffs"},{"id":1127122,"gallery_id":323396,"poster":{"id":2137706,"username":"Kinesis_","slug":"kinesis_","avatar_url":"avatars/2137706.png","is_superuser":false,"is_staff":false},"post_date":1596691911,"body":"This is hot."},{"id":1127115,"gallery_id":323396,"poster":{"id":3323578,"username":"darkplayer13324","slug":"darkplayer13324","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1596691428,"body":"i give this 10/10 because i love loli's"},{"id":1127089,"gallery_id":323396,"poster":{"id":3166095,"username":"OFodendoEu","slug":"ofodendoeu","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596690073,"body":"Urg! I feel kinda bad for being turned on by this cuteness.... Someone else?"},{"id":1127086,"gallery_id":323396,"poster":{"id":1477184,"username":"Coitus Interruptus","slug":"coitus-interruptus","avatar_url":"avatars/1477184.png","is_superuser":false,"is_staff":false},"post_date":1596689932,"body":"Certified good shit"},{"id":1127075,"gallery_id":323396,"poster":{"id":3061918,"username":"Dr. Ratio","slug":"dr-ratio","avatar_url":"avatars/3061918.png?_=7f269b678408e2b9","is_superuser":false,"is_staff":false},"post_date":1596689326,"body":"Good stuffs"},{"id":1127053,"gallery_id":323396,"poster":{"id":3184799,"username":"hiretsuna","slug":"hiretsuna","avatar_url":"avatars/3184799.png?_=2f6d8e70b94f9f71","is_superuser":false,"is_staff":false},"post_date":1596688452,"body":"Achromics works are masterpieces "},{"id":1127050,"gallery_id":323396,"poster":{"id":1781756,"username":"Brightwell","slug":"brightwell","avatar_url":"avatars/1781756.png?_=f2eb295104e736c2","is_superuser":false,"is_staff":false},"post_date":1596688300,"body":"The absolute peak of degeneracy "},{"id":1126994,"gallery_id":323396,"poster":{"id":3521524,"username":"NakamuraYoh","slug":"nakamurayoh","avatar_url":"avatars/3521524.png?_=3735909f487a894e","is_superuser":false,"is_staff":false},"post_date":1596685675,"body":"Not a big fan of futa.....but I'll let this on slide"},{"id":1126949,"gallery_id":323396,"poster":{"id":3126341,"username":"Maka2000","slug":"maka2000","avatar_url":"avatars/3126341.png","is_superuser":false,"is_staff":false},"post_date":1596683815,"body":"truly a yabai one"},{"id":1126943,"gallery_id":323396,"poster":{"id":1220760,"username":"Segamaxx360","slug":"segamaxx360","avatar_url":"avatars/1220760.png?_=5af8b52d93b32751","is_superuser":false,"is_staff":false},"post_date":1596683664,"body":"That was really good. "},{"id":1126934,"gallery_id":323396,"poster":{"id":3047178,"username":"*rubs beard* I like this!","slug":"rubs-beard-i-like-this","avatar_url":"avatars/3047178.png?_=a9e150591771556c","is_superuser":false,"is_staff":false},"post_date":1596683370,"body":"*massive burp, followed by a loud growl of the stomach* Oh hoh hoh! The king has returned!"},{"id":1126930,"gallery_id":323396,"poster":{"id":1889818,"username":"GR3NK","slug":"gr3nk","avatar_url":"avatars/1889818.png?_=535f705e8c987718","is_superuser":false,"is_staff":false},"post_date":1596683245,"body":"contemporary artwork"},{"id":1126892,"gallery_id":323396,"poster":{"id":1655549,"username":"Encendedor","slug":"encendedor","avatar_url":"avatars/1655549.png?_=111bf3aa53621f85","is_superuser":false,"is_staff":false},"post_date":1596682241,"body":"Fuck.... Risa Is so fucking hot"},{"id":1126838,"gallery_id":323396,"poster":{"id":3521365,"username":"TheCumBucket","slug":"thecumbucket","avatar_url":"avatars/3521365.png?_=a0bba871930f6e6f","is_superuser":false,"is_staff":false},"post_date":1596680763,"body":"Thank you for another masterpiece Achromic"},{"id":1126714,"gallery_id":323396,"poster":{"id":1480484,"username":"KaiserKhazuto","slug":"kaiserkhazuto","avatar_url":"avatars/1480484.png?_=7eeae405fa89a934","is_superuser":false,"is_staff":false},"post_date":1596675869,"body":"Hahahahaha, that took such a short time to translate. And now it's in Trending today Rofl."},{"id":1126655,"gallery_id":323396,"poster":{"id":1331452,"username":"futafan101","slug":"futafan101","avatar_url":"avatars/1331452.png","is_superuser":false,"is_staff":false},"post_date":1596673557,"body":"Finally a good futa story, it's been a dry spell lately"},{"id":1126550,"gallery_id":323396,"poster":{"id":3060356,"username":"benthic","slug":"benthic","avatar_url":"avatars/3060356.png?_=1ff5d885128f2d3e","is_superuser":false,"is_staff":false},"post_date":1596668804,"body":"God, that's a fast translation"},{"id":1126505,"gallery_id":323396,"poster":{"id":3377106,"username":"HentaiBeetle","slug":"hentaibeetle","avatar_url":"avatars/3377106.png?_=f7fa8939745f5e6e","is_superuser":false,"is_staff":false},"post_date":1596667414,"body":"I just unlocked a new fetish from reading this"},{"id":1126496,"gallery_id":323396,"poster":{"id":1801276,"username":"ifwas","slug":"ifwas","avatar_url":"avatars/1801276.png?_=00acda0d685832ff","is_superuser":false,"is_staff":false},"post_date":1596667251,"body":"As always, pretty good from Musouduki\n"},{"id":1126472,"gallery_id":323396,"poster":{"id":3329855,"username":"lima57","slug":"lima57","avatar_url":"avatars/3329855.png?_=8f4e4e13338d1877","is_superuser":false,"is_staff":false},"post_date":1596666500,"body":"The artstyle, the Futa Loli, the relationship established between the characters and some hot sex are simply an epic mixture."},{"id":1126463,"gallery_id":323396,"poster":{"id":3329855,"username":"lima57","slug":"lima57","avatar_url":"avatars/3329855.png?_=8f4e4e13338d1877","is_superuser":false,"is_staff":false},"post_date":1596666292,"body":"That's some good shit bro."},{"id":1126413,"gallery_id":323396,"poster":{"id":1769093,"username":"Hi Bye Hi Bye","slug":"hi-bye-hi-bye","avatar_url":"avatars/1769093.png?_=7e473d63ae018ee5","is_superuser":false,"is_staff":false},"post_date":1596664232,"body":"@JizzedinMyPants what does it matter just ignore em or troll them"},{"id":1126391,"gallery_id":323396,"poster":{"id":996344,"username":"Ellie-chan","slug":"ellie-chan","avatar_url":"avatars/996344.png","is_superuser":false,"is_staff":false},"post_date":1596663145,"body":"Oh fuck yes I've missed this series. God tier Achromic"},{"id":1126387,"gallery_id":323396,"poster":{"id":588764,"username":"SionKazuki","slug":"sionkazuki","avatar_url":"avatars/588764.png?_=33495b0abaa65fd5","is_superuser":false,"is_staff":false},"post_date":1596663050,"body":"This was magnificent as expected of Achromic / Musouduki"},{"id":1126308,"gallery_id":323396,"poster":{"id":2511948,"username":"Look-See","slug":"look-see","avatar_url":"avatars/2511948.png","is_superuser":false,"is_staff":false},"post_date":1596659739,"body":"Nice~ futaloli"}]