[{"id":1655345,"gallery_id":323629,"poster":{"id":2969696,"username":"fakkiuman","slug":"fakkiuman","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1617344617,"body":"It's so good but I just... hate her so much"},{"id":1229188,"gallery_id":323629,"poster":{"id":411666,"username":"QuetzalCoatl","slug":"quetzalcoatl","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600902190,"body":"@Reiko Chan. Bruh... Your profile icon is from a ntr... And I have not found transl from it but I think it's similar to this one XD"},{"id":1229168,"gallery_id":323629,"poster":{"id":411666,"username":"QuetzalCoatl","slug":"quetzalcoatl","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600901114,"body":"She... SHE IS A SLUT!!!! good ol' NTR :D don't be fooled by the start. She is a full fledged slut just that she was tricked into marriage before even know it herself. Truly a tragedy for all those poor sluts that are tricked into marriage."},{"id":1218179,"gallery_id":323629,"poster":{"id":3329089,"username":"RAZERSUPREME","slug":"razersupreme","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1600442268,"body":"she do cocaine in my basement. im a doctor but im running out of patients"},{"id":1195064,"gallery_id":323629,"poster":{"id":3510460,"username":"Reiko Chan","slug":"reiko-chan","avatar_url":"avatars/3510460.png?_=8858b0d7193fe4a0","is_superuser":false,"is_staff":false},"post_date":1599383480,"body":"I only like the sex scenes, the story is just so horribly dumb and sad at the same time, this why i dont like ntr it makes me feel just so sad.."},{"id":1185414,"gallery_id":323629,"poster":{"id":1373373,"username":"oreo0960","slug":"oreo0960","avatar_url":"avatars/1373373.png?_=679c97826d612e16","is_superuser":false,"is_staff":false},"post_date":1598973884,"body":"@fab_ben oh yeah i coincidentally found the authors twitter and while going through it i realized it was the same dude lol\nshiiiit man poor guy..  mans just wanted some $$$ to let his wife live a better life but then again some guy he was asking his wife to teach his boss and and go on their dinners that seriously my guy xD basically asking to get cucked lmfao"},{"id":1149281,"gallery_id":323629,"poster":{"id":1925855,"username":"fab_ben","slug":"fab_ben","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597564425,"body":"@oreo0960 There is a 61.5 chapter that hasnt been translated. It has a morbidly ambiguous ending, that has Kim imprisoned, crying, with guards at his back, and idk what happens next but it doesn't look pretty. The secretary seems to habe gone insane like the dad. And the rich guy and the wife are living a happy life. FUCK THE EVER LOVING CRAP OUT OF THE AUTHOR THEY SHOULD JUST STICK TO DRAWING. "},{"id":1145770,"gallery_id":323629,"poster":{"id":3547044,"username":"Kapert123","slug":"kapert123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597420069,"body":"Just finish this manhwa, 3/4 of this only have a sex scene, it so bored and a story is really bad for me. No plot twist no surprise scene or anything, just fuck each other till the end and i don't see how director love Nayeon anypoint of this story, he just want to fuck her. And Nayeon's husband. Kim. He can speak only thing is a company and when he went to NY, he never appears in the story anymore (He does but he was get rid out of this story anyway). Actually, you can jump to ch.58 after ch.12, you still know a whole story."},{"id":1137649,"gallery_id":323629,"poster":{"id":1373373,"username":"oreo0960","slug":"oreo0960","avatar_url":"avatars/1373373.png?_=679c97826d612e16","is_superuser":false,"is_staff":false},"post_date":1597114363,"body":"@Bigbearharris79. yeah i finished it man.. i really felt for the husband and i felt broken for the rest of the day but y'know what shes living a life crueler than death so im cool with it but i just hope her husband is safe and he forgets his wife real amnesia and lives a happy life "},{"id":1133660,"gallery_id":323629,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1596953481,"body":"@oreo0960.     yea you finished this too?, im so disgusted at this bitch the shit she says and does, then acts like she is victim to all of it, bitch started this whole thing giving the asshole hope he can have her, hope a dangerous thing for ppl fucked in the head and  now she dealing with the consequences "},{"id":1133451,"gallery_id":323629,"poster":{"id":1373373,"username":"oreo0960","slug":"oreo0960","avatar_url":"avatars/1373373.png?_=679c97826d612e16","is_superuser":false,"is_staff":false},"post_date":1596946043,"body":"i thought i was immune to the ntr shit but my heart was in pieces.. i had my eyes balling after i finished reading this and i kept reading cause i wanted to see both the wife and that asshole suffer and here im left with this bitter end"},{"id":1133125,"gallery_id":323629,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1596931947,"body":"Oh man the twist and turns that come make you hate her more for the decsion she made to fuck this prick for a month for her so called success of her husband"},{"id":1133078,"gallery_id":323629,"poster":{"id":3377228,"username":"kip0007","slug":"kip0007","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596930001,"body":"@abstare @bigbearharris79 i get what you guys are saying. And the boss is just left and right destroying the marriage and she is conveniently going along with it, so yea she kinda does deserve an asshole like him for the lusting bitch she is i guess. Actually a grown up child i swear. \nThis is too much of a mess to even make out anything of these characters in my mind.\n"},{"id":1132689,"gallery_id":323629,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1596912597,"body":"I read this whole thing already im going to rant about this bitch the whole time, she says she miss her husband? Watch her interactions and face expression with this asshole, she is the worst women i ever seen, so indecisive, go with the flow with any situation then shows remorse after the fact, she acts like a fucking grown child i swear"},{"id":1132527,"gallery_id":323629,"poster":{"id":2063454,"username":"asbstare","slug":"asbstare","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596907894,"body":"@kip0007 that's bullshit dude. Maybe if she actually said something to her husband about not wanting to be away from him so much and got her concerns ignored you'd have a point, but she's just doing some feigned enthusiasm bullshit to his face while moping about it behind his back with the asshole boss. The boss who, by the way, is literally doing everything he can to sabotage their relationship by sending the husband on this US trip, actively trying to make his supposed \"love\" interest as unhappy as possible so he can take advantage of it and fuck her. Is *that* really the kind of person you think she'd be \"better off\" with?"},{"id":1132178,"gallery_id":323629,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1596894646,"body":"@kip0007 husband is a little dense, but she lied about who her client who is his boss that set it up for him to be alone wit her....red flag alert.then since she feels since she only had sex with her husband, she wants to feel what it be like to fuck another man and her words \"cant be a normal man\" so she goes wit the flow and fucks his boss from all ppl. At this point she put herself in this postion, husband just wanted to put food on the table and provide for his wife, and she finds it convenient to live out a fantasy with this asshole...she a ditzy bitch "},{"id":1130993,"gallery_id":323629,"poster":{"id":3377228,"username":"kip0007","slug":"kip0007","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1596852249,"body":"Really dont know what this is at this point. He calls it a \"Romance\" while leading her on and manipulating her. Meanwhile the dumb twat husband just is too focused on his promotion and job hardly giving attention to the wife or even trying to understand whats going on with her, so i feel shes better off with this guy, atleast he is giving her some sort of happiness and satisfaction, dont know what his real motive is or he genuinely likes her or something. \nAnd as for the secretar dont know what her point to the story is, but rn she is just being a slave driver to the old man, . \nKorean manhwa drama mess at its finest, lets see where this shit fest goes. Sex scenes are quite great though. "}]