[{"id":1190981,"gallery_id":324299,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1599204226,"body":"It's clear to understand, there are no MC or FMC, all characters are just fucking each other"},{"id":1177393,"gallery_id":324299,"poster":{"id":2320187,"username":"Waduhek","slug":"waduhek","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598634955,"body":"Bruh im telling you, you will regret to read this shit"},{"id":1175720,"gallery_id":324299,"poster":{"id":3556876,"username":"vinblademan","slug":"vinblademan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598557099,"body":"Why can't this be english translated? Looks quite good with spicy drama."},{"id":1166789,"gallery_id":324299,"poster":{"id":3459146,"username":"WEL","slug":"wel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598184535,"body":"Basic gist: Mc and Fmc (chick with the glasses) are childhood friends. Mc is frustrated cus Gf won't fuck with him and Fmc also has someone she likes but dude don't seem to be interested in her, so Fmc and Mc become fuck buddies. Then they go on a school trip or something and Gf finally decides to fuck with Mc but now Mc seem to be more interested in Fmc. Because Mc is now busy fucking with GF Fmc starts fucking with some random dude she met during the trip since the dude she liked is too already fucking with someone else (tanned girl). Mc starts getting jealous and Gf notices it. Gf realizes Mc is interested in Fmc, so she starts fucking with some other random dude she met at at the beach. Fmc catches Gf in the acts and scolds her. Gf says she knows about her and Mc. Fmc says it's a misunderstanding... And so far this is the story. Still not over obviously."},{"id":1141542,"gallery_id":324299,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1597262783,"body":"@akitoh -- Thank you. Definitely getting a more manhwa vibe from this than the typical few chapter long hentai. Interesting."},{"id":1141382,"gallery_id":324299,"poster":{"id":3533037,"username":"SirRobin‏‏‎ ‎","slug":"sirrobin","avatar_url":"avatars/3533037.png?_=36fb1d10b5335960","is_superuser":false,"is_staff":false},"post_date":1597257307,"body":"@AkitoH Thanks a lot for the detailed explanation if you were gay I would have sucked your dick."},{"id":1141372,"gallery_id":324299,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1597257084,"body":"https://nhentai.net/g/322825/ This was my interpretation just from the reactions, but a user named sleik in the link I posted seems to have a far more accurate breakdown of the recent events in this manga. So I'd suggest looking at his breakdown for far better accuracy. "},{"id":1141327,"gallery_id":324299,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1597254861,"body":"@SirRobin In chapter 28, the cover girl already fucked the beach dude but when she sees the MC and glasses girl together, it sort of bothers her (pages 617 through 619), so she sort of falls into depravity briefly. Page 621 shows her accepting the beach dude groping her. A few pages later, the MC and her are having sex, but I think she's imagining the beach dude in that scene. She imagines him while the MC begins to imagine the glasses girl while fucking her, which makes him cum immediately. From the looks of it, SHE doesn't cum, which comes as a shock to him (meaning he busted early most likely since he never had an issue making a girl cum before). The following chapter, she fucks the beach dude and MC fingers the glasses girl while she blows him and everyone cums. Chapter 30, cover girl puts a stop to it, her and the barista make the beach dude look stupid. The vibes are there but not like your typical cheating or ntr plot. The characters become stronger for it."},{"id":1141305,"gallery_id":324299,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1597253960,"body":"@SirRobin Exactly. You'll most likely feel NTR vibes just cause of what I said earlier. The tanned dude on the beach fucks the brown haired cover girl, the girl the MC was crushing on, but she only accepted his advances because the MC was looking at the glasses girl while receiving a blowjob from her, which shocked her and told he that he didn't really love her, despite the sex. I caught NTR anxiety around the final few chapters of this update, but that was mostly due to the realism of the situation and I kinda shipped the brown haired girl and the MC. But it's an experience she grows from, because she and the barista girl from page 52 drops the tanned beach dude completely. But no one is in a real relationship here. Not yet. It's more like adolescent experimenting where they make mistakes but grow from it.  "},{"id":1141263,"gallery_id":324299,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1597252915,"body":"@akitoh -- Thank you. So if no one is really together to begin with then this wouldn't really be cheating or netorare, right?"},{"id":1141226,"gallery_id":324299,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1597251506,"body":"This is one of my favorie series on here, has realistic situations but keeping it a little wackey in a comic sense, drawings are great, the character developments is where this shines since its a long series. It needs a complete translation tho so i can sit and enjoy it completely "},{"id":1141173,"gallery_id":324299,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1597249708,"body":"@SirRobin I wouldn't say cheating, because no one is ever really together. That one girl that runs that shop introduced on page 52 is probably the only thing I would potentially call \"cheating\". If you read, you would see that she had sex with the MC's friend in that bar. He probably took that as a sign that they were going out, but I assume the girl just saw it as casual sex and she appears to have realized that her carelessness hurt him about 2/3s of the way through. The manga starts with the girl in glasses getting rejected by her crush and I assume the MC also got rejected, so they start their own sexual relationship to cope and work on a way to actually get their crushes, but no one is definitively going out in this manga. Not to my understanding. So it's not cheating by the normal definition. Just a whole lot of unrequited love and finding comfort in sex with others who share the same \"heartbreak\" in a sense. "},{"id":1141152,"gallery_id":324299,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1597249050,"body":"@akitoh -- Thank you. So its more like a ton of cheating? Well that explains the length. This is more like a manwha I guess."},{"id":1141150,"gallery_id":324299,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1597248994,"body":"I kept calling her the redhead, but I guess it's technically brown. Hmm."},{"id":1141141,"gallery_id":324299,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1597248794,"body":"(Part 3 Conclusion of the \"breakdown\") Obviously there is a whole lot of in between and stuff, but if you look at the character's reactions to things, you can sort of get where the plot is going and Page 191 goes a long way in helping you understand the flow of relationships here. Definitely one of the most layered hentai stories I've read since Metamorphosis by ShindoL. I didn't even cover all the other side stories, but you can sort of infer from their reactions. The main story is between the 2 cover girls and the MC and by this time, the MC and the redheaded girl end things. Probably a little reluctantly, but accepting that it wasn't gonna work out. The \"antagonist\" of the story up to this point was likely the tanned dude their with on the trip. Didn't like him the entire time cause he was just molesting everyone and playing it off as a joke. That's why it bothered me to see the redhead succumb to him, but by the end, she appears to have made a good decision for herself."},{"id":1141118,"gallery_id":324299,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1597248101,"body":"The last part of this trip they go on is where things start getting a little twisted plot wise and the \"scum\" starts to come out of people. This is why I likened this to Scum's Wish. People start confusing sex with love and love with sex and start using sex as a means to cope with unrequited love. It started to bother me because the red head girl, the MC's crush, while he's blowing him, sees that HE'S looking at the girl with glasses having sex and that bothers her. She starts to look elsewhere (the tanned dude with the hat) and that's where the NTR anxiety kicks in (at least for me) cause we watched the MC build up a relationship somewhat with this girl and he's a pretty standup dude, he just doesn't have his feelings together. By the end of Chapter 30, he appears to have realized his love for the girl with glasses and he and his crush say their \"final\" goodbyes, ending their sexual and \"romantic\" relationship, after she ends it with the tanned dude (by the looks of it)"},{"id":1141114,"gallery_id":324299,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1597247834,"body":"SO, I can't read this obviously, but I kinda got the gist of the plot. If anyone knows the manga Scum's Wish (Kuzu no Honkai), this is basically the same plot, just more light-hearted (at least for the majority. It starts getting more dramatic and fucked up when they go on this trip about half way through). But basically, everyone likes someone else. The MC likes the red headed girl on the cover, but the girl with glasses appears to be his sexfriend/bestfriend and she likes one of his friends. Go to page 191 to see the full love rectangle. Throughout, the MC and the girl with glasses try to get with their crushes. The girl with glasses doesn't really work out so she just happens to have a passionate time with the longer blonde haired dude. The MC fucks his crush a few times but soon begins to miss his sexfriend (Sort of like Toradora here a bit where Ryuugi and Taiga both had crushes but they spent so much time supporting each other that they ended up falling for one another.) "},{"id":1141068,"gallery_id":324299,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1597246618,"body":"Anyone got a breakdown on the plot since an english translation of 697 pages would be pretty monumental and its stil TBC? Did they really strecth out the standard NTR storyline that far?"},{"id":1140954,"gallery_id":324299,"poster":{"id":1049315,"username":"haterjones","slug":"haterjones","avatar_url":"avatars/1049315.png","is_superuser":false,"is_staff":false},"post_date":1597242203,"body":"nah miss me lol "},{"id":1140848,"gallery_id":324299,"poster":{"id":2325721,"username":"weeebgod","slug":"weeebgod","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1597238499,"body":"English v. wheeeen?"},{"id":1140711,"gallery_id":324299,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1597233721,"body":"697 pages? Holy shit! That's not a story arc. That's an autobiography."},{"id":1140709,"gallery_id":324299,"poster":{"id":3476935,"username":"scourge17","slug":"scourge17","avatar_url":"avatars/3476935.png?_=2a89f6b505647430","is_superuser":false,"is_staff":false},"post_date":1597233694,"body":"Still waiting for eng translation haha"},{"id":1140700,"gallery_id":324299,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1597233365,"body":"Double posting off the same username? You are a sad, strange, little man, and you have my pity Met-oops, random upset internet guy. -- Well here's the genuine SirRobin links post. -- LOL! Random upset internet guy copying my username and even profile pic to troll and flame me and you. -- https://nhentai.net/users/3533037/sirrobin -- Even copypasta my posts but changes the links. Click on username to see the older account. -- I prefer Cheating/NTR with Revenge/Payback afterwards. The husband/SO getting revenge or justice. That sort of shit. Here are ones I know of. https://nhentai.net/g/76017/ - https://nhentai.net/g/284898/ - https://nhentai.net/g/254437/ - https://nhentai.net/g/254443/ - https://nhentai.net/g/192711/ - https://e-hentai.org/g/1553252/568b266768/ -- Know any others to recommend?"},{"id":1140465,"gallery_id":324299,"poster":{"id":3533037,"username":"SirRobin‏‏‎ ‎","slug":"sirrobin","avatar_url":"avatars/3533037.png?_=36fb1d10b5335960","is_superuser":false,"is_staff":false},"post_date":1597223597,"body":"LOL! Random upset internet guy copying my username and even profile pic to troll and flame me and you. -- https://nhentai.net/users/3533037/sirrobin -- Click on username to see the older account. -- I prefer Cheating/NTR with Revenge/Payback afterwards. The husband/SO getting revenge or justice. That sort of shit. Here are ones I know of. https://nhentai.net/g/76017/ - https://nhentai.net/g/283744/ - https://nhentai.net/g/206896/ - https://nhentai.net/g/299039/ - https://nhentai.net/g/239103/ - https://e-hentai.org/g/1553252/568b266768/ - Know any others to recommend?\n"},{"id":1140457,"gallery_id":324299,"poster":{"id":3533037,"username":"SirRobin‏‏‎ ‎","slug":"sirrobin","avatar_url":"avatars/3533037.png?_=36fb1d10b5335960","is_superuser":false,"is_staff":false},"post_date":1597223301,"body":"I prefer Cheating/NTR with Revenge/Payback afterwards. The husband/SO getting revenge or justice. That sort of shit. Here are ones I know of. https://nhentai.net/g/76017/ - https://nhentai.net/g/283744/ - https://nhentai.net/g/206896/ - https://nhentai.net/g/299039/ - https://nhentai.net/g/239103/ - https://e-hentai.org/g/1553252/568b266768/ - Know any others to recommend? - LOL! Random upset internet guy copying my username to troll and flame me. - https://nhentai.net/users/3517389/sirrobin\n"},{"id":1140374,"gallery_id":324299,"poster":{"id":747898,"username":"ayami123","slug":"ayami123","avatar_url":"avatars/747898.png?_=cc4978cd112629f7","is_superuser":false,"is_staff":false},"post_date":1597220159,"body":"I'm Still waiting for full translation of this :D"},{"id":1140369,"gallery_id":324299,"poster":{"id":2332491,"username":"Begone","slug":"begone","avatar_url":"avatars/2332491.png?_=9e315fb257e55024","is_superuser":false,"is_staff":false},"post_date":1597219939,"body":"this was a whole new level of pain"},{"id":1140312,"gallery_id":324299,"poster":{"id":2224688,"username":"what u lookin at","slug":"what-u-lookin-at","avatar_url":"avatars/2224688.png?_=7e94402cd4876f47","is_superuser":false,"is_staff":false},"post_date":1597217635,"body":"fuck dis shit"}]