[{"id":1229609,"gallery_id":325511,"poster":{"id":3472738,"username":"poopnigga","slug":"poopnigga","avatar_url":"avatars/3472738.png?_=f1c493913d480520","is_superuser":false,"is_staff":false},"post_date":1600922168,"body":"@Gwimi: I can do editing. I've got experience with redrawing too. Get with me about it"},{"id":1188836,"gallery_id":325511,"poster":{"id":1052472,"username":"A Certain Crossdressing Touma","slug":"a-certain-crossdressing-touma","avatar_url":"avatars/1052472.png?_=0adb4fee00706545","is_superuser":false,"is_staff":false},"post_date":1599116460,"body":"@Gwimi: I think folks residing in ExHentai may have interest on translating it."},{"id":1181492,"gallery_id":325511,"poster":{"id":970476,"username":"Gwimi","slug":"gwimi","avatar_url":"avatars/970476.png","is_superuser":false,"is_staff":false},"post_date":1598820167,"body":"The next scene is just them teasing her with the blindfold, and by the end of it she's thinking to herself about the pleasures of a woman and how she doesn't want to change back. Finally he transforms the other two and restores their old memories before adding them to the harem, and by this point the chairman is completely mc's servant (without any mind control)."},{"id":1181488,"gallery_id":325511,"poster":{"id":970476,"username":"Gwimi","slug":"gwimi","avatar_url":"avatars/970476.png","is_superuser":false,"is_staff":false},"post_date":1598820047,"body":"If anyone would be willing to edit, I could supply a full translation, but here's a plot summary:\nThe three at the beginning are from the class committee and picking on our mc glasses boy for cash, but he uses some magic spell book to turn the committee chairman into a girl, and rewrites everyone else's memories so they think she's always been a girl. He lets the other two fuck her so they stop bullying him, and afterwards he tells the chairman that they are the only two who remember, and if she tries telling anyone he'll never turn her back into a guy. In pages 16-19 a month passes, which then leads to mc showing up in her room (which was also rewritten when he transformed her). She then initiates the sex without realizing, but a couple pages later mc is teasing her and points out that he never commanded her to, and that her own nature has transformed."},{"id":1169933,"gallery_id":325511,"poster":{"id":2605731,"username":"Siscelin285","slug":"siscelin285","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598302800,"body":"Please translate it a bit faster"},{"id":1162573,"gallery_id":325511,"poster":{"id":912224,"username":"TeslaHaxz","slug":"teslahaxz","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1598028420,"body":"Tsf no f is always a treat, and i love nomu's art. Shame the English versions take so long"}]