[{"id":1183557,"gallery_id":326666,"poster":{"id":540792,"username":"SilverLight","slug":"silverlight","avatar_url":"avatars/540792.png","is_superuser":false,"is_staff":false},"post_date":1598896949,"body":"How was I being a dick in any way? Literally told you the situation because you seem unjustly pissed. If you knew there was a difference between the artist and an actual uploader, do that next time. And what uploader username?"},{"id":1181129,"gallery_id":326666,"poster":{"id":3595982,"username":"NoSleepNoLife","slug":"nosleepnolife","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598805821,"body":"@jdogzero LMFAO you're actually  Retardnerd,More retarded than an actual retard, as expected as the nerd people looks like they all have down syndrome, GROW A BRAIN RETARDED NERD"},{"id":1180143,"gallery_id":326666,"poster":{"id":497460,"username":"jdogzero","slug":"jdogzero","avatar_url":"avatars/497460.png","is_superuser":false,"is_staff":false},"post_date":1598764262,"body":"love how those 2 morons are being dicks out of nowhere. 1 no shit its not the actual artist. read the god damn uploaders username. sleep how about YOU use your fucking brain. would have seen that if you did. 2 same goes with you silver. i can change the name naruhodo to the uploader and my comment wouldnt change. why would it. "},{"id":1179413,"gallery_id":326666,"poster":{"id":3595982,"username":"NoSleepNoLife","slug":"nosleepnolife","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598728507,"body":"@jdogzero use your fucking brain dumbass why would hentai artist uploads free doujin for us to read? \nThis website is illegal\nIf you want read the complete version go buy it you son of uneducated brainless dog\nBlame the thief uploaded not the artist it's self get it now you fucking piece of trash?  How dumb can you be? "},{"id":1179190,"gallery_id":326666,"poster":{"id":540792,"username":"SilverLight","slug":"silverlight","avatar_url":"avatars/540792.png","is_superuser":false,"is_staff":false},"post_date":1598717694,"body":"@jdogzero Dude, you're saying this as if the artist themselves are actively uploading this here themselves, which I doubt. Plus I'm pretty sure this is just a mirror site without the ability to update already existing galleries."},{"id":1178994,"gallery_id":326666,"poster":{"id":497460,"username":"jdogzero","slug":"jdogzero","avatar_url":"avatars/497460.png","is_superuser":false,"is_staff":false},"post_date":1598710530,"body":"this is getting stupid naruhodo needs to piss off with the half ass constant uploads and just post the entire thing or dont bother posting. maybe 1 or 2 samples but his page is getting spammed with whats basically copy and paste posts. hate when artists do this because its just plain annoying."}]