[{"id":1527740,"gallery_id":326706,"poster":{"id":3892511,"username":"SlymeTyme","slug":"slymetyme","avatar_url":"avatars/3892511.png?_=3aa4e5173f142e2f","is_superuser":false,"is_staff":false},"post_date":1611669811,"body":"Dumb bitch wouldn't even let him kiss her and she expected him to wait an entire year. Stupidity smh"},{"id":1254193,"gallery_id":326706,"poster":{"id":3643128,"username":"Berserker333","slug":"berserker333","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601911247,"body":"Pfffft, fuck that bitch. If she hadn’t chucked him, maybe he would have passed the exam cause he wouldn’t be tempted by the study slut. Maybe offer the butt as a reward for passing, but give your man some release so he can focus. You can’t study with a hard dick."},{"id":1198744,"gallery_id":326706,"poster":{"id":1245513,"username":"mrkagesawa","slug":"mrkagesawa","avatar_url":"avatars/1245513.png?_=827a53984612f3f8","is_superuser":false,"is_staff":false},"post_date":1599546562,"body":"Did he really think she was going let him have sex with her after cheating on her, bruhhhhhh. That's a very, Very sexy underwear that suits a body like hers. Not every got that fancy lingerie, sexy body with a pretty face. Your girl got the cute face, sexy body, innocent type. Damn bro, like I get it, she was holding back and all but come on dude you have a cute girlfriend. And she was waiting for you to pass is a sign that she wanted it to be memorable to celebrate that you passed your exam and that you both lost your virginity. Guess I would of been a happy memorial Day for both of you on the calendar. The thing is that girls like Junghyun are the type that want to feel safe knowing that it's only her, whereas pink hair girl is the wild type. Junghyun is sooooooo cute with banging body. I'd be happy bro."},{"id":1198694,"gallery_id":326706,"poster":{"id":1245513,"username":"mrkagesawa","slug":"mrkagesawa","avatar_url":"avatars/1245513.png?_=827a53984612f3f8","is_superuser":false,"is_staff":false},"post_date":1599544914,"body":"Nah, I want to see him bang his girl, she cute. Come on man, keep your dick in your pants MC and wait 1 more year dude. Bro if you had waited, then when you actually have sex with your girlfriend then you go full force let out all that pent up feeling, but now you wasting on a pretty girl you just met. She's definitely going to blackmail you or something and use it against you. Don't get me wrong I like he fucked the pink hair girl of course, but his girlfriend is Soooooooo cute. Never know she probably more a freak when she knows she's comfortable knowing you only have her in your line of sight. ONLY HER. Again she is sooo cute. "},{"id":1198278,"gallery_id":326706,"poster":{"id":1138214,"username":"BootyIsLife","slug":"bootyislife","avatar_url":"avatars/1138214.png","is_superuser":false,"is_staff":false},"post_date":1599526614,"body":"Coulda gave my man some head to motivate him js"},{"id":1180732,"gallery_id":326706,"poster":{"id":818439,"username":"michkirito","slug":"michkirito","avatar_url":"avatars/818439.png?_=f265676052c3af1c","is_superuser":false,"is_staff":false},"post_date":1598787510,"body":"Not even god can save you now nibba... Latom..."},{"id":1180201,"gallery_id":326706,"poster":{"id":3036467,"username":"Malek_sama_da","slug":"malek_sama_da","avatar_url":"avatars/3036467.png?_=338dbf21f17d783c","is_superuser":false,"is_staff":false},"post_date":1598766300,"body":"Ok we all will ignore that the girl in the front page isn't in "},{"id":1180107,"gallery_id":326706,"poster":{"id":3597030,"username":"aleatorio9999","slug":"aleatorio9999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598762684,"body":"Feel bad for the girl cuz he should had broke up with her after the first act. So that makes him a douchebag. But she had it coming. Seriously, they are both adults in  a serious relationship and she says he needs to wait another year to have sex?  There are other ways to satisfy your partner but not even touching is allowed? She acted way worse than any religious girl I ever met . Tbh he kinda dodge a bullet there, she would be the kinda a girl that would \"reward\" her husband with sex once per years or some BS. But still feel bad for her lol"},{"id":1179677,"gallery_id":326706,"poster":{"id":2385123,"username":"Hannn","slug":"hannn","avatar_url":"avatars/2385123.png?_=42a501ceb04f689e","is_superuser":false,"is_staff":false},"post_date":1598741422,"body":"oh yeahh jembut ah wkwkw"},{"id":1179595,"gallery_id":326706,"poster":{"id":3119387,"username":"factorisation","slug":"factorisation","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598736983,"body":"yup... a certified scumbag is what this dumbass is"},{"id":1179411,"gallery_id":326706,"poster":{"id":1567636,"username":"TheGucciTheory","slug":"theguccitheory","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598728470,"body":"This is why you should not blueball men."},{"id":1179129,"gallery_id":326706,"poster":{"id":3238954,"username":"ravides","slug":"ravides","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1598715100,"body":"Nice story , but this make me cry with his girlfriend"},{"id":1179098,"gallery_id":326706,"poster":{"id":1685518,"username":"acolyteofpain","slug":"acolyteofpain","avatar_url":"avatars/1685518.png","is_superuser":false,"is_staff":false},"post_date":1598713873,"body":"@zombieadd well... in a sense, this is a netorare (male). the MC isn't really that great tbh but the art still makes it worth to read i guess"},{"id":1178860,"gallery_id":326706,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1598704837,"body":"As far as I've read into the raws (up to chapter 18), there is no NTR but MC was simply cheating since he got so pent up he fucked Yura, one of the hottest girls in his school, so idk wtf @Psychoscient is crying about (NTR =/= cheating), probably a kid since kids can't handle these situations. BTW, the story gets better later, there is drama, there are unlucky events that will happen later, but so are good ones. Will there be any NTR? I wouldn't be surprised if there would be some, since so far I've been seeing MC having many relationships with women but MC is a good guy. This is a pornhwa we are talking about, ofc there would be some \"Korean fuckery\" or similar shit like that. It's an adult read, not some happy-go-round teenager love story thou. But I tell ya, this one's got a good story drama so far. So that's my recommendation but you be the judge."},{"id":1178726,"gallery_id":326706,"poster":{"id":3341907,"username":"HornyHammer","slug":"hornyhammer","avatar_url":"avatars/3341907.png?_=59285d3d35baf9e3","is_superuser":false,"is_staff":false},"post_date":1598697640,"body":"In mangas there are those pathetic crybaby MCs and in manhwas there's horny-only-thinking-with-the-dick type of dumbasses,tho the bitch had this coming cuz she kept her bf pent up for like a year without even attending to his emotional needs so fair enuf. "},{"id":1178718,"gallery_id":326706,"poster":{"id":3424662,"username":"Psychoscient","slug":"psychoscient","avatar_url":"avatars/3424662.png?_=804d9f02fca7d72f","is_superuser":false,"is_staff":false},"post_date":1598697194,"body":"wow, i thought it's some goodshit. only to know it's a fucking ntr. this is fucking bullshit. u got me in the first half, not gonna lie. "}]