[{"id":2415821,"gallery_id":327762,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1648163644,"body":"So uncle is her first love but since they're relatives so she tries to forgot about him and accepted a confession then got a boyfriend for the first time and is about to lose her virginity  but her uncle interrupted them then uncle touches her which triggers her subconsciousness then all her love which she suppresses returned. The 2nd attempt of the boyfriend also failed as her friends w/ her which she aggress to come then was about to get raped and be deflowered by some rando who is after her for some time but then uncle appeared like a mushroom and saved her. Later on home she finally loses her virginity as she gave it to her uncle. She got raped by her lover with the 4th attempt he made as the 3rd also failed at some point then broke up with him. Her parents suddenly returned home without prior notice. They tried to hide their relationship bbut got caught and thought that they would get into trouble but they didn't saying. They got married and lived happily."},{"id":2400368,"gallery_id":327762,"poster":{"id":165277,"username":"Alex_Grey","slug":"alex_grey","avatar_url":"avatars/165277.png?_=7dd4ce09fd4015c7","is_superuser":false,"is_staff":false},"post_date":1647552646,"body":"@Whore4men The uncle did, if you check in the shower scene (while BF is watching) you see red water going down the drain.----------------------------------------- I hope the rest gets translated soon because I don't understand anything.-------------------------------------------------- If I was the uncle I would have pushed that little shit of BF in front of the train. Also, what shitty friends she has, the girl tries to get away from rapey dude from the karaoke and don't check after her, then (in the bathroom with boyfriend FMC was kept quiet, so I don't count it, unless they pretended not to notice) and on the rooftop the BF went on his knees (I guess apologizing for molesting her) and they leave their friend alone with that molester? bitches please. And come on man, your brother and his wife are home and you start touching their daughter? (I assume they are her parents)------------------I put this lines to separete everything because even if I push enter it ends being a wall of text"},{"id":2317766,"gallery_id":327762,"poster":{"id":4354264,"username":"Whore4men","slug":"whore4men","avatar_url":"avatars/4354264.png?_=4c3365bdecabc168","is_superuser":false,"is_staff":false},"post_date":1644242191,"body":"Came here because the 1st chapter got English now.. From what Im understanding here (Well its hard to understand really because of the fucking light censorship I can't tell who the fuck got the FMCs V card) is that FMC likes his oji-san but she gotta keep balancing her relationship.. And since she's bothered by it first she decided to get into a karaoke party with her friends and almost got raped but uncle saved her which is a more development for her feelings?? That's all I get 😂 I didn't get anything between the BF situation at all.. All I know is that he's a scumbag horny guy who keeps aiming for her pussy. "},{"id":2317734,"gallery_id":327762,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1644240586,"body":"Thank God it's happy ending"},{"id":1213447,"gallery_id":327762,"poster":{"id":951163,"username":"snapshot","slug":"snapshot","avatar_url":"avatars/951163.png?_=54c655df2f6ded3c","is_superuser":false,"is_staff":false},"post_date":1600238523,"body":"Yo wtf did I just read?\nSo this girl likes his brother, but gets raped by a friend, then the brother has sex with a work friend, the sister discovers them (ntr, gets cycled), then he makes up with her with sex, then the parents come home and they discover them having sex, procede to make more sex and end happily together?"},{"id":1212123,"gallery_id":327762,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1600178014,"body":"The story seems nice, english please.\nThe brother win, I like it..."},{"id":1196476,"gallery_id":327762,"poster":{"id":1464302,"username":"Ahmadn100","slug":"ahmadn100","avatar_url":"avatars/1464302.png","is_superuser":false,"is_staff":false},"post_date":1599450068,"body":"Wtf. To much censored with white light. But the story look nice"},{"id":1195576,"gallery_id":327762,"poster":{"id":1299331,"username":"alonerone","slug":"alonerone","avatar_url":"avatars/1299331.png","is_superuser":false,"is_staff":false},"post_date":1599407154,"body":"This is good! It would be better if it's not full uncensored. Pixelated is better"}]