[{"id":1458892,"gallery_id":327929,"poster":{"id":3905159,"username":"animesexual","slug":"animesexual","avatar_url":"avatars/3905159.png?_=740014e9e7fafdb9","is_superuser":false,"is_staff":false},"post_date":1609714729,"body":" This is so hot"},{"id":1345078,"gallery_id":327929,"poster":{"id":3685251,"username":"xxen","slug":"xxen","avatar_url":"avatars/3685251.png?_=bada02c1ac34a402","is_superuser":false,"is_staff":false},"post_date":1605697383,"body":"three astolfo is too hot for me i'm dying"},{"id":1315602,"gallery_id":327929,"poster":{"id":1986370,"username":"Hentaist","slug":"hentaist","avatar_url":"avatars/1986370.png?_=d43cd6fdc24f20bf","is_superuser":false,"is_staff":false},"post_date":1604523036,"body":"blyat this is so hot, look at dat thickness in stockings at page 7 and that boner, yes this is real culture."},{"id":1254468,"gallery_id":327929,"poster":{"id":1298395,"username":"foxlord","slug":"foxlord","avatar_url":"avatars/1298395.png?_=df042b27107df121","is_superuser":false,"is_staff":false},"post_date":1601921392,"body":"meme50 is a fucking god\n"},{"id":1215648,"gallery_id":327929,"poster":{"id":2529225,"username":"chanclas has joined the chat","slug":"chanclas-has-joined-the-chat","avatar_url":"avatars/2529225.png","is_superuser":false,"is_staff":false},"post_date":1600333016,"body":"Why are the comments a doctor stone episode"},{"id":1211474,"gallery_id":327929,"poster":{"id":2462919,"username":"drava","slug":"drava","avatar_url":"avatars/2462919.png","is_superuser":false,"is_staff":false},"post_date":1600144879,"body":"hm, i dont know anything it says, but it seems someone said “go fuck yourself” to astolfo \n8/10"},{"id":1207014,"gallery_id":327929,"poster":{"id":3413691,"username":"golden weeb","slug":"golden-weeb","avatar_url":"avatars/3413691.png?_=734f04fe8d2a4bc2","is_superuser":false,"is_staff":false},"post_date":1599939438,"body":"a masterpiece honestly im ok with going gay if it means i can read this"},{"id":1205017,"gallery_id":327929,"poster":{"id":1591860,"username":"Kick Dickem","slug":"kick-dickem","avatar_url":"avatars/1591860.png?_=a0634518d0bd6d9f","is_superuser":false,"is_staff":false},"post_date":1599846238,"body":"For many of us yaoi connoisseurs, there is this constant nagging thought in the back of our heads asking us, “bro am I gay bro?” As a yaoi watcher myself trust me my fellow weebs I understand your pain. And thus I have come up with a convenient excuse to avoid thinking about your insecurities with your sexuality because I can prove that yaoi is not only not gay, but is in fact completely straight through the use of the Fibonacci sequence.\n\nNow before we can go any further with the theory, we first all have to be on the same page of what the Fibonacci sequence actually is.\n\nThe Fibonacci sequence is a sequence of numbers where as in each number in the sequence is the sum of the previous two numbers that come before it. So for instance when looking at the number 2 the previous two numbers would be one and one which when added together make the number two.\n\nThe sequence is however perhaps more famous for the spiral pattern that is associated with it."},{"id":1205013,"gallery_id":327929,"poster":{"id":1591860,"username":"Kick Dickem","slug":"kick-dickem","avatar_url":"avatars/1591860.png?_=a0634518d0bd6d9f","is_superuser":false,"is_staff":false},"post_date":1599846089,"body":"This pattern is formed when putting squares with side lengths that correspond to individual numbers of the Fibonacci sequence in a way that forms a rectangle. Then by connecting the corners of these squares by using arcs the spiral is formed. Now this spiral that is formed is known as the golden spiral, which is a logarithmic spiral that is a graph of the golden ratio. Now the golden ratio is a+b is to a as a is to b where a, b, and a + b refer to side lengths. When this ratio is put in a visual example it looks like this. This visualization is known as a golden rectangle. Here it is easy to see how side a + b is proportional to side a like how side a is proportional to side b.\nNow the golden ratio gets its name due to its frequent appearance in geometry and due to the visually appealing nature of its existence. To many the golden ratio represents the beauty of numbers and the patterns that form in geometry."},{"id":1205009,"gallery_id":327929,"poster":{"id":1591860,"username":"Kick Dickem","slug":"kick-dickem","avatar_url":"avatars/1591860.png?_=a0634518d0bd6d9f","is_superuser":false,"is_staff":false},"post_date":1599845944,"body":"Now in order to bring this back to yaoi we are first gonna have to look at some anime girl ass. Take a look at this picture of kaguya with the Fibonacci sequences golden spiral being superimposed over her posterior. Now this image relates to this theory I have called the 【Golden Masturbatio】. Here’s how it goes. Essentially what this picture signifies is that anime character’s asses follow the golden ratio, which if you will remember from earlier is often considered to be one of the most beautiful ratios in geometry. This fact partially explains why so many weebs find anime girls more attractive than real ones and hence why they prefer to jack it to them. Now when we think about it here, male and female ass pretty much looks the same, especially so in the realm of anime. If you had to choose between a pic of an anime dudes ass and an anime girls, would you be able to tell the difference without any previous knowledge?"},{"id":1205002,"gallery_id":327929,"poster":{"id":1591860,"username":"Kick Dickem","slug":"kick-dickem","avatar_url":"avatars/1591860.png?_=a0634518d0bd6d9f","is_superuser":false,"is_staff":false},"post_date":1599845767,"body":"The truth is that the majority of people cannot because ass does not really have any features at all to distinguish sex. Thus it is safe to say that male anime ass also follows the golden ratio, and is thus naturally attractive to all humans. Now while this is certainly interesting information on its own right, I’m sure you’re wondering how this makes yaoi less gay, I mean it’s literally about being gay right? Well here’s how you should look at it. As long as you spend your time while watching yaoi only focusing on the asses of the dudes, it’s not even slightly gay since their asses share the same golden ratio that female characters have. In fact it’s completely straight to watch yaoi as long as you make sure that you don’t take your eyes off of that male butt. So when you think about it here, there isn’t anything straighter than enjoying and checking out the asses of the characters in shows about gay guys falling in love with each other."},{"id":1202499,"gallery_id":327929,"poster":{"id":1930146,"username":"KyleCombriver","slug":"kylecombriver","avatar_url":"avatars/1930146.png?_=8ad5844ae3858483","is_superuser":false,"is_staff":false},"post_date":1599718062,"body":"This is so hot yet so fucking gay at the same time. Good nut"}]