[{"id":2016930,"gallery_id":330531,"poster":{"id":1326768,"username":"Eliot201","slug":"eliot201","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1631657210,"body":"She definitely fucked her son"},{"id":1886134,"gallery_id":330531,"poster":{"id":1007086,"username":"Aquas","slug":"aquas","avatar_url":"avatars/1007086.png?_=9b5102967c89f831","is_superuser":false,"is_staff":false},"post_date":1626799165,"body":"NA H                                                  "},{"id":1528408,"gallery_id":330531,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611699197,"body":"Talk about \"show, don't tell\"... This story does the exact opposite. Claims she's a strong willed woman...yet her actions show otherwise. Takuma really should have dropped her ass after she showed no concern when the guy went after him with a knife in front of her...even slashing his face. She sees it up close later and still doesn't care. Then everything she does after that. He should have helped her, then left her alone. Find someone else...like Aya, maybe."},{"id":1387437,"gallery_id":330531,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1607250706,"body":"Funny when they say it was too late for an abortion. Most women have them in under 12 weeks and even under 23 weeks is possible. That’s 3 and 6 months."},{"id":1387428,"gallery_id":330531,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1607250309,"body":"Pretty sure the kid is Nakakoshi‘s. He looks like him. Plus they didn’t have the abortion even though they knew she was pregnant from all those guys."},{"id":1243164,"gallery_id":330531,"poster":{"id":66866,"username":"neofranky","slug":"neofranky","avatar_url":"avatars/66866.png?_=8fad8ad3b400f785","is_superuser":false,"is_staff":false},"post_date":1601421597,"body":"I like how in the end the child looks like Nakakoshi."},{"id":1241808,"gallery_id":330531,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1601355690,"body":"@SatchPangit Takumi didn't plan any of the gangrapes(he didn't know they were happening til twintails told him), that was because the student council VP blackmailed Yayoi with pics from when Takumi forced her to have sex at school. Basically the same thing happens when the twintailed girl forces Takumi to fuck her in this volume. Takumi did the brainwashing thing just to make sure Yayoi wouldn't leave him like she suggested after he came back from that business with his master and Aya."},{"id":1241524,"gallery_id":330531,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1601341657,"body":"@SirRobin.\nI see. Thanks for giving the first two parts. Now, I finally get what's going on. Thought that she was gangraped then be threatened thru blackmail by the delinquents to continuously rape her but it seems Takumi planned everything to make her broken with plans of him to brainwash her. He does love her but his twisted fetish gets the better of him. "},{"id":1241475,"gallery_id":330531,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1601338700,"body":"@bzo1480 -- Yep. I reread Part 1 and Takumi broke her first. Everything Yayoi went thru happened because of Takumi. Takumi fucked Yayoi up so much that I'm not sure the netorare tag here is accurate. By that I mean that usually with Japanese NTR? The one \"stealing\" the girl does it by \"breaking\" her. Well, Yayoi was already broken. In the end all that really happens is that she goes back to being Takumi's sex slave. She's just a slave being passed between owners. No one is really \"stealing\" her. Pretty sad."},{"id":1241364,"gallery_id":330531,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1601332672,"body":"@SirRobin Yayoi and Takumi were dating and she thought he was a timid junior so she took the initiative to have sex and then Takumi's real side came out and he forced his kink onto her. Dude's a piece of garbage from beginning to end."},{"id":1241279,"gallery_id":330531,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1601327807,"body":"Well crap. Turns out I had forgotten a lot. Damn this is old. Part 1 in English is here. - https://nhentai.net/g/50116/ - Part 2 (No English) is here. - https://nhentai.net/g/24098/ -- @satchpangit - I don't recall it ever being said."},{"id":1241242,"gallery_id":330531,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1601325915,"body":"So, who's the father of Yayoi's child? I didn't quite catch it."},{"id":1241098,"gallery_id":330531,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1601317875,"body":"-- into believing that she hadn't been NTR'd by, like, anyone with a dick who was willing to stick it in her. That she had actually been doing what Takumi wanted her to do all along. So Aya and Yayoi become Takumi's sex slaves and they live happily ever after. The end. -- Oh, and there is a ton of side stories going on throughout. Think Takumi is fucking Yayoi's younger sister at some point too. Pretty much just a hugely drawn out \"breaking the girl\" for Yayoi. "},{"id":1241093,"gallery_id":330531,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1601317229,"body":"@walkerfe -- I can try but its been a long long time since I read the earlier stuff. -- Main guy is Takumi. Main girl is Yayoi. There is also a second main girl, Aya. Takumi has a shitty life. No dad and mom's a slut. He's also involved with a BDSM underground group. He's a student of a bondage master. That master's daughter, Aya, and Takumi have a thing for each other. Takumi gets involved with Yayoi, I don't remember how, and he breaks her. Eventually Takumi gets busted and kicked out of school for a while. During that time Yayoi pretty much becomes the school's cum dump. If I remember right she's being blackmailed and raped till she likes it. Takumi comes back and bangs a frenemy of Yayoi's. This crushes her dream of getting back together with Takumi and she goes full fucktoy mode. Takumi eventually rescues her, sort of, with friends from the BDSM scene. She still hates herself and wants to be nothing more than a fucktoy. Takumi rescues Aya, also sort of, and brainwashes Yayoi --"},{"id":1241009,"gallery_id":330531,"poster":{"id":3647202,"username":"WalkerFE","slug":"walkerfe","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601313352,"body":"Gonna need a summary for this."},{"id":1240767,"gallery_id":330531,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1601303035,"body":"@bzo1480 Agreed. -- Hehe, 230 pages and it doesn't include the first 18 chapters. -- Can we get a \"NTRx50\" tag? This bitch gets stolen all over again every time she gets fucked. -- And that pointless brainwashing at the end? Why bother. She'll still fuck anybody anyway. -- Question. What do the Japanese have against abortions? If she has a guy she wants to keep? And knows he ain't the daddy? She goes down to the clinic and gets cleaned out. Do the salarymen these are made for really find it naughtier when the broken girl keeps the not-MC's kid?"},{"id":1240675,"gallery_id":330531,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1601299151,"body":"Takumi is such a piece of shit that he doesn't deserve that happy ending."},{"id":1240568,"gallery_id":330531,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1601292817,"body":"So... All's well that ends well?"}]