[{"id":1265557,"gallery_id":330614,"poster":{"id":708813,"username":"ardipahlawan88","slug":"ardipahlawan88","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602427754,"body":"the fuck is going on with the ending ?🤣 n\ngood ending with divorce?"},{"id":1246369,"gallery_id":330614,"poster":{"id":3692435,"username":"fasdgsdgs","slug":"fasdgsdgs","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601559573,"body":"I made an account because I'm worried about you. It took you 9 minutes to reply to me. On a hentai website. What are you doing with your life, dude? Seriously. I'm not trying to insult you, but I'm 99% sure you're not satisfied with your life, and being an asshole on the internet for absolutely no reason is only going to make it worse. I am not angry, you are, ironically, projecting that yourself. I have no idea why, or how, you are so ridiculously angry and vitriolic. Go outside, seriously. I've been like you before, it's pointless and unhealthy. \nAlso stalking isn't the same as replying to someone once. But I won't reply again. If you don't understand what I'm saying now, you won't understand with more comments. Good luck in life :)"},{"id":1246117,"gallery_id":330614,"poster":{"id":3692435,"username":"fasdgsdgs","slug":"fasdgsdgs","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601544592,"body":"METROID, literally all your comments are you getting INSANELY butthurt over random people on the internet. You have no life nor a sense of irony. Just chill out man, beat your meat and then go do something productive"},{"id":1242145,"gallery_id":330614,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1601372454,"body":"It much better than stupid typical NTR.  Lot of stuff still not quite right such as she basically get sexual harassments early on and she's fine with it... furthermore even allow him to have sex with her. Lot more work still needs.  "}]