[{"id":2176738,"gallery_id":330874,"poster":{"id":4451251,"username":"I am ashamed to be here","slug":"i-am-ashamed-to-be-here","avatar_url":"avatars/4451251.png?_=f6b2dbe099057ee7","is_superuser":false,"is_staff":false},"post_date":1638482528,"body":"I have now learned how and it is self taught. I should not have wrote the previous thing but I still agree with my opinion. He can’t always use her as that is not the lesson. Anyways, this comment is undesirable to read and I just wanted to update whoever reads this comment that 3 days ago I learned how to do it properly entirely on my own and also using a bunch of tiny scenes from this website to create my new technique as the last one felt better but wasn’t very good to use. Anyways bye and I may come back in a long time."},{"id":1893044,"gallery_id":330874,"poster":{"id":4451251,"username":"I am ashamed to be here","slug":"i-am-ashamed-to-be-here","avatar_url":"avatars/4451251.png?_=f6b2dbe099057ee7","is_superuser":false,"is_staff":false},"post_date":1627085922,"body":"I want to kill everyone I thought she was gonna do a proper tutorial for a second and we get this disappointment. I am annoyed I can’t use that technique. Not everyone is a protagonist that gets 82847474894 girls to help them. I am annoyed now and disappointed. I was looking forward to a full tutorial. (Oh and btw I’m embarrassed to look it up if u say that.) I have never watched any stuff with real people and I’m kinda scared to lol so when I saw this I was super excited."},{"id":1246800,"gallery_id":330874,"poster":{"id":3464939,"username":"Picchucero","slug":"picchucero","avatar_url":"avatars/3464939.png?_=c0612733dfab10fc","is_superuser":false,"is_staff":false},"post_date":1601578167,"body":"Is this from the same artist as Sweet guy? "},{"id":1245899,"gallery_id":330874,"poster":{"id":1469603,"username":"fred jpg","slug":"fred-jpg","avatar_url":"avatars/1469603.png?_=04def99e5bf140cb","is_superuser":false,"is_staff":false},"post_date":1601535383,"body":" You do be right @buddhaman3333 "},{"id":1245092,"gallery_id":330874,"poster":{"id":473807,"username":"buddhaman3333","slug":"buddhaman3333","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601501534,"body":"I admit - I do love the over the top sexy character designs.  That said, reposting something that already has the other 47 chapters posted is silly.  And let's admit: the people in this comic are dumb as rocks.  \"Sex? I'm 18 and don't know what sex or masturbation is!\"\n\nYeah.  Right.  "}]