[{"id":1311772,"gallery_id":330990,"poster":{"id":3380232,"username":"Reyas","slug":"reyas","avatar_url":"avatars/3380232.png?_=49fb02bd9376c1cd","is_superuser":false,"is_staff":false},"post_date":1604361248,"body":"I deeply sympathize with this MC. Having a cunty wife that is completely unwilling to even try anything other than the most rudimentary sex AND is incapable of giving you children....... ..bruh. He must have Green Lantern level willpower to not immediately tear up that Surrogate pussy"},{"id":1249421,"gallery_id":330990,"poster":{"id":3421707,"username":"Lc_101","slug":"lc_101","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1601703887,"body":"🙂 for the heads up glad I didn't waste my time on it,🤔 also what a messed up story I mean I wanted material not an emotional twisted story.😒😔"},{"id":1247824,"gallery_id":330990,"poster":{"id":2229014,"username":"KurogamiKayn","slug":"kurogamikayn","avatar_url":"avatars/2229014.png?_=a00e3be2e69822a8","is_superuser":false,"is_staff":false},"post_date":1601635798,"body":"Guys, do not read this shit, I will tell you what happens, the wife gets jealous of the youngest and gets in touch with the rapist to rape and take a video of the youngest woman, but for her to give it to him  She had to fuck the rapist (the wife), possibly he makes her pregnant and hides it from her husband, the rapist kills the young woman's son (who did have the protagonist's baby) and the wife sends them to kill but fails.  the wife fucks about 5 times with the rapist and to tell them the end, the young girl is going to kill the wife for ruining her life but the protagonist stops her and almost kills her, but reconsiders and does not do it but at that moment the wife  He kills her with a knife, the house is burned and in the end only the wife is seen with the baby, nothing is known about the protagonist or the young girl, possibly dead.  IT'S A SHIT OF history, don't waste your time"}]