[{"id":1556630,"gallery_id":331581,"poster":{"id":3946851,"username":"LimousineDick69","slug":"limousinedick69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612945996,"body":"From the mist, a shape, a ship is taking form. And the silence of the seas about to drift into a storm. Sight of power, show of force! Rise the anchor battleship is plotting it's course! Pride of a nation, a beast made of steel. Bismark in motion (Queen) of the ocean. (She) was made to rule the waves across the Seven Seas! To lead the warmachine. To rule the waves and lead the Kriegsmarine! The terror of the seas! The Bismark and the Kriegsmarine! 2000 men and 50000 tonnnes of steel. Set the course of the Atlantic, With allies on the heel Firepower! Firefight! Battlestations! Keep your target steady in sights! Into formation, The hunt has begun! Death and damnation. The fleet is coming! (She) was made to the waves across the Seven Seas! To lead the Warmachine! To rule the waves and lead the Kriegsmarine! The terror of the seas! The Bismark and the Kriegsmarine!"},{"id":1453520,"gallery_id":331581,"poster":{"id":1610581,"username":"Lil'Mrsus.Lolicon","slug":"lil-mrsus-lolicon","avatar_url":"avatars/1610581.png?_=f33c1e938922c8e5","is_superuser":false,"is_staff":false},"post_date":1609567261,"body":"Except the Fairy and Zuikaku part, everything feels like coming out of a 12 years old boy mind."},{"id":1269401,"gallery_id":331581,"poster":{"id":3138975,"username":"manga_fanatic","slug":"manga_fanatic","avatar_url":"avatars/3138975.png","is_superuser":false,"is_staff":false},"post_date":1602579927,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me"},{"id":1257184,"gallery_id":331581,"poster":{"id":2193199,"username":"ImTired","slug":"imtired","avatar_url":"avatars/2193199.png?_=480a3803a7cc9d44","is_superuser":false,"is_staff":false},"post_date":1602049488,"body":"Ah yes, the two comments below me representing the duality of man."}]