[{"id":2266596,"gallery_id":332197,"poster":{"id":87097,"username":"-Fin-","slug":"fin","avatar_url":"avatars/87097.png?_=befc35f967d41688","is_superuser":false,"is_staff":false},"post_date":1642263285,"body":"Guys. You need to read this. This is the perfect ending for a whore like her. https://archiveofourown.org/works/33892285/chapters/84314386#workskin"},{"id":2256459,"gallery_id":332197,"poster":{"id":3893500,"username":"xXUtHiNkUnOmEXx","slug":"xxuthinkunomexx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641875372,"body":"Do you want to see how this foolish Girl regret her life choices because the consequences of her actions? Want to see how Karma can be ruthless sometimes? Want to see how successful the MC compared to that scumbag of a boyfriend (soon husband) she chose over the MC in social life?\n\nWell look no further! Check the link!\n\nhttps://archiveofourown.org/works/33892285/chapters/84314386"},{"id":2208398,"gallery_id":332197,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1639973799,"body":"It was ok until the MC suddenly decided to be a cuck in the end.\nLike, dude, your friendship with her isn't even that great, just go get other girl. I know its netorare logic, but c'mon, I never get this lines of thought in hentai"},{"id":2181434,"gallery_id":332197,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638691771,"body":"For her to fuck this dude knowing he is older not much going for him andhe low key violent asf, and he trying to knock her up and ruin her life good luck dumb bitch"},{"id":2089861,"gallery_id":332197,"poster":{"id":1819047,"username":"toshokan7","slug":"toshokan7","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634554552,"body":"This is very interesting in that it's not typical ntr she's not even hiding it.... and you kinda can't blame her since they were never going out to begin with... at the same time they  both knew they had feeling for each other. Obviously him more than her or she wouldn't have dated some other guy...  This reminds me of like when you break up with someone and their like but we can still be friends right?.?? Unless you moved on answer is always NO! Or else end up like this guy.... lol Seriously don't do it..."},{"id":2066540,"gallery_id":332197,"poster":{"id":4281592,"username":"boi what da hell boi","slug":"boi-what-da-hell-boi","avatar_url":"avatars/4281592.png?_=815d3e32747c81a7","is_superuser":false,"is_staff":false},"post_date":1633627450,"body":"this artist is so good at drawing ahegaos , so hot"},{"id":2049565,"gallery_id":332197,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1632924517,"body":"It will be better if Mc cut off the bitch."},{"id":2049257,"gallery_id":332197,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1632912814,"body":"The story is fine until Dramus ruined her story with the prologues showing how the Fuckboy conquers her. Instead of developing the FMC, it makes her look stupider. Dramus practically shows that the relationship between the Fuckboy and Akina is nothing more than a form of escapism on her part (Akina). Therefore, it´s somewhat stupid to me that things will end with Akina being <victorious> when the real consequence will be that such a relationship will fails"},{"id":2044353,"gallery_id":332197,"poster":{"id":3712144,"username":"LAZZ","slug":"lazz","avatar_url":"avatars/3712144.png?_=87076806c0d088ca","is_superuser":false,"is_staff":false},"post_date":1632711864,"body":"She belongs to the street yeah"},{"id":2033777,"gallery_id":332197,"poster":{"id":3073594,"username":"iamhero_303","slug":"iamhero_303","avatar_url":"avatars/3073594.png?_=5c4d9acfd4900950","is_superuser":false,"is_staff":false},"post_date":1632315691,"body":"It would be good if the ending is marrying that dude and that mc would be still friends its just a love triangle story"},{"id":2023989,"gallery_id":332197,"poster":{"id":4365989,"username":"Vindicta_01","slug":"vindicta_01","avatar_url":"avatars/4365989.png?_=111d13ac6981bf31","is_superuser":false,"is_staff":false},"post_date":1631952737,"body":"Seeing the dude who cucked the MC, confront the MC is very different from typical NTR doujins, he even went ahead and told him that Akina was his, interesting. I hope other parts get translated"},{"id":1997409,"gallery_id":332197,"poster":{"id":4054339,"username":"P.C","slug":"p-c","avatar_url":"avatars/4054339.png?_=4953cadfc29ea051","is_superuser":false,"is_staff":false},"post_date":1630906849,"body":"You snooze you loose "},{"id":1995403,"gallery_id":332197,"poster":{"id":3965071,"username":"N-Squidward","slug":"n-squidward","avatar_url":"avatars/3965071.png?_=3f835ca4bddbff18","is_superuser":false,"is_staff":false},"post_date":1630836808,"body":"Bruh.        "},{"id":1986940,"gallery_id":332197,"poster":{"id":2594896,"username":"Quietshun","slug":"quietshun","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630479868,"body":"What a waste of good art"},{"id":1919148,"gallery_id":332197,"poster":{"id":1259477,"username":"seraphimz","slug":"seraphimz","avatar_url":"avatars/1259477.png?_=c780d0b26446eef9","is_superuser":false,"is_staff":false},"post_date":1628006317,"body":"The answer is always murder~"},{"id":1917992,"gallery_id":332197,"poster":{"id":3146782,"username":"GoldenFaphand","slug":"goldenfaphand","avatar_url":"avatars/3146782.png?_=bd6b0b32ed9f27a3","is_superuser":false,"is_staff":false},"post_date":1627964707,"body":"the girl is sexy af but the mc just shit man whyy"},{"id":1917920,"gallery_id":332197,"poster":{"id":3683042,"username":"Dankest Lariat","slug":"dankest-lariat","avatar_url":"avatars/3683042.png?_=f0be87c9b48ad746","is_superuser":false,"is_staff":false},"post_date":1627961438,"body":"@TheFuckingKage finally, someone with has a brain "},{"id":1917746,"gallery_id":332197,"poster":{"id":3683042,"username":"Dankest Lariat","slug":"dankest-lariat","avatar_url":"avatars/3683042.png?_=f0be87c9b48ad746","is_superuser":false,"is_staff":false},"post_date":1627956649,"body":"I don't seek out NTR, but if the art is great I'll beat my dick. I'm not some guy who self inserts as the cheater or the cuck (or the girl lol). \nThis fucking doujin is called \"first come first served\" and it hits hard. I always (always) say this about NTR: it's a lesson of what not to do.\n\nYou don't want to be an NTR protag or involved in that shit at all. Everyone in these scenarios are fucking losers and that's okay. \n\nIf you have a girl you like, ask her out! Worst she tells you is no. Better to take your shot, miss, and move on than not take a shot all and feel like you were cucked. You already don't have her so what do you have to lose??? JUST DO IT NIGGA!!! \n\nAnd if you're already in a relationship and you get cheated on? Bruh don't beat off the idea of it. Pack your bags and leave. No explanation, no tears, no forgiveness. Have some self respect. Grow a pair and say bye bye. There are hundreds of bitches out there are you're about to simp to her? \n\nAll that said, the art was B+"},{"id":1917203,"gallery_id":332197,"poster":{"id":3432371,"username":"Some random weeb","slug":"some-random-weeb","avatar_url":"avatars/3432371.png?_=542a5887a02f6470","is_superuser":false,"is_staff":false},"post_date":1627938256,"body":"The art is good but everything else is full shit"},{"id":1916432,"gallery_id":332197,"poster":{"id":3359184,"username":"Marshal Zhukov","slug":"marshal-zhukov","avatar_url":"avatars/3359184.png?_=0d58c9970920f227","is_superuser":false,"is_staff":false},"post_date":1627915732,"body":"All three of them are dumb you know why? Fist the childhood friend, the opportunity was there but he was too scared to catch it, that's how my sister got her wife, she just shot in the air until she got a bullseye. Second the girl, if you truly liked the guy why didn't you go first? My mother confessed to father that she fell in love at first sight when she saw him walking outside of the Jollibee in 1997, my mom would be around your age when that happened. Lastly the NTRer, Why the fuck would you try to impregnate a god damn highschooler? Fucking saying she should dropout of school when your job looks like it's very unstable, that's how my uncle was (except NTR part) she convinced my aunt to drop out of school (even though she was 5months away from getting a highschool Valevicitorian degree) she got pregnant a few days later, So when my uncle died they were hit hard because he didn't have any savings and If my aunt had highschool degree she would have landed a decent job but she didn't"},{"id":1915661,"gallery_id":332197,"poster":{"id":4483581,"username":"IEatTallPpl","slug":"ieattallppl","avatar_url":"avatars/4483581.png?_=f8ec528042757f19","is_superuser":false,"is_staff":false},"post_date":1627887318,"body":"My god he's stupid and a simp you got the chance and you did nothing the girl is a whore but atleast she moved on unlike the mc ugh don't feel bad for the guy 4/10"},{"id":1861757,"gallery_id":332197,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1625878934,"body":"Also shes stupid asf \"i thought you didnt want me and forgot about me\" like what so you just decided to settle for someone you dont even truly love instead of trying harder for the one you truly love because you never even confirmed his feelings it was your own speculation"},{"id":1861690,"gallery_id":332197,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1625875154,"body":"I feel like the one suffering and will suffer the most here is the childhood friend cause she's doing all this in the heat of the moment looks like she isn't thinking this through cause it looks like she still likes MC. Her expressions sometimes show hesitation also since the title is \"First come First served\". which if you look at it this way she has one she loves which is MC but the One who came first was someone she didn't love and decided to just settle for whatever came instead of trying more for the one she truly loved and settled this way with someone she didn't fully love and the one she settles with which just means means later down the line when she is more mature to realize her mistake she will regret it. Anyway I don't mind NTR but i really wish these stories would at least include like 2-3 extra chapters where we see the Guy move on and get with another girl."},{"id":1858922,"gallery_id":332197,"poster":{"id":4078913,"username":"totuandat","slug":"totuandat","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625749537,"body":"if you are like this guy, i must say one is you talk with her and take her back with your feeling and your cock, if you are inadequate you can still practise, cuz he is really a bad guy , you can talk to her about it, she certainly fall for him cuz of his cock more than having feeling for him. you can do it. or just be normal acquantance if you are able to forget about your feeling with her, cuz you are mature enough, she is just on her road to be more mature. you also need to be more mature. "},{"id":1821052,"gallery_id":332197,"poster":{"id":4381591,"username":"leocalonge100","slug":"leocalonge100","avatar_url":"avatars/4381591.png?_=11aeb193231c8110","is_superuser":false,"is_staff":false},"post_date":1624251220,"body":"Another weak mc if he stub that guy who probably rape the girl that why his acting like that another useless mc who so weak"},{"id":1769002,"gallery_id":332197,"poster":{"id":2446464,"username":"Udon","slug":"udon","avatar_url":"avatars/2446464.png?_=587cb4b437b4b08b","is_superuser":false,"is_staff":false},"post_date":1622228087,"body":"Meh, 1. the mc is an idiot 2. The girl is a bitch 3. Ntr are stupid 4. Why ntr even exist? 5. Just your basic ntr plot 6. Why am i still here? 7. Just to suffer 8. The mc need to move on 9. Leave her alone 10. Let her regret her decision (im hoping for the shit happened on 177013) 11. But they wont make it like that 12. 177013 isnt an ntr but atleast it make sense that she regret everything (already too late tho)"},{"id":1762212,"gallery_id":332197,"poster":{"id":2038120,"username":"carminebanana","slug":"carminebanana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621938574,"body":"Damn I need more from this series"},{"id":1759854,"gallery_id":332197,"poster":{"id":1449774,"username":"Celino","slug":"celino","avatar_url":"avatars/1449774.png?_=a0025f897baa9069","is_superuser":false,"is_staff":false},"post_date":1621849968,"body":"The MC is a wimp, she just moved on after the rejection i don't blame her at all"},{"id":1753635,"gallery_id":332197,"poster":{"id":2830827,"username":"The Boyfriend","slug":"the-boyfriend","avatar_url":"avatars/2830827.png?_=3e36eb94d7f1251a","is_superuser":false,"is_staff":false},"post_date":1621595399,"body":"My heart is heavy"},{"id":1701025,"gallery_id":332197,"poster":{"id":4277453,"username":"OresamaTobi","slug":"oresamatobi","avatar_url":"avatars/4277453.png?_=b74491ffed75f92f","is_superuser":false,"is_staff":false},"post_date":1619470070,"body":"Well he only have himself to blame for being beta"},{"id":1665998,"gallery_id":332197,"poster":{"id":3806825,"username":"jorreez","slug":"jorreez","avatar_url":"avatars/3806825.png?_=0cfad7d0fd203995","is_superuser":false,"is_staff":false},"post_date":1617813334,"body":"These people be writing essays for an overly generic NTR lmao. "},{"id":1654176,"gallery_id":332197,"poster":{"id":3056431,"username":"its God","slug":"its-god","avatar_url":"avatars/3056431.png?_=e7c158ec7667ae15","is_superuser":false,"is_staff":false},"post_date":1617289334,"body":"but seriously tho yall just need to fap to this shit and not whine about it, its fucking hentai dude, logic barely works here and if some author did then that girl would have a shitty life cuz she got pregnant early and his 'partner\" is a plummer with a big cock like thats his only redeeming point, he's got a big cock and nothing else no personality whatsoever for the MC im sure he would move on, finish school, earn sum muney and find another girl cuz why not? and if they actually turn this \"logical thinking plot\" into a sequel then I hope he would give money to his friend, with a look of pity and say \"life's not going well for ya ain't it?\" then I would burst out laughing."},{"id":1654159,"gallery_id":332197,"poster":{"id":3056431,"username":"its God","slug":"its-god","avatar_url":"avatars/3056431.png?_=e7c158ec7667ae15","is_superuser":false,"is_staff":false},"post_date":1617288740,"body":"yo can yall give me a hentai where the MC got cucked but moved on (maybe found another girl) but the girl he likes got preggo or something. Im just into NTR with \"consequences\""},{"id":1626714,"gallery_id":332197,"poster":{"id":329947,"username":"Ran Kirumi","slug":"ran-kirumi","avatar_url":"avatars/329947.png","is_superuser":false,"is_staff":false},"post_date":1616115540,"body":"I hope the ending is that the guy moves on and the girl sufffers lmao. Rare to see the ntr mc having an actual spine instead of being a pussy ass"},{"id":1618290,"gallery_id":332197,"poster":{"id":992443,"username":"Jokke0009","slug":"jokke0009","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615734642,"body":"Nice copy paste lol. Ntr is just the same shit every single time with no variety in characters. Same dumb whore, same assholle who only has a big dick (like seriously do people actually thing size matters? sure super small isn't good but holy fuck). Guess rapists like this and people who are born defects ;)"},{"id":1549395,"gallery_id":332197,"poster":{"id":1248306,"username":"TheFuckingKage","slug":"thefuckingkage","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1612647682,"body":"Here’s how I see it. This is all the fantasy of the Plummer. Plumber goes to the house of the girl to fix shit, and is attracted to her. She is obviously disgusted. Plummer makes a move, it is laughably awkward, and her parents get threaten to call the cops. He leaves but not before seeing her with her childhood friend. Plumber goes to his pathetic van and starts fantasizing this story. You can do this with any NTR with a fat or old dude. Cuz these fuckers suck at sex. No stamina, or big cocks. Just remember this shit ain’t real. If you like this stuff, good for you. It’s your kink, and no one should shake you. We’re on a fucking hentai website, and y’all out at each other’s throats. Everyone on this website, including me, is into “werid shit.” So why we all taking the higher ground. NTR fans fr being hating on people who like vanilla, and vice versa. Just beat your dick and dip. This has been my Ted talk"},{"id":1549390,"gallery_id":332197,"poster":{"id":1248306,"username":"TheFuckingKage","slug":"thefuckingkage","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1612647220,"body":"Bruh everyone really getting mad over this dumb shit. Like if you dislike NTR, blacklist NTR. I kinda understand getting angry at other stuff, but this shit is so dumb it’s fucking hilarious. A Plummer? Like fr a Plummer. There is no way some girl saw this fat ugly ass Plummer, and was like I’ll let him pipe me😂. Bitch wasn’t loyal in the first first place 😂. This shit is so impossible it’s funny. Like if you’re angry at this, take a step back and think realistically. This bitch left a dude she loved for some Plummer. Not only that the Plummer is attacking the dude, who is student. You fr expect me to be angry over this dumb shit 😂. This dude literally picks her up in a rape van, and she’s like 😍. And her parents are ok with this??  "},{"id":1548246,"gallery_id":332197,"poster":{"id":2563413,"username":"hahaminato","slug":"hahaminato","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612597673,"body":"Well at least the guy has the black haired girl"},{"id":1538203,"gallery_id":332197,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612145160,"body":"@who cares about name There ARE NTRs out there with revenge that works in them, though. Just do a google search for \"NTR with revenge\"..."},{"id":1515566,"gallery_id":332197,"poster":{"id":3387991,"username":"who cares about name","slug":"who-cares-about-name","avatar_url":"avatars/3387991.png?_=9b5ea2971af4ccf2","is_superuser":false,"is_staff":false},"post_date":1611151305,"body":"You wanted the MC to fight back ya now he did it but guess what the girl is the actual cock hungry slut so revenge in NTR is kinda impossible, i wish salty vanillafrags could understand this"},{"id":1465955,"gallery_id":332197,"poster":{"id":3984680,"username":"Yu-Ishigami","slug":"yu-ishigami","avatar_url":"avatars/3984680.png?_=a8ddfa969f863130","is_superuser":false,"is_staff":false},"post_date":1609890250,"body":"I have read so much ntr that I am numb to it and I don't know if that is good or bad"},{"id":1465838,"gallery_id":332197,"poster":{"id":3944360,"username":"12codeine","slug":"12codeine","avatar_url":"avatars/3944360.png?_=6a26cc8333938963","is_superuser":false,"is_staff":false},"post_date":1609886620,"body":"we were so close to a mc getting revenge "},{"id":1440074,"gallery_id":332197,"poster":{"id":532087,"username":"ayy lmao1","slug":"ayy-lmao1","avatar_url":"avatars/532087.png?_=af42851463003b30","is_superuser":false,"is_staff":false},"post_date":1609186710,"body":"the art is so beautiful but I dont like crywanking"},{"id":1407220,"gallery_id":332197,"poster":{"id":2039858,"username":"makotosenpai","slug":"makotosenpai","avatar_url":"avatars/2039858.png?_=89b913e9ab403d79","is_superuser":false,"is_staff":false},"post_date":1608013284,"body":"Lol, mc is a handsome no need to waste your feelings on a slut move on , bruh"},{"id":1401975,"gallery_id":332197,"poster":{"id":1666533,"username":"rAnDom","slug":"random","avatar_url":"avatars/1666533.png?_=3b5219c5cf9d5118","is_superuser":false,"is_staff":false},"post_date":1607824598,"body":"I just wanna die. (:"},{"id":1393364,"gallery_id":332197,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1607486103,"body":"Ah, so it's already released, the last perspective, I didn't see it, lol. So she chose Tyron, huh. And then when she just chosen Tyron, MC confessed to her. Damn... That's sure will gave her a neverending guilt. Hell, she will use all the fucking she gets just to kill her rekindled love, unlike chapters before where she had passionate sex with Tyron. That's goddamn painful."},{"id":1393354,"gallery_id":332197,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1607485555,"body":"Man.. I just wanna know how it really ends. So the total conclusion is at the hand of the girl perspective, huh. Too bad for Kouta, but it's fine, he'll move on and there're a lot of fish in the sea."},{"id":1374267,"gallery_id":332197,"poster":{"id":2403513,"username":"nFR","slug":"nfr","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606778426,"body":"All the NTRs are the same shit, I just go in to see the design and lingerie of the FMC, the day an MC comes out with eggs that is not stupid and seeks revenge I buy a physical edition,it is simply a waste of time you want to find feet for an NTR"},{"id":1368080,"gallery_id":332197,"poster":{"id":3742513,"username":"Qin Ruo","slug":"qin-ruo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1606561516,"body":"@cuck4life\nDude, i have read tons of ntr and only thing came in mind is that there is no happy ending. Wives, girlfriends and maybe sisters, mothers all in ntr shit get succumbs to their sexual drive. Neither of the above mentioned female goed back to normal life. Even if their is a happy ending that is pseudo happy ending. The womens come back to their respective partners but deep down at their partners back they do those sexual activities with those chuds/ big cockers. They heartily accept their normal life but their bodies goes back to sex. Now, above manga has a high chance to succumb to ntr shit where fmc will become a cumdump. I wish their should be happy ending but it all depends on author mindset also i don't know but why the males are being made a cuckold. Come on give them some spine, mc in above hentai should leave her, grind hard make success and you will get tones of other girls."},{"id":1351885,"gallery_id":332197,"poster":{"id":2219877,"username":"cuck4life","slug":"cuck4life","avatar_url":"avatars/2219877.png?_=af495a08affac6b8","is_superuser":false,"is_staff":false},"post_date":1605968015,"body":"The author said there will another side story of the females perspective and it will be spread into to two parts . First part will be up in Japan at 5 am on 22nd November in the weekly kairakuten Vol 68. The gorilla thinks he won and the male MC has given up but the female is still indecisive. The ending will apparently in the second part of the female side story. The author is still indecisive whether to give a happy or bad ending and said he hasnt drawn the ending yet. But we will know when the second part comes."},{"id":1342808,"gallery_id":332197,"poster":{"id":3550367,"username":"thunderballs","slug":"thunderballs","avatar_url":"avatars/3550367.png?_=18e7214ab03f9d17","is_superuser":false,"is_staff":false},"post_date":1605611836,"body":"It good that he move on and took his L it mostly his fault for not realizing she like him nobody not going to wait forever.Fmc happy with Chad but not good couple to me he going to mess up her life but childhood friend  guy going to be making money and have better job than the Chad while she going to have baby to take care of because sex is better than having an life."},{"id":1342754,"gallery_id":332197,"poster":{"id":3550367,"username":"thunderballs","slug":"thunderballs","avatar_url":"avatars/3550367.png?_=18e7214ab03f9d17","is_superuser":false,"is_staff":false},"post_date":1605610203,"body":"I hope the childhood guy should  forgot his feeling  about be an good friend and  move on like an natural person would do than be butt hurt forever But Chad hey don't mess with my girl and look like he would fight him.I hope get something like unsweetened like the guy find a new girlfriend and move on.I'm tried of this bad ending for my boy "},{"id":1342177,"gallery_id":332197,"poster":{"id":3391020,"username":"angsarapngbuhay","slug":"angsarapngbuhay","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605588962,"body":"i think this is the chapter 3 and then the other one is the chapter 2"},{"id":1341558,"gallery_id":332197,"poster":{"id":3550367,"username":"thunderballs","slug":"thunderballs","avatar_url":"avatars/3550367.png?_=18e7214ab03f9d17","is_superuser":false,"is_staff":false},"post_date":1605560929,"body":"So lesson of this story is The guy mess up he waited too long to tell and she lost interest in him and move on another guy.Only thing he can be is good friend because he mess up his opportunity she was giving you clear sign she like you bro.i don't feel angry or anything because it not cheating or he's being betray."},{"id":1340804,"gallery_id":332197,"poster":{"id":1550426,"username":"MightyHorny","slug":"mightyhorny","avatar_url":"avatars/1550426.png?_=edd59f8a3cfdb321","is_superuser":false,"is_staff":false},"post_date":1605524665,"body":"... The more ntr you read, the more you wonder if Japanese men know anything about the concept of 'moving on.' She's not into you anymore? Date other girls! Stop hanging out with her! MOVE ON. All he does, right now, is hurting himself, pinning for a girl that doesn't even want him anymore. It's pathetic.. but that's a netorate for you."},{"id":1338909,"gallery_id":332197,"poster":{"id":1387175,"username":"a drop of virtues.","slug":"a-drop-of-virtues","avatar_url":"avatars/1387175.png?_=36d1c341684b4d47","is_superuser":false,"is_staff":false},"post_date":1605457344,"body":"...okay, so? what is the moral message in here?\n\nits like, tons of horny bitches out there... your childhood friend is not an exception. \n\n\njust find another bitch man, she into shaved man  big black dick... ( ͡° ͜ʖ ͡°) there's nothing you could do about it"},{"id":1336634,"gallery_id":332197,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1605375326,"body":"Bro is this guy retarded lmao just find some other girl like damn, she's already his bitch."},{"id":1334503,"gallery_id":332197,"poster":{"id":2293608,"username":"Randomdude299","slug":"randomdude299","avatar_url":"avatars/2293608.png?_=8ff5bd3f8d10a7ba","is_superuser":false,"is_staff":false},"post_date":1605290876,"body":"I guess this is the end because the newest is the prelude so yeah, the mc got cucked fucking beta mc, if author release a plot twist i may rethink"},{"id":1334440,"gallery_id":332197,"poster":{"id":2652251,"username":"legaecy","slug":"legaecy","avatar_url":"avatars/2652251.png","is_superuser":false,"is_staff":false},"post_date":1605288600,"body":"Well to assume that the MC is beta is reasonable but then again, it was his first love experience so yeah, it also reasonable (albeit infuriating) to got nervous when she asked him to kiss her (albeit his choice for simping later is pathetic I concur). Then again I hope they (mc and fmc) never become a couple for it is kinda unrealistic at least until they graduate and change their personality to their best if not at all. It gonna be great if the author make him make him learn the implication of being pussy+simp and man him up so he can live his life to the fullest (doesn't mean he must become alpha chad bullshit stereotype but just like, less caring about pussy and more enjoy his life to he fullest+do what's meaningful to his life) while the fmc also know how to pick up a better man than some nigga who treat her just like a game and a shiny trophy and got a better eyes for a man next time. That, by my opinion, is the only happy ending that make sense."},{"id":1334151,"gallery_id":332197,"poster":{"id":3205140,"username":"Player_D","slug":"player_d","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605280238,"body":"yeah she is definitly wavering"},{"id":1334103,"gallery_id":332197,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605278776,"body":"to the earlier comment: I agree make the MC popular the the girl tries to get back with him but the MC moved on and forgot about her"},{"id":1334098,"gallery_id":332197,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605278567,"body":"TO the childhood friend: Life goes on brah, just forget about her and move on with your life"},{"id":1331917,"gallery_id":332197,"poster":{"id":2005265,"username":"Loli_guy","slug":"loli_guy","avatar_url":"avatars/2005265.png?_=fb4a6b71abce21e3","is_superuser":false,"is_staff":false},"post_date":1605196647,"body":"I want more of this! "},{"id":1331575,"gallery_id":332197,"poster":{"id":2484316,"username":"EasternCuisine","slug":"easterncuisine","avatar_url":"avatars/2484316.png?_=7d499ec6872a5815","is_superuser":false,"is_staff":false},"post_date":1605180082,"body":"Its to friendship that we present our virtues, we become patient, tolerant, encouraging, and most of all, kind. We expect a little less and are hundreds of times more forgiving. We don't expect to be fully understood and therefore act more humanely towards our friends. We are in the presence of our friends our best selves, our own role models."},{"id":1331573,"gallery_id":332197,"poster":{"id":2484316,"username":"EasternCuisine","slug":"easterncuisine","avatar_url":"avatars/2484316.png?_=7d499ec6872a5815","is_superuser":false,"is_staff":false},"post_date":1605179855,"body":"Throughout the history, the thought of romance had been ruined by many forms of entertainment we indulge in. That loving and being loved by someone is life's most important purpose. Though it may seem the case that friendship is but the consolation prize to a missed shot, many seem to miss the bigger picture. It is through our loved ones that we expect most to understand our deepest frustrations, and saddest moments. If one were to measure love in all those emotional fits and tantrums, one may mistake it for a psychological illness. To those we love, we open up and show our worst moods, unfair acusations, and wounding insults. Its to our lovers that we direct blame for the many things gone wrong with our lives. Its to them that we expect to know everything we mean without bothering to explain to them. Its to them that with minor errors and misunderstanding that we respond with sulks and rage. "},{"id":1331561,"gallery_id":332197,"poster":{"id":2484316,"username":"EasternCuisine","slug":"easterncuisine","avatar_url":"avatars/2484316.png?_=7d499ec6872a5815","is_superuser":false,"is_staff":false},"post_date":1605179082,"body":"Just some Philosophy/Psychology. A virtue is the most ideal thing people should look for, to be in either side of the spectrum is not ideal, in this case, the two spectrums would be lovers and enemies the virtuous path is friendship since it is between lover and enemy. To be friends, one will not need to expect a lot from you, yet they will still be there in times of need. Emotional baggages won't be heavy. To be placed in a category of not a lover but as a friend may seem hurtful and damming; it may also seem like you are alone and it is indeed a lonely feeling. But know that with a friend you may be alone but you won't be lonely."},{"id":1328560,"gallery_id":332197,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1605048785,"body":"Honestly i love the scenes but ... Mc has a up hill battle. I mean that dudes packing salami and Mc is average, if she goes for Mc and feels she happy with lovey dovey sex with him kudos to her. But thisis a doujin so she might go get piped by big salami on the side"},{"id":1328352,"gallery_id":332197,"poster":{"id":3478892,"username":"けんじ ざね","slug":"kenzi-zane","avatar_url":"avatars/3478892.png?_=1cfe3785c6130eed","is_superuser":false,"is_staff":false},"post_date":1605041596,"body":"I just want a ntr doujin to have a version where its vanilla"},{"id":1327330,"gallery_id":332197,"poster":{"id":3123368,"username":"mcdoggo","slug":"mcdoggo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604997738,"body":"Well i guess my story will be the same as this guy\nBtw im at first phase"},{"id":1326369,"gallery_id":332197,"poster":{"id":2967550,"username":"Itachi The Clan Killer","slug":"itachi-the-clan-killer","avatar_url":"avatars/2967550.png?_=e978c9e9217b53c8","is_superuser":false,"is_staff":false},"post_date":1604952993,"body":"I don't like Netorare, but this art is good"},{"id":1324841,"gallery_id":332197,"poster":{"id":3770441,"username":"joylde 635883389","slug":"joylde-635883389","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604888510,"body":"DO A REVENGEE HENTAI THAT THE MC BECAME PAPULOR AND THIS BITCH MISSES HIM AHAHAHAJA"},{"id":1324205,"gallery_id":332197,"poster":{"id":2176151,"username":"Kelras","slug":"kelras","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604863136,"body":"Haven't often seen this type of NTR where the guy who supposedly stole the girl is still seething about the guy he stole the girl from. Lmao."},{"id":1324005,"gallery_id":332197,"poster":{"id":355471,"username":"imaginelikingshota","slug":"imaginelikingshota","avatar_url":"avatars/355471.png?_=bb1d689ea4339082","is_superuser":false,"is_staff":false},"post_date":1604857605,"body":"MC is stupid, just move on, he had it coming tbh for being so insecure, either way embrace slut shaming"},{"id":1321925,"gallery_id":332197,"poster":{"id":2713663,"username":"Lowhole","slug":"lowhole","avatar_url":"avatars/2713663.png?_=486366be3f72b8eb","is_superuser":false,"is_staff":false},"post_date":1604777148,"body":"Now everybody, we see a type of NTR where the dude was just asking to get cucked. "},{"id":1318190,"gallery_id":332197,"poster":{"id":1238114,"username":"sarod","slug":"sarod","avatar_url":"avatars/1238114.png?_=b74bbf3a41abea53","is_superuser":false,"is_staff":false},"post_date":1604633561,"body":"Moral of the story: If you like someone, take the fucking dive. Don't have regrets like this stupid ass MC over here."},{"id":1318064,"gallery_id":332197,"poster":{"id":2034951,"username":"beaverhide1","slug":"beaverhide1","avatar_url":"avatars/2034951.png","is_superuser":false,"is_staff":false},"post_date":1604628768,"body":"Dumbass mc"},{"id":1317357,"gallery_id":332197,"poster":{"id":3800969,"username":"XePorche","slug":"xeporche","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604599236,"body":"The bastard should show how dominate he is, but as we can see the story is going at the turning point of the mc's way. I will not be surprise if that bastard got trash at the end and the bitch will trying to go back to the MC. Based on what I read in this manga the MC and bastard kinda slowing to switch their roles. The MC is slowly showing that he can fight the bastard and slowly accepting his fate to be a friend of the bitch. While this bastard losing his mind becoming childish and paranoid that the MC might steal his girl. I think the author is trying to reverse the story based on the attitude of characters. I hope the MC got show how dominant he is and to have his own relationship just to make the bitch get jealous and try to run back at him."},{"id":1317325,"gallery_id":332197,"poster":{"id":1550349,"username":"Gawr Gura Ch. hololive-EN","slug":"gawr-gura-ch-hololive-en","avatar_url":"avatars/1550349.png?_=0db52eaeb84d39cc","is_superuser":false,"is_staff":false},"post_date":1604598103,"body":"Ye make her pregnant!!!! NTR FTW"},{"id":1315437,"gallery_id":332197,"poster":{"id":3645361,"username":"Hornygod234","slug":"hornygod234","avatar_url":"avatars/3645361.png?_=01a2544e147ef281","is_superuser":false,"is_staff":false},"post_date":1604515790,"body":"Dude this hurts to read cause this happens in real life and that girl gonna have trouble in future I choose lust over her feelings and mc will learn from mistakes and find a woman for him and tell her how he feels. Good message tell someone how you feel before it's too late.message 8/10 story 7/10"},{"id":1315079,"gallery_id":332197,"poster":{"id":2370904,"username":"Lumpii","slug":"lumpii","avatar_url":"avatars/2370904.png?_=e734ada24156be71","is_superuser":false,"is_staff":false},"post_date":1604503556,"body":"Damn rip da homie"},{"id":1314943,"gallery_id":332197,"poster":{"id":1376713,"username":"MrHowd","slug":"mrhowd","avatar_url":"avatars/1376713.png","is_superuser":false,"is_staff":false},"post_date":1604498602,"body":"The guy missed the train called opportunity, if he took the chance then he would be the one fucking her but that's life. So guys, if there's an opportunity whether be it job or helping someone, take that chance while it's still there, because once it's gone, you can't get it back. "},{"id":1314812,"gallery_id":332197,"poster":{"id":696495,"username":"conscript117","slug":"conscript117","avatar_url":"avatars/696495.png?_=c15333a79568e0f8","is_superuser":false,"is_staff":false},"post_date":1604492450,"body":"This deserves a part 3....I need to know more....I don't really fapped to it but man, I didn't expected the childhood friend to even try, now I wanna see what's next."},{"id":1313526,"gallery_id":332197,"poster":{"id":1164955,"username":"suhodmutalib","slug":"suhodmutalib","avatar_url":"avatars/1164955.png?_=00a17e4e90a0a2d4","is_superuser":false,"is_staff":false},"post_date":1604445137,"body":"look at these vanilla faggs in the comments lmao.. dont read shit knowing full well of the tags, ur sensitive feelings cant take it lmaooo"},{"id":1313127,"gallery_id":332197,"poster":{"id":543146,"username":"AquaBlazt","slug":"aquablazt","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604428170,"body":"the only good thing is that the MC almost beat the shit out of the other guy lmao,the MC looks cool but the girl had to intervene"},{"id":1313078,"gallery_id":332197,"poster":{"id":846732,"username":"AIMED55","slug":"aimed55","avatar_url":"avatars/846732.png?_=8ebefd69ec31bf08","is_superuser":false,"is_staff":false},"post_date":1604425957,"body":"shittiest doujin of 2020!!"},{"id":1312841,"gallery_id":332197,"poster":{"id":2860241,"username":"kira-xxx-xx-01","slug":"kira-xxx-xx-01","avatar_url":"avatars/2860241.png?_=edeada8888e1b09f","is_superuser":false,"is_staff":false},"post_date":1604417108,"body":"Clearly this is the most shitty hentai I read and it needs to be burn to oblivion..."},{"id":1312792,"gallery_id":332197,"poster":{"id":3256599,"username":"One-Way Road","slug":"one-way-road","avatar_url":"avatars/3256599.png?_=0a980d83084d4599","is_superuser":false,"is_staff":false},"post_date":1604414685,"body":"Great art but shitty plot."},{"id":1312472,"gallery_id":332197,"poster":{"id":3793819,"username":"goshujini99a","slug":"goshujini99a","avatar_url":"avatars/3793819.png?_=b2b006494c3cbb42","is_superuser":false,"is_staff":false},"post_date":1604394587,"body":"this is the NTR that I like seeing where the guy fucks the simp ass mc’s girl"},{"id":1312109,"gallery_id":332197,"poster":{"id":1736653,"username":"frozo","slug":"frozo","avatar_url":"avatars/1736653.png?_=d46ffa4bbebb2709","is_superuser":false,"is_staff":false},"post_date":1604377821,"body":"Oh god why the god tier art always has to be ntr"},{"id":1312052,"gallery_id":332197,"poster":{"id":3697825,"username":"Mononoke.","slug":"mononoke","avatar_url":"avatars/3697825.png?_=5c6bea2a20dccbe0","is_superuser":false,"is_staff":false},"post_date":1604375657,"body":"Hopefully mc beats the shit out of that ugly ass nigga "},{"id":1310991,"gallery_id":332197,"poster":{"id":2761470,"username":"ulquiorra_no4","slug":"ulquiorra_no4","avatar_url":"avatars/2761470.png","is_superuser":false,"is_staff":false},"post_date":1604326855,"body":"Mc should have just thanks that thug for saving him from this whore "},{"id":1309741,"gallery_id":332197,"poster":{"id":3476326,"username":"https//sleep.com","slug":"https-sleep-com","avatar_url":"avatars/3476326.png?_=81475935cbd37331","is_superuser":false,"is_staff":false},"post_date":1604268840,"body":"bitch belong to the streets and the mc is a big simp"},{"id":1309361,"gallery_id":332197,"poster":{"id":50375,"username":"rednaks","slug":"rednaks","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604251155,"body":"i think its possible to have a good ending because her trash boyfriend scare about her childhoodfriend, even he fuck her like crazy for me he is scare about him, and she has a feel for him and in the last page she is sad, i think it s possible for a good ending and i hope so"},{"id":1309019,"gallery_id":332197,"poster":{"id":3201466,"username":"Just a Horny Guy","slug":"just-a-horny-guy","avatar_url":"avatars/3201466.png?_=11e6d61c04348454","is_superuser":false,"is_staff":false},"post_date":1604238608,"body":"Damn I want the MC to get his revenge. From what I've seen, the MC can beat the shit out of the n¡gga bastard."},{"id":1307561,"gallery_id":332197,"poster":{"id":2483504,"username":"new001pñ","slug":"new001pn","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1604177497,"body":"MC is a simp"},{"id":1306377,"gallery_id":332197,"poster":{"id":1945969,"username":"hentaikingusama","slug":"hentaikingusama","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604128494,"body":"Well, atleast the thug almost got his ass beaten"},{"id":1306138,"gallery_id":332197,"poster":{"id":477004,"username":"FresshLikeLettuce","slug":"fresshlikelettuce","avatar_url":"avatars/477004.png","is_superuser":false,"is_staff":false},"post_date":1604119087,"body":"lol dunno what can i say about it, the 3 of them are shitty idiots, MC for think she was a granted,Girl cause stoped trying after MC rejected 1 kiss,Thug cause his mental age its around 10 years old boy getting jealous for a message  asking about a souvenir when he knows that both are CF and live next to each other.overall its TRASH"},{"id":1305903,"gallery_id":332197,"poster":{"id":378079,"username":"goddamnme123","slug":"goddamnme123","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1604110511,"body":"Huh this one... kinda dumb? 🤔"},{"id":1305589,"gallery_id":332197,"poster":{"id":3762878,"username":"NTR are only for Losers","slug":"ntr-are-only-for-losers","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604098270,"body":"But personally, I want everyone to be happy so I hope that fatty is not typical NTR rapist but wholesome dude. But considering his attitudes, I don't see any of wholesome lol. Feel bad man for this girl (lmao) MC? He will be fine, I am sure of it ;) ( cause irl experiences)"},{"id":1305584,"gallery_id":332197,"poster":{"id":3762878,"username":"NTR are only for Losers","slug":"ntr-are-only-for-losers","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604098080,"body":"Don't worry Vanilla fan. MC can learn and his character will develop. Soon he will find another girl who is better than his first crush. His crush too get happy by marrying this fatty? That is not true(lol). If you think she will be happy in the future, you are too NAIVE. First, look at his age. Now look at his job. Then look at his experience with women ( surely he have banged many women in the past) Now ask this: is fatty truely love this girl? Or after her body? Answer is obvious. Surely he will get tired of her and ditch her sooner or later. That is why divorce exists. But life will be hard for her as she will be 1) mother 2) widow 3) jobless (cause he mention she quit school) 4) slutty body( literally she become bitch) 5) old hag (if he ditch her for getting older and go for young)  6) loner ( MC will surely be married at this point)"},{"id":1305550,"gallery_id":332197,"poster":{"id":3762878,"username":"NTR are only for Losers","slug":"ntr-are-only-for-losers","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604096793,"body":"MC learn the lesson hard way. Hope you guys don't learn like that. Cause THIS is how MOST teenage drama went. First come first serve, Crush? Childhood friend? Best friend? No matter, only fast one wins. "},{"id":1305517,"gallery_id":332197,"poster":{"id":467569,"username":"D2K","slug":"d2k","avatar_url":"avatars/467569.png?_=99b284cbaa0c33bd","is_superuser":false,"is_staff":false},"post_date":1604095082,"body":"This was poorly crafted imo, dunno if it was the TL or if it's the quality of the writing, but since it's porn it's no biggy I guess. Arts is cool tho."},{"id":1301805,"gallery_id":332197,"poster":{"id":3543003,"username":"theboibc","slug":"theboibc","avatar_url":"avatars/3543003.png?_=b400d1e316b5a092","is_superuser":false,"is_staff":false},"post_date":1603955043,"body":"The guy doing the ntr is such a baby,get mad over some text?stop being a crying bitch"},{"id":1300856,"gallery_id":332197,"poster":{"id":1649298,"username":"Razal","slug":"razal","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603925357,"body":"@MrNova28 where you read the next chapter? "},{"id":1300789,"gallery_id":332197,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1603922362,"body":"@spiderscout: He liked her 10 years ago when they were kids and she messed up his shirt with the dango spill; and 2 years ago when she asked to kiss but he didn't have the courage to 'fess. 10 years - dream, 2 years - kiss/confession."},{"id":1300737,"gallery_id":332197,"poster":{"id":1232300,"username":"Yagami Boi","slug":"yagami-boi","avatar_url":"avatars/1232300.png","is_superuser":false,"is_staff":false},"post_date":1603919797,"body":"Just go chase a good woman weak mc stop being pathetic weak fuck,man up and get over with"},{"id":1300520,"gallery_id":332197,"poster":{"id":2952629,"username":"spiderscout","slug":"spiderscout","avatar_url":"avatars/2952629.png","is_superuser":false,"is_staff":false},"post_date":1603909384,"body":"Why the hell are people saying ten years went by, in the first one it says only two went by? https://nhentai.net/g/332196/2/"},{"id":1300512,"gallery_id":332197,"poster":{"id":19775,"username":"ATF2009","slug":"atf2009","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1603909157,"body":"pfffhahaha what a fucking loser...  peeps be mad at this but this is a life lesson 8f you like the girl then go after her... hard if she doesn't like you back fuck it who cares"},{"id":1300355,"gallery_id":332197,"poster":{"id":3129568,"username":"alexmars","slug":"alexmars","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603903169,"body":"Well this is reason why I don't like NTR"},{"id":1300336,"gallery_id":332197,"poster":{"id":1373112,"username":"sennoden","slug":"sennoden","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603902141,"body":"Well he had 10 years to confess. Nobody to blame but himself. But yeah, it must suck"},{"id":1297343,"gallery_id":332197,"poster":{"id":1378861,"username":"yoleorosa","slug":"yoleorosa","avatar_url":"avatars/1378861.png","is_superuser":false,"is_staff":false},"post_date":1603771518,"body":"This is real shit. Mans never said anything so she assumed he wasn't into her. It's happened to me way too many times. This one actually hurts, especially page 13. He had more guts than me and ended up worse than I ever was. Ignorance is fucking bliss. I'm gonna die alone, aren't I?"},{"id":1292303,"gallery_id":332197,"poster":{"id":740808,"username":"Shad","slug":"shad","avatar_url":"avatars/740808.png?_=e266b012c2356d53","is_superuser":false,"is_staff":false},"post_date":1603577075,"body":"@MrNova28 you have a good idea there. I would like that to happen too. Anyway this is unfappable to me but you sick bastards probably enjoy all this no brainer dumb shit"},{"id":1292048,"gallery_id":332197,"poster":{"id":3348691,"username":"MrNova28","slug":"mrnova28","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603565205,"body":"But the funny thing is: \nThe next chapter ends with the chad being worried that she might cheat on him with the MC lmfao. I want her to go through the exact same shit: feel like reaffirming her feelings, confess to the MC then have a hot chick appear outta nowhere, kiss the MC passionetly and have him say \"Sorry, I liked you too, but I'm with someone else now\", then she goes back to chad only to find him either cheating or leaving her.\n\nPerfect ending"},{"id":1292041,"gallery_id":332197,"poster":{"id":3348691,"username":"MrNova28","slug":"mrnova28","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603565042,"body":"First we have a dumbass MC who has a girl tell him to kiss him, he refuses. Then 10 years go by and he somehow expects her to wait for him eventhough he never told her anything. Then he saw the shit he saw and instead of either walking away from the entire shit  or telling her how he felt to get it off his chest, he says nothing yet again. This is literally not ntr lmfao, he never made a move. And don't give me the \"it's not easy to confess\": 10 YEARS AND SHE EVEN TOLD HIM TO KISS HER. That's ALL you need to know you can go for it lol.\n\nThe ONLY thing that made this guy unbearably stupid is the fact that she pushed the MC away without asking what happened, then tells him she liked him too  after he confesses and walks away for another fucking. For every dumbass cuck saying this is a nice sentiment or totally normal, take that buttplug out your ass and stop dreaming lol, in reality he would've never talked to her again. Irl people already easily abandon others if they get rejected lol"},{"id":1288663,"gallery_id":332197,"poster":{"id":61830,"username":"homer666","slug":"homer666","avatar_url":"avatars/61830.png","is_superuser":false,"is_staff":false},"post_date":1603438274,"body":"Lmao 10 years ? Bruh if there's any of you guys that's currently in this situation, just confess man. Being rejected hurts less than being cucked. Embarrassment won't kill you."},{"id":1287065,"gallery_id":332197,"poster":{"id":3209768,"username":"exknight","slug":"exknight","avatar_url":"avatars/3209768.png?_=aa4d2431547da17f","is_superuser":false,"is_staff":false},"post_date":1603378439,"body":"I dunno why the artist's keeps giving the cucks some life but doesn't even have a brain to think"},{"id":1285941,"gallery_id":332197,"poster":{"id":2843660,"username":"Only Pedos like shota","slug":"only-pedos-like-shota","avatar_url":"avatars/2843660.png?_=cc0c6b8dec4f6dfd","is_superuser":false,"is_staff":false},"post_date":1603325001,"body":"What a bitch. Kouta is better off without a bitch like her in his life"},{"id":1285096,"gallery_id":332197,"poster":{"id":906201,"username":"Imenoname","slug":"imenoname","avatar_url":"avatars/906201.png?_=c285eb631251bc8b","is_superuser":false,"is_staff":false},"post_date":1603284863,"body":"Imagine being able to accept that the girl you like is fucking someone else because you're such a pussy to confess. You guys are so pathetic to not see that trait from the dude lmao. Goes to show what kind of pussybois you guys are. "},{"id":1282491,"gallery_id":332197,"poster":{"id":3323611,"username":"Bararaq","slug":"bararaq","avatar_url":"avatars/3323611.png?_=5acd32ca5f5ef2bc","is_superuser":false,"is_staff":false},"post_date":1603170860,"body":"Wait,there's no \"tsudsuku\" in the last page like in the 1st chapter,so I guess there's no more"},{"id":1282070,"gallery_id":332197,"poster":{"id":1666533,"username":"rAnDom","slug":"random","avatar_url":"avatars/1666533.png?_=3b5219c5cf9d5118","is_superuser":false,"is_staff":false},"post_date":1603153402,"body":"Also... Who gives a fuck? Y'all just piss your \"MC pussy\" on a hentai site, and your presence alone says you aren't much of a playa' yourselves. This story is very real and realistic. It doesn't care about your feelings. It exists IRL and this doujin depicts it well. If you are gonna critique it do it properly. Not your \"MC bitch because he got cucked\" that ain't an argument. That's a statement. And more than 10 comments saying that is already too much. You drown the comment section in hundreds of bitchings. I wanna hear a proper critique cause i know this isn't a masterpiece but i am not the brightest of minds and need someone to point it out. And i can't cause y'all are a collective of people who just wanna fap without too much thought. They need to add likes or upvotes so you could pile up on one commdnt saying what y'all mean so dumbasses like me who wanna critique properly can see each other's points of view. - - - and no. I wasn't in this situation nor one like it."},{"id":1282042,"gallery_id":332197,"poster":{"id":1666533,"username":"rAnDom","slug":"random","avatar_url":"avatars/1666533.png?_=3b5219c5cf9d5118","is_superuser":false,"is_staff":false},"post_date":1603151983,"body":"Ah yes. The \"Nice guys\" are in the comments. Love is a unpredictable feeling. And it isn't just sexual attraction. Y'all just pissed cause it hits close to home i guess. It's too real. Dude seems like he isn't a looser in anything except love.  If you actually love someone you need time to get over it.  I wanna see y'all who complaining he a lil' bitch cause he didn't ask her out for a while ask a girl you LOVE out with no problem, it's way easier if you just wanna have sex. - - - - - this was a huge pile of randomly piled up \"info\" and \"tips\". Absolutely no structure. Nothing to back up statements. 3/10 rant"},{"id":1281645,"gallery_id":332197,"poster":{"id":2930170,"username":"unhollt","slug":"unhollt","avatar_url":"avatars/2930170.png?_=4a58b55b720f1601","is_superuser":false,"is_staff":false},"post_date":1603131400,"body":"The cuck character desing looked like he was going to get his hoe back but he didnt it was confusing but Fair."},{"id":1280726,"gallery_id":332197,"poster":{"id":1217,"username":"dou_shi_you","slug":"dou_shi_you","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603094725,"body":"Man, that girl's really hot though. (Maybe) I'd still love her if she came back to me after NTRing me. Idk. Only cuz she's as hot as anime! Btw, there's no 3rd chapter unless the author changes his mind. It says Kan (Complete) on the last page in japanese."},{"id":1280718,"gallery_id":332197,"poster":{"id":1217,"username":"dou_shi_you","slug":"dou_shi_you","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1603094354,"body":"@Akira-kun omg are you a guy or a girl??? If your a guy you must be so alpha you have confessed to every girl you've had a crush on when you went to school, and even if you have confessed before, you never felt any embarrassment, shame, or anxiety before that moment of confession? This MC hits a little close to home for me as a guy... sorta hurts cuz I've had similar experiences to this MC here except that none of them, of course, had to do with sex, just romance. This MC is actually one of the more relatable ones in an NTR manga/doujin."},{"id":1279457,"gallery_id":332197,"poster":{"id":1797784,"username":"Tony098","slug":"tony098","avatar_url":"avatars/1797784.png?_=be57b4b655ad8ebf","is_superuser":false,"is_staff":false},"post_date":1603044528,"body":"NTR MANGA ARE DEEP CUT THAN WOUNDS  JUST LIKE THEIR FLASHBACI"},{"id":1278142,"gallery_id":332197,"poster":{"id":3505379,"username":"Cpt. MacMillan","slug":"cpt-macmillan","avatar_url":"avatars/3505379.png?_=2893dbe537c0a4d8","is_superuser":false,"is_staff":false},"post_date":1602995301,"body":">I'll still be your good friend\nThis beta MC deserves it for being the sucker he is, I hate this but this guy is useless like throwing a shovel to someone drownig"},{"id":1277784,"gallery_id":332197,"poster":{"id":196484,"username":"genbu650","slug":"genbu650","avatar_url":"avatars/196484.png","is_superuser":false,"is_staff":false},"post_date":1602976211,"body":"@Hinatana: It’s not over. There’s more to come. The silver lining is that Akina still has feelings for Kouta."},{"id":1277508,"gallery_id":332197,"poster":{"id":1680284,"username":"Hinatana","slug":"hinatana","avatar_url":"avatars/1680284.png?_=b0429c0ae932a836","is_superuser":false,"is_staff":false},"post_date":1602961409,"body":"This conclusion's so fucking dumb. Why would he force such an unhappy situation onto himself? Honestly baffling. You fucked up, it's time to move on. Good art all around though."},{"id":1277234,"gallery_id":332197,"poster":{"id":3123368,"username":"mcdoggo","slug":"mcdoggo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602948376,"body":"Well same shit happened on me last year but my friend succ her"},{"id":1277220,"gallery_id":332197,"poster":{"id":1095368,"username":"ParaguaPatriarcal","slug":"paraguapatriarcal","avatar_url":"avatars/1095368.png?_=7fd8622b6c2cf73a","is_superuser":false,"is_staff":false},"post_date":1602947794,"body":"Can't feel bad for the MC, he's pathetic."},{"id":1276819,"gallery_id":332197,"poster":{"id":3610215,"username":"Akira-kun","slug":"akira-kun","avatar_url":"avatars/3610215.png?_=591b1c6e6cffb8ab","is_superuser":false,"is_staff":false},"post_date":1602930624,"body":"A small mistake: I DON'T really like NTR*"},{"id":1276814,"gallery_id":332197,"poster":{"id":3610215,"username":"Akira-kun","slug":"akira-kun","avatar_url":"avatars/3610215.png?_=591b1c6e6cffb8ab","is_superuser":false,"is_staff":false},"post_date":1602930360,"body":"I really like NTR, but holy shit this pisses me off. Not because it's \"NTR\", but because the MC is just so fucking retarded. Imagine not confessing then being heartbroken when you find out the girl is already seeing someone. What a fucking pathetic being called a \"man\". Absolutely garbage. He should be fucking thrown out this planet and his existence removed from the history of the world."},{"id":1276656,"gallery_id":332197,"poster":{"id":3437594,"username":"I.love.anal","slug":"i-love-anal","avatar_url":"avatars/3437594.png?_=fa557b1f76eb5199","is_superuser":false,"is_staff":false},"post_date":1602923375,"body":"Bruh who gets turned on by NTR? The point is the art is very good don't waste it on shit plot. Fucking cunts. But overall nice. "},{"id":1276229,"gallery_id":332197,"poster":{"id":196484,"username":"genbu650","slug":"genbu650","avatar_url":"avatars/196484.png","is_superuser":false,"is_staff":false},"post_date":1602903795,"body":"@Kongdonkey: When you bought up the possibility of Akina being raped by Tatsuya prior to their \"relationship\", it's possible that Akina may have been broken. I hope Akina's pov chapter would flesh out the situation she's in."},{"id":1275973,"gallery_id":332197,"poster":{"id":720296,"username":"bigJB21","slug":"bigjb21","avatar_url":"avatars/720296.png?_=3e8b2518a3afa9f8","is_superuser":false,"is_staff":false},"post_date":1602890231,"body":"What even is the point of this shit? This is not even ntr, so why all the dumb drama shit? I don't fucking care, just draw the girl getting fucked "},{"id":1274218,"gallery_id":332197,"poster":{"id":2205374,"username":"Kiss shot","slug":"kiss-shot","avatar_url":"avatars/2205374.png?_=3b6dd7b4cc8887b7","is_superuser":false,"is_staff":false},"post_date":1602806879,"body":"This fucking cunt Mc"},{"id":1273937,"gallery_id":332197,"poster":{"id":507179,"username":"Le Wolf","slug":"le-wolf","avatar_url":"avatars/507179.png","is_superuser":false,"is_staff":false},"post_date":1602795501,"body":"Dude I didn't come here to feel"},{"id":1273605,"gallery_id":332197,"poster":{"id":18953,"username":"ruki141","slug":"ruki141","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602780256,"body":"this not NTR tho, the beta MC never confess so she still single, as the tittle, first come first served"},{"id":1272915,"gallery_id":332197,"poster":{"id":755753,"username":"sirflim","slug":"sirflim","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602745297,"body":"I will never understand this kind of NTR. Like, I actually don't mind stories where the main heroine is cucked from the MC. It's just gotta actually be coherent. The girls always fall so fast in these stories -- if you're going to make it a multiparter in the first place you have time to make her give up on the dude she likes instead of just having her switch on and off from innocent childhood friend to mega slut mode at the drop of a hat."},{"id":1272460,"gallery_id":332197,"poster":{"id":2870273,"username":"zaweaboo","slug":"zaweaboo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602727218,"body":"If u looking for the next chap https://nhentai.net/g/330962/ go straight to page 35 to see the 3rd chap"},{"id":1272453,"gallery_id":332197,"poster":{"id":2870273,"username":"zaweaboo","slug":"zaweaboo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602726936,"body":"PAIN...     Really needs a 3rd chap I'm very interested in were this is going"},{"id":1272428,"gallery_id":332197,"poster":{"id":311398,"username":"SveXer","slug":"svexer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602725624,"body":"After being baptized in the filth of emergence this is nothing to me"},{"id":1272360,"gallery_id":332197,"poster":{"id":3733987,"username":"pururin32","slug":"pururin32","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602718977,"body":"Gonna be honest, I usually like ntr and know I'm a degenerate for it, but this...this isn't it "},{"id":1272284,"gallery_id":332197,"poster":{"id":3708795,"username":"(=∩_∩=)","slug":"_","avatar_url":"avatars/3708795.png?_=cd5cdf064cd0dc5d","is_superuser":false,"is_staff":false},"post_date":1602713735,"body":"This man's a cuck"},{"id":1271930,"gallery_id":332197,"poster":{"id":3199663,"username":"harmonygirl23","slug":"harmonygirl23","avatar_url":"avatars/3199663.png?_=4e07f0fc696e8488","is_superuser":false,"is_staff":false},"post_date":1602695655,"body":"this girl   newer talk abot her fielings witch MC too , and then  in typical unlogical ntr hentai style she exchanged true love for dick , there not only MC  made mistakes , i think if girl  was not a  slut and really loved him , she dump her fucker and start dating MC after his confession to her  , but she slut and choose dick , MC falut minimal there , girl in this story main whore and villian "},{"id":1271919,"gallery_id":332197,"poster":{"id":3199663,"username":"harmonygirl23","slug":"harmonygirl23","avatar_url":"avatars/3199663.png?_=4e07f0fc696e8488","is_superuser":false,"is_staff":false},"post_date":1602694995,"body":"dick loving whore "},{"id":1271169,"gallery_id":332197,"poster":{"id":2504484,"username":"Bobson Dugnutt","slug":"bobson-dugnutt","avatar_url":"avatars/2504484.png?_=79ab47ccd6e96488","is_superuser":false,"is_staff":false},"post_date":1602657823,"body":"Damn, the first chap didn't get me at all but this one got me thinking\nI usually like NTR cuz the Main Male character always a simp, pathetic little bitch and I like seeing them in pain but this guy just punched the shit out of that asshole like a chad. At least he stands up and does something rather than just stand there and cry. This is the first time that I feel sorry for the main character \nThe art is good and I enjoy the fucking scene but I just can't stop thinking about annoying to get cheated on and women are such a whore "},{"id":1270865,"gallery_id":332197,"poster":{"id":3491206,"username":"😹","slug":"_","avatar_url":"avatars/3491206.png?_=587705f743a5242e","is_superuser":false,"is_staff":false},"post_date":1602645053,"body":"Is there gonna be a part 3?"},{"id":1270674,"gallery_id":332197,"poster":{"id":2504078,"username":"Zukulentoman80s","slug":"zukulentoman80s","avatar_url":"avatars/2504078.png","is_superuser":false,"is_staff":false},"post_date":1602635248,"body":"You NTR haters pussys first this is not exactly NTR because they never dating the MC is just a pathetic simp without balls"},{"id":1270591,"gallery_id":332197,"poster":{"id":3554850,"username":"lugerspiel","slug":"lugerspiel","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602630363,"body":"The art is really sexy even though NTR isn't my fetish. Still enjoyed the story even though its pretty sad. The story was enough to compel myself to write a lengthy comment lol. The ending had some realistic closure and the characters were human. MC wasn't just a beta, girl wasn't just a slut and the \"villain\" seemed to actually want to pursue a genuine relationship with the girl. Hope all characters can find happiness moving forward, even though its just a fantasy story that is probably already over.\n\nAlso hoping to see more of Dramus' art, but with a story that's more vanilla."},{"id":1270420,"gallery_id":332197,"poster":{"id":1757483,"username":"AddChan","slug":"addchan","avatar_url":"avatars/1757483.png?_=68a3bab5d3a8148f","is_superuser":false,"is_staff":false},"post_date":1602622484,"body":"I liked the design of the long hair male mc.. he looks cool"},{"id":1270357,"gallery_id":332197,"poster":{"id":2398352,"username":"llik lla skcuc","slug":"llik-lla-skcuc","avatar_url":"avatars/2398352.png?_=21dc69ae8cd4c9cf","is_superuser":false,"is_staff":false},"post_date":1602620381,"body":"When you are not in relationship but go to NTR and call vanilla beta wimp, then you are all big talk lmao. Pathetic. But if you are in relationship but still come to NTR, I really feel sorry for your gf!! Cause the man she love is a horny dog! Btw if in relationship but also have two or more girls to bang, then obviously all these girls are bitches lmao. Why am I here? I wonder lmao. "},{"id":1270347,"gallery_id":332197,"poster":{"id":2398352,"username":"llik lla skcuc","slug":"llik-lla-skcuc","avatar_url":"avatars/2398352.png?_=21dc69ae8cd4c9cf","is_superuser":false,"is_staff":false},"post_date":1602619970,"body":"I feel sorry for those who self insert into the fuckers lmao. Cause they can't get their girls irl, insulting the vanilla guys, thinking themselves like a chad when in fact their life is pathetic. But if these fuckers even get bitches, they don't really love her lmao. Cause they only have big egos and NTR tag, thinking they will steal a girl but in fact a dog in heat lmao."},{"id":1270182,"gallery_id":332197,"poster":{"id":410492,"username":"elucidator86","slug":"elucidator86","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602613654,"body":"So many comments just for 1 manga is just amazing. But I have to say: this isn't your typical NTR. As a matter of fact, if you remove the sex, then this is the kind of plot that occurs a lot in teenage dramas. If you've ever read Salad Days, you'll know what I mean. The only reason this feels like NTR, is because the violent sex the thug is giving the girl feels like it shuts down the whole love triangle thing.\n\nAnd if you're hoping there's a part 3 where things will get better for the MC, then tough luck. I found a chapter in this series title, but since it's in korean (I can't read that), I can only infer based on the images themself.  Basically the guy is a possesive fuck, and the girl is an indecisive bitch. She doesn't want to split from thugface, yet wants to stay close with her childhood friend (Childhood photos, hanging out, that sort of thing), which pisses thugface off.  So he decides to just fuck her brains out and force her to choose, in the end ruining even the friendship."},{"id":1270146,"gallery_id":332197,"poster":{"id":1749417,"username":"Deddy Corbuzier","slug":"deddy-corbuzier","avatar_url":"avatars/1749417.png?_=30ec5180e296571a","is_superuser":false,"is_staff":false},"post_date":1602612810,"body":"Pain ‍ ‍ ‍ ‍ ‍ ‍"},{"id":1269465,"gallery_id":332197,"poster":{"id":261212,"username":"Nudeclear","slug":"nudeclear","avatar_url":"avatars/261212.png?_=347810fb81a2da19","is_superuser":false,"is_staff":false},"post_date":1602582768,"body":"OH WOWWIIIEEE THIS GOT BETTER, AM I RIGHT FOLKS? SHAME ON YOU CUCKS CRYING BECAUSE OF THIS PRODUCT LOL!"},{"id":1269459,"gallery_id":332197,"poster":{"id":3728354,"username":"derds","slug":"derds","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602582567,"body":"NTR comment section is where you can clearly see the simps virgin who can't confess to a girl they like irl. This dude is fair and square just like real life. Having a crush on someone does not make you entitled to own a female lmao. I always fucking love NTR because I look like the chad stealing the girl irl than a skinny virgin small-dick simp mc.."},{"id":1269412,"gallery_id":332197,"poster":{"id":3421314,"username":"LosingNNN","slug":"losingnnn","avatar_url":"avatars/3421314.png?_=d301996eeee966d1","is_superuser":false,"is_staff":false},"post_date":1602580470,"body":"Another woman thrown to the street"},{"id":1269380,"gallery_id":332197,"poster":{"id":3421314,"username":"LosingNNN","slug":"losingnnn","avatar_url":"avatars/3421314.png?_=d301996eeee966d1","is_superuser":false,"is_staff":false},"post_date":1602578377,"body":"THROW HER TO THE STREETS"},{"id":1269153,"gallery_id":332197,"poster":{"id":2764569,"username":"ShikeiV","slug":"shikeiv","avatar_url":"avatars/2764569.png?_=3c7a5ec7a40bf6a9","is_superuser":false,"is_staff":false},"post_date":1602566717,"body":"Nah fuck that, let her get fucked and impregnated when the man obviously leaves her alone with a single child and she has no education and tell her that's what you get. God damn japanese and Korean men are really making feel like they are just weak push overs. Infuriating. Just simply infuriating."},{"id":1269105,"gallery_id":332197,"poster":{"id":1821092,"username":"RUD3DUD3","slug":"rud3dud3","avatar_url":"avatars/1821092.png?_=96746958e1ac5d68","is_superuser":false,"is_staff":false},"post_date":1602565157,"body":"beta japanese male deserved it. go die you piece of shit."},{"id":1269018,"gallery_id":332197,"poster":{"id":1343863,"username":"Jabby","slug":"jabby","avatar_url":"avatars/1343863.png","is_superuser":false,"is_staff":false},"post_date":1602562600,"body":"she act like she regret and go back with MC, just to realize that the other dude's dick was always better. Just watch thats whats gonna happen. I know the pattern of these type of hentai."},{"id":1268977,"gallery_id":332197,"poster":{"id":770443,"username":"collaid","slug":"collaid","avatar_url":"avatars/770443.png?_=b8487d3475f6cf21","is_superuser":false,"is_staff":false},"post_date":1602560416,"body":"Dumbass MC, why didn’t u confess earlier "},{"id":1268970,"gallery_id":332197,"poster":{"id":2759126,"username":"tsuyukihime","slug":"tsuyukihime","avatar_url":"avatars/2759126.png?_=0a961a943dda667b","is_superuser":false,"is_staff":false},"post_date":1602560093,"body":"this isn't NTR lmao"},{"id":1268821,"gallery_id":332197,"poster":{"id":3652413,"username":"icameforthebooty16","slug":"icameforthebooty16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602553543,"body":"There will be a part 3 cause at the end she's showing regret for being a dumb bitch and the nigga (mc) is show a smile looking he planning something, you not gonna tell me he smiling cause hes getting cucked? No the nigga is about to do something "},{"id":1268693,"gallery_id":332197,"poster":{"id":1275563,"username":"KusoKuzu","slug":"kusokuzu","avatar_url":"avatars/1275563.png?_=4deb0717d437e50b","is_superuser":false,"is_staff":false},"post_date":1602547579,"body":"@esodrevo - Man you should look at the fucking road when you're driving. Like for real. Do you know how many people die every year because of drivers who are drunk/don't pay attention?\n\n@esquire Alphonse - My opinion 1. Probably no, the other guy looks way bigger and was stated to be someone who works manually 2. I don't think so 3. He literally said he sees her just as his bitch\n\n"},{"id":1268668,"gallery_id":332197,"poster":{"id":320503,"username":"esodrevo","slug":"esodrevo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602546156,"body":"I was reading this while driving. Man I almost crashed into the freeway barrier lmaoo"},{"id":1268565,"gallery_id":332197,"poster":{"id":240313,"username":"knightsabre2k","slug":"knightsabre2k","avatar_url":"avatars/240313.png","is_superuser":false,"is_staff":false},"post_date":1602541296,"body":"I... just don't get it. It was clear that the feelings between the MC and the girl were mutual from the start of the 1st chapter and, while I understand that she would be frustrated with his cowardice, the jump to the other guy seems so... random. And all they seem to do is fuck so it's not even a full relationship. How did it start? Is it one of those typical \"I love his cock\" sex relationships (even tho she seems to think otherwise even if her actions support it). Why does she keep her relationship so close with the MC as well for so long and only rejecting him when she couldn't avoid it? \n\nHonestly, with all the blanks in the story, the Girl comes off as bitch character you see in a Kouji Seo manga. Except in this one, the MC might get together with a better girl who is more suited to him."},{"id":1268474,"gallery_id":332197,"poster":{"id":3726630,"username":"Louie08213","slug":"louie08213","avatar_url":"avatars/3726630.png?_=04ac8c4ffaf36b97","is_superuser":false,"is_staff":false},"post_date":1602537393,"body":"Maybe it stings a little (i don't know why but it sort of does) but, this is all fair game. There is not a single reason of why this is considered NTR. Guess we'll have to wait until november for chapter 4. (The prelude said that there will be more in November)."},{"id":1268370,"gallery_id":332197,"poster":{"id":2375049,"username":"reaper85","slug":"reaper85","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602532833,"body":"good thing I didn't black list ntr\nNever a dull moment in the comment section LOL"},{"id":1268353,"gallery_id":332197,"poster":{"id":1618287,"username":"Link-Zelda","slug":"link-zelda","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602531752,"body":"King of simp hahahahaha"},{"id":1268325,"gallery_id":332197,"poster":{"id":2195403,"username":"animangafan342","slug":"animangafan342","avatar_url":"avatars/2195403.png","is_superuser":false,"is_staff":false},"post_date":1602530303,"body":"were they dating for this to be NTR? Osanamajimi & dating aren't the same thing. I've been in the mc's place where I wasn't forward with someone & she started dating someone else (she was a total hoe so dodged a bullet tbh) but I was never dating them so it wasn't NTR. It was just a bunch of stuff in the air that was never clarified. Even if you hook up with them, not really NTR unless you're officially together."},{"id":1268264,"gallery_id":332197,"poster":{"id":1602979,"username":"Badzkie","slug":"badzkie","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602527614,"body":"SHES REALLY A BITCH AND KILL ALL CUCKS.."},{"id":1268232,"gallery_id":332197,"poster":{"id":2681344,"username":"eren_jizzer","slug":"eren_jizzer","avatar_url":"avatars/2681344.png?_=b41e2ee32c1bd5cd","is_superuser":false,"is_staff":false},"post_date":1602525770,"body":"hoping for revenge chapter °~°"},{"id":1268230,"gallery_id":332197,"poster":{"id":2540827,"username":"Asterlanus","slug":"asterlanus","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602525754,"body":"So dumb why didn't she just say she liked him. Both of them are at fault for being fucking idiots. She's just as much at fault as he is. Also literally just met the guy and already doing the deed literally right after without confirming the guy she likes feelings or feeling it out from his friends. He's a coward, she's a dumb bitch.\n\nBut will see what happens if he stays a cuck or if he gets himself a better girl and she ends up dumped on the street preggo having to whore herself out or live a deadbeat life while he becomes successful for ultimate NTR cuck to her.\n\nSee chapter 3 where she is gonna quit school because she's pregnant and get dumped. He will probably take her in and adopt the kid and the baldy will still fuck her is alternative.\n\nKinda wanna see some vindication for the guy in this one. As ultimate NTR because she needs to get NTR'd hard and suffer ultimate regret now that she is feeling regret now in this chapter.\n\nArtwork is hot wouldn't mind a vanilla version of it too"},{"id":1268204,"gallery_id":332197,"poster":{"id":3175609,"username":"The25thBam","slug":"the25thbam","avatar_url":"avatars/3175609.png?_=8c5f22baf7e4b0a6","is_superuser":false,"is_staff":false},"post_date":1602524772,"body":"@pettam2.q I think the order is 3 than 1 and then 2 since in chapter 1 she already had the piercing "},{"id":1268155,"gallery_id":332197,"poster":{"id":341719,"username":"NHentai_Gallery","slug":"nhentai_gallery","avatar_url":"avatars/341719.png","is_superuser":false,"is_staff":false},"post_date":1602523507,"body":"She seems to show a little regret, I hope it stays like this and doesn't go full retard minibreak. I also think it's just as much the girls fault as te guys for them not ending up together, she could have easily confessed to him but chose to go with the first dude that showed intrest in her. "},{"id":1268099,"gallery_id":332197,"poster":{"id":3445003,"username":"basic24","slug":"basic24","avatar_url":"avatars/3445003.png?_=6b28cd575c4ca7d4","is_superuser":false,"is_staff":false},"post_date":1602521832,"body":"ouch my heart again"},{"id":1268093,"gallery_id":332197,"poster":{"id":1182673,"username":"anoaghost","slug":"anoaghost","avatar_url":"avatars/1182673.png?_=198c81b96ae291f5","is_superuser":false,"is_staff":false},"post_date":1602521648,"body":"Well, just wait for next chapters"},{"id":1268050,"gallery_id":332197,"poster":{"id":3364290,"username":"Akip0y0","slug":"akip0y0","avatar_url":"avatars/3364290.png?_=61eb2f0fa029664b","is_superuser":false,"is_staff":false},"post_date":1602519993,"body":"I can't wait for more chapters."},{"id":1268046,"gallery_id":332197,"poster":{"id":3725830,"username":"highschool dxd5716","slug":"highschool-dxd5716","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602519855,"body":"I feel sorry for the mc"},{"id":1267969,"gallery_id":332197,"poster":{"id":532087,"username":"ayy lmao1","slug":"ayy-lmao1","avatar_url":"avatars/532087.png?_=af42851463003b30","is_superuser":false,"is_staff":false},"post_date":1602517749,"body":"why do people fap do this when its just sad"},{"id":1267907,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602515092,"body":"Cpt_fapcon dude... you're right didn't think of that"},{"id":1267834,"gallery_id":332197,"poster":{"id":3024715,"username":"Cpt_fapcon","slug":"cpt_fapcon","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602512485,"body":"Add the part when she saw mc with someone better and she'll regret it...best revenge yet"},{"id":1267692,"gallery_id":332197,"poster":{"id":3291363,"username":"macocute","slug":"macocute","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602506323,"body":"Need part 3 and 4 and the end "},{"id":1267669,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602504955,"body":"pettam2.q ikr dude shes not a slut but shes just pathetic that she didn't wait for the one she truly loves and that made me mad at her, but the MC is pathetic to I know that he dosent or cant bring himself to confess, thats pathetic dude..."},{"id":1267537,"gallery_id":332197,"poster":{"id":3722997,"username":"pettam2.q","slug":"pettam2-q","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602499488,"body":"You people need to shut up who says the girl a slut, she isnt, shes not flaunting her body to other guys and fucking them because she loves cock, she has a boyfriend and shes having sex with him ALONE she gave the mc chances which he passed up sinse hes naive But, this still doesnt make her a slut by any means u guys need to search up what a slut is before actually using the damn term overall. The mc isnt simping over her at all do u know what a simp is, hes giving up on her and decided to protect her as a boyfriend and now sees her as a friend why is that so hard to understand? Hes given no signs of wanting to get back to her at all only the face of utter defeat but still respects her enough to let her be with the guy she *LIKES\". Its still up in the air as shes clearly not as intocthe guy as the story might want it to be and IS having second thoughts on her situation."},{"id":1267509,"gallery_id":332197,"poster":{"id":3722997,"username":"pettam2.q","slug":"pettam2-q","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602498185,"body":"From what i could gather the story goes like this; chap 1 then 3 which takes place between 1 and then this chapter which is 2, shes still shown to be thinking about the guys confession in the second to last page imo and and best friend stoped simping over her and decided to give up totally. The story isnt complete and if it is its left up to interpretation given her signs throughout the series as a whole, so you could say she became cock hungry or she decided to be with the guy she genuinly liked for years."},{"id":1267504,"gallery_id":332197,"poster":{"id":1421683,"username":"BakaNeko12","slug":"bakaneko12","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602497851,"body":"well just tell u like him or will be ended like this shit\n"},{"id":1267469,"gallery_id":332197,"poster":{"id":2526489,"username":"ottesuhc","slug":"ottesuhc","avatar_url":"avatars/2526489.png","is_superuser":false,"is_staff":false},"post_date":1602496586,"body":"It's not NTR because the boyfriend IS the Chad xD"},{"id":1267441,"gallery_id":332197,"poster":{"id":2484316,"username":"EasternCuisine","slug":"easterncuisine","avatar_url":"avatars/2484316.png?_=7d499ec6872a5815","is_superuser":false,"is_staff":false},"post_date":1602495360,"body":"As sad as it is, this is his fault, of course he will miss the shot he didn't take. He didn't act on it and just stayed as friends. But here's another lesson to be had, being friends is most ideal really, you expect less from each other and will still be together no matter what. Forgiving is easier and you'll have someone to lean in tines of need. "},{"id":1267409,"gallery_id":332197,"poster":{"id":1951342,"username":"Dynamiclel","slug":"dynamiclel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602494333,"body":"@Nightmare X, I prefer Mami than this, so for now yes."},{"id":1267400,"gallery_id":332197,"poster":{"id":3364290,"username":"Akip0y0","slug":"akip0y0","avatar_url":"avatars/3364290.png?_=61eb2f0fa029664b","is_superuser":false,"is_staff":false},"post_date":1602494014,"body":"@Dynamiclel, Mami-chan is the best waifu."},{"id":1267388,"gallery_id":332197,"poster":{"id":1951342,"username":"Dynamiclel","slug":"dynamiclel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602493702,"body":"This dude makes Mami-chan look as a good person."},{"id":1267333,"gallery_id":332197,"poster":{"id":3016628,"username":"Mephestopheles","slug":"mephestopheles","avatar_url":"avatars/3016628.png?_=580e6c4a377b9cac","is_superuser":false,"is_staff":false},"post_date":1602491584,"body":"I don't think there's going to be a third part. The kanji at the bottom of the 16th page (second to last page) translates to \"complete\", so I think this is the end."},{"id":1267309,"gallery_id":332197,"poster":{"id":3068129,"username":"X-POTATO","slug":"x-potato","avatar_url":"avatars/3068129.png?_=16a0207e074db641","is_superuser":false,"is_staff":false},"post_date":1602490750,"body":"Pls give e good end for mc"},{"id":1267297,"gallery_id":332197,"poster":{"id":3480604,"username":"itsuka_hiori","slug":"itsuka_hiori","avatar_url":"avatars/3480604.png?_=5c9754c24c8f37c0","is_superuser":false,"is_staff":false},"post_date":1602490480,"body":"In 3rd chapter she will regret. It's my curse to her "},{"id":1267291,"gallery_id":332197,"poster":{"id":2386466,"username":"uglybastardd","slug":"uglybastardd","avatar_url":"avatars/2386466.png?_=044c846e15479a7a","is_superuser":false,"is_staff":false},"post_date":1602490340,"body":"cowo lemah mending comli aja sambil liatin temen baikmu di entod orang lain hahaha"},{"id":1267262,"gallery_id":332197,"poster":{"id":1838566,"username":"Beliarr","slug":"beliarr","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602489640,"body":"Shit skins and their fangirls need their heads bashed in!"},{"id":1267213,"gallery_id":332197,"poster":{"id":160093,"username":"Shavier","slug":"shavier","avatar_url":"avatars/160093.png?_=1ada2d94db0f0841","is_superuser":false,"is_staff":false},"post_date":1602487603,"body":"Dude, the mc is just shit lmao\nnice body anyway"},{"id":1267187,"gallery_id":332197,"poster":{"id":2578322,"username":"omltitf","slug":"omltitf","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602486900,"body":"The lesson of the hentai was if u like somebody tell them and dont wait or else shes going to get dicked down "},{"id":1267102,"gallery_id":332197,"poster":{"id":21220,"username":"Blakku","slug":"blakku","avatar_url":"avatars/21220.png","is_superuser":false,"is_staff":false},"post_date":1602484528,"body":"what a pathetic guy."},{"id":1267081,"gallery_id":332197,"poster":{"id":3612091,"username":"DragonStrike123","slug":"dragonstrike123","avatar_url":"avatars/3612091.png?_=b8324d098a445059","is_superuser":false,"is_staff":false},"post_date":1602483903,"body":"There should be a tag for SIMP! Cause that’s what he is, Pathetic lol. "},{"id":1267034,"gallery_id":332197,"poster":{"id":1568108,"username":"Demon Usamaro","slug":"demon-usamaro","avatar_url":"avatars/1568108.png?_=7b801144a6c4fe37","is_superuser":false,"is_staff":false},"post_date":1602482554,"body":"@Logf you must be deluded, porn is to give off a realistic fiction aspect to human sexual activity. When you make something like this, it's most likely to give off a realistic feel so you can relate to the characters or put yourself in to the content, but then they take the realistic aspect away by giving the characters, inaccurate mind sets towards relatable situations. So basically why give 2 characters in a porno realistic mindsets, if you make the third one (the guy who is suffering) have a bizzare unrealistic mind set. After taking phycology classes, I've learned that average human nature (male or female) throughout the world is to be petty and destructive to loved ones/significant others/partners who do you wrong, none of that is shown in this at all, or throughout some ntr porno that give off realistic vibes, it's ridiculous. "},{"id":1267030,"gallery_id":332197,"poster":{"id":3252553,"username":"Kterez09","slug":"kterez09","avatar_url":"avatars/3252553.png?_=0c5b84ae9501e1ae","is_superuser":false,"is_staff":false},"post_date":1602482493,"body":"FUCK THAT'S SO FUCKING PATHETIC. SHIT I DIDN'T EVEN GET HARD"},{"id":1267009,"gallery_id":332197,"poster":{"id":2568200,"username":"pepejohn","slug":"pepejohn","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602481924,"body":"Damn that sucks but this guy should NOT have confessed. Made it super awkward. That's hentai logic for ya though. At least it didn't follow the trope with the MC being some weakass loser who cums from getting cucked (is that even real???)"},{"id":1266909,"gallery_id":332197,"poster":{"id":2789451,"username":"JoeMama13","slug":"joemama13","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602478516,"body":"fucking simp"},{"id":1266905,"gallery_id":332197,"poster":{"id":1511470,"username":"turbulence","slug":"turbulence","avatar_url":"avatars/1511470.png?_=15de6df5b3331027","is_superuser":false,"is_staff":false},"post_date":1602478403,"body":"This is NTR story more rational than the most. Like the title say. I honestly agree with most of the comment below. MC should have moved on and upgrade his life rather than keep SIMP-ing on her.  But who knows, maybe author gonna twist this like madman. Still this kind of story rarely get a happy/good ending. 7.5/10 from me."},{"id":1266895,"gallery_id":332197,"poster":{"id":1777889,"username":"Do you know me?","slug":"do-you-know-me","avatar_url":"avatars/1777889.png?_=d2ad066e6d03ee0b","is_superuser":false,"is_staff":false},"post_date":1602478239,"body":"The best ending. @Ecchinosuke"},{"id":1266849,"gallery_id":332197,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1602476895,"body":"I want to see the story end with the mc just moving on from all of it and get himself a nice girl to get his mind off her, like any guy with a broken heart should. After some time they would see each other again reminisce of old times have a first and last fuck for closure and ending it with her realizing that both made a mistake but she didn't stop until it was too late, and then we find out she's working as a prostitute or something. Alas in the the world of NTR hentai the female must always be protected at all cause because of reasons, and so she will be justice in everything she does again because of reasons while the guy has to suffer in a corner because they represent your average Japanese otaku jerking off to hentai instead of helping in stopping the birth decline in Japan or something. "},{"id":1266833,"gallery_id":332197,"poster":{"id":846732,"username":"AIMED55","slug":"aimed55","avatar_url":"avatars/846732.png?_=8ebefd69ec31bf08","is_superuser":false,"is_staff":false},"post_date":1602476308,"body":"myaccountfornhentai, maaan STFU. we are allowed to comment and complain about the story! "},{"id":1266828,"gallery_id":332197,"poster":{"id":3429509,"username":"BlackShukaku","slug":"blackshukaku","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602476106,"body":"Living in Spain but the S is silent :("},{"id":1266824,"gallery_id":332197,"poster":{"id":3665920,"username":"BlitzReport","slug":"blitzreport","avatar_url":"avatars/3665920.png?_=bd98dd3a778ee2d0","is_superuser":false,"is_staff":false},"post_date":1602475983,"body":"She's fucking hot"},{"id":1266822,"gallery_id":332197,"poster":{"id":1903735,"username":"Enyawud","slug":"enyawud","avatar_url":"avatars/1903735.png","is_superuser":false,"is_staff":false},"post_date":1602475591,"body":"@Sakk4ku because u horny bro that’s why we’re here xD "},{"id":1266821,"gallery_id":332197,"poster":{"id":3645361,"username":"Hornygod234","slug":"hornygod234","avatar_url":"avatars/3645361.png?_=01a2544e147ef281","is_superuser":false,"is_staff":false},"post_date":1602475546,"body":"Dam bro that shit is sad man but mc just a wimp man."},{"id":1266800,"gallery_id":332197,"poster":{"id":3724173,"username":"Sakk4ku","slug":"sakk4ku","avatar_url":"avatars/3724173.png?_=0af81aa75348d52c","is_superuser":false,"is_staff":false},"post_date":1602474844,"body":"Why am i even reading this piece of shit"},{"id":1266798,"gallery_id":332197,"poster":{"id":3343593,"username":"yeetus them fetus","slug":"yeetus-them-fetus","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602474745,"body":"damn, i know this is netorare but this shit just tragic and sad bro"},{"id":1266786,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602474384,"body":"@myaccountfornhentai sorry dude didn't mean to be aggressive..."},{"id":1266785,"gallery_id":332197,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1602474366,"body":"Art top notch no question!!!, plot is ok. He had his chance and lost it yea, but he was mature and told her i know you dating and left it at that. He is still a good friend even after the fact till her Bf gets in his face and talks mad crap to him bout her and why she skips on times they were to hang out He lost it, rightfully so, when she stop the fight and pushed kouta away and sided with her bf and he shouted he always loved her i felt bad for him. He tried to protect her honor and she choose the guy said things that should not be said and kouta blirted it out cause he would not be that shallow. Still if there is redemption i dont it will end well cause that dude packing and kouta not lmao so idk"},{"id":1266742,"gallery_id":332197,"poster":{"id":747898,"username":"ayami123","slug":"ayami123","avatar_url":"avatars/747898.png?_=cc4978cd112629f7","is_superuser":false,"is_staff":false},"post_date":1602472861,"body":"I Enjoyed the Comments for than the story\n\neven though It's actually one of the NTR with good plot :D\nHad a Beginning, Climax and Ending\n\nunlike other NTR which basically after one sex becomes a cock lover LOL"},{"id":1266707,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602471451,"body":"@jlbbmt  dude wtf the girl, I KNOW THAT SHE IS FUCKING HUNGRY FOR FUCKING LOVE, BUT HE CHOSE A FUCKING GUY THAT HE JUST MET AND SHE DOSENT EVEN FUCKING KNOW THAT THE BOYFRIEND IS FUCKING HER BRAIN OUTS TO FORGET KOUTA, AND WHY THE FUCK DID SHE EVEN CHOOSE HIM IN THE FIRST COULDN'T SHE JUST WAITED FOR HER CHILDHOOD FRIEND TO CONFESS, YOU CAN'T BLAME THE MC THAT HE KNOWS IF HE FUCKING CONFESS THEIR RELATIONSHIP MIGHT BE AWKWARD I KNOW THAT THEY ARE CLOSE BUT DUDE WHO TF WOULD KISS THEIR GIRL BESTFRIEND WHO ISN'T EVEN IN A RELATIONSHIP WITH YOU, IF HE KISSED HER WHAT WOULD'VE HAPPEN THEY WOULD BE IN A RELATIONSHIP??? DUDE IF HE KISSED HER THEIR FUCKING RELATIONSHIP WOULD BE FUCKING AWKWARD AND WHO IN THEIR RIGHT MIND THAT THEY WOULD KISS HIS/HER BESTFRIEND AND THEN AFTER THAT THEY WOULD FUCKING BE AWKWARD DUDE....."},{"id":1266672,"gallery_id":332197,"poster":{"id":1653701,"username":"megumi48","slug":"megumi48","avatar_url":"avatars/1653701.png?_=4da1d6492adae3e3","is_superuser":false,"is_staff":false},"post_date":1602470140,"body":"\"I need a full answer\"\n\"Yeah..\"\n\nGG FOR U GUYS"},{"id":1266647,"gallery_id":332197,"poster":{"id":2749598,"username":"epic video game","slug":"epic-video-game","avatar_url":"avatars/2749598.png?_=91684e76945888f3","is_superuser":false,"is_staff":false},"post_date":1602469170,"body":"Lmao, the mc is such a pussy.and his bff is such a slut, it's a win for the buff guy 😎😎😎"},{"id":1266637,"gallery_id":332197,"poster":{"id":1903735,"username":"Enyawud","slug":"enyawud","avatar_url":"avatars/1903735.png","is_superuser":false,"is_staff":false},"post_date":1602468735,"body":"I don’t know why I can’t stop thinking about this hentai. It really hits my heart that the MC is being treated this way. But if you look at both perspectives, the asshole of a guy and the MC. They both have their own justice. The MC is just trying to get back with his childhood friend but he is too late to confess his love for her and the asshole guy is just protecting his Slutty girlfriend. I have read many NTR but this one really made me go like wtf GG for MC."},{"id":1266626,"gallery_id":332197,"poster":{"id":2209434,"username":"jlbbmt10","slug":"jlbbmt10","avatar_url":"avatars/2209434.png?_=b12bc3907e8f4f42","is_superuser":false,"is_staff":false},"post_date":1602468105,"body":"LOL how is the girl a whore or slut because she’s fucking her bf? She hinted many times and even asked the dude(BFF) if he wanted to kiss her but he was a pussy. They could’ve been in a relationship 2 years ago but he was an idiot. Although she probably would of ended up cheating on him anyway because he is so slow at everything."},{"id":1266615,"gallery_id":332197,"poster":{"id":3624054,"username":"gumtoy","slug":"gumtoy","avatar_url":"avatars/3624054.png?_=ad3ee98e07cc2a9d","is_superuser":false,"is_staff":false},"post_date":1602467637,"body":"Damm ntr huh...."},{"id":1266610,"gallery_id":332197,"poster":{"id":2017242,"username":"Reverie01","slug":"reverie01","avatar_url":"avatars/2017242.png","is_superuser":false,"is_staff":false},"post_date":1602467429,"body":"Can't even feel bad. Fuck bitch niggas like him and all you pussies below. "},{"id":1266588,"gallery_id":332197,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1602465909,"body":"Nah, since this is that kind of story, all that's left is to troll some more by punishing the MC for getting with the slut together, and have that slut to keep fucking with that dude. Happy ending? Bullshit, dream on buds. That supposedly \"chapter 3\", if you read it says \"Prelude\" and has days counting on it, which means that it is just a recounting of events from the slut's perspective. I'm more pessimistic on how this one will end unlike how some of the previous commenters say that she is having 2nd doubts and shit like that. TBH, it doesn't matter what she thinks at this point, MC will be a fool to keep this relationship with the slut and a fucking dumbass for persevering. Throughout the 2 chaps, all I saw was slut sinking into pleasure, never appreciated MC. BUT NO, author will piss you off by jebaiting you first then BAM NTR, take that bitches! How's that shock value??? HAHA big praise for author."},{"id":1266571,"gallery_id":332197,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1602465180,"body":"Guys this isn't going to end happy at all and if it does well then it's a lie. If she dumps her boyfriend and goes with the mc sashes only going to be thinking about the asshole and then she'll end up fucking him again so what's the point. "},{"id":1266553,"gallery_id":332197,"poster":{"id":3429361,"username":"completedegeneracy","slug":"completedegeneracy","avatar_url":"avatars/3429361.png?_=dee240670b3b79ef","is_superuser":false,"is_staff":false},"post_date":1602464075,"body":"it is what it is"},{"id":1266547,"gallery_id":332197,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602463753,"body":"@playboi carti Because, idiot, they have always been friends. You've never been friends with the opposite sex, have you? You're one of those \"nice guys\" who only become friends with a member of the opposite sex to get in their pants. Not everyone is a disgusting waste of genetic material like you."},{"id":1266502,"gallery_id":332197,"poster":{"id":3364290,"username":"Akip0y0","slug":"akip0y0","avatar_url":"avatars/3364290.png?_=61eb2f0fa029664b","is_superuser":false,"is_staff":false},"post_date":1602461813,"body":"That was so nice."},{"id":1266496,"gallery_id":332197,"poster":{"id":2492878,"username":"weidenfeller","slug":"weidenfeller","avatar_url":"avatars/2492878.png?_=974e29a10785b192","is_superuser":false,"is_staff":false},"post_date":1602461653,"body":"I didn't get why you guys complaining, the title says it all. First come first served. That's it"},{"id":1266473,"gallery_id":332197,"poster":{"id":2387356,"username":"I ♡ Zonda","slug":"i-zonda","avatar_url":"avatars/2387356.png?_=97ae4640b559f746","is_superuser":false,"is_staff":false},"post_date":1602460703,"body":"Oh look... another cuck pussy. How generic."},{"id":1266432,"gallery_id":332197,"poster":{"id":2843660,"username":"Only Pedos like shota","slug":"only-pedos-like-shota","avatar_url":"avatars/2843660.png?_=cc0c6b8dec4f6dfd","is_superuser":false,"is_staff":false},"post_date":1602458422,"body":"Trust no bitches "},{"id":1266394,"gallery_id":332197,"poster":{"id":2466299,"username":"Fear Itself","slug":"fear-itself","avatar_url":"avatars/2466299.png","is_superuser":false,"is_staff":false},"post_date":1602456668,"body":"Where is part 3 also this shit is good the scenes were top notch might be in nexus with such quality"},{"id":1266385,"gallery_id":332197,"poster":{"id":3611308,"username":"KongDonkey","slug":"kongdonkey","avatar_url":"avatars/3611308.png?_=46d7db44c510725e","is_superuser":false,"is_staff":false},"post_date":1602456340,"body":"Someone realized that the big guy looks like the Sigma villain from the game Megaman X Lol"},{"id":1266383,"gallery_id":332197,"poster":{"id":3723514,"username":"HisokaBallsDeep","slug":"hisokaballsdeep","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602456303,"body":"@tobajas\n\nAgree, she gone mayne she goooneeee. \nWouldn't be surprised in the next chapter the BF fucks her with open curtains and showing it to MC. lol "},{"id":1266381,"gallery_id":332197,"poster":{"id":3341907,"username":"HornyHammer","slug":"hornyhammer","avatar_url":"avatars/3341907.png?_=59285d3d35baf9e3","is_superuser":false,"is_staff":false},"post_date":1602456192,"body":"If you read part 3 you'll see that the plumber guy is very insecure about how the FMC still feels towards the MC,maybe this could go a different route but we'll wait a few weeks for more works from the author I guess "},{"id":1266376,"gallery_id":332197,"poster":{"id":3349469,"username":"playboi carti","slug":"playboi-carti","avatar_url":"avatars/3349469.png?_=736e01a4bcdc2fce","is_superuser":false,"is_staff":false},"post_date":1602455910,"body":"this guy is braindead lmao even after he’s been cucked he is still gonna be friends with her like wtf kinda logic is that "},{"id":1266370,"gallery_id":332197,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602455680,"body":"@HisokaBallsDeep I'd still call this NTR since the first guy shown is the childhood friend so she was \"stolen\" from him thus it's NTR especially when were shown thata there was and pretty much is love between them, it's just that he for some reason couldn't say he liked her which pissed her of and then he doesn't do shit for almost 2 years until another guy actually asks her out and honestly with the title firts come first served it's almost a given that it will end with her and the bf being together. Since it kinda feels like the title is saying first dude who got to fuck her gets to keep fucking her."},{"id":1266366,"gallery_id":332197,"poster":{"id":754385,"username":"MeniLTere","slug":"meniltere","avatar_url":"avatars/754385.png","is_superuser":false,"is_staff":false},"post_date":1602455561,"body":"man didnt confess to her for 10 years stop bitching dude wtf"},{"id":1266355,"gallery_id":332197,"poster":{"id":3723514,"username":"HisokaBallsDeep","slug":"hisokaballsdeep","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602455090,"body":"Continuing from my long post of ehentai comment, it got cut off. \n\nBF tells him not to cheat blah blah, and she reply's blah blah,  which he(BF) calls her a liar in his mind and that he needs to find a way to get rid of her bestfriend. "},{"id":1266346,"gallery_id":332197,"poster":{"id":3723514,"username":"HisokaBallsDeep","slug":"hisokaballsdeep","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602454927,"body":"@Player_D\n\nnext chapter (not translated) https://nhentai.net/g/330962/35/"},{"id":1266341,"gallery_id":332197,"poster":{"id":3723514,"username":"HisokaBallsDeep","slug":"hisokaballsdeep","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602454799,"body":"Got this from a comment on ehentai about part 3:\nThe final 3 pages take place after the previous chapter. Tatsuya is bragging with a friend of his about how he stole Akina from Kouta, with Akina clearly uncomfortable talking about it. Eventually, Tatsuya's friend asks if he'll get the chance to fuck Akina, since Tatsuya let that happen to his last girlfriend.\n\nAfter apologizing (and knocking out the friend), Akina asks if that was true. Tatsuya admits that it was, saying his previous girlfriend had cheated on him so he lost feelings for her"},{"id":1266328,"gallery_id":332197,"poster":{"id":3205140,"username":"Player_D","slug":"player_d","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602454185,"body":"@HisokaBallsDeep where did you read part 3?"},{"id":1266324,"gallery_id":332197,"poster":{"id":3723514,"username":"HisokaBallsDeep","slug":"hisokaballsdeep","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602454007,"body":"Damnn read part 3 too. BF is definitely jealous, and honestly it ain't a NTR. Like the title says, this shit happens in real world. If BF didn't stick around she probably completed fallen for the BF, but the jealousy of the BF is already making her feel some type of way. The REAL NTR is when the best friend comes and fucks her away from the BF. lol \nSeen to many shit like this, a.) MC ain't getting that happy ending or b.) She loves him and they date but fucks with plumber for good sex. lol\n"},{"id":1266321,"gallery_id":332197,"poster":{"id":3337748,"username":"SuCCulent","slug":"succulent","avatar_url":"avatars/3337748.png?_=c42a7c06bc97ce1a","is_superuser":false,"is_staff":false},"post_date":1602453812,"body":"Accept that she's fucking someone else and move on. If you cling on, you're just getting yourself cucked. "},{"id":1266304,"gallery_id":332197,"poster":{"id":2214825,"username":"GODDAMN eye penetration","slug":"goddamn-eye-penetration","avatar_url":"avatars/2214825.png?_=7f89b2c1791d01f9","is_superuser":false,"is_staff":false},"post_date":1602453126,"body":"If this gets a chapter 3, I don't know anymore"},{"id":1266302,"gallery_id":332197,"poster":{"id":3723492,"username":"Logf","slug":"logf","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602453030,"body":"Yall overthink this too much. Stop self inserting as the mc and just fap to the attractive drawing. Remember that this is porn, it's not supposed to be realistic"},{"id":1266282,"gallery_id":332197,"poster":{"id":3722997,"username":"pettam2.q","slug":"pettam2-q","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602451888,"body":"The mc has moved on but he girl hasnt. From the very first chapter he let her go knowing he wouldnt get her but hes still is her friend which i respect cause that takes balls to do, shes not really over the mc perse shes telling herself that she loves the other guy which she doesnt imo even in some panels looking like shes having second thoughts. she like the sex bf gives not the individual himself and even then shes not totally in him, hes constantly pissed throughout the series cause he knows the girl still likes the mc even trying go the original dick dowm method and shes shown still texting the friend post sex, i kinda felt bad for the guy he shoot his shot he may be kind of a dick and only sees her as a possesion which i think the girl realises to some degree but he still played somewhat fair in getting her."},{"id":1266227,"gallery_id":332197,"poster":{"id":3723380,"username":"Dark101","slug":"dark101","avatar_url":"avatars/3723380.png?_=586b54893d6f77dd","is_superuser":false,"is_staff":false},"post_date":1602449731,"body":"this is full of shit. it just doesn't make any sense.\n\nthe mc is just a friend ain't he? and the dude fucking the fl is her boyfriend ain't he? then ain't the dude entitled to fuck her? zzz... "},{"id":1266213,"gallery_id":332197,"poster":{"id":1568108,"username":"Demon Usamaro","slug":"demon-usamaro","avatar_url":"avatars/1568108.png?_=7b801144a6c4fe37","is_superuser":false,"is_staff":false},"post_date":1602449126,"body":"When these artist make ntr, do the realize how the human mind works? Like most of these \"ntr/cuck\" books are far from what the human mind normally does in this situation, this is basically an acting from a porno. Like how can you make one characters mind set be average, but the others is rare, i'd find ntr fine, but it's so humanly inaccurate, it's ridiculous!   "},{"id":1266210,"gallery_id":332197,"poster":{"id":3602099,"username":"Djilali","slug":"djilali","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602449018,"body":"Dude if you can't move on, you have to ruin their lifes ,spread rumors, fake accusation, ruin their image, I know that seems bad but you will  feel peace only by following this way"},{"id":1266181,"gallery_id":332197,"poster":{"id":3421356,"username":"NezNezNumeros","slug":"nezneznumeros","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602447786,"body":"Damn. This is sad. I feel bad for the both of them. They both missed their chance to be a couple. I was kinda hoping the story will have happy ending where they still end up with each other, but it's rare for NTR to have that. Anyway, this is a good story. Love the writing. Good pacing too."},{"id":1266178,"gallery_id":332197,"poster":{"id":2132301,"username":"Cube210","slug":"cube210","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602447667,"body":"Not even NTR. Dude was a beta and didn't show interest, she moved on."},{"id":1266158,"gallery_id":332197,"poster":{"id":3114234,"username":"zenn114","slug":"zenn114","avatar_url":"avatars/3114234.png?_=568a7a4340085172","is_superuser":false,"is_staff":false},"post_date":1602446827,"body":"hahh i thought this doujin will become a vanilla one but that woman is just a cock"},{"id":1266121,"gallery_id":332197,"poster":{"id":182421,"username":"NeinNeinNein","slug":"neinneinnein","avatar_url":"avatars/182421.png?_=a11f5e1310ecbf9b","is_superuser":false,"is_staff":false},"post_date":1602445095,"body":"Kek, dense ass shit got his just desert for being stupid. What a moron."},{"id":1266099,"gallery_id":332197,"poster":{"id":1299331,"username":"alonerone","slug":"alonerone","avatar_url":"avatars/1299331.png","is_superuser":false,"is_staff":false},"post_date":1602444474,"body":"Pfft that bitch just like big cocks. Fcking slut!"},{"id":1266048,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602442235,"body":"itraito dude..... don't worry you didn't miss anything.... don't worry dude >:DDD"},{"id":1266046,"gallery_id":332197,"poster":{"id":3720993,"username":"itraito","slug":"itraito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602442155,"body":"Maybe i missed something but i don't understand why everyone is treating her a whore. MC had all his chance, she made it quite clear she was into him but he didn't respond. She went with the other guy but you can see by the end that she still loves MC and I don't quite understand why she stayed with the old guy but this isn't because of his dick. On the last page it is show that she's thinking about MC."},{"id":1266036,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602441808,"body":"hitormiss22 right dude who would have friends with a whore like that dude I would've said \"what? you think im friends with you? me friends with a whore? you have fucking bf an old man\" that's what I could've said to her cause Im so fucking angry If I found out that she were doing that..."},{"id":1266026,"gallery_id":332197,"poster":{"id":3341907,"username":"HornyHammer","slug":"hornyhammer","avatar_url":"avatars/3341907.png?_=59285d3d35baf9e3","is_superuser":false,"is_staff":false},"post_date":1602441401,"body":"Wew some good shit after quite awhile,plot made sense and art was 8/10.Tbh the MC had alot of chances to hit at her as you can see he was apparently popular and even had the physical strength to hold the other dude by his collar.Tho how the girl and the other dude met made no sense,they were only good together when they had sex and no chemistry at all so she'll regret her life choices sooner or later and get hit by karma."},{"id":1266010,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602440665,"body":"pettam2.q ikr the abusive bf is dicking her brain out so she can forget about the childhood friend and love him instead so he treated her as a tool not a person but still I know that I dont feel any sympathy for her but I still hope the MC saves the girl..."},{"id":1266006,"gallery_id":332197,"poster":{"id":2243747,"username":"hitormiss21","slug":"hitormiss21","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602440481,"body":"Bro. I wouldnt even stay friends with her after that. Since the person i have a crush on is getting pounded by another person, im not gonna fuck with that. Unless they somehow make it a happy ending, i’ll take back what i said"},{"id":1265998,"gallery_id":332197,"poster":{"id":3212969,"username":"poif","slug":"poif","avatar_url":"avatars/3212969.png?_=cbe7f37fa777ae6e","is_superuser":false,"is_staff":false},"post_date":1602440235,"body":"to everyone who is stressed out by this, here's something that might help: https://m.youtube.com/watch?v=GJDNkVDGM_s"},{"id":1265992,"gallery_id":332197,"poster":{"id":846732,"username":"AIMED55","slug":"aimed55","avatar_url":"avatars/846732.png?_=8ebefd69ec31bf08","is_superuser":false,"is_staff":false},"post_date":1602440061,"body":"My soul cant handle this... Ugh.."},{"id":1265987,"gallery_id":332197,"poster":{"id":3722997,"username":"pettam2.q","slug":"pettam2-q","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602439899,"body":"Kiluaa i think she thinks hes jelous and im syre you have ween her reactions post sex the bf pissed that she still comunicates with the friend. Shes trying her best to love the bf but is as is shown is having second thoughts even BEFORE the confession. The bf sees shes not fully into and is desperate to get that affection from her."},{"id":1265985,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602439834,"body":"FresshLikeLettuce this where you read the next chapter (not translated)\n\nhttps://nhentai.net/g/330962/35/"},{"id":1265983,"gallery_id":332197,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602439765,"body":"Yeah well there will be at least 4 chapters for this but at the moment from ch 1-3 she is pretty obviously in love with the childhood friend and only hooked up with the guy because he hit on her and the sex is good. The bf is planning some stuff by the end of ch 3 and the story can pretty much a couple of ways but I am pretty sure the ending will most likely be something along the lines of. A) the bf let's the two have sex but the childhood friend turns out to have a tiny dick or since he's always been in love with the girl being a virgin he will suck at sex. B) ch 3 kind of gives the feelings that the bf will do something like drug her or fuck her like crazy to make her break and become his slut or C) either the girl and childhood friend ends up together or they get together but she keeps sleeping with this dude."},{"id":1265982,"gallery_id":332197,"poster":{"id":3056431,"username":"its God","slug":"its-god","avatar_url":"avatars/3056431.png?_=e7c158ec7667ae15","is_superuser":false,"is_staff":false},"post_date":1602439754,"body":"I mean shes a whore so being her \"good friend\" is the best possible choice "},{"id":1265977,"gallery_id":332197,"poster":{"id":3722997,"username":"pettam2.q","slug":"pettam2-q","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602439665,"body":"AimeD55 i agree on that as well, hes not really in love with her aswell only thing is that he does not want to lose the friend she has. I think she picks up tje fact that he treating her as a possesion not a person and which also imo increases her uneasiness with him."},{"id":1265976,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602439650,"body":"pettam2.q right dude?? so if he still like her friend why dont she just fucking leave that guy... but I know it wont be easy cuz well her pussy took shape of that guy's dick... but then when his friend fought the BF why did she push her fucking friend instead of her BF and even give her BF a FUCKING SECOND CHANCE dude that means that the fucking girl is a fucking W-H-O-R-E and I fucking don't even feel sympathetic for the girl cuz that's the path she choose dude, and who is in their right mind that she still choose the guy that is abusing and manipulating her instead of the gentle good looking popular guy....."},{"id":1265972,"gallery_id":332197,"poster":{"id":3722997,"username":"pettam2.q","slug":"pettam2-q","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602439427,"body":"Continuation. if u pay aattention to her reactions to her during sex shes obvi not really into it that much even not giving him answers obvi looking into her own decisions and to the fact that the guy shes liked finaly confessed to her after all this time also ive seen people call the friend an idiot. hes respected her decisions and chooses to remain as her friend until the end hes not approaching her like he used to imo this series now going to go for how long the bf will try to keep his girl from her friend. She still think about the mc througout all three chapter and its shown that the bf is desperatly trying to win her afrection."},{"id":1265968,"gallery_id":332197,"poster":{"id":1038397,"username":"Sir Dragon","slug":"sir-dragon","avatar_url":"avatars/1038397.png","is_superuser":false,"is_staff":false},"post_date":1602439337,"body":"Friendship with decent Person over. \nPenis is now my best friend."},{"id":1265966,"gallery_id":332197,"poster":{"id":3723061,"username":"Grettle011","slug":"grettle011","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602439301,"body":"CHAPTER 3 ? WHEN?"},{"id":1265963,"gallery_id":332197,"poster":{"id":846732,"username":"AIMED55","slug":"aimed55","avatar_url":"avatars/846732.png?_=8ebefd69ec31bf08","is_superuser":false,"is_staff":false},"post_date":1602439290,"body":"pettam2.q, \"BF\" is just using her as a cum dumpster and pretending to have \"feelings\" for her!"},{"id":1265960,"gallery_id":332197,"poster":{"id":477004,"username":"FresshLikeLettuce","slug":"fresshlikelettuce","avatar_url":"avatars/477004.png","is_superuser":false,"is_staff":false},"post_date":1602439150,"body":"lol trash shit,not material for a fap but well was a good read  while i wait for another series"},{"id":1265953,"gallery_id":332197,"poster":{"id":3722997,"username":"pettam2.q","slug":"pettam2-q","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602438985,"body":"Kilua i agree bro, ive made another mistake if u pay attention the bf is trying his fucking hardest to take her but cant, its obvious that she loves the friend cause she cant stop thinking about him even still texts him the bf must feel like shit if u think about it from his perspective bro hes not really winning. Yes he mave have gotten her first but its obvious that the girl still likes the friend shes just telling herself that she doesnt,and the bf sees this in the first chap she still thinks about the friend even after sex she texts the friend aswell kinda feel bad for the chad. She doesnt really LOVE the guy perse but she enjoys the sex but not to the point where shes mind is in her crotch she still thinks about the friend even in the next chap she hangs out with the friend to a festival and, the bf gets jelous again and trys to dick her down again its a cycle hes not winning at all hes obvi desperate for her love and isnt even getting it fully."},{"id":1265926,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602438102,"body":"dude.... damn....... fucking water is in my eyes its not fucking stopping dude why the fuck did she fucking like that guy dude why.... fucking waters in my eyes not stopping, pettam2.q I know dude but WHY TF DID SHE DATE HIM IN THE FIRST PLACE I KNOW THAT SHE'S FUCKING HUNGRY FOR LOVE BUT WHY TF A GUY LIKE HIM MAKING HER FORGET ABOUT THE CHILDHOOD FRIEND IT WHY DIDN'T SHE JUST WAIT AND NOW SHE'S  HAVING SECOND THOUGHT??? DUDE WTF???"},{"id":1265913,"gallery_id":332197,"poster":{"id":846732,"username":"AIMED55","slug":"aimed55","avatar_url":"avatars/846732.png?_=8ebefd69ec31bf08","is_superuser":false,"is_staff":false},"post_date":1602437768,"body":"ugh.. now im all depressed n shit.."},{"id":1265912,"gallery_id":332197,"poster":{"id":3722997,"username":"pettam2.q","slug":"pettam2-q","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602437756,"body":"Tbh, i read the last untranslated part 3 so far and, shes obviously starting to have second thoughts as of what it would seem like even in the second to last page in this chap u see her starting to look unsure. Anyway she is thinking about the childhood friend alot also ive noticed that her \"BF\" is trying to make her forget about the childhood friend at all costs even getting upset that shes possible mentioning so hes trying to dick her down which isnt really working out too in his favor either so this story could go either way imo its not really ntr as of yet since shes not fully taken over by the chad aswell even lookin like shes tired of him in some panels in the next chap."},{"id":1265895,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602437397,"body":"AIMED55 right the girls a fucking whore can't even have a single sympathy for her MC should say \"you're my childhood friend? my childhood friend isn't a fucking whore\""},{"id":1265883,"gallery_id":332197,"poster":{"id":846732,"username":"AIMED55","slug":"aimed55","avatar_url":"avatars/846732.png?_=8ebefd69ec31bf08","is_superuser":false,"is_staff":false},"post_date":1602436996,"body":"Kiluaaaa, oh i read the next chapter.. just made it worse.."},{"id":1265876,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602436848,"body":"AIMED55 COULDN'T AGREE WITH YOU MORE DUDE SHE'S A FUCKING WHORE WAIT UNTIL YOU READ THE NEXT CHAPTER DUDE"},{"id":1265873,"gallery_id":332197,"poster":{"id":846732,"username":"AIMED55","slug":"aimed55","avatar_url":"avatars/846732.png?_=8ebefd69ec31bf08","is_superuser":false,"is_staff":false},"post_date":1602436751,"body":"dumbass bitch and whore!!"},{"id":1265871,"gallery_id":332197,"poster":{"id":3722959,"username":"DarkLul","slug":"darklul","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602436707,"body":"Lmao Im actually rooting for the MC on this one bc this seems like a very abusive relationship. Like the dude doesnt seem to want her to even have friends"},{"id":1265859,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602436243,"body":"https://nhentai.net/g/330962/35/  \n\nbtw thats where I read the next chapter without translations..."},{"id":1265858,"gallery_id":332197,"poster":{"id":2181037,"username":"otomono","slug":"otomono","avatar_url":"avatars/2181037.png","is_superuser":false,"is_staff":false},"post_date":1602436226,"body":"meh story even for its genre"},{"id":1265853,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602436118,"body":"Tf, when I read the next chapter without the translations, dude I dont know anymore but now I fucking know that shes a fucking whore"},{"id":1265849,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602435976,"body":"Oh damn sorry I said she was a whore but Im wrong about that I was just so mad that I called her a whore TT"},{"id":1265848,"gallery_id":332197,"poster":{"id":633658,"username":"GreenLemon","slug":"greenlemon","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602435907,"body":"wouldnt say shes a whore.. just desperate for love and attention that she goes for the first person to make a move on her.. which just happens to be an asshole\n\nguy should just move on, girl will eventually come to him"},{"id":1265845,"gallery_id":332197,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1602435793,"body":"what a whore, but damn I hope the mc would have a development but then again this is not manhwa tho but I still hope it does that, and I can't blame the fmc coz he hasn't even made a move on her that why she became a whore"},{"id":1265839,"gallery_id":332197,"poster":{"id":1754783,"username":"tasos1","slug":"tasos1","avatar_url":"avatars/1754783.png?_=b1002fc785e43d71","is_superuser":false,"is_staff":false},"post_date":1602435475,"body":"For this girl the end will be ugly and addictive to illegal substances."},{"id":1265834,"gallery_id":332197,"poster":{"id":3480604,"username":"itsuka_hiori","slug":"itsuka_hiori","avatar_url":"avatars/3480604.png?_=5c9754c24c8f37c0","is_superuser":false,"is_staff":false},"post_date":1602435351,"body":"I am depressed as hell :,("},{"id":1265829,"gallery_id":332197,"poster":{"id":3509230,"username":"Irredeemable","slug":"irredeemable","avatar_url":"avatars/3509230.png?_=be88fd8b2827ac7f","is_superuser":false,"is_staff":false},"post_date":1602435261,"body":"Yup still depressed"},{"id":1265822,"gallery_id":332197,"poster":{"id":3353232,"username":"minecrafthentai69","slug":"minecrafthentai69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602435094,"body":"You’re a fucking dumbass for not making a move on her and you’re a fucking pussy for not moving on. Deserved."},{"id":1265798,"gallery_id":332197,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602434454,"body":"But the title kinda says the point, The MC should have made a move on her when he had the chance instead of just joking around doing nothing"},{"id":1265795,"gallery_id":332197,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1602434421,"body":"Right now is a shit tier NTR but if we get next chapter it might changing it. MC was just stupid as typical NTR but it seem like he have some fight. Maybe not completely but girl just retard as always. Been a while since we get decent story NTR but the action of the character just doesn't fit considered the how story was build and personality of character.  "},{"id":1265779,"gallery_id":332197,"poster":{"id":2302446,"username":"cottonm","slug":"cottonm","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602434055,"body":"Yup still sad with a boner"},{"id":1265733,"gallery_id":332197,"poster":{"id":3310993,"username":"Suck my Dick","slug":"suck-my-dick","avatar_url":"avatars/3310993.png?_=1ebf8cdcd9301ad6","is_superuser":false,"is_staff":false},"post_date":1602432434,"body":"I want the next chapter\n"},{"id":1265730,"gallery_id":332197,"poster":{"id":2009875,"username":"Sbeveman","slug":"sbeveman","avatar_url":"avatars/2009875.png","is_superuser":false,"is_staff":false},"post_date":1602432239,"body":"Leave that bitch bruh go find someone else"},{"id":1265726,"gallery_id":332197,"poster":{"id":3398205,"username":"Destroyedyourmom","slug":"destroyedyourmom","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602432191,"body":"This is sad and depressing because she  chose a fucking asshole who only sees her as a onahole and she's going to quit school and abandoned her future just to become this guys personal onahole \n"},{"id":1265720,"gallery_id":332197,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602431952,"body":"look MC she with another man so just give up and find someone else brah."},{"id":1265718,"gallery_id":332197,"poster":{"id":3506752,"username":"SourCat","slug":"sourcat","avatar_url":"avatars/3506752.png?_=1d07ec63b24725e3","is_superuser":false,"is_staff":false},"post_date":1602431946,"body":"@naniiiii the girl is starting to having doubts now. now that the plumber treated her as toy only.\n"},{"id":1265717,"gallery_id":332197,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1602431931,"body":"So I read the next part the comment gave and holy shit. I don't really care about the NTR part, even if he didn't end up with the girl at least I want to see him save her as her closest friend. I shouldn't get my hopes up though since NTR rarely has a happy end."},{"id":1265704,"gallery_id":332197,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602431692,"body":"just move the fuck on man "},{"id":1265694,"gallery_id":332197,"poster":{"id":1374724,"username":"naniiiii","slug":"naniiiii","avatar_url":"avatars/1374724.png","is_superuser":false,"is_staff":false},"post_date":1602431316,"body":"Next part, no translation https://nhentai.net/g/330962/35/"},{"id":1265689,"gallery_id":332197,"poster":{"id":2463041,"username":"Ntr-scum","slug":"ntr-scum","avatar_url":"avatars/2463041.png","is_superuser":false,"is_staff":false},"post_date":1602431210,"body":"This is one of the ntr doujins where I see vanilla and ntr fans somehow agreeing"},{"id":1265685,"gallery_id":332197,"poster":{"id":3205140,"username":"Player_D","slug":"player_d","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602431061,"body":"Is there gonna be another part?"},{"id":1265684,"gallery_id":332197,"poster":{"id":2556901,"username":"FunnyFear","slug":"funnyfear","avatar_url":"avatars/2556901.png?_=2b8cff737924837b","is_superuser":false,"is_staff":false},"post_date":1602430998,"body":"Very cool NTR, I wonder what will happen next. Maybe MC will fight back and take the girl."},{"id":1265681,"gallery_id":332197,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1602430869,"body":"Is that all? No more chapter?"},{"id":1265680,"gallery_id":332197,"poster":{"id":2360097,"username":"I hast come","slug":"i-hast-come","avatar_url":"avatars/2360097.png?_=1b27924d795e9e78","is_superuser":false,"is_staff":false},"post_date":1602430857,"body":"We all want the mc to be a chad, get life and flex it"},{"id":1265662,"gallery_id":332197,"poster":{"id":2519656,"username":"SadadErlangga","slug":"sadaderlangga","avatar_url":"avatars/2519656.png?_=6cbede91b284f2a6","is_superuser":false,"is_staff":false},"post_date":1602430107,"body":"Tbh, this is good for the MC. He just dodge a Thot, now he could find another girl who doesn't judge male by its dick. It's better for him tbh, she got taken before you guys date or get married"},{"id":1265658,"gallery_id":332197,"poster":{"id":3363960,"username":"Schrodinger dick","slug":"schrodinger-dick","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602430071,"body":"Im not an NTR lover but this one really makes sense. 1. The MC is too slow, could possibly avoid this thing to happen if he confessed already. 2. its actually a minor loss to the MC, well.. she is a slutty bitch which means even though he confessed and they have a releationship, she will still adicted to a big cock. 3. Lesson for you guys : dont take your childhood friend releationship seriously. "},{"id":1265637,"gallery_id":332197,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1602429452,"body":"Not bad, not bad at all. One of the better NTRs, true to the meaning of the title \"First Come, First Served.\" But then, this is actually good for MC, he dodged a thot. Even if he confessed way before, this thot would've eventually NTR'd him anyways. Thots will always be thots."},{"id":1265635,"gallery_id":332197,"poster":{"id":3611308,"username":"KongDonkey","slug":"kongdonkey","avatar_url":"avatars/3611308.png?_=46d7db44c510725e","is_superuser":false,"is_staff":false},"post_date":1602429372,"body":"There is a prologue that has not yet been translated, and Dramus is doing the part that he says is the heroine’s vision, he had commented on twitter that this edtion  has rape, so that’s how she got “in love” with the big guy"},{"id":1265627,"gallery_id":332197,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1602429277,"body":"MC dodged a bullet here girls a slut better now then when they're married and she burns the coal behind his back."},{"id":1265625,"gallery_id":332197,"poster":{"id":853901,"username":"NTR is love and life","slug":"ntr-is-love-and-life","avatar_url":"avatars/853901.png?_=a96a0a928ea38991","is_superuser":false,"is_staff":false},"post_date":1602429247,"body":"Very niceee, NTR with thicc girl and big guy and big dick.  No fuckin disgusting shota and shotacon shit"},{"id":1265620,"gallery_id":332197,"poster":{"id":1384986,"username":"donaldgx","slug":"donaldgx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602429184,"body":"needs part 3 where mc fks a chick he meets in uni with vanilla end, and a cameo of this Akina chick raising 2 kids alone after plumber dumped her"},{"id":1265619,"gallery_id":332197,"poster":{"id":3360227,"username":"Maboooyy","slug":"maboooyy","avatar_url":"avatars/3360227.png?_=fc67579eb26f600c","is_superuser":false,"is_staff":false},"post_date":1602429158,"body":"Man i wish there some comic story like this but mc take back his girlfriend who got ntr and got happy ending"},{"id":1265613,"gallery_id":332197,"poster":{"id":1553070,"username":"Rigiro","slug":"rigiro","avatar_url":"avatars/1553070.png?_=0b6884c2c5d38477","is_superuser":false,"is_staff":false},"post_date":1602429013,"body":"Good shit to Fap to. But not something to reflect on. Men, take a red pill and fo your own way. Dick size dont matter if you ain't sticking it in pussy. Dont be simps, and if you feel like you're being friendzoned, move on from the bitch or just dont have female friends."},{"id":1265592,"gallery_id":332197,"poster":{"id":2772711,"username":"SeeYouInHell","slug":"seeyouinhell","avatar_url":"avatars/2772711.png","is_superuser":false,"is_staff":false},"post_date":1602428541,"body":"642. MC didn't make a move for the longest time. Then again he did uppercut that mofo. Hope he'll move on from this. "},{"id":1265575,"gallery_id":332197,"poster":{"id":3506752,"username":"SourCat","slug":"sourcat","avatar_url":"avatars/3506752.png?_=1d07ec63b24725e3","is_superuser":false,"is_staff":false},"post_date":1602428095,"body":"i'm hate NTR but this is probably the lightest story i've ever read all the way to this chap. probably its because its just a minor loss to MC. i'm sure that girl's choice will be the biggest regret of her life. its obvious that plumber will dump her after she gets pregnant."},{"id":1265570,"gallery_id":332197,"poster":{"id":1337080,"username":"TrickstaBoy","slug":"trickstaboy","avatar_url":"avatars/1337080.png?_=93b49d0b44cc933c","is_superuser":false,"is_staff":false},"post_date":1602427966,"body":"Whip and nae nae"},{"id":1265539,"gallery_id":332197,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1602427273,"body":"@NovaX Agreed. Dude was a plumber/bathroom fixer? Close to her age? (Hopefully she is 18). No College for sure, and going straight to sex in 3 months means going straight to child in 3 months or straight to break up in 3 months. Though judging by the MC outwardly denying his relationship even though girl too initiative, he's a fucking idiot. Overall, this is mostly on him cause he refused to give his girl some loving when she needed it."},{"id":1265528,"gallery_id":332197,"poster":{"id":3484377,"username":"funklink3","slug":"funklink3","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602427006,"body":"@NovaX hell yeah definitely, one of the probable regrettable path in which she chose to do so."},{"id":1265512,"gallery_id":332197,"poster":{"id":3641910,"username":"NovaX","slug":"novax","avatar_url":"avatars/3641910.png?_=1867ce9d1f3e53c5","is_superuser":false,"is_staff":false},"post_date":1602426457,"body":"Also that girl has bad choice of men. That guy is going to be your typical Abusive Drunkard Husband i guarantee it. Either that or someone who leaves her with a child. \n\nshe's gonna get pregnant even before college which would make it even worse for her. Very bad choice of life.\n"},{"id":1265511,"gallery_id":332197,"poster":{"id":278798,"username":"metroidman22000","slug":"metroidman22000","avatar_url":"avatars/278798.png?_=c0f8323065ad459a","is_superuser":false,"is_staff":false},"post_date":1602426448,"body":"I really wanted to see Kouta mess that asshole up. Sucks, that he chose to be the bigger man. "},{"id":1265509,"gallery_id":332197,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1602426357,"body":"10 years of not doing anything is all on MC."},{"id":1265506,"gallery_id":332197,"poster":{"id":3641910,"username":"NovaX","slug":"novax","avatar_url":"avatars/3641910.png?_=1867ce9d1f3e53c5","is_superuser":false,"is_staff":false},"post_date":1602426257,"body":"Its Not even the ntr that's the problem its because of mc's Cowardice. Just forget about her and move on there's plenty of fish in the sea. \n\n"},{"id":1265496,"gallery_id":332197,"poster":{"id":1912654,"username":"Filthy Talon","slug":"filthy-talon","avatar_url":"avatars/1912654.png","is_superuser":false,"is_staff":false},"post_date":1602426014,"body":"Man Is a disgusting NTR, and the MC has such a bad development, but this artstyle it's fucking awesome."},{"id":1265495,"gallery_id":332197,"poster":{"id":933417,"username":"fazerlazor","slug":"fazerlazor","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602425969,"body":"That guy is gonna pump and dump her till hes done with her.  Move on, if she comes back shell be used goods, especially how this guy is riding her.\n\n"},{"id":1265489,"gallery_id":332197,"poster":{"id":2079458,"username":"realme5","slug":"realme5","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602425855,"body":"I love this fucking NTR so much, just a suggestion the MC is actually can turn such a event or scenario in this story since he is physically buff up & can showing aggressive response to the Alpha guy also perhaps he can be villain too. if thats happen it will have 1/2 additional chapters for him. he just needs a friend of encouragement / motivation to do it all. Overall this NTR get 8.5/10 from me."},{"id":1265474,"gallery_id":332197,"poster":{"id":3001957,"username":"Flatron","slug":"flatron","avatar_url":"avatars/3001957.png","is_superuser":false,"is_staff":false},"post_date":1602425509,"body":"Mf missed the train so y'all better stop acting like he's a cuck you relate to, this has to be an exemple for y'all, dont wait for a girl, go get her, and don't call her a slut or sum if someone get her before you, unless you're fat ugly hairy smelly and uninteresting and difficult to talk to most girls won't refuse at least talking with you and if the enjoy it, they might even accept a date, but.jerking off to your cartoon is cool too I guess "},{"id":1265470,"gallery_id":332197,"poster":{"id":3484377,"username":"funklink3","slug":"funklink3","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602425415,"body":"a decent ending for the MC at least, after she agreed to live him who is only after her for her body, it's safe to assume she's definitely gonna be in the streets doing prostitution in a couple years."},{"id":1265452,"gallery_id":332197,"poster":{"id":1666533,"username":"rAnDom","slug":"random","avatar_url":"avatars/1666533.png?_=3b5219c5cf9d5118","is_superuser":false,"is_staff":false},"post_date":1602425038,"body":"@Release i would have loved it if it happened. - - - Does anyone know it the story ended here? Does it say \"to be continued\" on Japanese in the bottom left corner of the last page? I am really interested where this story will go. It isn't badly written like most ntr (per my standards and taste which i must admit are quite weird and don't make much sense). Because the story could take an interesting turn. Divert from standard ntr."},{"id":1265446,"gallery_id":332197,"poster":{"id":2833215,"username":"7Star","slug":"7star","avatar_url":"avatars/2833215.png?_=0ab631f153c863df","is_superuser":false,"is_staff":false},"post_date":1602424765,"body":"Such a bad ending...in the end he's the lowest of the low... Even after all that he's gonna cling to her...\nIt would have been better of he were to beat him up."},{"id":1265443,"gallery_id":332197,"poster":{"id":949151,"username":"Release","slug":"release","avatar_url":"avatars/949151.png","is_superuser":false,"is_staff":false},"post_date":1602424683,"body":"Thought the MC was about to beat the ugly dude, shit would have been hilarious."},{"id":1265428,"gallery_id":332197,"poster":{"id":3598204,"username":"InternetReviewer","slug":"internetreviewer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1602424205,"body":"Very fucked story, Mc aint much of a bitch, Has a undying love syndrome, great art, cannot fap to this regardless, this story just makes you feel horrible overall.\n\nI would say if you like ntr then its a 9/10 \nIf you hate ntr 2/10 "},{"id":1265423,"gallery_id":332197,"poster":{"id":3648645,"username":"pankī","slug":"panki","avatar_url":"avatars/3648645.png?_=bc9c5a9d17279478","is_superuser":false,"is_staff":false},"post_date":1602423971,"body":"this dumb ass nigga should just make her life a living hell"},{"id":1265422,"gallery_id":332197,"poster":{"id":1666533,"username":"rAnDom","slug":"random","avatar_url":"avatars/1666533.png?_=3b5219c5cf9d5118","is_superuser":false,"is_staff":false},"post_date":1602423863,"body":"@jhonamin i agree. Welp at least this mc isn't a bitch. He was willing to fight the big boii for taunting him."},{"id":1265417,"gallery_id":332197,"poster":{"id":1953416,"username":"Axelerator","slug":"axelerator","avatar_url":"avatars/1953416.png","is_superuser":false,"is_staff":false},"post_date":1602423708,"body":"Good Art, realistic story, the MC's thoughts at the end of the doujin are shit. Feels Bad for him for still being her friend after that. Can't fap to this, but the Art is very good."},{"id":1265411,"gallery_id":332197,"poster":{"id":3360776,"username":"jhonamin","slug":"jhonamin","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1602423506,"body":"Why can't ntr mc just move on man up pull your shit together then forget about her it ain't the end of the world"}]