[{"id":1292321,"gallery_id":332164,"poster":{"id":740808,"username":"Shad","slug":"shad","avatar_url":"avatars/740808.png?_=e266b012c2356d53","is_superuser":false,"is_staff":false},"post_date":1603577688,"body":"Thanks for the context. This clearly isn't my thing so I cant fap to this, but from the context I understand that the MC was the delusional one to think that Rio liked him in the first place, whereas Rio always liked Kaito(?) Well anyway, in that regard Rio was never really MC's(MC's Girl) in the first place so you really have to question is this even true NTR? And no NTR does not mean (Cheating) cuz Cheating is a standalone genre."},{"id":1278494,"gallery_id":332164,"poster":{"id":2512240,"username":"Diddo","slug":"diddo","avatar_url":"avatars/2512240.png?_=7eba742a20568db3","is_superuser":false,"is_staff":false},"post_date":1603007787,"body":"Meh, It sucks anyway"},{"id":1276840,"gallery_id":332164,"poster":{"id":3742012,"username":"A_Summarizer","slug":"a_summarizer","avatar_url":"avatars/3742012.png?_=86527a286c17ab52","is_superuser":false,"is_staff":false},"post_date":1602931186,"body":"(2/2) Rio eventually remembers that she was supposed to meet up with MC because he wanted to tell her something. Kaito then says one last fuck as he rams into her as she says that MC needed to talk to her. Kaito says that if she wants him to stop he will stop, but she will have to return to her old life and not have him. He makes her chose who to be with Kaito then pushes into MAXIMUM OVERDRIVE as Rio begs him to cum inside of her as she says that she doesn't care if she becomes a mom. This happens as Kaito is imagining his confession to Rio as the two text bubbles collide into the words \"I love you Rio\" and \"I love you Kaito\" as Kaito plants one inside her unprotected and she falls asleep. The story then cuts forward saying that Kaito and Rio got married and have been married for two years. Fucking sad as hell but theres your fucking context, Happy sad fapping motherfuckers, once you actually know the context the story is sad as hell. : ("},{"id":1276835,"gallery_id":332164,"poster":{"id":3742012,"username":"A_Summarizer","slug":"a_summarizer","avatar_url":"avatars/3742012.png?_=86527a286c17ab52","is_superuser":false,"is_staff":false},"post_date":1602931063,"body":"(1/2) My Japanese is shoddy at best but here goes. The MC and the Chick are childhood friends. The MC laments on how he never took the chance to get with her and how he wants to be with her so hes going to try. As they are walking we see the leader from their youth return after he left to find a job and starts asking the MC if hes hit that. Mc says no which makes the leader instantly grin and leave. We later see Rio wearing a lewd outfit as the leader, Kaito praises her and begins to feel her up. We find out that Rio has liked him since they were little and how when he first returned she saw him and made out at his house. We cut to MC who is imagining a life where he married Rio and talks about how they have children and his house and thinks about her saying the three most beautiful words to him \"I love you\" when we cut to rio getting dicked down. Kaito as a gentleman makes her put on his condom as this is her first time as she lowers herself onto his rod."},{"id":1267235,"gallery_id":332164,"poster":{"id":2512240,"username":"Diddo","slug":"diddo","avatar_url":"avatars/2512240.png?_=7eba742a20568db3","is_superuser":false,"is_staff":false},"post_date":1602488582,"body":"@kurosaki991 indeed, It makes the doujin even more lame. Nice art tho, shame for the shit story"},{"id":1266685,"gallery_id":332164,"poster":{"id":1653701,"username":"megumi48","slug":"megumi48","avatar_url":"avatars/1653701.png?_=4da1d6492adae3e3","is_superuser":false,"is_staff":false},"post_date":1602470754,"body":"God bless Netorare"},{"id":1266005,"gallery_id":332164,"poster":{"id":645559,"username":"kurosaki991","slug":"kurosaki991","avatar_url":"avatars/645559.png","is_superuser":false,"is_staff":false},"post_date":1602440480,"body":"Isnt this basically the doujin from pija? "}]