[{"id":1783892,"gallery_id":332881,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1622861584,"body":"@TvManga2020 argument was that he was juggling too much and thought about stop playing and she got mad about it and ran off and when she tried to call him to reconcile he didn't answer and I guess she pretty much turned her brain off and had sex with other guy cus she was so mad/sad about him possibly leaving her I guess. Reason he didn't answer was like you said he broke his phone crashing and the reason he didn't chase her after the fight was cus he had to go home and they had fights liket hat before so he didn't think it was a big deal seems like other guy realized and is pretty much like \"shiiiieet\"."},{"id":1744022,"gallery_id":332881,"poster":{"id":1064327,"username":"TvManga2020","slug":"tvmanga2020","avatar_url":"avatars/1064327.png","is_superuser":false,"is_staff":false},"post_date":1621218792,"body":"@zikakuto I like to know that myself but basically my understanding that the girl are living with the dude with the glasses, she love to play Guitar 🎸 so the MC Suggested the girl enjoy the band. Somehow the girl and the dude with the glasses don’t get along so she decided to stay with MC by falling in love. Some strange reason the girl and MC got into a argument because somethings about not answer the phone I guess so she decided to go back to the dude house and they’re having sex  to keep the mind off the MC I guess. So MC got into a accident so his phone broken and he’s worrying about the girl because she’s not at  his house. So MC is stopping by the the dude house with the glass on to see he use his phone to contact the girl.  The dude just find out that those two got into a argument and that MC find out that she have sex with the other dude and that how it end. If I wrong please let me know."},{"id":1533675,"gallery_id":332881,"poster":{"id":734459,"username":"nike-kun","slug":"nike-kun","avatar_url":"avatars/734459.png?_=037ef07d1af64928","is_superuser":false,"is_staff":false},"post_date":1611933780,"body":"Love it. I wish I could tell stories as well as this."},{"id":1277851,"gallery_id":332881,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1602980430,"body":"Anyone know what happens?"},{"id":1277850,"gallery_id":332881,"poster":{"id":2769909,"username":"FruitsPunch","slug":"fruitspunch","avatar_url":"avatars/2769909.png","is_superuser":false,"is_staff":false},"post_date":1602980319,"body":"This is quite old and needs a translation"},{"id":1277747,"gallery_id":332881,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1602974501,"body":"This has yet to be translated right?"}]