[{"id":2208535,"gallery_id":334759,"poster":{"id":3811321,"username":"bobbtai","slug":"bobbtai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639980251,"body":"Why can’t this dumb guy just leave the girl alone. Let her ruin her life bruh she just a whore and slut"},{"id":1329544,"gallery_id":334759,"poster":{"id":2386466,"username":"uglybastardd","slug":"uglybastardd","avatar_url":"avatars/2386466.png?_=044c846e15479a7a","is_superuser":false,"is_staff":false},"post_date":1605086561,"body":"wht wrong with u MC? just find another pussy, and dont ever meet that bitch again, fucekk"},{"id":1326042,"gallery_id":334759,"poster":{"id":2723596,"username":"houchan","slug":"houchan","avatar_url":"avatars/2723596.png?_=18ed92bc8200ea4d","is_superuser":false,"is_staff":false},"post_date":1604937540,"body":"實話沒錯啊\n如果一開始我們的視角就是那位大漢，我們只會覺得他的青梅竹馬很煩，想讓女主趕快忘掉\n然而正因為視角的代入使我們站在青梅的立場看待事情\n我夢到的結局是，男主爭回女主，雖口上說喜歡男主，但身體已經是大漢的形狀了。\n還是別代入太多感情吧，這只會使你感到難過。熬了3集還%不到，只能看作者要怎麼收了"},{"id":1325438,"gallery_id":334759,"poster":{"id":2499209,"username":"jojoey","slug":"jojoey","avatar_url":"avatars/2499209.png?_=5659c1998bfe51ea","is_superuser":false,"is_staff":false},"post_date":1604910829,"body":"這男的其實人也挺好（如果他說的都是實話），只是長相比較像反派"},{"id":1318196,"gallery_id":334759,"poster":{"id":3175609,"username":"The25thBam","slug":"the25thbam","avatar_url":"avatars/3175609.png?_=8c5f22baf7e4b0a6","is_superuser":false,"is_staff":false},"post_date":1604633898,"body":"I feel like this takes place before ch 1 and 2 since on ch 1 she already had that naval piercing "},{"id":1316822,"gallery_id":334759,"poster":{"id":2396689,"username":"SoraSekkai","slug":"sorasekkai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604577013,"body":"I know I’m gonna get shit ton of hate but I really would want to see a ntr with the MC having a good ending 😅"},{"id":1316274,"gallery_id":334759,"poster":{"id":355471,"username":"imaginelikingshota","slug":"imaginelikingshota","avatar_url":"avatars/355471.png?_=bb1d689ea4339082","is_superuser":false,"is_staff":false},"post_date":1604552758,"body":"Why would you want the mc to win wtf? The girl is lost already and mc dodged the bullet lol"},{"id":1316251,"gallery_id":334759,"poster":{"id":1125183,"username":"StrykerZero","slug":"strykerzero","avatar_url":"avatars/1125183.png?_=45f7a498c5d1083d","is_superuser":false,"is_staff":false},"post_date":1604551990,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1315634,"gallery_id":334759,"poster":{"id":3798433,"username":"opulentkings","slug":"opulentkings","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604523855,"body":"Don't Worry MC Kun, when she's already popped out a kid or two from this tyrone and is about to hit the wall she'll let you hit it you you'll get to marry her she'll even convince you to raise kids that aren't even yours cause that's what a good man would do \nbut as your fucking this girl chances are she'll be faking every orgasms she has with you cause you don't just compare and she won't be doing that freaky sexual stuff she did with tyrone with you she even said so herself in the previous chapter she'll eventually Divorce you take half your shit and paying for kids that weren't even yours and find the next Chad or tyrone so have fun with tyrones sloppy seconds while you still can you Simp "},{"id":1315626,"gallery_id":334759,"poster":{"id":3798433,"username":"opulentkings","slug":"opulentkings","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604523682,"body":"Don't Worry MC Kun, when she's already popped out a kid or two from this tyrone and is about to hit the wall she'll let you hit it you you'll get to marry her but as your fucking this girl chances are she'll be taking every orgasms she has with you just cause you don't compare and she won't be doing that freaky sexual stuff she did with tyrone with you she even said so herself in the previous chapter she'll eventually Divorce you half your shit and find the next Chad or tyrone so have fun with tyrones sloppy seconds while you still can "},{"id":1314879,"gallery_id":334759,"poster":{"id":2681344,"username":"eren_jizzer","slug":"eren_jizzer","avatar_url":"avatars/2681344.png?_=b41e2ee32c1bd5cd","is_superuser":false,"is_staff":false},"post_date":1604495798,"body":"MC better be an Alpha and fuck all the girls surrounding FMC till she thirst for him"},{"id":1314806,"gallery_id":334759,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1604491917,"body":"@Yoshitsunecr he's more alpha than the MC sure but I wouldn't call this an alpha male, he got jealous of MC that his girl loves MC more. The most hurt NTR is when the stealer actually a gentleman, actually care for his partner, doesn't need to show it off, no bullshit dick size joke and bullshit I'm better than you at sex plot. This is because it feels natural that the girl/ boy changes their partner and basically the cuck has no hope of fighting back.\nPretty sure 99% of NTR nowadays just made for people who love to be cuck, NTR wouldn't get so much hate if they actually get creative with the plot instead of just these girl just let the stealer fuck of MC never even do anything.       "},{"id":1314541,"gallery_id":334759,"poster":{"id":1209426,"username":"Yoshitsunecr","slug":"yoshitsunecr","avatar_url":"avatars/1209426.png","is_superuser":false,"is_staff":false},"post_date":1604480941,"body":"@MeAndTheBoy i would like NTR more if both guys were Alpha fighting for the girl, in fact ive seen more Hentai were there are 2 Alpha girls fighting for the Male, Alphas cucking Betas is not interesting at all, in fact i kinda understand the alpha male here because hes Jealous/Envious of the Relationship that the MC and FC have and hes really interested on the girl, not like he just want a fast fuck or something because 3 chapters so far and zero of that shit so far, that would make this a worse NTR for the MC."},{"id":1313106,"gallery_id":334759,"poster":{"id":2952629,"username":"spiderscout","slug":"spiderscout","avatar_url":"avatars/2952629.png","is_superuser":false,"is_staff":false},"post_date":1604427125,"body":"Don’t root for the mc to win, root for him to find another fucking girlfriend "},{"id":1312945,"gallery_id":334759,"poster":{"id":2795188,"username":"fuckthemvanillafans","slug":"fuckthemvanillafans","avatar_url":"avatars/2795188.png?_=e6ad20902f773782","is_superuser":false,"is_staff":false},"post_date":1604421260,"body":"Why do people get mad over this ?                         \nSure its kinda dumb but when its nnn its easier to just let go no?\nฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1312876,"gallery_id":334759,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1604418173,"body":"@frozo NTR is a very interesting concept with a lot of potential... unlike other tags, there need to be at least a reason for the change to happen. So in theory it has more 'plot'... there's also that people simply just cuck and have a cuckold fetish. The good plot NTR with a clever story build is amazing and personally is the reason why I keep reading NTR. Generally is harder to standout out in other tags like vanilla, unless it has amazing art, sex, and a decent story, people just overlook it.  NTR however with just retarded plot and people go crazy over it... don't even need good art. But who am I to judge, I love anything to do with monster and demon girl (without rape/ NTR/ Gore/ lolicon) so...  \n\n"},{"id":1312730,"gallery_id":334759,"poster":{"id":1736653,"username":"frozo","slug":"frozo","avatar_url":"avatars/1736653.png?_=d46ffa4bbebb2709","is_superuser":false,"is_staff":false},"post_date":1604411062,"body":"I know this is not real. Not like im a whiner vanilla fag like other commenters below. Is this ntr kinda thing in japan? Why its so trendy in hentai manga?"},{"id":1312719,"gallery_id":334759,"poster":{"id":740808,"username":"Shad","slug":"shad","avatar_url":"avatars/740808.png?_=e266b012c2356d53","is_superuser":false,"is_staff":false},"post_date":1604410775,"body":"Its First Come First Served. Get over her and find someone else like wtf there are so many girls out there and some of them are thousand times better than your childhood friend smh. Nuff said."},{"id":1312560,"gallery_id":334759,"poster":{"id":2398352,"username":"llik lla skcuc","slug":"llik-lla-skcuc","avatar_url":"avatars/2398352.png?_=21dc69ae8cd4c9cf","is_superuser":false,"is_staff":false},"post_date":1604399733,"body":"https://nhentai.net/g/325479/\nHere you can heal by reading this NTR but story is reverse of this common NTR cuck story and Netori at that. Wow I only found this just now by searching more NTR XD"},{"id":1312384,"gallery_id":334759,"poster":{"id":2438516,"username":"Swagger22","slug":"swagger22","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604391001,"body":"Funny how part 3 for Chinese came out first before the English one."},{"id":1312263,"gallery_id":334759,"poster":{"id":853901,"username":"NTR is love and life","slug":"ntr-is-love-and-life","avatar_url":"avatars/853901.png?_=a96a0a928ea38991","is_superuser":false,"is_staff":false},"post_date":1604384790,"body":"Nut enough 😡"},{"id":1312210,"gallery_id":334759,"poster":{"id":1209426,"username":"Yoshitsunecr","slug":"yoshitsunecr","avatar_url":"avatars/1209426.png","is_superuser":false,"is_staff":false},"post_date":1604381828,"body":"Guys i dont know Chinnese but this is a Prequel 100%, look the Belly Piercing on the first chapter, here she dint have it until the last pages, like the MC said he lost \"months\" ago, kinda sad but thats NTR in a nutshell unless the autor pull a fcking Redemption arc but its 99% unlikely."},{"id":1312198,"gallery_id":334759,"poster":{"id":50375,"username":"rednaks","slug":"rednaks","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604381286,"body":"the fun i see is the boyfriend scared and anger and fuck her for not to lose her and she is hesitant if the mc go beat this trash it will be good"},{"id":1312073,"gallery_id":334759,"poster":{"id":747898,"username":"ayami123","slug":"ayami123","avatar_url":"avatars/747898.png?_=cc4978cd112629f7","is_superuser":false,"is_staff":false},"post_date":1604376455,"body":"the guy didn't bully the mc,\n\nMC is just jealous that, the childhood friend love someone else already"},{"id":1311973,"gallery_id":334759,"poster":{"id":3434718,"username":"zayama","slug":"zayama","avatar_url":"avatars/3434718.png?_=ac5369c53f294f78","is_superuser":false,"is_staff":false},"post_date":1604373089,"body":"Whats the name of the last image"},{"id":1311963,"gallery_id":334759,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1604372645,"body":"Is this really part 3? Well I mean, I've read part 1& 2. I'm not gonna cheer up for the MC (childhood friend). Why? Because that's clear man, just go find another girl. The tittle it self about this story is clear too. FIRST COME FIRST SERVED. Just accept your fate, blame yourself why not confess her at first? If the big guy & the girl keep seducing or bully you, just move on and go or move from that place to find your peace.\nWell that's only comment, I know this is not even affect about the story."},{"id":1311881,"gallery_id":334759,"poster":{"id":3360227,"username":"Maboooyy","slug":"maboooyy","avatar_url":"avatars/3360227.png?_=fc67579eb26f600c","is_superuser":false,"is_staff":false},"post_date":1604367723,"body":"I don' think this is a part 3. You can see on page 8 i think that her first got pierce from him soooo it's up to you guys for me i don't think is this the continue from part 2"},{"id":1311863,"gallery_id":334759,"poster":{"id":3381253,"username":"ᴍᴏʀɪᴊɪɴ","slug":"morijin","avatar_url":"avatars/3381253.png?_=d38eceea21a91015","is_superuser":false,"is_staff":false},"post_date":1604366952,"body":"dam man he should really have revenge, like dude forget about that girl and find who's someone better than that..... yeah its up to the author...... wait what am I doing here?? I was gon do no nut november.... fuck my habits :<"},{"id":1311859,"gallery_id":334759,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1604366759,"body":"Should we really root for the mc to win a girl so he can establish a doom relationship that we can all see a 100 light years away. "},{"id":1311853,"gallery_id":334759,"poster":{"id":1167315,"username":"God Grid","slug":"god-grid","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604366376,"body":"ive read that this is a prequel and isnt the continuation"},{"id":1311818,"gallery_id":334759,"poster":{"id":3398205,"username":"Destroyedyourmom","slug":"destroyedyourmom","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604363905,"body":"From the first two chapters it seems like the boyfriend has won. Now the author is making it out like the childhood friend has a chance which is highly unlikely given the outcome of most NTR and given that the title is 'first come first served' Personally don't think there's any point in a part 4 unless the childhood friend actually wins"},{"id":1311791,"gallery_id":334759,"poster":{"id":825016,"username":"sennengoroshi","slug":"sennengoroshi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604362351,"body":"Just move on dude, bitch is lost. Honestly speaking these dudes are so lame. They live in a word where all girls look like this but act like simps"},{"id":1311751,"gallery_id":334759,"poster":{"id":3070111,"username":"ConnerLikesCake","slug":"connerlikescake","avatar_url":"avatars/3070111.png?_=85c5233693402763","is_superuser":false,"is_staff":false},"post_date":1604360110,"body":"This nigga cant stop with the cuck! Just to let u know, this legit won't go far unless this dude kills the loser.\n\nI don't understand how yall think this is normal when the loser brainwashes the girl and now she doesn't like the person she liked anymore."},{"id":1311702,"gallery_id":334759,"poster":{"id":3454409,"username":"FelixHentai","slug":"felixhentai","avatar_url":"avatars/3454409.png?_=f77ac61d5d93d0d0","is_superuser":false,"is_staff":false},"post_date":1604357768,"body":"The ending would be a typical NTR ending: The MC gets to chance to have sex with her but the girl isn't getting statisfied then she had sex with the chad infront of the MC "},{"id":1311699,"gallery_id":334759,"poster":{"id":3258791,"username":"NaDelz","slug":"nadelz","avatar_url":"avatars/3258791.png?_=5ffe9a6536d2058e","is_superuser":false,"is_staff":false},"post_date":1604357716,"body":"every one here stfu it's no nut November (I'm suffering as well I'm just saving some stuff for ddd) good luck men "},{"id":1311669,"gallery_id":334759,"poster":{"id":3419576,"username":"Ehbm92","slug":"ehbm92","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604356249,"body":"Dude, I don't see how he can get her back from this. Why he would want to either, fuck love bro. She got a piercing, asked for cream pies, got fingered in front of her childhood friend. I don't see hope or need for that relationship. Just move on man, too late.\n I think this will end up with her being completely under the dudes control and having sex with him just because her boyfriend ordered her or something, no hope here. "},{"id":1311655,"gallery_id":334759,"poster":{"id":2466299,"username":"Fear Itself","slug":"fear-itself","avatar_url":"avatars/2466299.png","is_superuser":false,"is_staff":false},"post_date":1604355720,"body":"No everyone is retarded"},{"id":1311580,"gallery_id":334759,"poster":{"id":2290461,"username":"日寄子","slug":"ri-ji-zi","avatar_url":"avatars/2290461.png?_=683c92bad1c32f64","is_superuser":false,"is_staff":false},"post_date":1604351442,"body":"So why people speak english comment here lol can yall read chinese?"},{"id":1311417,"gallery_id":334759,"poster":{"id":477004,"username":"FresshLikeLettuce","slug":"fresshlikelettuce","avatar_url":"avatars/477004.png","is_superuser":false,"is_staff":false},"post_date":1604344413,"body":"yea this like a sequel  something like chapter 1.5  because when the Thug dude confront the MC  he asks him if he remember  how the girl broke her promise of going together to the festival etc,and its kinda somewhat forced  because we really don't need a sequel or prequel for this series and nobody cares what happens after chapter 2 after all at most we will get a chapter when the MC have a chance to fuck her  but  AS ALWAYS MC WILL HAVE A SUPER SMALL  DICK  then the "},{"id":1311416,"gallery_id":334759,"poster":{"id":791555,"username":"AnchiraWantMyBanana","slug":"anchirawantmybanana","avatar_url":"avatars/791555.png","is_superuser":false,"is_staff":false},"post_date":1604344388,"body":"Care enough to comment lol"},{"id":1311371,"gallery_id":334759,"poster":{"id":2856952,"username":"Japan Marak","slug":"japan-marak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604342572,"body":"She's probably going to get gangbang and get pregnant and the father will still be him and the childhood friend doesn't stand a change not that I care "},{"id":1311301,"gallery_id":334759,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1604339821,"body":"This is not gonna end well she slowly falling to getting treated like a slut"},{"id":1311299,"gallery_id":334759,"poster":{"id":50375,"username":"rednaks","slug":"rednaks","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604339639,"body":"@Randomuserc i think he can have his chance because the other trash scare of him"},{"id":1311276,"gallery_id":334759,"poster":{"id":1527880,"username":"Randomuserc","slug":"randomuserc","avatar_url":"avatars/1527880.png?_=05b8f2d5d0b1445e","is_superuser":false,"is_staff":false},"post_date":1604338529,"body":"This is a prequel, in the 1st chapter she already has the belly piercing.\n\nIt's OK, we don't really need a sequel for this, it was pretty obvious he lost his chance, you can't doubt with love and two years is too much time. "},{"id":1311200,"gallery_id":334759,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1604335671,"body":"Dude might get her back, not the pure one ofc but he'll properly get her back. if we ever get sequel... the plot kinda set it up for it. "},{"id":1311179,"gallery_id":334759,"poster":{"id":3731107,"username":"drnam645","slug":"drnam645","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604334898,"body":"@lolman0 I think this is rather a prequel that was included in a Doujinshi volume. The official sequel is no t out yet I think."},{"id":1311171,"gallery_id":334759,"poster":{"id":906789,"username":"lolman0","slug":"lolman0","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604334779,"body":"did we really need a sequel for this?"}]