[{"id":2379526,"gallery_id":335526,"poster":{"id":3721189,"username":"Black10k","slug":"black10k","avatar_url":"avatars/3721189.png?_=a2af0ae6e8d8479a","is_superuser":false,"is_staff":false},"post_date":1646603824,"body":"I see this as ntr"},{"id":1329843,"gallery_id":335526,"poster":{"id":1810489,"username":"BTK_Kileer","slug":"btk_kileer","avatar_url":"avatars/1810489.png","is_superuser":false,"is_staff":false},"post_date":1605100439,"body":"It just a love triangule not exacly netorare"},{"id":1328577,"gallery_id":335526,"poster":{"id":3318443,"username":"Raidacus","slug":"raidacus","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605049607,"body":"Lol I'm of the same mind as Yoshitsunecr. Even though we're shown the beta boy as the protagonist of sorts, it just feels like a story about two childhood friends who are in love and another with an unrequited love. This story feels off in that it should've probably shown the perspective of the older childhood friend or the girl. Heck, it might've been a really good story if it were longer and showed ALL perspectives in this ''love triangle'' of sorts that is more about a singular couple and another guy trying to fit in desperately yet not doing anything to actualize that. Heh."},{"id":1327127,"gallery_id":335526,"poster":{"id":946223,"username":"vessalius","slug":"vessalius","avatar_url":"avatars/946223.png","is_superuser":false,"is_staff":false},"post_date":1604988573,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1327106,"gallery_id":335526,"poster":{"id":946223,"username":"vessalius","slug":"vessalius","avatar_url":"avatars/946223.png","is_superuser":false,"is_staff":false},"post_date":1604988099,"body":"ppl are just stupid for translating the same doujin, can't you stupid cunt cooperate? talk! communicate!"},{"id":1327067,"gallery_id":335526,"poster":{"id":1209426,"username":"Yoshitsunecr","slug":"yoshitsunecr","avatar_url":"avatars/1209426.png","is_superuser":false,"is_staff":false},"post_date":1604986341,"body":"Someone can explain to me how this its NTR? for real this seems like a Vanilla Childhood Friends and the other guy never haved a chance, she loved the big bro since they were kids."},{"id":1326960,"gallery_id":335526,"poster":{"id":3430188,"username":"SteelH","slug":"steelh","avatar_url":"avatars/3430188.png?_=5f25da9b843032e1","is_superuser":false,"is_staff":false},"post_date":1604981914,"body":"For a moment I think she is Suguha from SAO"},{"id":1326946,"gallery_id":335526,"poster":{"id":3150096,"username":"BTS, bangladesh toilet service","slug":"bts-bangladesh-toilet-service","avatar_url":"avatars/3150096.png?_=2f84079bce19a5af","is_superuser":false,"is_staff":false},"post_date":1604981332,"body":"A really decent ntr doujin "},{"id":1326849,"gallery_id":335526,"poster":{"id":1655549,"username":"Encendedor","slug":"encendedor","avatar_url":"avatars/1655549.png?_=111bf3aa53621f85","is_superuser":false,"is_staff":false},"post_date":1604977070,"body":"Another good Shit... Fucking Normies, go to see Vanilla "},{"id":1326836,"gallery_id":335526,"poster":{"id":1266937,"username":"IExpectedBetter_v2.0","slug":"iexpectedbetter_v2-0","avatar_url":"avatars/1266937.png","is_superuser":false,"is_staff":false},"post_date":1604976553,"body":"Another NTR shit"},{"id":1326727,"gallery_id":335526,"poster":{"id":708813,"username":"ardipahlawan88","slug":"ardipahlawan88","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1604970557,"body":"love him? bwahahaha yaoi potential XD"},{"id":1326232,"gallery_id":335526,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1604946369,"body":"This portrays life in such a way lol, she did care for her younger friend but loved the bad boy, poor kid has plan for his future with her while chad is in the here and now having sex with her. We need a new genre that shows conclusions to the story not this stupid crap,irl iknow chads and they monkey branch alot cause thry know there sex game is good. They will never settle and just use them up, thats whats gonna happen to her you can tell by how he talks to her, author had other directions to take this after the end scene to make a good 2nd chapter but thinks of making a chapter of a hotspring of kid studying while chad bangs her out? Japanese authors need to get inspiration from seto yuukie "},{"id":1326192,"gallery_id":335526,"poster":{"id":1866420,"username":"Sinful_Syrup","slug":"sinful_syrup","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604944529,"body":"Lol the comments trying to squeeze as much NTR out of the plot as possible, simply pathetic. You are all pathetic."},{"id":1326110,"gallery_id":335526,"poster":{"id":2302446,"username":"cottonm","slug":"cottonm","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604940509,"body":"@Kami Nana think it’s just this translation, in the other one she says “I love you” to Kaito"},{"id":1325922,"gallery_id":335526,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604933187,"body":"@tobajas A couple things...you apparently missed the part \"I think I love...him\" that she says in tandem with the MC at the end. She's saying him as he says her...why would she do that(\"him\" instead of \"you\") if she was already with the guy she loved? It's implying that she's fallen for the younger brother, too...just not as much as her love for her beloved Kaito-nii. Also, nowhere is it even implied that she didn't want to take care of the younger brother...she even said it would be sad when he found out about them."},{"id":1325864,"gallery_id":335526,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1604930867,"body":"@tobajas I can supplement your definition by saying that netorare tries to invoke the feeling of jealousy towards the main lead and by extension the reader. The writing here does not portray a girls crush finally coming back; as they could have easily done this without the existence of the main lead boy. Clearly it’s written in a way that tries to show that the girl had let go of the care & affection she had over the main lead boy and prioritized the senpai dude; even to the point of skipping their appointments. So basically, this may not be a Hardcore NTR but definitely in the category."},{"id":1325833,"gallery_id":335526,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604929099,"body":"@xhawke09 by definition it's always NTR if someone the protaganist loves is stolen from them. Since NTR pretty much means having a loved one stolen/taken to bed. Though I agree that it's always a bit iffy when the person the protag loves/wants isn't even into them or are even in a relationship already. Like here the girl never loved the protag and always loved the other guy and the second he came back to town she went and confessed to him. A more usual way would be blackmail or something to force the girl into a relationship and then mindbreak her, usually simply done by just fucking her once or twice. Here were even told the only reason she's always been with the protag and acted like his big sis is cause the other guy asked her to always look after him when he left. So to keep her promise to the one she loved she kept on doing that, even though it's implied she didn't want to."},{"id":1325722,"gallery_id":335526,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1604923553,"body":"still say it's not NTR if she was already in a relationship with the older guy and just saw the other MC as a little brother to begin with"}]