[{"id":1601603,"gallery_id":335918,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1615017189,"body":"@DTC123 No she really can't. Have you never seen FMA? Even the greatest Alchemist can't do things beyond what is logical. Hence the whole Equivalent Exchange principle. The Philosopher's stone is supposed to surpass the limits and perform miraculous feats. That's the whole point behind it and why every alchemists ever wants to seek it. So if Cag herself admits that she can't do it, then she just can't do it. End of story. Otherwise she would need to follow the same procedure like what that douche Paracelsus did, which would require a lot of time, effort and sacrifices to make it. Also, like what michirusan said, she doesn't desire an \"imperfect body\" at the moment. She wants \"perfection\" aka an undying body, which correlates with her past life as a sick dying male (if you see her swimsuit ver, she went to the Auguste Beach to \"perfect\" her body even more). That's why she offered Mireille a choice: To either go the same path as Cag or go on her own path for a fertile body.  "},{"id":1339818,"gallery_id":335918,"poster":{"id":1409775,"username":"DTC123","slug":"dtc123","avatar_url":"avatars/1409775.png","is_superuser":false,"is_staff":false},"post_date":1605488497,"body":"Another one to add to my Cagliostro collection, she truly is best girl.\n\nAlso if she really desired to have a body that can reproduce then she can certainly create one, nothing is impossible for the great Cag"},{"id":1339566,"gallery_id":335918,"poster":{"id":588468,"username":"michirusan","slug":"michirusan","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1605478109,"body":" Yep, Current Cag's body is considered a \"perfect\" homunculus, and the closer to perfect a body like that is, the LESS it would need to have the ability to reproduce. So Cag as s/he currently is couldn't conceive at all. She COULD make a lesser homunculus that still has the ability, the event also taught us alchemy is certainly capable of it, but the price of doing so...well we got to see THAT too. Basically, alchemy in gbf alows you to slide the mortality scale on a body, And Cag is aiming for a \"perfect, unchanging, un-aging, unalterable, undying\" state of being. While the story MC was aiming for the exact OPPOSITE end of the line, physically healthy, able to age properly, capable of conceiving and bearing life for future generations to carry on, healing for sickness and injuries properly,  etc."},{"id":1339278,"gallery_id":335918,"poster":{"id":431444,"username":"underscore","slug":"underscore","avatar_url":"avatars/431444.png?_=bf929a7eba01733a","is_superuser":false,"is_staff":false},"post_date":1605467336,"body":"Latest cagliostro event has confirmed our greatest fear: her bodies are infertile."},{"id":1334349,"gallery_id":335918,"poster":{"id":1442564,"username":"L'","slug":"l","avatar_url":"avatars/1442564.png?_=e9e9d92a59014e89","is_superuser":false,"is_staff":false},"post_date":1605285506,"body":"@R E D S U G A R The \"real\" Cag couldn't cause all of her spares are artificially made. She would've needed to make an organic body with a philosopher's stone to actually get pregnant"},{"id":1333870,"gallery_id":335918,"poster":{"id":3421690,"username":"Lolis_is_Life","slug":"lolis_is_life","avatar_url":"avatars/3421690.png?_=c8aec3928e48dd16","is_superuser":false,"is_staff":false},"post_date":1605269784,"body":"The Pregnant Loli was much sexy and cute"},{"id":1333721,"gallery_id":335918,"poster":{"id":889789,"username":"R E D  S U G A R","slug":"r-e-d-s-u-g-a-r","avatar_url":"avatars/889789.png?_=bb59019b890b57dd","is_superuser":false,"is_staff":false},"post_date":1605263285,"body":"Cag can get pregnant?"},{"id":1333717,"gallery_id":335918,"poster":{"id":3340673,"username":"Za Big Gay","slug":"za-big-gay","avatar_url":"avatars/3340673.png?_=42b9f5fc514f3a7f","is_superuser":false,"is_staff":false},"post_date":1605263144,"body":"@LewdChamp Don't worry we do"},{"id":1333526,"gallery_id":335918,"poster":{"id":1651861,"username":"LewdChamp","slug":"lewdchamp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605255221,"body":"People who like this i got 1 thing to say to u : Nigga u gay . Embrace it "},{"id":1333416,"gallery_id":335918,"poster":{"id":611516,"username":"BakeANeko","slug":"bakeaneko","avatar_url":"avatars/611516.png?_=20417bde5d30cbde","is_superuser":false,"is_staff":false},"post_date":1605250859,"body":"Cute old cag"}]