[{"id":1384254,"gallery_id":336746,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1607133594,"body":"The worst thing is that there are people who masturbate on hentai of this type and even on the \"fictitious\" rape of the heroines they say they love, it disgusts me ! The place of exacerbated perverts in your genre is in the hell of the pigs. Where you will be fucked and tortured for eternity by hideous demons worthy of you. It pleases you to degrade the image that people have of their favorite characters and well I wish you all the misfortune of the world. Farewell."},{"id":1384250,"gallery_id":336746,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1607133421,"body":"You really have to be a sleeping criminal to create such an atrocity! A kind of victim who was mistreated by others in his youth and who, out of weakness, attacks someone weaker than himself to regain his miserable cowardly manhood without any genuine pride. Play as much as you want with your muscles and your big cock, alpha males are sub-men after all. They are unbridled cattle with a dick in place of a brain, enslaved by their hormones and not even having the strength to control their primary impulses, so dependent on their testosterone are these mangy dogs. In short, you're no better than those who excite you to imitate animals. And there is nothing more rewarding than to turn a common ox like you into a frightened virgin, you who think you are so strong. Your real face is pathetic. The worst thing is that there are people who masturbate on hentai of this type and even on the \"fictitious\" rape of the heroines they say they love, it disgusts me !"},{"id":1366059,"gallery_id":336746,"poster":{"id":3832882,"username":"Rindoku","slug":"rindoku","avatar_url":"avatars/3832882.png?_=145bbd4bb53aec3c","is_superuser":false,"is_staff":false},"post_date":1606475337,"body":"I’ll go and take my Panzerfaust real quick"},{"id":1360384,"gallery_id":336746,"poster":{"id":2237553,"username":"HentaiLover :3","slug":"hentailover-3","avatar_url":"avatars/2237553.png?_=07c1d8d0ac194b3b","is_superuser":false,"is_staff":false},"post_date":1606282323,"body":"fuck you author"},{"id":1350571,"gallery_id":336746,"poster":{"id":3816747,"username":"red_banana_lover","slug":"red_banana_lover","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1605919997,"body":"fuck you author"},{"id":1349724,"gallery_id":336746,"poster":{"id":2374921,"username":"shadowarrow","slug":"shadowarrow","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1605883250,"body":"thats just sad considering bell is so innocent  "}]