[{"id":1367648,"gallery_id":337241,"poster":{"id":3715445,"username":"joenutz","slug":"joenutz","avatar_url":"avatars/3715445.png?_=5afd61b0be0a044a","is_superuser":false,"is_staff":false},"post_date":1606544649,"body":"Btw she's had her hair dyed for a little while now it was the 2nd ch page 11 he was fucking her while dyeing her hair cus I saw a few comments saying her hair was dyed for the next cover she's had it for a little while"},{"id":1367583,"gallery_id":337241,"poster":{"id":3715445,"username":"joenutz","slug":"joenutz","avatar_url":"avatars/3715445.png?_=5afd61b0be0a044a","is_superuser":false,"is_staff":false},"post_date":1606541819,"body":"@sharpeningrod or you can just write how it ends I want to know the ending and don't want to wait I know it's not the good end I was hoping for but it is what it is it's what you get with ntr there's are very few ntr's with happy endings"},{"id":1367513,"gallery_id":337241,"poster":{"id":3715445,"username":"joenutz","slug":"joenutz","avatar_url":"avatars/3715445.png?_=5afd61b0be0a044a","is_superuser":false,"is_staff":false},"post_date":1606539410,"body":"@sharpeningrod well I got my hopes up I sorta want to see what the Chad's friend ment when he said will you let me fuck her just like your ex girl also can you provide a link I'll accept the authors decision it's his work after all"},{"id":1367498,"gallery_id":337241,"poster":{"id":3715445,"username":"joenutz","slug":"joenutz","avatar_url":"avatars/3715445.png?_=5afd61b0be0a044a","is_superuser":false,"is_staff":false},"post_date":1606538901,"body":"I couldn't tell it was a prelude till looking at the comments and then the doujin itself where he's at the desk with his friends but I haven't be this hopeful in a while artist please give us a good ending if you don't I'll respect your decision but please"},{"id":1366340,"gallery_id":337241,"poster":{"id":50375,"username":"rednaks","slug":"rednaks","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606489283,"body":"but theyy are ntr witth good ending or revenge and havr good popularity, i see chp2 he can do chp 3 to see what happen this chald scare about mc"},{"id":1365831,"gallery_id":337241,"poster":{"id":3365183,"username":"notsurnamelol","slug":"notsurnamelol","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606465008,"body":"As expected, how can you even apply a decent/good ending on a hentai based on shitty story with laughable approaches and takes. Heroines hesitation and motive makes no sense, MC seems like a clueless AI fps shooter, chad is all the same from a disney school bully. As depressing as it is, the slice is all NTR, stop expecting a good ending, NTR is severely popular in japan and most starting artist would start on that genre to earn exposure and popularity. The family tree always ends on \"money\"."},{"id":1365521,"gallery_id":337241,"poster":{"id":1238114,"username":"sarod","slug":"sarod","avatar_url":"avatars/1238114.png?_=b74bbf3a41abea53","is_superuser":false,"is_staff":false},"post_date":1606454205,"body":"Ch2 SPOILER: Chad wins. Akina's deeply inlove with him. Window has been closed. Go ahead and bitch about it now so you can shut the fuck up when the chapter comes in later."},{"id":1365343,"gallery_id":337241,"poster":{"id":50375,"username":"rednaks","slug":"rednaks","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606447466,"body":"i really want to see a good ending to mind break this chad, his friend getting revenge on him after beat him in prelude, this guy can let his girlfriend be raped like his exgirlfriend pls dramus do a good ending or both good and bad ending"},{"id":1365039,"gallery_id":337241,"poster":{"id":3550367,"username":"thunderballs","slug":"thunderballs","avatar_url":"avatars/3550367.png?_=18e7214ab03f9d17","is_superuser":false,"is_staff":false},"post_date":1606435549,"body":"The mc dick size  can't compare to muscle Chad ,if she break up with him she always going to compare how great sex was with muscle Chad.Guess this author just want the childhood friend guy to have bad ending.He's popular my guy it not like he can't get any other girl,he can move to black long hair one.I was fine with the ending  until this one came out and other chapter with Perspective of the Muscle Chad."},{"id":1365027,"gallery_id":337241,"poster":{"id":3550367,"username":"thunderballs","slug":"thunderballs","avatar_url":"avatars/3550367.png?_=18e7214ab03f9d17","is_superuser":false,"is_staff":false},"post_date":1606435182,"body":"I don't like it now chapter 2 should be the end of it now it feel like force sex and misunderstooding.i did like seeing what the muscle Chad was thinking saying the (Childhood friend Guy) was an pussy not to confess his feeling which was savage.Honestly why does this author want me to feel bad for the FMC now it doesn't feel like she move on to the Chad because the MC to took to long to say something."},{"id":1364558,"gallery_id":337241,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1606415754,"body":"@Yoshitsunecr that part pissed me off Mc accepted she fucking the next dude and still was her tight friend, that douchbag confronts hin popping off how blows her back out when cancels on days they hang out. Mc lost his shit for talking smack bout her, and runs over to push Mc away like he is in the wrong. His face when he said i always loved you man he was crushed, honestly she dont deserve redemption cause she just a pretty fuck hole to her bf, she just to stupid to realize it"},{"id":1364107,"gallery_id":337241,"poster":{"id":1209426,"username":"Yoshitsunecr","slug":"yoshitsunecr","avatar_url":"avatars/1209426.png","is_superuser":false,"is_staff":false},"post_date":1606403456,"body":"@Bigbearharris79 well my problem is that the first 2 chapters were good enough, a classic NTR of \"too late fam, someone already eated that cake\" but the author is now dragging it and pushing some feels BS that usually NTR dont have, the FMC is not a Bitch and still have feelings for the MC, the dude is not a faggot/ugly bastard and hes jealous of the MC and the MC is not even your usual cuck faggot, he confessed and hes willing to fight for the FMC but like i said, the FMC fucked his chances, trying to push the MC away and know she is full of Remorse, i would say even more remorse than the MC have."},{"id":1362394,"gallery_id":337241,"poster":{"id":2504078,"username":"Zukulentoman80s","slug":"zukulentoman80s","avatar_url":"avatars/2504078.png","is_superuser":false,"is_staff":false},"post_date":1606354584,"body":"FMC Perspective so the cuck get another girl this something new"},{"id":1362280,"gallery_id":337241,"poster":{"id":3419576,"username":"Ehbm92","slug":"ehbm92","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606350646,"body":"Hopefully dude just moves on, gets a better girl and she ends up living with regret ending.. Change it up a little you know. Would defibrillator be more original. "},{"id":1362210,"gallery_id":337241,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1606348427,"body":"@Yoshitsunecr i hear ya, but she put herself in this situation just cause douchbag told her things she wanted Mc to say and do. If she the type of women to love someone and not care bout size and get wit mc that be great but i dont see that happening "},{"id":1362017,"gallery_id":337241,"poster":{"id":2209434,"username":"jlbbmt10","slug":"jlbbmt10","avatar_url":"avatars/2209434.png?_=b12bc3907e8f4f42","is_superuser":false,"is_staff":false},"post_date":1606341060,"body":"Bitch you’re in the middle of fucking why answer the phone? If you didn’t want to fuck you wouldn't of gone to the hotel. The whole 3 months she was with that dude she was hiding it from the MC like she was scared of him finding out but she says he was popular and didn’t think he thought anything of her. The plot of the story is so stupid just make it a picture book with no words. "},{"id":1362012,"gallery_id":337241,"poster":{"id":1209426,"username":"Yoshitsunecr","slug":"yoshitsunecr","avatar_url":"avatars/1209426.png","is_superuser":false,"is_staff":false},"post_date":1606340653,"body":"@Bigbearharris79 The point is not even that she have \"fallen\" for the dude because \"muh dick is big\", she loves the MC but she cant express it and now add to that she is fucking with the dude just because and the MC knows it, imagine the remorse that she haves now and she thinks that the MC dont deserve her after that, we will see that shit coming full circle in the Chapter 2 of this prelude from the FMC point of view (we already saw MC and Dude point of view)."},{"id":1361964,"gallery_id":337241,"poster":{"id":3371246,"username":"Bigbearharris79","slug":"bigbearharris79","avatar_url":"avatars/3371246.png?_=23c978bfbf5decc6","is_superuser":false,"is_staff":false},"post_date":1606338227,"body":"How can Mc compete with this dude? They already showed there dick sizes and dude beats mc hands down and he been blowing her back out for a while. Women get use to sex with a person and any change of partner that cant live up to her sexual needs despite her loving the person always ends bad. Ppl men and women that seperate sexual needs and love will always cheat, mainly women cause they can orgasam countless times. Point is No hope for mc he needs to move on cause another dumb big dick dude that made her a tool ruined her mindset on love lol"},{"id":1361898,"gallery_id":337241,"poster":{"id":1238114,"username":"sarod","slug":"sarod","avatar_url":"avatars/1238114.png?_=b74bbf3a41abea53","is_superuser":false,"is_staff":false},"post_date":1606335207,"body":"@cuck4life if I'm right about Akina being in the cover of Vol.69 you have to give me a rimjob after i eat 12 burritos"},{"id":1361895,"gallery_id":337241,"poster":{"id":3708135,"username":"zoomking","slug":"zoomking","avatar_url":"avatars/3708135.png?_=02050d9d699c1e75","is_superuser":false,"is_staff":false},"post_date":1606335032,"body":"Like I said there's only one way to stop an NTR cut that fucker dick off."},{"id":1361885,"gallery_id":337241,"poster":{"id":2219877,"username":"cuck4life","slug":"cuck4life","avatar_url":"avatars/2219877.png?_=af495a08affac6b8","is_superuser":false,"is_staff":false},"post_date":1606334613,"body":"@hitormiss21 Part 1 of the second prelude from the female perspective.  Next part will be in the next weekly kairakuten (vol 68). Dont think theres gonna be a happy ending. If there is a sequel to chapter 2 its probably gonna end with bad ending."},{"id":1361873,"gallery_id":337241,"poster":{"id":2219877,"username":"cuck4life","slug":"cuck4life","avatar_url":"avatars/2219877.png?_=af495a08affac6b8","is_superuser":false,"is_staff":false},"post_date":1606334270,"body":"Just copy and paste the pixiv link to see the next cover."},{"id":1361870,"gallery_id":337241,"poster":{"id":2219877,"username":"cuck4life","slug":"cuck4life","avatar_url":"avatars/2219877.png?_=af495a08affac6b8","is_superuser":false,"is_staff":false},"post_date":1606334149,"body":"@sharpeningrod only two covers dude. The next cover is the girl corrupted bimbo form cover. Link to the next cover\n\nモタモタしてたら幼馴染がどっかの男と付き合ってた漫画（サンプル） | ドラムス #pixiv https://www.pixiv.net/en/artworks/85838684"},{"id":1361850,"gallery_id":337241,"poster":{"id":2947705,"username":"Lethal_Intent","slug":"lethal_intent","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606333545,"body":"What the fuck is wrong with this girl, they really are trying to drag it out. She seems jealous that mc is \"popular\" and has other friends while she lives and fucks another dude. She never has looked at it from male lead's perspective with his love confession and she basically said no and continues to fuck the other dude."},{"id":1361845,"gallery_id":337241,"poster":{"id":3708135,"username":"zoomking","slug":"zoomking","avatar_url":"avatars/3708135.png?_=02050d9d699c1e75","is_superuser":false,"is_staff":false},"post_date":1606333203,"body":"Well there's only one way to stop a \nntr from happening cut the guy's dick off."},{"id":1361837,"gallery_id":337241,"poster":{"id":3258791,"username":"NaDelz","slug":"nadelz","avatar_url":"avatars/3258791.png?_=5ffe9a6536d2058e","is_superuser":false,"is_staff":false},"post_date":1606332856,"body":"why tf are people arguing about usless shit just beat your shmeat and leave holy fuck"},{"id":1361834,"gallery_id":337241,"poster":{"id":1768093,"username":"BeatMeatMaster64","slug":"beatmeatmaster64","avatar_url":"avatars/1768093.png?_=ce6a3a0ea6dc459b","is_superuser":false,"is_staff":false},"post_date":1606332775,"body":"It is the females perspective, young lads."},{"id":1361817,"gallery_id":337241,"poster":{"id":2243747,"username":"hitormiss21","slug":"hitormiss21","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606332307,"body":"Is that the 3rd chapter of 1st come 1st served, or just another pointless prelude?"},{"id":1361804,"gallery_id":337241,"poster":{"id":1238114,"username":"sarod","slug":"sarod","avatar_url":"avatars/1238114.png?_=b74bbf3a41abea53","is_superuser":false,"is_staff":false},"post_date":1606331760,"body":"@Euphorism When you take being a fucking dickhead as an insult when I'm asking you to \"not be\" one, that's not on me, dude. And going to someone's twitter for an unwarranted \"pleading\" over someone's creative work is never a positive thing to do, especially when you're \"seriously\" considering on doing it. Again, just move on."},{"id":1361784,"gallery_id":337241,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1606330963,"body":"@sharpeningrod Meh, don't have twitter don't even know how it works. It's common sense not to \"harass\" anyone. It's common sense to know the difference between \"pleading\" and \"harassing.\" I'm sure positive and negative options are expected anywhere. For Example, you calling me a fucking dickhead and intimidating me to not do something is a form of harassment right now."},{"id":1361754,"gallery_id":337241,"poster":{"id":1238114,"username":"sarod","slug":"sarod","avatar_url":"avatars/1238114.png?_=b74bbf3a41abea53","is_superuser":false,"is_staff":false},"post_date":1606329679,"body":"@Euphorism This is common sense, but in case you haven't been told, don't be a fucking dickhead and harass authors over a fucking doujin. If you don't like what they have to offer, just move on. You don't get a say in their own creations unless they're specifically asking for your input. "},{"id":1361730,"gallery_id":337241,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1606328943,"body":"At the end of this chapter of \"First come first served\", it ends in つづく so expect a little more of the story to come (cover art is also of this story so based on their pattern, usually one or two more chapters)"},{"id":1361728,"gallery_id":337241,"poster":{"id":3708135,"username":"zoomking","slug":"zoomking","avatar_url":"avatars/3708135.png?_=02050d9d699c1e75","is_superuser":false,"is_staff":false},"post_date":1606328927,"body":"What if the last chapters of the Story is  a Side Story for the main MC where a sexy ass milf moves into town and they develop a relationship and then they start having sex in his room."},{"id":1361683,"gallery_id":337241,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1606327388,"body":"@Xx_Pope_Francis_xX depend.... cause I don't want a cuck as my homie. I want a man of culture who love plot, art and all kind of sex/ fetish. "},{"id":1361677,"gallery_id":337241,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1606327113,"body":"https://twitter .com/komiflo/status/1330118792098279429\n\nnext cover and 1 page sample"},{"id":1361626,"gallery_id":337241,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1606325577,"body":"I think author just forgot MC must masturbate while he saw they had sex ( common NTR logic ) or he already add at end next part. "},{"id":1361600,"gallery_id":337241,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1606324922,"body":"Yeah, I seriously want to send this guy a tweet pleading him to make the male lead move on. He was a fool for waiting this long but she was a fool as well if she knew he was popular and did not try to get more romantic attention. Her decision making is horrible and I'm sure readers will hate it if the MC will keep clinging to the childhood friend. He's don't what he can, he tried to talk to the chad, he confessed and she didn't take it. If in the following chapters she still ignores his care despite the obvious signs then both MC & FMC should just move on their own ways.  MC has done done all he can he doesn't deserve jacking off to her porn in front of the pc. "},{"id":1361550,"gallery_id":337241,"poster":{"id":477004,"username":"FresshLikeLettuce","slug":"fresshlikelettuce","avatar_url":"avatars/477004.png","is_superuser":false,"is_staff":false},"post_date":1606323331,"body":"hmm! will that be the next chapter of First come First served? if yes, it sucks man what is the author trying to do?the girl is already ruined beyond salvation and she should be aware of what type of Dude his BF its and should be ready to be gangbanged anytime, and now MC? as everyone stated already  at least he doesn't look  like a complete pushover that can be intimidated by the Ugly bastard  and yea we think that he can move on after all till now he is close to give up on her he just need maybe 1 more push of some random shit with the girl and he can freely move on and get a better girl, Yea just like MC of CHITOSE  both of them can MOVE ON and leave those Bitches then a TIME SKIP of 5 or 10 years and we should be able to see both of them we different girls and living  good and the 2 bitches throw aside like thhe shit theyre."},{"id":1361543,"gallery_id":337241,"poster":{"id":3365183,"username":"notsurnamelol","slug":"notsurnamelol","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606323137,"body":"Its all for the money and milk honestly. Author was very clever to end chapter 2 on a depressing atmosphere, that would make people beg for another release which would motivitate dramus agency and for him to make another one but since it's NTR where a sun never shines they could never deliver satisfaction to readers because it's just like that. The story has been weak from the very beginning, the execution, approach and dialogue seems ludacris but its NTR doesn't really add up. This will end for the artist with a success in the NTR industry, popularity and money. As for readers, let your imagination run wild."},{"id":1361525,"gallery_id":337241,"poster":{"id":1693698,"username":"The Hentai Pope","slug":"the-hentai-pope","avatar_url":"avatars/1693698.png?_=cd3826fbb65949ed","is_superuser":false,"is_staff":false},"post_date":1606322719,"body":"Just a reminder to stay civil in the comment section. May you be a vanilla lover or just plain ol butthurt, just remember NTR lovers are homies too."},{"id":1361522,"gallery_id":337241,"poster":{"id":3810205,"username":"Kyuu_19","slug":"kyuu_19","avatar_url":"avatars/3810205.png?_=152ae0a3e6e62fb8","is_superuser":false,"is_staff":false},"post_date":1606322662,"body":"Author keeps making the story longer. It would be better if the mc has a girl who supports him and makes him move on with his childhood friend. I can even say mc is popular not your typical ntr cucked mc. After that the girl gets pregnant however she regrets since the old ugly guy leaves her that would be the best."},{"id":1361506,"gallery_id":337241,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1606322421,"body":"Hope the author makes the guy get a girlfriend and move on at least. Stop dragging the inevitable if female just going to fall further and become a street prostitution or something. "},{"id":1361500,"gallery_id":337241,"poster":{"id":1480502,"username":"Yurha","slug":"yurha","avatar_url":"avatars/1480502.png","is_superuser":false,"is_staff":false},"post_date":1606322286,"body":"I already seen the vol 68 cover. She blonde her hair and also why he put the rest sex scene in another volume instead put it altogether on one volume I just don't know why..."},{"id":1361492,"gallery_id":337241,"poster":{"id":1529900,"username":"papa bl3ss","slug":"papa-bl3ss","avatar_url":"avatars/1529900.png","is_superuser":false,"is_staff":false},"post_date":1606322048,"body":"this is not how you do ntr hentai, doesnt need to drag the story for so long. i mean the girl already fall in love with the dick since the start, there are no development at all. the ntr feel so half assed. and the sex scene doesnt good at all, it doesnt have that kind of flow. one of the weakest ntr i have read."},{"id":1361423,"gallery_id":337241,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1606320528,"body":"lol, I just refresh the page and the comment below just sums up what I'm about to say... But if this what I'm thinking, the artist might just ruin the story so hard. This is before they got into the fight... it pretty weak for her to assume that he's interested in someone else since how close they were and how he keeps contact with her. Plus how she just gave her body away like nothing, doesn't fit her character at all... leave it off at the dumb dude was first that would just make decent NTR... now is just completely trash, way to ruin yours work. Also, don't see the point of dragging on. The title already said it all, unless the artist does 180 and first come first serve to mean the MC actually was the first. Think about it, he actually first in that case. "},{"id":1361366,"gallery_id":337241,"poster":{"id":3611308,"username":"KongDonkey","slug":"kongdonkey","avatar_url":"avatars/3611308.png?_=46d7db44c510725e","is_superuser":false,"is_staff":false},"post_date":1606319067,"body":"Dramus is stretching this story a lot, it’s getting the same as Miito Shido’s works, the author did a different ntr in the beginning, but in the end it’s basically the same thing as an ordinary ntr, that the girl was raped and then she magically falls in love by the big guy and the popular Mc can't move on."},{"id":1361329,"gallery_id":337241,"poster":{"id":2556901,"username":"FunnyFear","slug":"funnyfear","avatar_url":"avatars/2556901.png?_=2b8cff737924837b","is_superuser":false,"is_staff":false},"post_date":1606318115,"body":"About Dramus story. Just sex? I expected more drama. We've seen that before."},{"id":1361312,"gallery_id":337241,"poster":{"id":1527880,"username":"Randomuserc","slug":"randomuserc","avatar_url":"avatars/1527880.png?_=05b8f2d5d0b1445e","is_superuser":false,"is_staff":false},"post_date":1606317597,"body":"I feel bad for the girl, she just wanted to be love, and the Mc didn't have the balls, black guy is a moron but did not leave the chance to pass away; chapter 2 is the end of the history, it always has been "},{"id":1361199,"gallery_id":337241,"poster":{"id":599871,"username":"OshiriMan","slug":"oshiriman","avatar_url":"avatars/599871.png?_=7cd660fbedc4439a","is_superuser":false,"is_staff":false},"post_date":1606313258,"body":"Finally gud stuff here hoping next or last vol end well "},{"id":1361177,"gallery_id":337241,"poster":{"id":1097316,"username":"EX_Bugs_bunny","slug":"ex_bugs_bunny","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606312337,"body":"I could go either way. I want the MC boy to Impress me with a comeback, or have the MC girl dive deep into intense gangbang territory. I'm just hoping we get more after the prelude."},{"id":1361144,"gallery_id":337241,"poster":{"id":1238114,"username":"sarod","slug":"sarod","avatar_url":"avatars/1238114.png?_=b74bbf3a41abea53","is_superuser":false,"is_staff":false},"post_date":1606311128,"body":"@cuck4life I only meant the cover. It's been a trend in WEEKLY Kairakuten to have a single character in progressing states of undress for 3 consecutive volumes covers. So even if Dramus isn't gonna have a chapter on Vol.69, Akina's still gonna be featured."},{"id":1361138,"gallery_id":337241,"poster":{"id":2219877,"username":"cuck4life","slug":"cuck4life","avatar_url":"avatars/2219877.png?_=af495a08affac6b8","is_superuser":false,"is_staff":false},"post_date":1606310973,"body":"@sharpeningrod only the next volume will have the second part of the prequel. Chapter 2 is the ending for this. Dramus has said depending on the reception he may be allowed to draw a chapter 3 but this is the part 1 of the prequel. No sequel unless he wants to."},{"id":1361103,"gallery_id":337241,"poster":{"id":1238114,"username":"sarod","slug":"sarod","avatar_url":"avatars/1238114.png?_=b74bbf3a41abea53","is_superuser":false,"is_staff":false},"post_date":1606309778,"body":"Also, I just noticed that because Akina is the WEEKLY Kairakuten's cover, the next two volumes would also feature her. Can't wait to see how she looks like in Vol.69's cover."},{"id":1361093,"gallery_id":337241,"poster":{"id":3519111,"username":"Cheesycube","slug":"cheesycube","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606309618,"body":"I’m I the only one who loves this story? It’s really well done and the characters are explored to give a greater impact. "},{"id":1361092,"gallery_id":337241,"poster":{"id":1238114,"username":"sarod","slug":"sarod","avatar_url":"avatars/1238114.png?_=b74bbf3a41abea53","is_superuser":false,"is_staff":false},"post_date":1606309530,"body":"Can't wait for that Akifujime's chapter 2. The girl's hot, the bull's an absolute animal, and the cuck isn't even worth thinking about. I'm honestly okay with Dramus milking the fuck out of this. I've jerked it to every single release of ShindoL's TSF series, I can do it for this one too because I really love their artstyle."},{"id":1361073,"gallery_id":337241,"poster":{"id":3730956,"username":"ya_boiz","slug":"ya_boiz","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606308469,"body":"Another prelude...hmm ok"},{"id":1361053,"gallery_id":337241,"poster":{"id":1891526,"username":"KratoSpartA","slug":"kratosparta","avatar_url":"avatars/1891526.png","is_superuser":false,"is_staff":false},"post_date":1606307615,"body":"Tbh I'm not expecting anything else from 1st come, 1st serve. Aside from the nice art, the story is very repetitive and trashy. Note that I like NTR in general, but this one is just boring at this point, well at least for me tho."},{"id":1360938,"gallery_id":337241,"poster":{"id":1442090,"username":"Patriot_95","slug":"patriot_95","avatar_url":"avatars/1442090.png?_=28ee927c604aef60","is_superuser":false,"is_staff":false},"post_date":1606302622,"body":"The first part of the chapter of First come, First serve is a prelude anyway. There will be another 16 pages in another magazine but they will be also a prelude. So, in the end, chapter 2 is pretty much the ending of the story."}]