[{"id":1376391,"gallery_id":337890,"poster":{"id":3874388,"username":"Hotkitty01","slug":"hotkitty01","avatar_url":"avatars/3874388.png?_=9e82b424272124a5","is_superuser":false,"is_staff":false},"post_date":1606859827,"body":"Got a bоnеr? Lеt mе hеlp уоu with that!😏🍌💦 - check my profile"},{"id":1373513,"gallery_id":337890,"poster":{"id":906789,"username":"lolman0","slug":"lolman0","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606754394,"body":"so we have the good people who love vanilla and the bad people who love rape and cheating... is that really the case? I mean all and all it all comes to ones personality and how fucked up they are to go from cheat to relationship stealing to rape to ryona to Guro. ah yes it all ends in guro since they are DEAD.\nNot only you steal their innocence, time and feelings you also steal their life.\nBasically we are all Shitty people to even watch this from the beginning and then bitching about it. if you don't like it then just close it and stop barking about it. pretend you saw nothing just like in real life when you see someone is raping someone else would you be the hero wannabe and bitch about it how its wrong or just walk away?"},{"id":1373132,"gallery_id":337890,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1606743926,"body":"@chromosome ntr is just stealing, that's the fundamental thing. Rape is just forced without consent, she can enjoy or not as well. The main selling points is the plot since ntr in theory usually involves good story building and setting. But simple minded ape don't care and so we have these shitty 95% of NTR today which basically just rape. This shit is the same... "},{"id":1372892,"gallery_id":337890,"poster":{"id":1061869,"username":"chromosome","slug":"chromosome","avatar_url":"avatars/1061869.png","is_superuser":false,"is_staff":false},"post_date":1606736185,"body":"The whole selling point of ntr imo is about the girl losing her mind over ntr man's dick. Putting it into a simple formula, NTR = mind break - rape ( because it's certainly not rape if she starts enjoying it from the get go)"},{"id":1372653,"gallery_id":337890,"poster":{"id":3209768,"username":"exknight","slug":"exknight","avatar_url":"avatars/3209768.png?_=aa4d2431547da17f","is_superuser":false,"is_staff":false},"post_date":1606728930,"body":"Day 3 of getting no reaction from reading an ntr"},{"id":1372414,"gallery_id":337890,"poster":{"id":3708135,"username":"zoomking","slug":"zoomking","avatar_url":"avatars/3708135.png?_=02050d9d699c1e75","is_superuser":false,"is_staff":false},"post_date":1606723295,"body":"There's multiple ways how to take care of a netorare man 1 chop off his peace 2 blackmail him 3 sleep with somebody that he cares about 4 frame him 5 call the cops 6 beat the shit out of him 7 mess up his reputation and image 8 and if all that doesn't work kill the fuck\n"},{"id":1372325,"gallery_id":337890,"poster":{"id":3808689,"username":"Arionis","slug":"arionis","avatar_url":"avatars/3808689.png?_=69aa539e747cf8bf","is_superuser":false,"is_staff":false},"post_date":1606721121,"body":"Agreed. Whats the point on cheating when your only hurting a person. Which it could've been easier to not be together at all. And no one get hurt. And why cheat why though"},{"id":1372190,"gallery_id":337890,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1606718110,"body":"I have never understood the no break up logic with some of these girls. I get some feel guilty and all but this girl is straight up savoring her time with fuck boi, why not just break up with boyfriend. It's not like she's planning to marry him."}]