[{"id":1730118,"gallery_id":338671,"poster":{"id":1618287,"username":"Link-Zelda","slug":"link-zelda","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620697527,"body":"Lmaoo the author is a fucking cuck and should kill himself and that girlfriend if she like her boyfriend she should also kill herself after what she done 🤣🤣"},{"id":1426465,"gallery_id":338671,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608744229,"body":"@BZo1480 Thanks for the summary. And yeah the hentai logic is strong. Amazing how she’s being portrayed to have feelings for the guy who blackmailed and assaulted her. I mean par for the course for Hentai after all, but it’s the tone that just feels off. You’ve got extreme NTR logic on one hand and “relatively to hentai” grounded consequences on the other.\n"},{"id":1421078,"gallery_id":338671,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1608540094,"body":"@zombieadd No problem, man. I gotta say that the Hentai Logic™ is rather strong in these last two chapters. The coach still being allowed to coach(or even simply allowed on campus) when the entire school has heard the rumor about him and Yuki is really, really dumb. Not to mention if even the teachers are treating her like a victim, why has no one told her parents yet? Also, the coach acting like he had her best interests in mind last chapter when he talked shit about Shouma finishing inside her was hilarious considering that this whole started because he's sexually assaulting and blackmailing her, lol."},{"id":1420737,"gallery_id":338671,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608529812,"body":"Another thing, why not leave her so she can be happy and not conflicted. Unless this is gonna end with one of those, “I love my girlfriend, her heart belongs to me but her body belongs to the coach.” Or, “No matter how much my girlfriend may fall, I’ll always lover her.”\n\nIn my mind, endings like that feel like such cop outs. Another thing is if she had to choose between one or the other, the women in these would always choose the NTR guy over their original guy. They want to have their cake and eat it too."},{"id":1420396,"gallery_id":338671,"poster":{"id":1535924,"username":"girosfle","slug":"girosfle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608517730,"body":"Is it serious that this shit came back with this shit, even though he knows she's going to cheat on him again?"},{"id":1420370,"gallery_id":338671,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1608516491,"body":"The hell. Why would he stay with her. She’s obviously not in love with him. She’s constantly thinking about being with the coach. She’s just forcing herself to stay with you to keep up her own mental image of a good girl. The tone of this NTR doesn’t match the actions of the characters. This isn’t being portrayed as your typical mind break NTR where the cuck starts to get off on his girl being stolen. But he still stays. Kind of unsatisfied with this NTR, it just feels inconsistent."},{"id":1420299,"gallery_id":338671,"poster":{"id":3776613,"username":"ParGeo","slug":"pargeo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608513567,"body":"Парень - дебил. Обычное сцикло, которое боится остаться один и готов простить любое блядство. "},{"id":1419877,"gallery_id":338671,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1608495373,"body":"@BZo1480: Thx for the summary, that really helps. Man, this sounds like Yuki will get more coach-fucking... this back and forth shit, and with that title, NTR is stronk in this one. Shouma pls do us a favor and get a new girl lol."},{"id":1419772,"gallery_id":338671,"poster":{"id":477004,"username":"FresshLikeLettuce","slug":"fresshlikelettuce","avatar_url":"avatars/477004.png","is_superuser":false,"is_staff":false},"post_date":1608491125,"body":"pfthahahahahaha so the guy even when knowing that the girl will fuck the teacher whenever he can't see her still decided to back with her pffftt ahahhahahahahahahahaa   a CUCK ALWAYS A CUCK      GG temmo+ignite+exhaust"},{"id":1419724,"gallery_id":338671,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608489049,"body":"so did they get back together or what?"},{"id":1419670,"gallery_id":338671,"poster":{"id":3419576,"username":"Ehbm92","slug":"ehbm92","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608486199,"body":"So is this going to continue with her cucking him with his approval/knowledge? "},{"id":1414024,"gallery_id":338671,"poster":{"id":283201,"username":"crosskun","slug":"crosskun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1608264408,"body":"Welp I thought this would be different but I guess a cuck will be a cuck lol"},{"id":1393526,"gallery_id":338671,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1607491944,"body":"@Ehbm92 She already did that when Shouma took her virginity and then she went to the coach right after, lol. Though, it does seem like he made her orgasm when they had sex in the infirmary when the coach walked in on them."},{"id":1391689,"gallery_id":338671,"poster":{"id":3625007,"username":"Erixhian","slug":"erixhian","avatar_url":"avatars/3625007.png?_=608fe77449c09b90","is_superuser":false,"is_staff":false},"post_date":1607417379,"body":"what the fuck is this"},{"id":1390917,"gallery_id":338671,"poster":{"id":3419576,"username":"Ehbm92","slug":"ehbm92","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607384607,"body":"She will have sex with him and not be satisfied and will cheat on him. What a dumbass this dude"},{"id":1389895,"gallery_id":338671,"poster":{"id":2504803,"username":"cheesers","slug":"cheesers","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607339474,"body":"The cuck didnt learn anything"},{"id":1389583,"gallery_id":338671,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1607327382,"body":"Like chapter 10, all credit for the summary goes to defan752."},{"id":1389579,"gallery_id":338671,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1607327251,"body":"(continued) Yuki and Shoma get shaved ice to celebrate. They appear like a normal couple again but Yuki's clearly down. Coach appears in the same restaurant and Shoma invites him to sit with them. They make small talk but Coach is teasing Yuki's feet under the table. Yuki again has conflicting feelings and is clearly aroused, but Shoma makes a stand against Coach and implies that he did something with Yuki. Yuki, however, denies it and covers for Coach. Afterwards they part ways with Coach. On a bus bench Yuki asks if Shoma saw the posts. He repeats that his phone was broken so he couldn't, which makes Yuki realize that he saw her and Coach together. Yuki is clearly distressed by the news, but Shoma reassures her and says that she'll do anything to make her feel at ease, even if it means turning a blind eye, because he's too afraid of losing her. Yuki is touched and they embrace."},{"id":1389571,"gallery_id":338671,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1607327022,"body":"Summary from EH: Yuki actually returns home and masturbates in the shower and on bed, noticing that she can no longer be satisfied without using a vibrator like Coach taught her. She now thinks of him nonstop. During practice next day, she tells Coach that she's going to rehydrate (intending for him to follow her for a quickie) but he doesn't. She is disappointed. Himeko joins her and they chat. Yuki advises Himeko to stay away from her for her own good, but Himeko apologizes for telling Shoma off in Chapter 9. Yuki realizes that she's been appearing heartbroken lately.\n On the way home they run into Shoma, who acts normal. His leg's been splinted and he tells Yuki that his phone's been broken (so he presumably hasn't seen the post). He invites her to his place for dinner. Time passes and Shoma continues to act normal. They win big in the tournament and advance to the next stage. Coach and Yuki don't see each other to lay low."},{"id":1388982,"gallery_id":338671,"poster":{"id":1064327,"username":"TvManga2020","slug":"tvmanga2020","avatar_url":"avatars/1064327.png","is_superuser":false,"is_staff":false},"post_date":1607309076,"body":"@mykel14 no it’s the same guy but the story to me was weak. He should move on and find another girl Yuki have to accept reality that she made a mistake on her part. She knows that MC told the teacher on her to get revenge."},{"id":1388615,"gallery_id":338671,"poster":{"id":283352,"username":"mykel14","slug":"mykel14","avatar_url":"avatars/283352.png","is_superuser":false,"is_staff":false},"post_date":1607296345,"body":"Huh what happened? The girl and the bf got back together? Or is it a new guy? \n.\nIt looks like it is not the end though."},{"id":1388520,"gallery_id":338671,"poster":{"id":402451,"username":"gamelord","slug":"gamelord","avatar_url":"avatars/402451.png","is_superuser":false,"is_staff":false},"post_date":1607292606,"body":"Mannn God why kiled all NTR BRAIN MAN 'IN WORLD ..."},{"id":1388341,"gallery_id":338671,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1607285921,"body":"Nahh... There's no way it ends like this. She even got interested to the other guy and the other guy reveals he got hots for her. "}]