[{"id":1389566,"gallery_id":338670,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1607326777,"body":"All credit for the summary goes to defan752 over on EH."},{"id":1389560,"gallery_id":338670,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1607326651,"body":"(continued) During practice Yuki wonders how to lay low. A girl asks her to go get Coach to meet with the team. Most students see her as a victim and say she doesn't need to go but some are suspicious. Eventually she goes. Coach doesn't want the two of them to be seen alone together, but Yuki wants to hear Coach's answer. He doesn't and asks her why she is still meeting with him, to which she responds that it's for Shoma's rec. Coach gets annoyed that she's still defending him because he's jealous of Shoma and nearly got Yuki pregnant in Chapter 7, meaning he's a bad boyfriend and doesn't care about her. Yuki points out that Coach has also been acting the same way, but he gets fired up and swears to take responsibility if it had been him. This stuns her and she runs off."},{"id":1389555,"gallery_id":338670,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1607326512,"body":"Here's a summary I saw on EH: Yuki and Coach have a long sex scene continuing from the end of Chapter 9. They lose track of time and get tired but Coach is reluctant to see her go. Yuki's mom calls wondering where she is. Yuki wants Coach to tell her if she's betraying him by going out with Shoma. Coach says he'll answer her question the next day. Next morning, Yuki goes to see Shoma, whose mom informs her that he went to the hospital after injuring his leg in Chapter 9. Yuki offers to let Coach know that Shoma's staying home from club activities that day but he yells that he doesn't need her to. When she gets to school, she's pulled aside by counselors who show her the anonymous post calling her relationship with Coach out. They treat her like the victim and ask if there's any truth to the allegations, but she denies all of it because she's afraid that Coach will rescind Shoma's recommendation. "},{"id":1388978,"gallery_id":338670,"poster":{"id":1064327,"username":"TvManga2020","slug":"tvmanga2020","avatar_url":"avatars/1064327.png","is_superuser":false,"is_staff":false},"post_date":1607308874,"body":"I think understand what’s going on she got burst by who wrote the letter and exposing her on website (which is MC because he the only one that knows what’s going on) and the director was upset at Yuki because she lied to the teachers that it’s not true about the letter. Because she’s starting to fall in love with director. Director told her he will take responsibility for his actions. And she realized that she made a mistake on her part. Ask me she get what she deserves dumb slut 😜"},{"id":1388278,"gallery_id":338670,"poster":{"id":1064327,"username":"TvManga2020","slug":"tvmanga2020","avatar_url":"avatars/1064327.png","is_superuser":false,"is_staff":false},"post_date":1607283770,"body":"I mean on Chapter 9 he find out the truth in last  4 or 5 page "},{"id":1388094,"gallery_id":338670,"poster":{"id":1064327,"username":"TvManga2020","slug":"tvmanga2020","avatar_url":"avatars/1064327.png","is_superuser":false,"is_staff":false},"post_date":1607276893,"body":"@Euphorism yeah he did in the last 4 or 5 page that letter that mc wrote is in website and spread rumors. I was waiting for that day coming you stupid slut 😜"},{"id":1388046,"gallery_id":338670,"poster":{"id":3205140,"username":"Player_D","slug":"player_d","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607275546,"body":"so did he reveal she is a slut?\n"},{"id":1387918,"gallery_id":338670,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1607271003,"body":"Did he find out already? I dont remember"}]