[{"id":1978303,"gallery_id":338839,"poster":{"id":287357,"username":"bluemorpho99","slug":"bluemorpho99","avatar_url":"avatars/287357.png","is_superuser":false,"is_staff":false},"post_date":1630126898,"body":"cant believe this isnt translated yet"},{"id":1527908,"gallery_id":338839,"poster":{"id":2810491,"username":"UncomfortableNikaT","slug":"uncomfortablenikat","avatar_url":"avatars/2810491.png?_=cba87d28f2549192","is_superuser":false,"is_staff":false},"post_date":1611675891,"body":"Ahhh yes.. more ntr that will give me a reason to not get a gf... "},{"id":1405812,"gallery_id":338839,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1607967244,"body":"I kinda like how NTR abuse the MC, it gave readers insecurity and a reality of what happens if you did this or that. The only thing that I'm worried about is people actually take it the opposite way and they enjoyed it lmao"},{"id":1394442,"gallery_id":338839,"poster":{"id":3705422,"username":"valentrax","slug":"valentrax","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607523435,"body":"In case anyone was wondering why this got \"reuploaded\" so quickly, page 94 was missing from the first upload."},{"id":1393724,"gallery_id":338839,"poster":{"id":3708135,"username":"zoomking","slug":"zoomking","avatar_url":"avatars/3708135.png?_=02050d9d699c1e75","is_superuser":false,"is_staff":false},"post_date":1607497853,"body":"First of all if niggers don't like what I say don't read my comments and second of all why you getting mad over a hentai that isn't real"},{"id":1392562,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607456358,"body":"@METROID 2.00 Lmao, Ok. If that's what a dog bark, so be it. There are no more cookies for you. Feeding you further would be a waste of food for such a dog's brain. Even Chihuahua is smarter than this dog."},{"id":1392550,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607456149,"body":"@brucucked Ok, here is 2 different examples having the same plot to reflect \"betrayal of trust\" in NTR: incest between mother and son. [荒井啓] 蟷螂の巣 (https://nhentai.net/g/150541/) vs. [ほーすている] 母さんじゃなきゃダメなんだっ (https://nhentai.net/group/horsetail/). Do you know why, in \"蟷螂の巣\", it's considered NTR, while \"母さんじゃなきゃダメなんだっ\" are just incest/cheating, despite both have the son steal the mom from the father (lack of daily sex life), both have the mom subservient to the son? B/c the \"betrayal of trust\" factor between the two (MC vs FMC) in \"蟷螂の巣\", while there isn't one in the other. (in both work, the Father is not MC if you're going to add 'betrayal of trust' in marriage)."},{"id":1392547,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607455857,"body":"@brucucked Did you know how to read? Too much for your dog's brain? Both parties have to reciprocate each other's feelings at some point in the story, directly or indirectly. A one-sided crush/ affection is meaningless shit. Additionally, it's not enough b/c NTR has to have a betrayal of a trust factor, and to have such, both must have enough intimate relationship together somewhere in the storyline. Otherwise, it's considered rape/ incest/ etc."},{"id":1392488,"gallery_id":338839,"poster":{"id":3279234,"username":"brucucked","slug":"brucucked","avatar_url":"avatars/3279234.png?_=99f2385fca8c29f2","is_superuser":false,"is_staff":false},"post_date":1607453497,"body":"That's a lot of barks for someone who like to call people with reasonable argument dogs lmao. You said it yourself, NTR is about stealing the protagonist's significant other, which you included: family member, relative, someone beside Gf/Bf, and someone that is PRECIOUS TO THE MC. A close friend which is bounded by years of fondness to each other could be considered an intimate relationship. And even if it's just a crush, it's still precious to the mc, which fucking contradict to your first comment. Make up your fucking mind hypocrite. "},{"id":1392467,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607452478,"body":"@METROID 2.00 I'm going to give this very simple example to educate you on which one is NTR and not. Read this one: [田中あじ] 僕の家族を晒します (https://nhentai.net/g/338612/). Hint: what happens to his family members is not NTR, but what happens to Fumika is NTR. Got it, dog's brain!!"},{"id":1392421,"gallery_id":338839,"poster":{"id":3483935,"username":"𝕊𝕖𝕚𝕛𝕚","slug":"seiji","avatar_url":"avatars/3483935.png?_=c179f846fcf790ad","is_superuser":false,"is_staff":false},"post_date":1607451204,"body":"I hate NTR but why did this turn me on? am I falling into the trap?"},{"id":1392410,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607451010,"body":"@METROID 2.00 also, an intimate relationship is different than a sexual relationship. Here is a lesson cookie for you, dog!!"},{"id":1392403,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607450690,"body":"@METROID 2.00 LoL. That's what SO means (including a family member, relative, someone beside Gf/Bf, spouses that is precious to MC). Otherwise, I wouldn't list Gf/Bf as a different category from SO. And once again, a dog cannot comprehend human' intelligence and try to speak with barking nonsense. Oh, to be considered NTR, if it's a platonic/ childhood crush, there has to be a plot point where both parties have to confront and resolve their feelings during the story (it doesn't matter if it starts at beginning/ middle/ or end), thus resulting in a conflicted emotional level (satisfaction vs. dissatisfaction, guilt (lust) vs. regret (irrational), etc). LoL, one-sided crush/ affection means jackshit without that condition, b/c there isn't a betrayal of trust in the 1st place."},{"id":1392381,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607449950,"body":"@otomono correct me if I'm wrong, but on page 33, you will see that the FMC is going to give MC the concrete answer \"コウタに言わなきゃいけない事があるの…\" (I have something to say to you, Kouta...) - And the MC interrupts FMC as he asks why she becomes so serious (- This is after he asks if she's free during Christmas -) - and he has a hunch that he will hear an unpleasant answer, a rejection. (綾姉との関係がここで終わってしまう. そんな気がして. その場を誤麿化すので精一杯だった一). That's what I read from it."},{"id":1392220,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607445612,"body":"@brucucked Oh, another dog knows that \"cheating is different from NTR\". Congrats!! Now you can learn to eat your shit before bark twice. NTR is about stealing the protagonist's significant other and cause a disturbing emotional level (regretful/ guilty/ broken) to both parties as the result."},{"id":1392216,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607445383,"body":"@METROID 2.00 LMAO, ok. From your comment, I know you know jackshit about NTR definition. Learn to bark first before spewing shit."},{"id":1392212,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607445255,"body":"@otomono No, it'll be NTR if both MC and FMC are in a deep intimate relationship (husband/wife, Gf/Bf, significant others). At the moment, they are just friends at the least, one has a crush on the other without even a single close physical contact (such as hugging, hand-holding, etc). That's why the FMC's action is not considered a betrayal of trust, and the antagonist's act doesn't consider stealing b/c FMC is not MC's SO. Also, no, FMC only implies that she will respond with a concrete answer soon, but she doesn't mean that she will say to love him as a man in a previous chapter. It's that she's aware of his feeling."},{"id":1392157,"gallery_id":338839,"poster":{"id":3279234,"username":"brucucked","slug":"brucucked","avatar_url":"avatars/3279234.png?_=99f2385fca8c29f2","is_superuser":false,"is_staff":false},"post_date":1607443100,"body":"Niggas better learn their shit before declaring some dumbass statement with pride. Cheating is different from ntr faggot. Then ya'll get mad if metroid blast your ass in a \"(Insert name) is another (vanilla fag, dumbass, cunt, zoomer, retarded, any COD lobby insults to your mother)\" format. Prevention is better than cure. Learn your shit."},{"id":1392007,"gallery_id":338839,"poster":{"id":2181037,"username":"otomono","slug":"otomono","avatar_url":"avatars/2181037.png","is_superuser":false,"is_staff":false},"post_date":1607435644,"body":"Moskol wdym by that..The girl acknowledged in p1 she knew about the reclusive guy's feelings and showed signs she may have some..Both didnt act on it...Later some bits and pieces of hentai logic ensued..\nThis is NTR but not cheating."},{"id":1391862,"gallery_id":338839,"poster":{"id":3708135,"username":"zoomking","slug":"zoomking","avatar_url":"avatars/3708135.png?_=02050d9d699c1e75","is_superuser":false,"is_staff":false},"post_date":1607426643,"body":"Man fuck this shit if nobody is going to do Revenge I'm going to make my own Revenge  hentai where the MC comes out on top"},{"id":1391692,"gallery_id":338839,"poster":{"id":330808,"username":"Moskol","slug":"moskol","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1607417493,"body":"This is so pathetic. Fapping when your crush gets fucked?. And also, this is not NTR. The MC is not in any relationship with FMC, so FMC freely chooses whomever to be with. It's not considered either cheating or cucked b/c FMC doesn't even belong to the MC in the 1st place, just a crush. Lmao. Man~ the term NTR has been loosely losing its meaning nowadays."},{"id":1391410,"gallery_id":338839,"poster":{"id":1797784,"username":"Tony098","slug":"tony098","avatar_url":"avatars/1797784.png?_=be57b4b655ad8ebf","is_superuser":false,"is_staff":false},"post_date":1607405658,"body":"Why are they making this kind of stories can't they make mc little powerful instead of jerking"},{"id":1391349,"gallery_id":338839,"poster":{"id":2263841,"username":"fablelyst","slug":"fablelyst","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607403489,"body":"One way to end this cycle... "},{"id":1391220,"gallery_id":338839,"poster":{"id":3652413,"username":"icameforthebooty16","slug":"icameforthebooty16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607397723,"body":"Bro i love ntr and shit but shit this just pissed me the fuck off "},{"id":1391210,"gallery_id":338839,"poster":{"id":1535924,"username":"girosfle","slug":"girosfle","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1607397222,"body":"bad shit, lost another girl, poor mc, this bald guy has to die\n"}]