[{"id":2096272,"gallery_id":340048,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634848788,"body":"Also the title of this from what I can understand is something like Akane - It feels good to be raped over and over. Akane being the name of the girl who's the focus in this chapter."},{"id":2093281,"gallery_id":340048,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634717750,"body":"Anyhow summary of the story. Pretty much the guys are childhood friends and the other guy is a popular outgoing guy who everyone likes and he even has a \"harem\" consisting of 5 girls who are all in love with him. Then we have the other guy who is ugly and an introvert and was often bullied but the popular guy helped him out and they see each other as best friends. Then the popular guy tells the other guy that he will now confess to Akane the girl he likes the most and \"settle down\". But he also tells the other guy he should also try to confess to the girl he likes. I also believe he say's something like if he's having trouble with words he should just \"show\" her how much he loves her. Then the other guy goes and asks Akane to meet him on the rooftoop and then goes on to rape her over and over while she screams for him to stop. "},{"id":2093278,"gallery_id":340048,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634717618,"body":"Then it goes forward a bit in time either some hours or a few days with the popular guy confessing to Akane and she pretty much starts laughing and saying that she's sorry but they've childhood friends for so long that she can't see him as anything but her friend. Then the other guy enters and he goes haha you should have confessed sooner and you told me to confess so I did and now she's all mine. But I'm a nice guy and want us all to get along so why don't we all have sex together? Then the guy runs of and the two goes too bad or something with the girl adding she'll gonna have to be extra nice to the other guy now or something. But who cares now bring out your cock thats much more important. Then they fuck a bunch more and then at the end the guy goes something like dang I am still horny and Akane can't keep up if I do any more she'll break. Then the other guy has run and met up with the Gyaru girl and she just keeps on smiling to everthing and it just ends with a strong hint that"},{"id":2093275,"gallery_id":340048,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634717451,"body":"in the next chapter and probably some more it will keep on going with the \"popular\" guy wanting to get together with some other girl in the harem while the \"best friend\" guy just keeps on raping + stealing the girls until they all become a part of his harem or something."},{"id":2093262,"gallery_id":340048,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634716839,"body":"Sometimes I wonder in these stories if it's Netorare or Netori since the MC here seems to be the guy fucking."},{"id":1428117,"gallery_id":340048,"poster":{"id":3907439,"username":"gudako34","slug":"gudako34","avatar_url":"avatars/3907439.png?_=bf09d4d040883f34","is_superuser":false,"is_staff":false},"post_date":1608799034,"body":"Lebih bagus lagi kalo dah ditranslate"},{"id":1417465,"gallery_id":340048,"poster":{"id":2029608,"username":"山本栞","slug":"shan-ben-kan","avatar_url":"avatars/2029608.png?_=86d5b267d7a33d2a","is_superuser":false,"is_staff":false},"post_date":1608391694,"body":"Oke, pcoli ini menarik ya, wajah ahegao nya sangat merangsang. Dan gw juga croot dari dojin ini. Hm, tapi agak terganggu perubahan warna. "},{"id":1416584,"gallery_id":340048,"poster":{"id":565763,"username":"vilao21","slug":"vilao21","avatar_url":"avatars/565763.png","is_superuser":false,"is_staff":false},"post_date":1608356422,"body":"This isn't related to 315861 nor 318387."},{"id":1416129,"gallery_id":340048,"poster":{"id":3924251,"username":"neo3546566","slug":"neo3546566","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608339629,"body":"Nah I translated the last panels. They don't regret it the dude wanted more sex so he felt sad she couldn't keep up with him (probs gonna fuck the rest of their friends) and the girl was out of her mind saying so good. Oh and they aren't going out they're just sex partners they offered the skinny if he wanted to fuck as well. 👍👍👍"},{"id":1416079,"gallery_id":340048,"poster":{"id":3205140,"username":"Player_D","slug":"player_d","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608337015,"body":"Do they regret it or something? Whats with those last panels"},{"id":1416052,"gallery_id":340048,"poster":{"id":2408988,"username":"Sgt. Morningwood","slug":"sgt-morningwood","avatar_url":"avatars/2408988.png?_=79dc690bab62f983","is_superuser":false,"is_staff":false},"post_date":1608335840,"body":"Dude there are previous work of the same thing, it looks like the antag showed MC a hypnotising app and the girl went with the flow in the first part and fucked with MC only to be really hypnotised by the antag and being used to play with MC's feelings\n\nThese are \npart 1 : https://nhentai.net/g/315861/\nPart 2 : https://nhentai.net/g/318387/\n"},{"id":1416020,"gallery_id":340048,"poster":{"id":3924251,"username":"neo3546566","slug":"neo3546566","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608334388,"body":"Can anyone describe the plot to me. I get a general idea but I don't really understand. Was the Skinner mc crushing on the the girl that got fucked? Did the buff one know? Did they call him to the class to see him suffer or something? Oh is there gonna be a part 2 also?"}]