[{"id":1420435,"gallery_id":340159,"poster":{"id":3641492,"username":"Rednaxela.ExE","slug":"rednaxela-exe","avatar_url":"avatars/3641492.png?_=99306eafb730163e","is_superuser":false,"is_staff":false},"post_date":1608519238,"body":"I remember reading the matchgirl, I personally didn't find it that bad as it got a kinda happy end, but I don't remember the abusive father part though and that probably made it less sad. I thought that her father died and her mother was struggling to take care of her so she went selling matches to help her mother then, yeah, the rest happened. I guess it was less sad because she didn't have a abusive father in the version I read."},{"id":1417726,"gallery_id":340159,"poster":{"id":3341948,"username":"ManOCulture","slug":"manoculture","avatar_url":"avatars/3341948.png?_=de1b47cb5992e95a","is_superuser":false,"is_staff":false},"post_date":1608400910,"body":"I cant fap to this after reading that V"},{"id":1417641,"gallery_id":340159,"poster":{"id":3926463,"username":"Fuck Y'all","slug":"fuck-y-all","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1608398800,"body":"Made an account just for this. The motherfucking matchgirl story was fucking traumatizing as a kid, like holy shit. For whoever never heard or read it, it basically goes like this: The girl is selling matches in the freezing cold either on Christmas eve or New Years' eve, she can't go home because abusive father, so she keeps at it but no one is buying matches from her so she starts burning one after another for just a little bit of warmth. After a bit, hypothermia kicks in and she starts having visions of warmth and the lights of a christmas tree while she slowly succumbs to the biting cold she can no longer feel. After she dies her dead grandmother takes her soul to heaven where they are finally happy together. Like holy fuck was that shit sad and terrifying when I was a kid, and now I find fucking porn of it, like goddamn. - Already posted this comment on the japanese version but I might as well put it here too."}]