[{"id":2416210,"gallery_id":341890,"poster":{"id":4095917,"username":"GtgamerSL","slug":"gtgamersl","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648180608,"body":"\"Wake up to reality, nothing ever goes as planned in this accursed world. The longer you live the more you'll realize that the only things that truly exist in this reality are merely pain, suffering, and futility. Listen, everywhere you look in this world wherever there is light there will always be shadows to be found as well. As long as there is a concept of victors, the vanquished will also exist. The selfish intent of wanting to preserve peace initiates wars, and hatred is born in order to protect love. These are nexuses, causal relationships that cannot be separated. I want to sever the fate of this world. A world of only victors. A world of only peace. A world of only love. I will create such a world.\""},{"id":2412959,"gallery_id":341890,"poster":{"id":2246992,"username":"Waraduk","slug":"waraduk","avatar_url":"avatars/2246992.png","is_superuser":false,"is_staff":false},"post_date":1648015623,"body":"This is canon 1000.00%"},{"id":2389590,"gallery_id":341890,"poster":{"id":4879348,"username":"denditwittard","slug":"denditwittard","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647059734,"body":"Wish I could doggy style Aqua phat ass"},{"id":2355538,"gallery_id":341890,"poster":{"id":3359540,"username":"purpurpickle","slug":"purpurpickle","avatar_url":"avatars/3359540.png?_=6087a87f0cb199d2","is_superuser":false,"is_staff":false},"post_date":1645595517,"body":"Nice comment section"},{"id":2313714,"gallery_id":341890,"poster":{"id":4917763,"username":"I abandoned hope","slug":"i-abandoned-hope","avatar_url":"avatars/4917763.png?_=6d8191575de6d95d","is_superuser":false,"is_staff":false},"post_date":1644096594,"body":"You bet your ass thats the only blessing she has completely useless in the anime kazuma struggling frfr"},{"id":2281843,"gallery_id":341890,"poster":{"id":2324488,"username":"Pom Pom Cultist","slug":"pom-pom-cultist","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1642850572,"body":"We are often taught that in life their is a wrong and a right answer. Or this person is completely evil and this one is good. Unfortunately this is not the way of world. Life contains no true absolute. Life has countless hurdles and their is no guaranteed solitary perfect answer to any of them. As such we are forced to take what life teaches us and hope that our choices were more on the side of right then wrong. Lastly remember that only the Sith believe in absolutes."},{"id":2269423,"gallery_id":341890,"poster":{"id":3876946,"username":"chronicmathsdebator","slug":"chronicmathsdebator","avatar_url":"avatars/3876946.png?_=0df24a8f0d909bb2","is_superuser":false,"is_staff":false},"post_date":1642384815,"body":"As it is ever nearing valentines day, i feel it necessary to base my bi-monthly science lesson on feelings of attraction. Today students i will be discussing\"misattribution of arousal\". Misattribution of Arousal is the phrase used to describe when an individual mistakenly attributes a strong sense of another feeling as romantic interest in another person. This most commonly occurs during, what the body percieves as, intense high pressure or even life threatening situations such as riding rollercoasters or walking through a haunted house. The human body renders the strong feeling of fear indistinguishable from a strong feeling of arousal towards another leading to romantic feelings (although most of the time temporary) towards another person."},{"id":2252990,"gallery_id":341890,"poster":{"id":1661251,"username":"pyrex123","slug":"pyrex123","avatar_url":"avatars/1661251.png?_=61bcc744ea54b93c","is_superuser":false,"is_staff":false},"post_date":1641731359,"body":"The Alcubierre drive, Alcubierre warp drive, or Alcubierre metric (referring to metric tensor) is a speculative warp drive idea based on a solution of Einstein's field equations in general relativity as proposed by theoretical physicist Miguel Alcubierre during his PhD study at the University of Wales, Cardiff, by which a spacecraft could achieve apparent faster-than-light travel if a configurable energy-density field lower than that of vacuum (that is, negative mass) could be created.\nRather than exceeding the speed of light within a local reference frame, a spacecraft would traverse distances by contracting space in front of it and expanding space behind it, resulting in effective faster-than-light travel. Objects cannot accelerate to the speed of light within normal spacetime; instead, the Alcubierre drive shifts space around an object so that the object would arrive at its destination more quickly than light would in normal space without breaking any physical laws.\n\n"},{"id":2248873,"gallery_id":341890,"poster":{"id":1661525,"username":"coolguy222","slug":"coolguy222","avatar_url":"avatars/1661525.png","is_superuser":false,"is_staff":false},"post_date":1641554172,"body":"One of the best Aqua reads out there"},{"id":2241613,"gallery_id":341890,"poster":{"id":4852647,"username":"Z1berロボッ","slug":"z1berrobotsu","avatar_url":"avatars/4852647.png?_=07cd824d21ff4a6f","is_superuser":false,"is_staff":false},"post_date":1641273782,"body":"My theory on black holes, the Black holes said Nasa that noway out, but it may have out, but on others side, on the other side is a sun or a stars it have a great gravity like our sun it may connected on the other black hole that why any other star blown up or got black holes because to much power because the other side is getting a power that produce the other side of sun so if sun explode the black hole of the sun is gone because the other side sun turn into black hole"},{"id":2218450,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1640373066,"body":"So about quantum entanglement, it's actually something Stephen Hawking used to explain the so called Hawking radiation, a radiation occurring near the event horizon of a black hole. It's like this, in empty space, matter anti matter pairs come in and out of existence, immediately cancelling each other out. These pairs are quantum entangled, meaning that if the spin of one of them changes, the spin of the other one also changes, no matter how far away they are. This is a problem, because that would mean that they exchange information with each other at a speed faster  than light, which isn't possible, but it's quantum mechanics so let's ignore that. Now, if such a pair appears at the event horizon, with each one on a different side, they can in theory exchange information about things inside the event horizon, this effect is called Hawking radiation (SIMPLIFIED BY A LOT). Anyway I wish you all a merry Christmas and hope to see more interesting talks in this comment section! -A nihilist"},{"id":2203417,"gallery_id":341890,"poster":{"id":4661769,"username":"tejaz","slug":"tejaz","avatar_url":"avatars/4661769.png?_=3211aebc3ce90e06","is_superuser":false,"is_staff":false},"post_date":1639734969,"body":"A wise man once said 'amongus'"},{"id":2202218,"gallery_id":341890,"poster":{"id":4602957,"username":"Mr.Stroke","slug":"mr-stroke","avatar_url":"avatars/4602957.png?_=2a3fd4a6330fce33","is_superuser":false,"is_staff":false},"post_date":1639676035,"body":"Quantum entanglement is a physical phenomenon that occurs when a group of particles are generated, interact, or share spatial proximity in a way such that the quantum state of each particle of the group cannot be described independently of the state of the others, including when the particles are separated by a large distance. The topic of quantum entanglement is at the heart of the disparity between classical and quantum physics: entanglement is a primary feature of quantum mechanics lacking in classical mechanics.\nMeasurements of physical properties such as position, momentum, spin, and polarization performed on entangled particles can, in some cases, be found to be perfectly correlated. For example, if a pair of entangled particles is generated such that their total spin is known to be zero, and one particle is found to have clockwise spin on a first axis, then the spin of the other particle, measured on the same axis, is found to be counterclockwise. Yeah, I definitely wrote this."},{"id":2201093,"gallery_id":341890,"poster":{"id":3790482,"username":"kamadoseryu","slug":"kamadoseryu","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1639609296,"body":"The quantum entanglement theory says that particles can influence each other even if they're separated by great distances, like billions of miles or maybe the entire length of the universe."},{"id":2199428,"gallery_id":341890,"poster":{"id":3876946,"username":"chronicmathsdebator","slug":"chronicmathsdebator","avatar_url":"avatars/3876946.png?_=0df24a8f0d909bb2","is_superuser":false,"is_staff":false},"post_date":1639529287,"body":"Hello Mr Alexteo, regarding the Ship of Thesues paradox and the regenerating cells i didn't even think of the connection, so props to you for the association. In regards to my answer to the Ship of Thesues paradox; I believe that the ship remains the same, my theory is that an object is not decided on its physical features but rather it's purpose. Say for example you have a torch, if said torch runs out of battery and you replace it with a new brand of battery does that mean you have a new torch? no you do not. If we apply this logic to the Ship of Theseus paradox, every time the ship is repaired with new planks of wood, the purpose does not change and as the boat like a torch with new batteries it functions as before. "},{"id":2198668,"gallery_id":341890,"poster":{"id":577762,"username":"alexteo","slug":"alexteo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1639487104,"body":"huh @chronicmathsdebator so does that tie into the Ship of Theseus paradox as well? If that is the case, I wanna see your opinion on the paradox as well if you don't mind"},{"id":2191966,"gallery_id":341890,"poster":{"id":3876946,"username":"chronicmathsdebator","slug":"chronicmathsdebator","avatar_url":"avatars/3876946.png?_=0df24a8f0d909bb2","is_superuser":false,"is_staff":false},"post_date":1639180470,"body":"Hello again students, Prof chronic here. Did you know that your body right now is not the same as the one you had around 7~10 yrs ago? The human body contains 37.2 trillion cells, on average 1,000,000 of those cells die and are replaced every day meaning that once 7/10 years have passed none of the same cells from your past body remain. "},{"id":2170364,"gallery_id":341890,"poster":{"id":2585074,"username":"Dio_The_Invader","slug":"dio_the_invader","avatar_url":"avatars/2585074.png","is_superuser":false,"is_staff":false},"post_date":1638166073,"body":"A lot of philosophers here. Fine, I'll give it a try.\n\n\nLife is soup and I'm fork."},{"id":2161415,"gallery_id":341890,"poster":{"id":4171607,"username":"Thepizzacrust","slug":"thepizzacrust","avatar_url":"avatars/4171607.png?_=b1274ad168a88ace","is_superuser":false,"is_staff":false},"post_date":1637787791,"body":"Cock and ball torture (CBT), occasionally known as penis torture, dick torture, or male genitorture/male genital torture, is a sexual activity involving the application of pain or constriction to the penis or testicles. This may involve directly painful activities, such as genital piercing, wax play, genital spanking, squeezing, ball-busting, genital flogging, urethral play, tickle torture, erotic electrostimulation, kneeing or kicking.[1] The recipient of such activities may receive direct physical pleasure via masochism, or emotional pleasure through erotic humiliation, or knowledge that the play is pleasing to a sadistic dominant. Many of these practices carry significant health risks."},{"id":2161149,"gallery_id":341890,"poster":{"id":1610376,"username":"AnotherRat","slug":"anotherrat","avatar_url":"avatars/1610376.png?_=caeb786f3ad0f622","is_superuser":false,"is_staff":false},"post_date":1637774040,"body":"(1/2) The missile knows where it is at all times. It knows this because it knows where it isn't. By subtracting where it is from where it isn't, or where it isn't from where it is - whichever is greater - it obtains a difference or deviation. The guidance subsystem uses deviations to generate corrective commands to drive the missile from a position where it is to a position where it isn't, and arriving at a position that it wasn't, it now is. Consequently, the position where it is is now the position that it wasn't, and if follows that the position that it was is now the position that it isn't. In the event that the position that it is in is not the position that it wasn't, the system has acquired a variation. "},{"id":2161143,"gallery_id":341890,"poster":{"id":1610376,"username":"AnotherRat","slug":"anotherrat","avatar_url":"avatars/1610376.png?_=caeb786f3ad0f622","is_superuser":false,"is_staff":false},"post_date":1637773791,"body":"(2/2) The variation being the difference between where the missile is and where it wasn't. If variation is considered to be a significant factor, it too may be corrected by the GEA. However, the missile must also know where it was. The missile guidance computer scenario works as follows: Because a variation has modified some of the information that the missile has obtained, it is not sure just where it is. However, it is sure where it isn't, within reason, and it knows where it was. It now subtracts where it should be from where it wasn't, or vice versa. And by differentiating this from the algebraic sum of where it shouldn't be and where it was, it is able to obtain the deviation and its variation, which is called error."},{"id":2151479,"gallery_id":341890,"poster":{"id":1362657,"username":"Einher","slug":"einher","avatar_url":"avatars/1362657.png?_=3c2e3ff27e5368cf","is_superuser":false,"is_staff":false},"post_date":1637307336,"body":"what the fuck are you guys talking about just touch your cocks/vaginas already"},{"id":2112599,"gallery_id":341890,"poster":{"id":4642497,"username":"PUSSYCAT(>~<)","slug":"pussycat","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635515038,"body":"All of us are just illusion. In truth we're just atoms, recycled when we die so it's not farfetched to say that your body contains an atom of a meteor, black hole and star, we all are atoms "},{"id":2100268,"gallery_id":341890,"poster":{"id":4082988,"username":"Artavazdpet","slug":"artavazdpet","avatar_url":"avatars/4082988.png?_=f1b4d6bb676040e4","is_superuser":false,"is_staff":false},"post_date":1635005148,"body":"Finally, this type of sleep allows dolphins to maintain certain physiological processes, such as muscle movements, in order to maintain body temperature in the cold ocean."},{"id":2100262,"gallery_id":341890,"poster":{"id":4082988,"username":"Artavazdpet","slug":"artavazdpet","avatar_url":"avatars/4082988.png?_=f1b4d6bb676040e4","is_superuser":false,"is_staff":false},"post_date":1635004984,"body":"When it comes time to rest, the dolphin turns off only one hemisphere of the brain and closes the opposite eye at the same time (the left eye will be closed when the right half of the brain is asleep, and vice versa). And the other half of the brain at this time monitors what is happening in the environment and controls respiratory functions. Sometimes dolphins stay on the surface of the water while sleeping, sometimes they can swim slowly. In captivity, scientists also observed dolphins sleeping at the bottom of the pool (periodically they rise to the surface for air). There are three main reasons why dolphins have developed this type of sleep. Firstly, dolphins would drown if they did not keep part of the brain active, since they always control breathing consciously. Secondly, such a dream allows animals to monitor possible dangers while they rest. (Continued from above)"},{"id":2082185,"gallery_id":341890,"poster":{"id":3876946,"username":"chronicmathsdebator","slug":"chronicmathsdebator","avatar_url":"avatars/3876946.png?_=0df24a8f0d909bb2","is_superuser":false,"is_staff":false},"post_date":1634262908,"body":"Hello again Gentlemen, have you ever wondered why we find images \"creepy\"? well i'm here to tell you exactly why, In your brain you have a special neuron named the \"Amygdala\" which specializes in decision making as well as emotion based reactions, this means often your body will react towards things you consider 'creepy' without your brain telling it to do so. In fact the majority of things the average human considers 'creepy' is solely a response to the possibility of ambiguous danger rather than the inevitability.\n"},{"id":2081715,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1634241422,"body":"Yes, I am back.\nWhile I am not 100% certain about what you are trying to ask alexteo, our 'rules' are fundamental things of the universe. An example, If you see a circle you'd call it a circle. You could spin it and maybe use it as a wheel or whatever else you can do with a circle. Now if some other \"thing\" is trying to describe the circle, it might name it differently and maybe they'd come up with other ideas for it due to their sensational difference, but in the end it will always stay a circle. Same with the rules of the universe, they do exist for everything within our universe, just because another species experiences or calls them differently, doesn't mean they cease to exist for them. There are 4 fundamental rules (maybe 5 if the new discovery turns out to be real) and they always apply. \nHope that answered your question,\n- A nihilist living in hell. ^^"},{"id":2081038,"gallery_id":341890,"poster":{"id":577762,"username":"alexteo","slug":"alexteo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1634216858,"body":".. Why the hell is there a science lecture occurring in a hentai comment section...\nThough, I kinda have a question as well, right now our entire technology tree is based on all kinds of laws and rules that we defined ourselves based on multiple experiments and the sort, but if say there is another race that is sensing the world differently from us and thus interpreting and hypothesizing different laws and rules, does that mean there is actually no set rule for the universe and the rules are just what has been theorized and defined by each species? If that is the case, will there actually be any fundamental rule between us and said hypothetical species that is exactly the same?"},{"id":2078644,"gallery_id":341890,"poster":{"id":4712770,"username":"Kirby Cosmico Mexicano","slug":"kirby-cosmico-mexicano","avatar_url":"avatars/4712770.png?_=be4d8df6b32ff5a9","is_superuser":false,"is_staff":false},"post_date":1634106427,"body":"This is one of the best comment sections I've ever seen, thanks for sharing your knowledge wisemen, this proves that people who like hentai are superior."},{"id":2021813,"gallery_id":341890,"poster":{"id":4060207,"username":"Comedia","slug":"comedia","avatar_url":"avatars/4060207.png?_=f26e65a293d6d861","is_superuser":false,"is_staff":false},"post_date":1631864427,"body":"Damn boy! This comment section was so entertaining to read.\n@just_one_comment you are an absolute chad."},{"id":1978686,"gallery_id":341890,"poster":{"id":4634901,"username":"aPersonwithoutfuture","slug":"apersonwithoutfuture","avatar_url":"avatars/4634901.png?_=5a86fcdd2fffc551","is_superuser":false,"is_staff":false},"post_date":1630140965,"body":"I love this shit"},{"id":1973496,"gallery_id":341890,"poster":{"id":790513,"username":"Terra1125","slug":"terra1125","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1629942941,"body":"Lol I think that blue thing is going to be a horrid mother"},{"id":1965611,"gallery_id":341890,"poster":{"id":4348859,"username":"ddd destroy dick delighted","slug":"ddd-destroy-dick-delighted","avatar_url":"avatars/4348859.png?_=8b7be6cad7687c2f","is_superuser":false,"is_staff":false},"post_date":1629655748,"body":"The photoelectric effect is the emission of electrons or other free carriers when light shines on a material. Electrons emitted in this manner can be called photo electrons. This phenomenon is commonly studied in electronic physics, as well as in fields of chemistry, such as quantum chemistry or electrochemistry. According to classical electromagnetic theory, this effect can be attributed to the transfer of energy from the light to an electron. From this perspective, an alteration in the intensity of light would induce changes in the kinetic energy of the electrons emitted from the metal. Furthermore, according to this theory, a sufficiently dim light would be expected to show a time lag between the initial shining of its light and the subsequent emission of an electron."},{"id":1956727,"gallery_id":341890,"poster":{"id":4348859,"username":"ddd destroy dick delighted","slug":"ddd-destroy-dick-delighted","avatar_url":"avatars/4348859.png?_=8b7be6cad7687c2f","is_superuser":false,"is_staff":false},"post_date":1629337927,"body":"To all innocent souls that have stumbled into this comment section, If you are reading this, you are immune to all current or future curses on this site. Copy and paste this to 5 other manga, so others may be saved as well. I'm doing this to help y'all out. Stay safe everyone."},{"id":1900516,"gallery_id":341890,"poster":{"id":4351743,"username":"AraAraMilfLover93","slug":"araaramilflover93","avatar_url":"avatars/4351743.png?_=3d1909f1c82691b7","is_superuser":false,"is_staff":false},"post_date":1627335479,"body":"I definitely need to watch Konosuba one of these days. The hentai of it is great."},{"id":1877020,"gallery_id":341890,"poster":{"id":2737549,"username":"Mexican Dio 🌮","slug":"mexican-dio","avatar_url":"avatars/2737549.png?_=cfed7d951b13e168","is_superuser":false,"is_staff":false},"post_date":1626467168,"body":"To all innocent souls that have stumbled into this comment section, If you are reading this, you are immune to all current or future curses on this site. Copy and paste this to 5 other manga, so others may be saved as well. I'm doing this to help y'all out. Stay safe everyone."},{"id":1831611,"gallery_id":341890,"poster":{"id":4171945,"username":"erasatu","slug":"erasatu","avatar_url":"avatars/4171945.png?_=2f87aafbc4bee01e","is_superuser":false,"is_staff":false},"post_date":1624643004,"body":"Aqua is a burden but she is so beautiful"},{"id":1823692,"gallery_id":341890,"poster":{"id":1606537,"username":"Def2004","slug":"def2004","avatar_url":"avatars/1606537.png?_=d63c409712cac14e","is_superuser":false,"is_staff":false},"post_date":1624361221,"body":"Then basically only the atoms that can be classified as \"touching each other\" (?)"},{"id":1803082,"gallery_id":341890,"poster":{"id":3876946,"username":"chronicmathsdebator","slug":"chronicmathsdebator","avatar_url":"avatars/3876946.png?_=0df24a8f0d909bb2","is_superuser":false,"is_staff":false},"post_date":1623540133,"body":"Fun fact: Humans cannot touch anything, when you touch something for example the keyboard im using now, you are only touching the atoms on the surface with the atoms on the end of your fingertips. The feeling you get when you \"touch\" an object is called mutual atomic repulsion which keeps the atoms from combining and becoming one\n\n-side note i love this comment section post more scientific theories for the love of aqua"},{"id":1777584,"gallery_id":341890,"poster":{"id":4334355,"username":"nocringeman","slug":"nocringeman","avatar_url":"avatars/4334355.png?_=d57cf501a0a830b3","is_superuser":false,"is_staff":false},"post_date":1622618923,"body":"Wait guys, what happened?"},{"id":1765204,"gallery_id":341890,"poster":{"id":4210715,"username":"Hentai Wanderer","slug":"hentai-wanderer","avatar_url":"avatars/4210715.png?_=649ee1465e2967e1","is_superuser":false,"is_staff":false},"post_date":1622059628,"body":"Purify purify "},{"id":1754388,"gallery_id":341890,"poster":{"id":3341505,"username":"marutea","slug":"marutea","avatar_url":"avatars/3341505.png?_=86ae311ffbf95d55","is_superuser":false,"is_staff":false},"post_date":1621627176,"body":"post-nut clarity really be affecting people's minds huh"},{"id":1711777,"gallery_id":341890,"poster":{"id":3683308,"username":"gundam_geek","slug":"gundam_geek","avatar_url":"avatars/3683308.png?_=63fdb728059a261e","is_superuser":false,"is_staff":false},"post_date":1619924672,"body":"What's a virginiy"},{"id":1690130,"gallery_id":341890,"poster":{"id":3921501,"username":"SushiDealer","slug":"sushidealer","avatar_url":"avatars/3921501.png?_=8a4e599850ec69a3","is_superuser":false,"is_staff":false},"post_date":1618957890,"body":"I aint even gonna read the entire college textbook here "},{"id":1677990,"gallery_id":341890,"poster":{"id":3737919,"username":"AzurlaneFapper","slug":"azurlanefapper","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1618379301,"body":"I came out of this doujin more educated than what schools teach me. Holy shiet"},{"id":1673641,"gallery_id":341890,"poster":{"id":3900869,"username":"kuzuci","slug":"kuzuci","avatar_url":"avatars/3900869.png?_=c0b2af4632971e78","is_superuser":false,"is_staff":false},"post_date":1618174634,"body":"the comments what the fuck"},{"id":1667629,"gallery_id":341890,"poster":{"id":1986005,"username":"dumbass bourbon","slug":"dumbass-bourbon","avatar_url":"avatars/1986005.png?_=60201697ae8546b6","is_superuser":false,"is_staff":false},"post_date":1617890981,"body":"favorited this for the comments"},{"id":1666556,"gallery_id":341890,"poster":{"id":3440514,"username":"OburciTroll","slug":"oburcitroll","avatar_url":"avatars/3440514.png?_=02724ead8a6d3d26","is_superuser":false,"is_staff":false},"post_date":1617844618,"body":"I came for porn and stayed because of physics"},{"id":1648083,"gallery_id":341890,"poster":{"id":3722315,"username":"vek","slug":"vek","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1617037117,"body":"good doujin + legendary comment section 11/10"},{"id":1633094,"gallery_id":341890,"poster":{"id":1328572,"username":"Venom95","slug":"venom95","avatar_url":"avatars/1328572.png?_=4a0cda9bb7fb846f","is_superuser":false,"is_staff":false},"post_date":1616392763,"body":"The fuck is going on in this comment section?!"},{"id":1607586,"gallery_id":341890,"poster":{"id":3459571,"username":"Pekopekopeko","slug":"pekopekopeko","avatar_url":"avatars/3459571.png?_=7922baaf46d20758","is_superuser":false,"is_staff":false},"post_date":1615268828,"body":"Goddess indeed"},{"id":1603199,"gallery_id":341890,"poster":{"id":3083837,"username":"AsukaFan","slug":"asukafan","avatar_url":"avatars/3083837.png","is_superuser":false,"is_staff":false},"post_date":1615097690,"body":"@just_one_comment\nThis is just one of many theories. While I agree that relatively low-mass black holes can’t be a getaway to anywhere, it’s quite short-minded to believe that in singularity normal laws of physics can apply. For example, look at the quantum world- most of macro-physics laws don’t work there, so imagine HOW they would work in a black hole. And although I can agree that it would be impossible to get to another dimension (if you can even do that with supermassive black holes) due to spaghettification, as for me it’s very unlikely, but again, possible.\nIt can be debated whether or not it would lead to a 2D or 4D universe or even simply another version of our dimension. And, unfortunately, I highly doubt that even if we got there we would be able to even technically exist there."},{"id":1597071,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1614804444,"body":"Hello guys, it's been a while. i want to answer @HushDaWolf's question about black holes, because all the other questions have already been answered, you just need to scroll down ;). Anyway, it's not possible for a black hole to be a gateway into another dimension. That is because a black hole has a singularity at it's center, which is just super compressed mass. So every time matter is sucked into it, it just goes on adding to the singularity. Which is also why black holes can grow in size, the more they suck in. Black holes are really cool and you can do a lot of things with them (theoretically of course). For example it is possible to \"travel into the future\" (not really because time is relative, but we'll call it that to avoid confusion) because of it's gravitation. Anyway that's all I wanted to say, stay interested ^^ -Nihilism is god and he is dead"},{"id":1590840,"gallery_id":341890,"poster":{"id":1015053,"username":"HushDaWolf","slug":"hushdawolf","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1614497016,"body":"I have no words for this comment section except holy fuck is this  awesome! I didn't read all of comments but couldn't a black hole technically be a gateway to another dimension? Because if it's sucking in all matter even light it self doesn't it all have to go out somewhere?"},{"id":1589185,"gallery_id":341890,"poster":{"id":2790046,"username":"Empiras","slug":"empiras","avatar_url":"avatars/2790046.png?_=1506dfde073af515","is_superuser":false,"is_staff":false},"post_date":1614415671,"body":"@dynamxcs  Your question about the big bang...it isn’t sure yet how it occurred but there is a theory about the \"end\" of the universe. 1. There is the death of OUR current universe by collapsing in itself. So as our universe expands due to dark matter \"pulling it\" our universe also is pulling everything to the inside because of gravity. And now if the universe is pulling stronger than the dark matter (<—– | ->) it will collide in itself(Big Crunch) and based on the Big Bounce theory, after a Big Crunsh another Big Bang can happen and the universe is like resetting itself. This could mean an endless process of Big Bounces is why the Big Bang happened. Thus our universe could be the nth universe. However this theory is very unlike to be happening. (READ FIRST)"},{"id":1554457,"gallery_id":341890,"poster":{"id":3896662,"username":"Red_Bl00d","slug":"red_bl00d","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612841690,"body":"I just realized... \n\n\n\n\n\n\n\n\nthe chicken came first"},{"id":1531824,"gallery_id":341890,"poster":{"id":2291595,"username":"boymoe","slug":"boymoe","avatar_url":"avatars/2291595.png","is_superuser":false,"is_staff":false},"post_date":1611853941,"body":"kinda poggers"},{"id":1529495,"gallery_id":341890,"poster":{"id":1606537,"username":"Def2004","slug":"def2004","avatar_url":"avatars/1606537.png?_=d63c409712cac14e","is_superuser":false,"is_staff":false},"post_date":1611750498,"body":"Talking about other dimensions makes us really close to questioning a possibility to meet our waifus / husbandos"},{"id":1525067,"gallery_id":341890,"poster":{"id":2986492,"username":"Bapak dapid Anton btw","slug":"bapak-dapid-anton-btw","avatar_url":"avatars/2986492.png?_=bb6818866022ee05","is_superuser":false,"is_staff":false},"post_date":1611553077,"body":"Wtf of all this comment lmao"},{"id":1524900,"gallery_id":341890,"poster":{"id":3476626,"username":"n(^.^)n","slug":"n-n","avatar_url":"avatars/3476626.png?_=58c2c7ee45b14dad","is_superuser":false,"is_staff":false},"post_date":1611546378,"body":"I read so many comments about the multiverse theory and quanta entanglement but I give you a simpler solution used in various books and movies:it was but a dream, or rather, Kazuma's subconscious wishes that were brought to the surface for a brief moment. We have no evidence what is occurring is actually reality rather than a figment of Kazuma's imagination"},{"id":1516739,"gallery_id":341890,"poster":{"id":3815705,"username":"thatonefilipinokid","slug":"thatonefilipinokid","avatar_url":"avatars/3815705.png?_=13c1285ce564a915","is_superuser":false,"is_staff":false},"post_date":1611200525,"body":"Y'all really being philosophical in a hentai manga, dear god do I love this community "},{"id":1515916,"gallery_id":341890,"poster":{"id":3966703,"username":"Dynamxcs","slug":"dynamxcs","avatar_url":"avatars/3966703.png?_=3de350b88f5f2ddc","is_superuser":false,"is_staff":false},"post_date":1611164019,"body":"First of all,  thats exactly why I love this community. So I also have many questions but Im trying to just ask one or two. \n\nMy first qeustion is how the big bang occured. I mean if there was nothing at the beginning how is it possible that something happened in the first place. Its like creating something out of nothing and that should be impossible.\n\nMy second question would be how do rules in the universe even exist and why does the universe even follow it? How is it possible that something like gravity exists, couldnt the universe act without it? If the multiverse theory is true then there should be a universe which doesnt follow it rules so why does our universe constantly behave? Why does it act predictable (if you knew every law and possibility everything would be predictable, I guess).\n\nIm sorry if the questions are weird formulated, there are just so many questions I have about the universe and everything beyond and I just dont know how to express myself. \nThanks for reading!"},{"id":1514889,"gallery_id":341890,"poster":{"id":3248390,"username":"Dissu","slug":"dissu","avatar_url":"avatars/3248390.png?_=4546b06663428846","is_superuser":false,"is_staff":false},"post_date":1611123544,"body":"sucky sucky aqua "},{"id":1511243,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1610985747,"body":"Well like I have already said, even if the multiverse theory is correct, which is highly unlikely, because we find more and more evidence that it is false, then it is, under no circumstances ever possible to interact between them. The theory itself is basically proven false at this point anyway, however if it were to be true, it is based of quantum mechanics and Heisenberg's uncertainty principle and thus interaction being impossible is a basis of the multiverse theory. With time travel it is like this: travelling into the future is possible, after all time is relative and the movie interstellar shows one possibility of time travel that is actually doable, not that we have the technology. Travelling back in time is very difficult, not to say impossible. The theory closest to actual time travel, back in time would be the anti telephone by Einstein, however he himself proved his own theory to be false (massive flex i know xD). Start there if you are interested. -My Nihilism kills me ^^"},{"id":1509921,"gallery_id":341890,"poster":{"id":3930599,"username":"TsunaKUN","slug":"tsunakun","avatar_url":"avatars/3930599.png?_=37eed04962c8c67c","is_superuser":false,"is_staff":false},"post_date":1610939185,"body":"I am kinda late to add this question... But why didnt people from other dimensions come yet? There must be so many people that can travel back in time already, and yet they wont visit our boring timeline... Are we unlucky perhaps? Or just not worth going back to? Is it cause of covid, and other dimensions dont want this virus in their timeline, so they avoid us? Is there way that covid is only in few dimensions? "},{"id":1509883,"gallery_id":341890,"poster":{"id":3930599,"username":"TsunaKUN","slug":"tsunakun","avatar_url":"avatars/3930599.png?_=37eed04962c8c67c","is_superuser":false,"is_staff":false},"post_date":1610937620,"body":"@just_one_comment kinda diff topic, but I dont want this conversation to die.. If there is googleplex and more dimension, there will surely be soon dimension that can travel between dimensions, maybe it already happened, but America has to keep it as a secret, but very unlikely, but in that case, when we die our mind remains in those googleplex dimensions, and gets splitted up to all of them, meaning, person dies only after dying in all dimensions, that means, that theres really, really, really small possibility, that your mind might get transported into another world... Meaning that we actually might get isekaied, or it might end up in paradox, those people that died, are actually alive in another dimensions, but there might be sudden fail in all dimensions, leading to death of all possible versions of you, leading to real death, which might transport you into another universum that differs from real world, but those deaths in all dimensions would be really rare. But thats just theory"},{"id":1487970,"gallery_id":341890,"poster":{"id":3523077,"username":"Horny Dekomori","slug":"horny-dekomori","avatar_url":"avatars/3523077.png?_=e79d5ff51d0fd0e0","is_superuser":false,"is_staff":false},"post_date":1610657057,"body":"I like the bum sluty aqua but the comments are better"},{"id":1485321,"gallery_id":341890,"poster":{"id":3170784,"username":"Naplaeo","slug":"naplaeo","avatar_url":"avatars/3170784.png?_=de06e339afe5b439","is_superuser":false,"is_staff":false},"post_date":1610567790,"body":"This comments section is pure brain reinforcement."},{"id":1484381,"gallery_id":341890,"poster":{"id":1606537,"username":"Def2004","slug":"def2004","avatar_url":"avatars/1606537.png?_=d63c409712cac14e","is_superuser":false,"is_staff":false},"post_date":1610536540,"body":"Thank you people for all the answers! I feel more educated now"},{"id":1484299,"gallery_id":341890,"poster":{"id":1541374,"username":"TotallyNotIntoHentai","slug":"totallynotintohentai","avatar_url":"avatars/1541374.png","is_superuser":false,"is_staff":false},"post_date":1610533433,"body":"Kazuma is just big brain if you impregnate a god you get the god treatment"},{"id":1484229,"gallery_id":341890,"poster":{"id":3046711,"username":"HopeLost","slug":"hopelost","avatar_url":"avatars/3046711.png?_=ee0c834c61ab9912","is_superuser":false,"is_staff":false},"post_date":1610530538,"body":"Oh wow.. I just learned a lot from a hentai comment section haha it was an interesting read ^^"},{"id":1478491,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1610320646,"body":"Couldn't have said it better @possibly_retarded. I want to add something thou, because while what you were mentioning with quantum entanglement was correct, i don't think that was what he meant with empty space. I guess what he was talking about was what lies outside the universe, a question that is likely impossible to answer, at least for humans. But from what we gathered: No its not a part of the map uncovered. Its not like our Universe expands into something, it just widens itself without interfering with whatever is out there. But there is a popular theory that states that universe is infinite in itself. You can imagine it like a ball that goes around and in of itself. But these things are concepts we cant imagine, so id like to refer to a short story called Flatland which explains the concept of something impossible for us to understand, i highly recommend it. If you want ask your questions, its really fun to answer them, which i am not doing alone anymore it seems. -A nihililist"},{"id":1475905,"gallery_id":341890,"poster":{"id":3989926,"username":"Kraken-Sama","slug":"kraken-sama","avatar_url":"avatars/3989926.png?_=284b9a0765f5f046","is_superuser":false,"is_staff":false},"post_date":1610225727,"body":"I appreciate the answers everyone :)"},{"id":1475581,"gallery_id":341890,"poster":{"id":3999546,"username":"possibly_retarded","slug":"possibly_retarded","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610215627,"body":"Strange matter is simply matter composed of strange quarks. Quarks are elementary particles which make up hadrons, or things like protons and neutrons. Strange quarks are in the second (out of three) generation of quarks. The higher the generation, the more mass they have and the less stable they are. That's why you only really see up and down quarks in nature (protons and neutrons). Kurzgesagt has a fun little video on strange stars you can watch that explains much better than I do. kudos to anyone who actually read everything i posted lul"},{"id":1475563,"gallery_id":341890,"poster":{"id":3999546,"username":"possibly_retarded","slug":"possibly_retarded","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610215122,"body":"\"Dark matter is a form of matter thought to account for approximately 85% of the matter in the universe and about a quarter of its total mass–energy density...\" \"Dark matter is called dark because it does not appear to interact with the electromagnetic field, which means it does not absorb, reflect or emit electromagnetic radiation, and is therefore difficult to detect.\" Simply put, we only \"know\" dark matter through its effects on others. It's used to account for the gravitational effects that can't be explained unless there's more matter than is visible to the eye. Dark energy is similarly used to account for the accelerating expansion of the universe which couldn't be explained using our current understanding of the universe. "},{"id":1475498,"gallery_id":341890,"poster":{"id":3999546,"username":"possibly_retarded","slug":"possibly_retarded","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610213321,"body":"Addressing what Def2004 said, I'm gonna assume by empty space u mean just the parts of space where u dont see anything. Even those areas usually have some gas or dust floating around so it's not truly empty. The next \"step\" in emptiness would be a vacuum state, where there's no matter in that area. Even then particle-antiparticle pairs spontaneously come into existence and annihilate each other all the time (this isnt random, there are certain requirements) This is one of the phenomena of virtual particles - a subject im not willing nor smart enough to look into. The specific phenomena is called pair production. So to summarize, space is rarely ever truly empty. "},{"id":1475467,"gallery_id":341890,"poster":{"id":3999546,"username":"possibly_retarded","slug":"possibly_retarded","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610212298,"body":"Ok all this is coming off the top of my head, so take it with a grain of salt. \n\nAs for what Voxir asked, there's not really and \"outside\" for the universe to expand to. It just expands from within, in empty space between matter, empty space being defined as an area not affected by gravity (this is the part im not sure of). I believe you can only find areas with such low gravity between galaxies."},{"id":1474361,"gallery_id":341890,"poster":{"id":3826763,"username":"Radvlight","slug":"radvlight","avatar_url":"avatars/3826763.png?_=40dd55564b777337","is_superuser":false,"is_staff":false},"post_date":1610171922,"body":"Welp, are we gonna talk about dark matter and strange matters?"},{"id":1473928,"gallery_id":341890,"poster":{"id":1606537,"username":"Def2004","slug":"def2004","avatar_url":"avatars/1606537.png?_=d63c409712cac14e","is_superuser":false,"is_staff":false},"post_date":1610159610,"body":"Btw this is a really great doujin, a very nice one"},{"id":1473918,"gallery_id":341890,"poster":{"id":1606537,"username":"Def2004","slug":"def2004","avatar_url":"avatars/1606537.png?_=d63c409712cac14e","is_superuser":false,"is_staff":false},"post_date":1610159321,"body":"Is the empty space really empty? Or is it like an undiscovered part of a map just like in a game, waiting to be discovered?\n"},{"id":1472642,"gallery_id":341890,"poster":{"id":3846393,"username":"Sky2Alex","slug":"sky2alex","avatar_url":"avatars/3846393.png?_=6fd4d713f727baad","is_superuser":false,"is_staff":false},"post_date":1610105930,"body":"I love this comment section"},{"id":1471795,"gallery_id":341890,"poster":{"id":3970874,"username":"WraTh3o2","slug":"wrath3o2","avatar_url":"avatars/3970874.png?_=3ca8ad31ad54551d","is_superuser":false,"is_staff":false},"post_date":1610076045,"body":"This comment section is great\n"},{"id":1469822,"gallery_id":341890,"poster":{"id":2790046,"username":"Empiras","slug":"empiras","avatar_url":"avatars/2790046.png?_=1506dfde073af515","is_superuser":false,"is_staff":false},"post_date":1610008368,"body":"First of all: Great comment section, love it. Second thing: Time. Time isn't infinite as when the heat death of the universe occurs. The laws of thermodynamics say that everything wants to be at the same temperature someday. So when everything once has the same temperature, nothing will happen anymore, no more molecular reactions, nothing moves and so on. So will time. If everything would stop moving or doing what it is doing, we can't count time anymore. Imagine nothing. Pure nothing. Would you be able to tell how much time has past in this \"nothing\"? No, you wouldn't. We need something to count the time off, like two atoms giving electrons back and forth. That's the reason why the Universe isn't infinite snd won't expand forever. Please correct me if I am wrong since I'm also german. Thank you and have a great day dear friends."},{"id":1469748,"gallery_id":341890,"poster":{"id":1097007,"username":"Maxtirun","slug":"maxtirun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1610006573,"body":"@Voxir\nWhat we call the universe is the entire amount of actual matter in space. It is what have been expanding (distance between matter). There is no known limit to the empty space outside of the universe for it to stop the expansion."},{"id":1469085,"gallery_id":341890,"poster":{"id":3989926,"username":"Kraken-Sama","slug":"kraken-sama","avatar_url":"avatars/3989926.png?_=284b9a0765f5f046","is_superuser":false,"is_staff":false},"post_date":1609983623,"body":"Since this comment section is a gathering of intellectuals I would like to ask a question that has been on my mind for quite some time. Since the beginning of the universe, it has been expanding right? So my question is, Into what is the universe expanding? If the universe is everything how can it get bigger, is there room for it to grow, or does it just expand into nothingness?\nIs there anything \"beyond\" the universe or does it not exist until it expands to that point? Maybe this is a question that is impossible to answer but if anyone has some ideas I would like to know, either way, have a great fap ladies and gentlemen."},{"id":1465716,"gallery_id":341890,"poster":{"id":3737971,"username":"Papa Fucking Louie","slug":"papa-fucking-louie","avatar_url":"avatars/3737971.png?_=b74a485fcb47ea65","is_superuser":false,"is_staff":false},"post_date":1609882996,"body":"How did Konosuba porn start a topic about thermodynamics and entropy"},{"id":1465439,"gallery_id":341890,"poster":{"id":3874830,"username":"MoeLester69","slug":"moelester69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609873765,"body":"Post nut clarity hit this comment section so hard that they started teaching a whole fucking science class "},{"id":1464851,"gallery_id":341890,"poster":{"id":3153784,"username":"tenmicer","slug":"tenmicer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609861244,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me (fuck the motherfucker who posted this shit in the first place. i actuals love my parents and i'd hate to see them die to bullshit like this.)"},{"id":1461484,"gallery_id":341890,"poster":{"id":3981502,"username":"Uzumakidavid","slug":"uzumakidavid","avatar_url":"avatars/3981502.png?_=8cc54029615bdc14","is_superuser":false,"is_staff":false},"post_date":1609783309,"body":"Second porh friend of mine "},{"id":1459345,"gallery_id":341890,"poster":{"id":3711111,"username":"GhostySSR","slug":"ghostyssr","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609729503,"body":"man wtf kskskskk...\nthis is the best comment section that i have seen in my life until now. wow. is truly astonishing to see how much this developed in a Hentai website. my hope on humanity has been recovered a little kskkskk."},{"id":1455498,"gallery_id":341890,"poster":{"id":3713025,"username":"Time Flies By","slug":"time-flies-by","avatar_url":"avatars/3713025.png?_=496bcac7c7da9b55","is_superuser":false,"is_staff":false},"post_date":1609621993,"body":"@Abusive Plague Doctor ı writed from gmail didnt answered lol"},{"id":1451601,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609511006,"body":"@A_Summarizer its actual atoms that are being split into their building stones. It happens when the expansion of the universe is faster than the speed of light, so then there would just be atoms, flying around but not being able to ever interact. Because of entropy, these particles would move away from each other with the speed of light. The freeze is actually not a freeze in stopping the movement, but time itself, which is a concept thats very hard to grasp, so dont be disappointed if you dont get it, scientists dont get it either. Hopefully that answered your question."},{"id":1451366,"gallery_id":341890,"poster":{"id":3742012,"username":"A_Summarizer","slug":"a_summarizer","avatar_url":"avatars/3742012.png?_=86527a286c17ab52","is_superuser":false,"is_staff":false},"post_date":1609504721,"body":"Well hold on a minute @just_one_comment , when you talk about a universe \"freeze\" and atoms not being able to move does that imply that all atoms have been separated individually or does it just mean celestial bodies are separate from one another because if it is the latter then wouldn't the force of something like a supernova cause a mass expulsion of atoms therefore ending the \"freeze\" for however long it lasts or does the force of dark matter just counteract that? If it's the former than how does it achieve said result? "},{"id":1450932,"gallery_id":341890,"poster":{"id":1474672,"username":"Abusive Plague Doctor","slug":"abusive-plague-doctor","avatar_url":"avatars/1474672.png","is_superuser":false,"is_staff":false},"post_date":1609491446,"body":"The final redpill is that those who read hentai are the smartest lads around. Cheers cunts, May we have a great 2021 and hopefully my dreams really will become real."},{"id":1450616,"gallery_id":341890,"poster":{"id":3967687,"username":"couch potato hub","slug":"couch-potato-hub","avatar_url":"avatars/3967687.png?_=0dd1e939e947b7fc","is_superuser":false,"is_staff":false},"post_date":1609484390,"body":"@EugEoX same"},{"id":1450605,"gallery_id":341890,"poster":{"id":3840070,"username":"EugEoX","slug":"eugeox","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609484129,"body":"Oh god i didn't expect i can learn more things here in the comment section"},{"id":1450394,"gallery_id":341890,"poster":{"id":3603718,"username":"FeraNikahia","slug":"feranikahia","avatar_url":"avatars/3603718.png?_=0577614dc3276730","is_superuser":false,"is_staff":false},"post_date":1609478770,"body":"This comment section is goated"},{"id":1450375,"gallery_id":341890,"poster":{"id":3814001,"username":"kazmathrowaway321","slug":"kazmathrowaway321","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609477849,"body":"kazuma x aqua is goated"},{"id":1449844,"gallery_id":341890,"poster":{"id":3964242,"username":"LittleCaesar","slug":"littlecaesar","avatar_url":"avatars/3964242.png?_=679925e7e20944f7","is_superuser":false,"is_staff":false},"post_date":1609463124,"body":"I keep coming back to this comment section just to see what new brilliant answers have appeared. To those answering the question, you have proved without a doubt that hentai fans are truly men of culture. Hats off to you all and I wish a Happy New Year and a good nut! "},{"id":1449830,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609462553,"body":"Oh yeah, happy new year to you all ^^"},{"id":1449811,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609462198,"body":"Dark matter is a kind of matter, found around galaxies, which keeps them spinning at a steady pace all around, sorry i cant explain it better. It wont interact with anything exept gravitation, which is the reason we know about it in the first place. Some galaxies were faster than their mass allowed so scientists thought about a reason, which was dark matter. I do not think we will ever interact with dark matter, because thats one of the things that makes it dark matter. However as i said we cant possibly predict the future, so there is a chance, however only for machines and not humans. If humans could do that, I dont think they would be humans anymore. Well, at least thats my take on the situation, hope I could help. -An unknown friend, drowning in his own nihilism"},{"id":1449799,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609461838,"body":"@RLHainne Well thats an interesting question, technology is evolving exponentially, which makes it impossible to predict the future especially if you go forth a hundred years. Our modern technology isnt really enough to get closer to the truth practically, but theoretically it is called the world formular, a formular which can be used to describe the whole universe. We are trying to get said formular, however our modern physics and chemestry is nothing more than a model, a very good one, but just a model. But even so there are attempts for the world formular, for example the string theory. The dark matter question is another thing."},{"id":1449603,"gallery_id":341890,"poster":{"id":3717990,"username":"just_a_lost_kid","slug":"just_a_lost_kid","avatar_url":"avatars/3717990.png?_=eaf390a2b5500ba8","is_superuser":false,"is_staff":false},"post_date":1609453493,"body":"@just_one_comment is back at it again! Fuck school, who needs school when you got just_one_comment to teach you everything you need to know!"},{"id":1449536,"gallery_id":341890,"poster":{"id":3923715,"username":"SmellyRafflesia","slug":"smellyrafflesia","avatar_url":"avatars/3923715.png?_=9eefc04ecb2bb5e7","is_superuser":false,"is_staff":false},"post_date":1609450787,"body":"To all innocent souls that have stumbled into this comment section, If you are reading this, you are immune to all current or future curses on this site. Copy and paste this to 5 other manga, so others may be saved as well. I'm doing this to help y'all out. Stay safe everyone."},{"id":1449421,"gallery_id":341890,"poster":{"id":3338918,"username":"RLHainne","slug":"rlhainne","avatar_url":"avatars/3338918.png?_=3edae7743ed84a16","is_superuser":false,"is_staff":false},"post_date":1609446463,"body":"@just_one_comment .. in your opinion... will it take like a hundred years before we can prove all these theories or are our technologies today enough to even just take a peak to the truth of the universe... will there be a time when humans will evolve to be able to perceive dark matter with our 5 senses or with the use of technology... "},{"id":1449376,"gallery_id":341890,"poster":{"id":650700,"username":"S.P.I.R.A.L.","slug":"s-p-i-r-a-l","avatar_url":"avatars/650700.png?_=0144cfc827e80ff1","is_superuser":false,"is_staff":false},"post_date":1609444778,"body":"If you are reading this, you can read."},{"id":1449359,"gallery_id":341890,"poster":{"id":3417242,"username":"emberember","slug":"emberember","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609444133,"body":"What the fuck is happening in this comment section and why did I just get a degree in something I can't even pronounce"},{"id":1448940,"gallery_id":341890,"poster":{"id":3895804,"username":"Dave Mathew","slug":"dave-mathew","avatar_url":"avatars/3895804.png?_=2aa0a1a136dad7ea","is_superuser":false,"is_staff":false},"post_date":1609432283,"body":"To all innocent souls that have stumbled into this comment section, If you are reading this, you are immune to all current or future curses on this site. Copy and paste this to 5 other manga, so others may be saved as well. I'm doing this to help y'all out. Stay safe everyone."},{"id":1448833,"gallery_id":341890,"poster":{"id":2238253,"username":"Out_of_the_shell","slug":"out_of_the_shell","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609428236,"body":"To all innocent souls that have stumbled into this comment section, If you are reading this, you are immune to all current or future curses on this site. Copy and paste this to 5 other manga, so others may be saved as well. I'm doing this to help y'all out. Stay safe everyone."},{"id":1448572,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609420509,"body":"constantly expand, leading to everything (atoms) being frozen in time and not being able to move, thus leading to the death of time itself, that would be the big freeze, which is with how things are right now, the most likely way the universe and thus time will die. However that lays way in the future, something we will never witness. If you are interested in one of the topics i mentioned and broke down EXTREMELY simplified, google the stuff i named and you will find something ^^. With that I once again leave, but I will check in here occasionally, so if you want to talk, just @ me and Ill answer you once I check up on here. \n -An unknown friend, trapped in his own nihilism"},{"id":1448556,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609420227,"body":"Well lets start shall we: The universe is expanding, but gravitation is constantly pulling it back together. Under normal circumstances the universe would have long collapsed, but it hasnt, thats because of the dark energy, which is a contra force to the gravitational force.Now we pretty much dont know anything about dark energy, other than it exists, however we can use that information like this: either the Universe will one day stop expanding, leading to the big crunch, where the gravitational force creates a black hole that will suck up the universe and finally itself; or the universe will expand quicker and quicker, until it rips apart galaxies with dark energy, the solar systems, then planets and finally atoms itself, leading them to move with the speed of light, not being able to interact at all, that would be the big rip. The last possibility is, that the gravitational and dark energy forces are relative to each other, which would mean that the universe would (Read bottom up)"},{"id":1448541,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609419836,"body":"So then, there was another comment by paxxer, saying that with how huge the universe is, it might be possible that there is another earth in our universe. And while the universe is massive, it isnt infinite, so the chances of such a planet to exist are basically 0, sorry. That doesnt mean that there cant be other lifeforms out there, if you wanna know more about that look into the fermi-paradox. So then, last but certainly not least, there was the question if time is infinite by FeraNikahia3. Well to answer this, you first have to understand that time and space are basically the same thing, hence its called space-time. Now, is it possible for the universe to be infinite? Maybe. Everything dies, even the universe. And there are 3 big theorys as to how that might happen: The big Crunch, the big freeze and the big rip. (Read bottom up)\n\n"},{"id":1448522,"gallery_id":341890,"poster":{"id":3958532,"username":"ereh yeageh","slug":"ereh-yeageh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609419483,"body":"Ayam goyeng nn"},{"id":1448513,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609419345,"body":"AHHH SHIT HERE WE GO... Well first of, what Beta Meta wrote was correct and to answer your question of if the sun is destroying Mass, not really. Mass and Energy are roughly the same, hence E=m*c^2 however what happens on the sun is so called Quantum tunneling, which says that objects can overcome an initial energy barrier to interact with each other, emitting the energy that was 'saved'. You were also correct with the 'magic', however even if we could do somethings that seem magical to us, in the end it still needs to have some roots in physics and be it that the universe is build with 16 building blocks and 4 general rules (look it up, its true). So yeah, stuff that seems magical to us could exist in a parallel universe, although it is unlikely for such a thing to exist in the first place. (Read bottom up)"},{"id":1448419,"gallery_id":341890,"poster":{"id":3954806,"username":"katontrash","slug":"katontrash","avatar_url":"avatars/3954806.png?_=eb7049916e51b74e","is_superuser":false,"is_staff":false},"post_date":1609416368,"body":"driptaro driptaro"},{"id":1448412,"gallery_id":341890,"poster":{"id":2526724,"username":"GMada","slug":"gmada","avatar_url":"avatars/2526724.png?_=97b786517f14e5f2","is_superuser":false,"is_staff":false},"post_date":1609416066,"body":"This comment section is kinda intellectual, ngl 10/10"},{"id":1448280,"gallery_id":341890,"poster":{"id":2124047,"username":"DemonFencer_420","slug":"demonfencer_420","avatar_url":"avatars/2124047.png?_=3814212075997156","is_superuser":false,"is_staff":false},"post_date":1609411185,"body":"This is an intellectual comment section"},{"id":1448259,"gallery_id":341890,"poster":{"id":3449019,"username":"ilovevanillaonly","slug":"ilovevanillaonly","avatar_url":"avatars/3449019.png?_=4f5a1ec313d3fd55","is_superuser":false,"is_staff":false},"post_date":1609410703,"body":"To all innocent souls that have stumbled into this comment section, If you are reading this, you are immune to all current or future curses on this site. Copy and paste this to 5 other manga, so others may be saved as well. I'm doing this to help y'all out. Stay safe everyone."},{"id":1448179,"gallery_id":341890,"poster":{"id":3603718,"username":"FeraNikahia","slug":"feranikahia","avatar_url":"avatars/3603718.png?_=0577614dc3276730","is_superuser":false,"is_staff":false},"post_date":1609408611,"body":"This is nice and all but i came for the comments also\nCan time be infinite? And does the fact that's one day the universe might end by The big rip or by the heat death can afffect the time flow or distract it by anymean ?"},{"id":1448153,"gallery_id":341890,"poster":{"id":3524992,"username":"ACYNED","slug":"acyned","avatar_url":"avatars/3524992.png?_=a91baec411ada727","is_superuser":false,"is_staff":false},"post_date":1609408111,"body":"This is a nice one!"},{"id":1448061,"gallery_id":341890,"poster":{"id":1483087,"username":"kingfish69","slug":"kingfish69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609406008,"body":"Man down so bad"},{"id":1447972,"gallery_id":341890,"poster":{"id":3423516,"username":"user_A_exist","slug":"user_a_exist","avatar_url":"avatars/3423516.png?_=abb022accdee2e90","is_superuser":false,"is_staff":false},"post_date":1609403782,"body":"That's a sweet one"},{"id":1447925,"gallery_id":341890,"poster":{"id":1310023,"username":"Dye","slug":"dye","avatar_url":"avatars/1310023.png?_=2e9034afcb3a963a","is_superuser":false,"is_staff":false},"post_date":1609402636,"body":"To all innocent souls that have stumbled into this comment section, If you are reading this, you are immune to all current or future curses on this site. Copy and paste this to 5 other manga, so others may be saved as well. I'm doing this to help y'all out. Stay safe everyone. I ALSO FUCKING HATE THOSE CHAIN MESSAGE SHIT SO HERE YOU GO."},{"id":1447743,"gallery_id":341890,"poster":{"id":3892870,"username":"just another random Horny weeb","slug":"just-another-random-horny-weeb","avatar_url":"avatars/3892870.png?_=bc18fbfe8333147d","is_superuser":false,"is_staff":false},"post_date":1609397796,"body":"Thanks for the protection and sorry for accidentally flagging you 😬"},{"id":1447732,"gallery_id":341890,"poster":{"id":3965052,"username":"FRIEZAOG","slug":"friezaog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609397493,"body":"Fuck those crappy little chain message shit about your “parents would die in 5 years if you dont resend it in 5 different manga”. I grant you the protection from those shitty messages and i even grant your parents immortality, now stay calm and fap."},{"id":1447719,"gallery_id":341890,"poster":{"id":3515521,"username":"Delsinblood","slug":"delsinblood","avatar_url":"avatars/3515521.png?_=57e5e6db6f095fd8","is_superuser":false,"is_staff":false},"post_date":1609397174,"body":"(Paxxer) yea u ar probably right Now I'm horny and guilty plus the heavy depression after making field good %change da world my final message, goodbye% *windows 95 start up sounds*"},{"id":1447592,"gallery_id":341890,"poster":{"id":3558521,"username":"FederalBureau of Investigation","slug":"federalbureau-of-investigation","avatar_url":"avatars/3558521.png?_=21a08c1d90be2ad3","is_superuser":false,"is_staff":false},"post_date":1609394309,"body":"I learned more in this comment section than all of my years in school and college."},{"id":1447589,"gallery_id":341890,"poster":{"id":3174633,"username":"Weeb_God","slug":"weeb_god","avatar_url":"avatars/3174633.png","is_superuser":false,"is_staff":false},"post_date":1609394272,"body":"Nice.      "},{"id":1447583,"gallery_id":341890,"poster":{"id":3964919,"username":"aldorezza","slug":"aldorezza","avatar_url":"avatars/3964919.png?_=d49f4b3661486fb1","is_superuser":false,"is_staff":false},"post_date":1609394199,"body":"I know people have answered this before, and the original poster has kind of close it, but J want to give my two cent about the discourse.\nThe law of physics and mathematics as we know it is actually not fully fixed or 100% sure yet. Those laws were actually just based on hypothesis proved by observable experiments and result. Magic could then be explained as the laws of physics and chemistry based on an understanding that we don't understand and/or prove yet"},{"id":1447499,"gallery_id":341890,"poster":{"id":3717990,"username":"just_a_lost_kid","slug":"just_a_lost_kid","avatar_url":"avatars/3717990.png?_=eaf390a2b5500ba8","is_superuser":false,"is_staff":false},"post_date":1609391590,"body":"Wow, I didn’t expect to get so many replies! For all of those who answered my questions thank you so much, I got the idea of how it all works, tho I am a bit disappointed that if I were to be Isekai’d in a new world, magic would be out of the question. But! I’m glad you guys were able to make me smile. It was getting pretty shitty but to see all those reply’s and peoples reactions through text was more than enough for me, all of you guys are fucking amazing! I literally learn new things today, that question was really hard on me and didn’t let me sleep at times, but I can finally rest assured now that I have the answer, of course it was all just a thought but I have the tendency to be really curious... anyway, again, thank you all so much, idk who you are or anything about you but with your comments bellow it was enough to let me know you guys are all lovable and amazing people! "},{"id":1447430,"gallery_id":341890,"poster":{"id":3340895,"username":"mynangay123","slug":"mynangay123","avatar_url":"avatars/3340895.png?_=f47bb6ed4bfd292f","is_superuser":false,"is_staff":false},"post_date":1609389551,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me Fuck too late\n\n\nAlso i rate this 8/10"},{"id":1447426,"gallery_id":341890,"poster":{"id":3964702,"username":"fuckemt","slug":"fuckemt","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609389376,"body":"\n\nIf you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me Fuck too late"},{"id":1447417,"gallery_id":341890,"poster":{"id":3964696,"username":"shits_weird","slug":"shits_weird","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609389221,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga."},{"id":1447407,"gallery_id":341890,"poster":{"id":2830443,"username":"Skorp1ON","slug":"skorp1on","avatar_url":"avatars/2830443.png?_=7b8be07924501557","is_superuser":false,"is_staff":false},"post_date":1609388837,"body":"Love the comments beside the fucking curses, yes a very interesting subject.\nThis is the part of the internet that I love civil discussion on a nhentai website About beyond and more 😎"},{"id":1447292,"gallery_id":341890,"poster":{"id":3439051,"username":"deeznuts121","slug":"deeznuts121","avatar_url":"avatars/3439051.png?_=e0afb3c059f184d5","is_superuser":false,"is_staff":false},"post_date":1609385569,"body":"Hentai is truly the intellectual mans fap material as many a comment section such as this one will prove "},{"id":1447277,"gallery_id":341890,"poster":{"id":1498477,"username":"SalaD_a$$_likr","slug":"salad_a-_likr","avatar_url":"avatars/1498477.png?_=331e29ac8d324cb8","is_superuser":false,"is_staff":false},"post_date":1609385229,"body":"This is the kind of comments that makes you wonder if you are even alive, and what does being alive even mean?..."},{"id":1447258,"gallery_id":341890,"poster":{"id":3340562,"username":"goppily","slug":"goppily","avatar_url":"avatars/3340562.png?_=385255c0b7c17465","is_superuser":false,"is_staff":false},"post_date":1609384703,"body":"This is the best comment section I have ever read"},{"id":1447204,"gallery_id":341890,"poster":{"id":3748098,"username":"OMrFancyO","slug":"omrfancyo","avatar_url":"avatars/3748098.png?_=12248cb7e82ca6d4","is_superuser":false,"is_staff":false},"post_date":1609383254,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎"},{"id":1447152,"gallery_id":341890,"poster":{"id":3046198,"username":"SiriusSync","slug":"siriussync","avatar_url":"avatars/3046198.png?_=b9f5b7a38aaf1533","is_superuser":false,"is_staff":false},"post_date":1609381813,"body":"TATER TOT LMAO"},{"id":1447020,"gallery_id":341890,"poster":{"id":3964242,"username":"LittleCaesar","slug":"littlecaesar","avatar_url":"avatars/3964242.png?_=679925e7e20944f7","is_superuser":false,"is_staff":false},"post_date":1609378008,"body":"Bravo. Bravo. Bravo. I came to this after someone said to read the comments, and I made an account to say that the most cultured men read hentai. Simply splendid that this comment section is a conglomeration of brilliant minds, seeking to aid a young mind out. To all of you, I wish thy a good day and a good shot. "},{"id":1447009,"gallery_id":341890,"poster":{"id":1276512,"username":"Supplici","slug":"supplici","avatar_url":"avatars/1276512.png?_=6e0999c6ed875477","is_superuser":false,"is_staff":false},"post_date":1609377696,"body":"Think about it like this. Point A to Point Z is the standard route. You read some doujin and came. But what if you didn't cum? That would be Point A to Point Y, you've changed the outcome of what would've been the \"normal\" outcome. These events would then predict what happens after aforementioned ejaculation. What if you edged yourself then accidentally came in your pants in public? That would be Point A to Point X. There is infinite outcomes so you could even have Points A-4 or V-81. With all that in mind, the Points are contained within larger ones. A to Z is life to death, but ejaculating to a doujin would deviate from A in progress to A-A1 to Z, eventually converging back unto Point Z (death). Which brings the next question, aren't all these Points contained within more Points? How many Points exist? Is there a limit to how many routes you can take into a Point? What determines that Point's end? This is the Hypothetical Ejaculation Nonsensical Theory of All Infinites, or HENTAI."},{"id":1446949,"gallery_id":341890,"poster":{"id":434849,"username":"Keksz","slug":"keksz","avatar_url":"avatars/434849.png","is_superuser":false,"is_staff":false},"post_date":1609375678,"body":"I tried to read the comments and end up learning about thermodynamic."},{"id":1446940,"gallery_id":341890,"poster":{"id":3964038,"username":"Beta Meta","slug":"beta-meta","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609375490,"body":"To answer if there could be a world like Earth but with one blade of grass missing, yes there very well could be. We simply don't know the full expanses of the universe. humans only have the ability to see about 4% of the observable universe but the rest 96% is simply unknown. Due to this factor, there is a chance, albeit very low, that there is a planet like Earth with one blade of grass missing. This is talking about an Earthlike place that currently exists. If you are talking about an Earth-like place that may have existed, then if it is true that time is infinite, then there would have to be a chance that least one in this infinite time that a place like Earth with one blade of grass missing existed. To answer your third question, no. We only can dream of things that we have a current memory of. Even if a dream seems random, it is just a mish-mash of things we already know. Thank you for reading my \"essay\". I hope my knowledge wasen't too lackluster and gave you a brain aneurysm."},{"id":1446927,"gallery_id":341890,"poster":{"id":3964038,"username":"Beta Meta","slug":"beta-meta","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609375039,"body":"Breaking the laws of thermodynamics might have already been done by humans before with the atomic bomb and even the sun. According to Einstein's equation E=mc^2, something like fusion taking place in the sun would require a reaction between two deuteriums creating helium. In this reaction, a small amount of mass is rubbed off of the atom, about the size of 1% of an election. However, when that mass is removed it creates enough heat and power that powers the sun. In a sense the sun is are \"destroying mass\" in order to create energy. I (Not so sure about this previous one maybe someone can correct me). But even if this previous statement is false, there would be a possibility that humans could break the laws of thermodynamics in the future since humans have been known for breaking limits before. (Read bottom up)"},{"id":1446917,"gallery_id":341890,"poster":{"id":3964038,"username":"Beta Meta","slug":"beta-meta","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609374508,"body":"But I'm assuming you are asking if something that could break the laws of physics types of magic could happen in this reality. Such as transmuting an object out of nothing or even breaking the laws of thermodynamics. The answer to that question would be a solid maybe. While it has been put that the laws of thermodynamics are pretty final, and transmuting something would be pretty impossible to pull off, it might be possible to pull off. Transmuting let's say a rock out of thin air would be pretty hard. If you wanted to make a cube of sulfur, you would have to take oxygen and fuse them together. Not only would it be very unstable, but it would also require you to manipulate around 6.022x10^23 molecules of oxygen if you wanted to make a mole of sulfur. While it is difficult, we as humans have no way to look into the future. Maybe in the future, we will have access to technology allowing us to fuse and transmute something like sulfur out of thin air. (Read bottom up)"},{"id":1446898,"gallery_id":341890,"poster":{"id":3964038,"username":"Beta Meta","slug":"beta-meta","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609373919,"body":"@just_a_lost_kid There are a couple of questions being asked here. First, is multiverse theory real. Second, is there a reality where say magic takes over science or a world just like Earth but one blade of grass is missing. Third, are dreams a look into the past, present, and futures of these realities. The first questions seem to have been answered by just_one_comment and I can agree with his statement, the multiverse theory is most likely false. However, this does not mean that the other questions are inherently false as well. We could answer the second question by saying that magic and science are interchangeable. For instance, using something like a blender or a toaster seems like a normal everyday thing, whereas 500 years ago it would be considered magical. Hell, if a woman showed off a phone to others back in the day, she would be burned for being a witch. Even now, something like a flying car would seem like magic but it could be possible in a couple decades. (Read bottom up)"},{"id":1446771,"gallery_id":341890,"poster":{"id":3584568,"username":"CookieQT","slug":"cookieqt","avatar_url":"avatars/3584568.png?_=00c4f608a56fed77","is_superuser":false,"is_staff":false},"post_date":1609371040,"body":"finally.. we need a sequel"},{"id":1446750,"gallery_id":341890,"poster":{"id":3901278,"username":"Yash Nemar","slug":"yash-nemar","avatar_url":"avatars/3901278.png?_=717d495e96f7741a","is_superuser":false,"is_staff":false},"post_date":1609370480,"body":"@just_one_comment - Wait what? 👀"},{"id":1446727,"gallery_id":341890,"poster":{"id":3963894,"username":"Sakata P","slug":"sakata-p","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609369932,"body":"\nIf you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me"},{"id":1446692,"gallery_id":341890,"poster":{"id":2137008,"username":"lolipounder","slug":"lolipounder","avatar_url":"avatars/2137008.png?_=f6e8470614d60809","is_superuser":false,"is_staff":false},"post_date":1609368596,"body":"very good, many cummies"},{"id":1446680,"gallery_id":341890,"poster":{"id":1700467,"username":"iMidnightStorm","slug":"imidnightstorm","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609367991,"body":"Bravo, just bravo. This is why I venture into the comments.\n"},{"id":1446630,"gallery_id":341890,"poster":{"id":1259219,"username":"the lurker","slug":"the-lurker","avatar_url":"avatars/1259219.png?_=1d7b8bf3ebce901b","is_superuser":false,"is_staff":false},"post_date":1609366301,"body":"This could be a theory"},{"id":1446539,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609363122,"body":"(read comment below fist) \ninteract with the other universes. So sadly, even though it would be nice, our dreams aren't  a look into other universes, that is simply impossible with the way physics work. Anyway, there is nothing bad about trying to escape reality, as long as you remember why you  live in this reality in the first place. \nWith that my only comment ever is done, thank you for reading this, whoever you are.\nAlso I am sorry if I misspelled words or my grammar isnt the best, I am from Germany. ^^\n\n-An unknown friend, trapped in his own nihilism"},{"id":1446532,"gallery_id":341890,"poster":{"id":3963643,"username":"just_one_comment","slug":"just_one_comment","avatar_url":"avatars/3963643.png?_=fa074397c426c9e7","is_superuser":false,"is_staff":false},"post_date":1609362839,"body":"@just_a_lost_kid Sadly we dont know much about this, neither about dreams, nor the multiverse theory (which is actually getting more and more unlikely with each new discovery, so sorry about that), however what we do know is that: The multiverse theory is based of quantum mechanics, which says that things like electrons are behaving like a particle and a wave, which creates multiple outcomes that are all happening at once. So the theory says, that each one of these possibility is its own universe, where (on a grand scale) things change. Sadly this doesnt allow magic or stuff like that because it would go against physics, and like I said, it doesnt change the universe, just decisions, kind of like a what if situation.  Now heres the thing with your dream theory, (which is actually a real thing, so if you are interested i am sure youll find some books about it) IF this multiverse theory were to be true, it would also mean that we cannot under any circumstances (read comment above)\n"},{"id":1446529,"gallery_id":341890,"poster":{"id":2264840,"username":"Hey0hentaihaven","slug":"hey0hentaihaven","avatar_url":"avatars/2264840.png?_=d8682711b53c2536","is_superuser":false,"is_staff":false},"post_date":1609362781,"body":"mf aqua's spit is holy lube. nice :)"},{"id":1446440,"gallery_id":341890,"poster":{"id":2782471,"username":"elipotheweeb","slug":"elipotheweeb","avatar_url":"avatars/2782471.png?_=35bd87ac5c249254","is_superuser":false,"is_staff":false},"post_date":1609359849,"body":"Im a hardcore aqua fan and I will take it"},{"id":1446390,"gallery_id":341890,"poster":{"id":750079,"username":"COOLASH","slug":"coolash","avatar_url":"avatars/750079.png","is_superuser":false,"is_staff":false},"post_date":1609358460,"body":"I'm a hardcore Megumin fan but .... I'll take it"},{"id":1446320,"gallery_id":341890,"poster":{"id":2323599,"username":"Denimsatr","slug":"denimsatr","avatar_url":"avatars/2323599.png","is_superuser":false,"is_staff":false},"post_date":1609356525,"body":"This guy had the biggest post-nut clarity i've ever seen"},{"id":1446316,"gallery_id":341890,"poster":{"id":3717990,"username":"just_a_lost_kid","slug":"just_a_lost_kid","avatar_url":"avatars/3717990.png?_=eaf390a2b5500ba8","is_superuser":false,"is_staff":false},"post_date":1609356401,"body":"Alright, guys, I have something that was on my mind all night so I decided to share it here where honesty is both honorable and shameful... okay so let’s say multi universes exist, there are infinite many of them, some that have magic replace science some that doesn’t even fit the same image as our earth some that are literally the same but the only difference being a blade of grass, you get the picture. Now with this method of thinking i came to this conclusion... dreams are not dreams instead they are memories of our past, present, and future multi universal-selves, if there are infinite maybe multi universes then your dreams exist somewhere in a different universe other than ours, so for any smart people can this be actually something that is correctly thought of or am I just trying to escape reality "},{"id":1446311,"gallery_id":341890,"poster":{"id":2982304,"username":"Yukitai","slug":"yukitai","avatar_url":"avatars/2982304.png","is_superuser":false,"is_staff":false},"post_date":1609356286,"body":"When I read the grovelling page, my immediate thought was \"Dogeza: I tried asking while kowtowing\". ngl, it made it kinda funny..."},{"id":1446257,"gallery_id":341890,"poster":{"id":3912827,"username":"Nathanzbob","slug":"nathanzbob","avatar_url":"avatars/3912827.png?_=eaeb0f429d7c62ab","is_superuser":false,"is_staff":false},"post_date":1609354846,"body":"Aqua es muy sexi NO MAMEEES"},{"id":1446233,"gallery_id":341890,"poster":{"id":617053,"username":"AJGuardian","slug":"ajguardian","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609354408,"body":"Time for Demi-God heroes..."},{"id":1446217,"gallery_id":341890,"poster":{"id":3480166,"username":"FUTALovers","slug":"futalovers","avatar_url":"avatars/3480166.png?_=602af622c34fdcce","is_superuser":false,"is_staff":false},"post_date":1609353929,"body":"aqua not useless now"},{"id":1446187,"gallery_id":341890,"poster":{"id":2092550,"username":"sok130","slug":"sok130","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609353310,"body":"aqua's leg on page 16 is so thick"},{"id":1446170,"gallery_id":341890,"poster":{"id":1901742,"username":"Salamander002","slug":"salamander002","avatar_url":"avatars/1901742.png?_=7bd32037d4316a0b","is_superuser":false,"is_staff":false},"post_date":1609352787,"body":"The author really knows how to draw tits "},{"id":1446167,"gallery_id":341890,"poster":{"id":3923945,"username":"juanzartar","slug":"juanzartar","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609352727,"body":"LOL TRASH ART. BUT AQUA IS POPULAR FUCKING WITH ANYONE"},{"id":1446056,"gallery_id":341890,"poster":{"id":2319749,"username":"0,6%","slug":"0-6","avatar_url":"avatars/2319749.png?_=d9e92ec7406c7fd0","is_superuser":false,"is_staff":false},"post_date":1609349554,"body":"Is that Aqua? A Lie!!"},{"id":1446043,"gallery_id":341890,"poster":{"id":1790349,"username":"Revlaine da Vermillion","slug":"revlaine-da-vermillion","avatar_url":"avatars/1790349.png?_=be7ddf88dab0a171","is_superuser":false,"is_staff":false},"post_date":1609349225,"body":"WTF Aqua popular 😂"},{"id":1446001,"gallery_id":341890,"poster":{"id":3389891,"username":"Kuki_Hideo","slug":"kuki_hideo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609348474,"body":"If you wrote stupid curse here, your parents will die within 5 years. There is no escape from this, you earned it by being a moron."},{"id":1445970,"gallery_id":341890,"poster":{"id":3868544,"username":"Primordial Simp","slug":"primordial-simp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609347862,"body":"A blessing from the Lord"},{"id":1445955,"gallery_id":341890,"poster":{"id":3905748,"username":"ajggggggg","slug":"ajggggggg","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609347461,"body":"ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎ฏ๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎๎"},{"id":1445898,"gallery_id":341890,"poster":{"id":2897116,"username":"Ahegao God","slug":"ahegao-god","avatar_url":"avatars/2897116.png?_=bf8f45d3c7884f8d","is_superuser":false,"is_staff":false},"post_date":1609346075,"body":"Not gonna lie....i dig it"},{"id":1445882,"gallery_id":341890,"poster":{"id":1473033,"username":"Ninguem suspeita","slug":"ninguem-suspeita","avatar_url":"avatars/1473033.png?_=66db60b7fd1a262f","is_superuser":false,"is_staff":false},"post_date":1609345672,"body":"A blessing indeed "},{"id":1445764,"gallery_id":341890,"poster":{"id":3848865,"username":"Liberty prime","slug":"liberty-prime","avatar_url":"avatars/3848865.png?_=7d99e6d088eaab20","is_superuser":false,"is_staff":false},"post_date":1609342516,"body":"Kazuma has more hentai than aqua 😂😂😂"},{"id":1445733,"gallery_id":341890,"poster":{"id":360291,"username":"xildon","slug":"xildon","avatar_url":"avatars/360291.png","is_superuser":false,"is_staff":false},"post_date":1609341592,"body":"To me this is canon"},{"id":1445719,"gallery_id":341890,"poster":{"id":3212954,"username":"HiroItsuka","slug":"hiroitsuka","avatar_url":"avatars/3212954.png?_=940eddaef32016fa","is_superuser":false,"is_staff":false},"post_date":1609341140,"body":"hOOhhh... This rare.... AQUA BEING THE POPULAR ONE.... ISN'T THIS GREAT FOR 8722 USER FAP RIGHT NOW?"},{"id":1445686,"gallery_id":341890,"poster":{"id":457385,"username":"Loli and Neko <3","slug":"loli-and-neko-3","avatar_url":"avatars/457385.png","is_superuser":false,"is_staff":false},"post_date":1609340263,"body":"Never thought about purification in this way ... pretty useful :D"},{"id":1445633,"gallery_id":341890,"poster":{"id":3931538,"username":"Asamura","slug":"asamura","avatar_url":"avatars/3931538.png?_=496124fc58fc6888","is_superuser":false,"is_staff":false},"post_date":1609338256,"body":"Aqua is not useless at all even in the a anime ;-;"},{"id":1445565,"gallery_id":341890,"poster":{"id":2172540,"username":"woodenfloor","slug":"woodenfloor","avatar_url":"avatars/2172540.png?_=7242179cd6fdb116","is_superuser":false,"is_staff":false},"post_date":1609336437,"body":"i never thought aqua can be this cute"},{"id":1445529,"gallery_id":341890,"poster":{"id":3441815,"username":"AssMan=GoodMan","slug":"assman-goodman","avatar_url":"avatars/3441815.png?_=7502f7c87fdea910","is_superuser":false,"is_staff":false},"post_date":1609335504,"body":"C-C-Canon ?"},{"id":1445518,"gallery_id":341890,"poster":{"id":3061918,"username":"Dr. Ratio","slug":"dr-ratio","avatar_url":"avatars/3061918.png?_=7f269b678408e2b9","is_superuser":false,"is_staff":false},"post_date":1609335234,"body":"\"...poor dick that has only known your right hand...\" :'("},{"id":1445408,"gallery_id":341890,"poster":{"id":3279234,"username":"brucucked","slug":"brucucked","avatar_url":"avatars/3279234.png?_=99f2385fca8c29f2","is_superuser":false,"is_staff":false},"post_date":1609331839,"body":"Who's useless again? Checkmate Eris cult!"},{"id":1445395,"gallery_id":341890,"poster":{"id":2668206,"username":"I am Malphite","slug":"i-am-malphite","avatar_url":"avatars/2668206.png?_=102f9ff1d4f27c69","is_superuser":false,"is_staff":false},"post_date":1609331417,"body":"If you reading this, all curses will be undo and have a happy Christmas. (Those who curses are losers in life) Copy this to all manga you came across"},{"id":1445315,"gallery_id":341890,"poster":{"id":2391655,"username":"Aminotsyma","slug":"aminotsyma","avatar_url":"avatars/2391655.png","is_superuser":false,"is_staff":false},"post_date":1609328639,"body":"From one Goddess to another, we thank the for Your service to our community, Aqua.\n\n-Aimiee Lewd Lemieux"},{"id":1445300,"gallery_id":341890,"poster":{"id":3510577,"username":"YourSenpai","slug":"yoursenpai","avatar_url":"avatars/3510577.png?_=06b85066c205bd38","is_superuser":false,"is_staff":false},"post_date":1609328155,"body":"We demand a sequel !!!!!"},{"id":1445296,"gallery_id":341890,"poster":{"id":1987020,"username":"XSainth","slug":"xsainth","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609327948,"body":"Personally, i like Aqua most."},{"id":1445290,"gallery_id":341890,"poster":{"id":3846926,"username":"Pisskink Mike","slug":"pisskink-mike","avatar_url":"avatars/3846926.png?_=dd15aec4ad6efb85","is_superuser":false,"is_staff":false},"post_date":1609327676,"body":"I told you she was not useless"},{"id":1445266,"gallery_id":341890,"poster":{"id":3962191,"username":"BIGboi69","slug":"bigboi69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609326838,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. Sorry y'all i got cursed too, you can't underestimate random people curse"},{"id":1445262,"gallery_id":341890,"poster":{"id":2793977,"username":"Keekrot","slug":"keekrot","avatar_url":"avatars/2793977.png","is_superuser":false,"is_staff":false},"post_date":1609326778,"body":"Cute <3333"},{"id":1445210,"gallery_id":341890,"poster":{"id":3093375,"username":"Alien3.0C","slug":"alien3-0c","avatar_url":"avatars/3093375.png?_=ce3cf82778d109df","is_superuser":false,"is_staff":false},"post_date":1609324849,"body":"Never liked this kind of big breasts smol pp shot-ish things but, however, this one wasn't that bad"},{"id":1445172,"gallery_id":341890,"poster":{"id":3925301,"username":"Dredgen Hope","slug":"dredgen-hope","avatar_url":"avatars/3925301.png?_=a0862e8caa49d478","is_superuser":false,"is_staff":false},"post_date":1609323919,"body":"This concludes my presentation on why aqua is 4000 times better that megumin "},{"id":1445163,"gallery_id":341890,"poster":{"id":3898141,"username":"Fmegotcursed","slug":"fmegotcursed","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609323549,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me\n\n\n\nIf you are reading this your not cursed and will get protection from all curses on this site forever and your going to be fine so recomment this so anyone can be save"},{"id":1445126,"gallery_id":341890,"poster":{"id":3857424,"username":"DeadPickle","slug":"deadpickle","avatar_url":"avatars/3857424.png?_=fa32586c1a8f6c26","is_superuser":false,"is_staff":false},"post_date":1609322463,"body":"@the stylish weeb you've hit rock bottom"},{"id":1445103,"gallery_id":341890,"poster":{"id":2055590,"username":"товарищ","slug":"tovarishch","avatar_url":"avatars/2055590.png","is_superuser":false,"is_staff":false},"post_date":1609321915,"body":"If only she is Sane"},{"id":1445076,"gallery_id":341890,"poster":{"id":3408879,"username":"🥞","slug":"_","avatar_url":"avatars/3408879.png?_=b49a3ed64f87b8e0","is_superuser":false,"is_staff":false},"post_date":1609321298,"body":"Damn this is a masterpiece even tho this isn't my cup of tea"},{"id":1445056,"gallery_id":341890,"poster":{"id":1351354,"username":"The Army","slug":"the-army","avatar_url":"avatars/1351354.png?_=c8d34d45545c137e","is_superuser":false,"is_staff":false},"post_date":1609320525,"body":"@the stylish weeb, you don't need the FBI, we will personally come to your home and eliminate you"},{"id":1444984,"gallery_id":341890,"poster":{"id":3249918,"username":"Graysha","slug":"graysha","avatar_url":"avatars/3249918.png?_=f31c81746965046e","is_superuser":false,"is_staff":false},"post_date":1609318277,"body":"I felt guilty but ass is ass and fap is masturbate...... Yeah here we go again\n\nBy sicarius gray"},{"id":1444982,"gallery_id":341890,"poster":{"id":1854395,"username":"Matsuo_kun","slug":"matsuo_kun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609318215,"body":"This is one of the rare cases of a doujin that actually tries to be in-universe and in-character, and one that pulls it off, too."},{"id":1444976,"gallery_id":341890,"poster":{"id":3631968,"username":"NTR Hater","slug":"ntr-hater","avatar_url":"avatars/3631968.png?_=8f488a4d8080d55f","is_superuser":false,"is_staff":false},"post_date":1609318084,"body":"@AsainsLoveNiggers choke on your spit, nasty"},{"id":1444964,"gallery_id":341890,"poster":{"id":3087752,"username":"TheMateo217","slug":"themateo217","avatar_url":"avatars/3087752.png?_=b16abf0685e9602e","is_superuser":false,"is_staff":false},"post_date":1609317665,"body":"Approved 👍"},{"id":1444962,"gallery_id":341890,"poster":{"id":3895804,"username":"Dave Mathew","slug":"dave-mathew","avatar_url":"avatars/3895804.png?_=2aa0a1a136dad7ea","is_superuser":false,"is_staff":false},"post_date":1609317648,"body":"@lordsofending YES YES YES YES.... YESSSSS"},{"id":1444912,"gallery_id":341890,"poster":{"id":3665746,"username":"Earljazz","slug":"earljazz","avatar_url":"avatars/3665746.png?_=35e8555d5ec24b71","is_superuser":false,"is_staff":false},"post_date":1609316197,"body":"Is this the real ending that was cut out on the novel...?"},{"id":1444893,"gallery_id":341890,"poster":{"id":3936201,"username":"Crîdobi","slug":"cridobi","avatar_url":"avatars/3936201.png?_=48f327970e6cb51c","is_superuser":false,"is_staff":false},"post_date":1609315487,"body":"DICKHARD 9000"},{"id":1444864,"gallery_id":341890,"poster":{"id":3219402,"username":"UglyDiaper69","slug":"uglydiaper69","avatar_url":"avatars/3219402.png?_=0476ff244876a855","is_superuser":false,"is_staff":false},"post_date":1609314863,"body":"The only Konosuba ship I approve"},{"id":1444859,"gallery_id":341890,"poster":{"id":1093378,"username":"linkjames24","slug":"linkjames24","avatar_url":"avatars/1093378.png","is_superuser":false,"is_staff":false},"post_date":1609314672,"body":"Stupid sexy Aqua\n"},{"id":1444782,"gallery_id":341890,"poster":{"id":3497092,"username":"Logan Slayer","slug":"logan-slayer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609312664,"body":"Hey she is not useless I giving it 9/10"},{"id":1444758,"gallery_id":341890,"poster":{"id":3814871,"username":"Fenixan","slug":"fenixan","avatar_url":"avatars/3814871.png?_=bf46e87b6b7c9084","is_superuser":false,"is_staff":false},"post_date":1609312013,"body":"not bad manga"},{"id":1444747,"gallery_id":341890,"poster":{"id":3479360,"username":"ThatDumbass","slug":"thatdumbass","avatar_url":"avatars/3479360.png?_=b243639b8399afcf","is_superuser":false,"is_staff":false},"post_date":1609311756,"body":"Favorited without looking "},{"id":1444711,"gallery_id":341890,"poster":{"id":3325483,"username":"Gardieen","slug":"gardieen","avatar_url":"avatars/3325483.png","is_superuser":false,"is_staff":false},"post_date":1609311012,"body":"I have waited 4... No! 5 thousand years for this type of hentai manga!"},{"id":1444687,"gallery_id":341890,"poster":{"id":3614823,"username":"Donald_Fuck","slug":"donald_fuck","avatar_url":"avatars/3614823.png?_=5740fe70d20b2007","is_superuser":false,"is_staff":false},"post_date":1609310640,"body":"Same, Pandesal. Same."},{"id":1444684,"gallery_id":341890,"poster":{"id":2438576,"username":"lomeno","slug":"lomeno","avatar_url":"avatars/2438576.png","is_superuser":false,"is_staff":false},"post_date":1609310571,"body":"We need moooorrrreee"},{"id":1444666,"gallery_id":341890,"poster":{"id":1679538,"username":"Crybaby_G000007","slug":"crybaby_g000007","avatar_url":"avatars/1679538.png","is_superuser":false,"is_staff":false},"post_date":1609310252,"body":"Everyone forgot that Aqua literally stated she would be willing to have sex with Kazuma IF....he gives her specific things mainly booze or money."},{"id":1444625,"gallery_id":341890,"poster":{"id":3436031,"username":"luna_tic_15","slug":"luna_tic_15","avatar_url":"avatars/3436031.png?_=e908580a08e6db56","is_superuser":false,"is_staff":false},"post_date":1609309560,"body":"Part 2 plz"},{"id":1444624,"gallery_id":341890,"poster":{"id":3961495,"username":"?mmmmm","slug":"mmmmm","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609309531,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me"},{"id":1444590,"gallery_id":341890,"poster":{"id":1524536,"username":"oyasupai","slug":"oyasupai","avatar_url":"avatars/1524536.png?_=064c4502c422ee71","is_superuser":false,"is_staff":false},"post_date":1609308752,"body":"I want that serious to continue"},{"id":1444579,"gallery_id":341890,"poster":{"id":3654185,"username":"Jagaaaaaan","slug":"jagaaaaaan","avatar_url":"avatars/3654185.png?_=c9a0fb53662f92d8","is_superuser":false,"is_staff":false},"post_date":1609308300,"body":"Can’t ever get enough aqua doujins"},{"id":1444561,"gallery_id":341890,"poster":{"id":3842500,"username":"ObamaJedi","slug":"obamajedi","avatar_url":"avatars/3842500.png?_=f2dc8fe02ccd266b","is_superuser":false,"is_staff":false},"post_date":1609307704,"body":"I needed this"},{"id":1444557,"gallery_id":341890,"poster":{"id":3520728,"username":"PakiSlayer9000","slug":"pakislayer9000","avatar_url":"avatars/3520728.png?_=2c7eab4e32fcfb0a","is_superuser":false,"is_staff":false},"post_date":1609307645,"body":"I havent seen good hentai In the popular List For weeks And still waiting "},{"id":1444528,"gallery_id":341890,"poster":{"id":3961407,"username":"Minigamer7745","slug":"minigamer7745","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609307195,"body":"damn this sum good shi"},{"id":1444515,"gallery_id":341890,"poster":{"id":3630149,"username":"Pandesal","slug":"pandesal","avatar_url":"avatars/3630149.png?_=d3a908e1c5f03cbe","is_superuser":false,"is_staff":false},"post_date":1609306933,"body":"i want some wholesome kazuma x aqua shit"},{"id":1444510,"gallery_id":341890,"poster":{"id":3557073,"username":"hi I'm your Narrator","slug":"hi-i-m-your-narrator","avatar_url":"avatars/3557073.png?_=8f3075a899d56bd8","is_superuser":false,"is_staff":false},"post_date":1609306871,"body":"wholesome "},{"id":1444472,"gallery_id":341890,"poster":{"id":2138943,"username":"DryingPan4ever","slug":"dryingpan4ever","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609306175,"body":"Impregnation S tier tag and aqua? Hell yeah"},{"id":1444445,"gallery_id":341890,"poster":{"id":3961332,"username":"HiThereHowAreYou","slug":"hitherehowareyou","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609305726,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry,please forgive me (i accidentally read this comment, so sorry"},{"id":1444361,"gallery_id":341890,"poster":{"id":1753099,"username":"Satou Matsuzaka","slug":"satou-matsuzaka","avatar_url":"avatars/1753099.png?_=06f9834a837c9dcf","is_superuser":false,"is_staff":false},"post_date":1609303686,"body":"Is satou kazuma related to satou matsuzaka or something ?"},{"id":1444360,"gallery_id":341890,"poster":{"id":1547800,"username":"Yoshiki99","slug":"yoshiki99","avatar_url":"avatars/1547800.png","is_superuser":false,"is_staff":false},"post_date":1609303673,"body":"Hope the Demi-Goddess is better than her mother"},{"id":1444359,"gallery_id":341890,"poster":{"id":2359429,"username":"buraundesu","slug":"buraundesu","avatar_url":"avatars/2359429.png","is_superuser":false,"is_staff":false},"post_date":1609303647,"body":"If greek gods have impregnated humans then im sure vice versa could happen"},{"id":1444349,"gallery_id":341890,"poster":{"id":3949064,"username":"AstolfoForPresident","slug":"astolfoforpresident","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1609303486,"body":"The bean council approves."},{"id":1444332,"gallery_id":341890,"poster":{"id":3817587,"username":"Thumbs up man","slug":"thumbs-up-man","avatar_url":"avatars/3817587.png?_=4940eeefe794541e","is_superuser":false,"is_staff":false},"post_date":1609303246,"body":"Can a mortal even impregnate a goddess?"},{"id":1444306,"gallery_id":341890,"poster":{"id":1936257,"username":"P.A.N.D.E.M.O.N.I.U.M.","slug":"p-a-n-d-e-m-o-n-i-u-m","avatar_url":"avatars/1936257.png?_=e09e27d6e6931ec2","is_superuser":false,"is_staff":false},"post_date":1609302719,"body":"Perfection. Nothing more, nothing less."},{"id":1444273,"gallery_id":341890,"poster":{"id":1784655,"username":"rohan121","slug":"rohan121","avatar_url":"avatars/1784655.png?_=3184e3c168f4c261","is_superuser":false,"is_staff":false},"post_date":1609302169,"body":"Nice to see my favorite tag impregnation with best Konosuba hentai girl Aqua"},{"id":1444254,"gallery_id":341890,"poster":{"id":2021687,"username":"XHunter212X","slug":"xhunter212x","avatar_url":"avatars/2021687.png?_=b9b48a4d67ca3136","is_superuser":false,"is_staff":false},"post_date":1609301629,"body":"well well well, hot tag in front is not a joke"},{"id":1444232,"gallery_id":341890,"poster":{"id":3305546,"username":"miikoo","slug":"miikoo","avatar_url":"avatars/3305546.png","is_superuser":false,"is_staff":false},"post_date":1609301061,"body":"This lie, the real kazuma would bully aqua into submission"},{"id":1444169,"gallery_id":341890,"poster":{"id":3340673,"username":"Za Big Gay","slug":"za-big-gay","avatar_url":"avatars/3340673.png?_=42b9f5fc514f3a7f","is_superuser":false,"is_staff":false},"post_date":1609299745,"body":"Armpit was the best part "},{"id":1444163,"gallery_id":341890,"poster":{"id":3395137,"username":"KINGJACKSON","slug":"kingjackson","avatar_url":"avatars/3395137.png?_=8b550983afb96492","is_superuser":false,"is_staff":false},"post_date":1609299590,"body":"Well yeeeeah Good ending "},{"id":1444121,"gallery_id":341890,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1609298266,"body":"Good KonoSuba shit right here."},{"id":1444090,"gallery_id":341890,"poster":{"id":2494901,"username":"Amir Syarifudin","slug":"amir-syarifudin","avatar_url":"avatars/2494901.png","is_superuser":false,"is_staff":false},"post_date":1609297664,"body":"SIAPA YG TRANSLATE INI AJGGG, JELEK AMAT. Tapi isinya lumayan. Overall 7/10"},{"id":1444085,"gallery_id":341890,"poster":{"id":3960949,"username":"blawblaw11","slug":"blawblaw11","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609297602,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. Sorry y'all i got cursed too, you can't understimate random people curse"},{"id":1444016,"gallery_id":341890,"poster":{"id":1499418,"username":"vaccinated","slug":"vaccinated","avatar_url":"avatars/1499418.png?_=ba187796f0b8f367","is_superuser":false,"is_staff":false},"post_date":1609296271,"body":"canon     "},{"id":1444008,"gallery_id":341890,"poster":{"id":3356562,"username":"maling_memek","slug":"maling_memek","avatar_url":"avatars/3356562.png?_=bbdaf07a1a9cbaa7","is_superuser":false,"is_staff":false},"post_date":1609296071,"body":"Armpit part is so hot"},{"id":1443990,"gallery_id":341890,"poster":{"id":3086427,"username":"Gay bowser","slug":"gay-bowser","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609295688,"body":"Help I am no a adult how can I watch this "},{"id":1443978,"gallery_id":341890,"poster":{"id":3096455,"username":"grixismadlad","slug":"grixismadlad","avatar_url":"avatars/3096455.png","is_superuser":false,"is_staff":false},"post_date":1609295516,"body":"Demigod kid..... Interesting "},{"id":1443939,"gallery_id":341890,"poster":{"id":3414994,"username":"Netorinoceros","slug":"netorinoceros","avatar_url":"avatars/3414994.png?_=ecee8966d9223767","is_superuser":false,"is_staff":false},"post_date":1609294702,"body":"Aqua being useful KEKW"},{"id":1443933,"gallery_id":341890,"poster":{"id":3960795,"username":"verde123","slug":"verde123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609294540,"body":"If you are reading this comment you will get impotence for the rest of your life. To undo this curse you need to copy this and paste it on 5 other dojins. i'm so, so sorry,please forgive me. I Know this may be seem nonsense but not gonna risk\nIf you read everytjing until here: the curse above is here being dismissed, don't need to paste it anywhere. You get protection from ALL curses on this site for 1 year, congrats. Please, repost this to protect other people."},{"id":1443875,"gallery_id":341890,"poster":{"id":3629643,"username":"IdkwhyimHere","slug":"idkwhyimhere","avatar_url":"avatars/3629643.png?_=5f4c9a9dbd1fba19","is_superuser":false,"is_staff":false},"post_date":1609293198,"body":"This GOOD SHIT I like the anime Konosuba so 10/10 Nice "},{"id":1443874,"gallery_id":341890,"poster":{"id":3953938,"username":"stramisai","slug":"stramisai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1609293184,"body":"pretty average but nice plot 👍🏼"},{"id":1443865,"gallery_id":341890,"poster":{"id":3906821,"username":"JoCa","slug":"joca","avatar_url":"avatars/3906821.png?_=921577f489da3daf","is_superuser":false,"is_staff":false},"post_date":1609293028,"body":"Not bad, not too bad\nStory checks out, makes sense in a way \nArt is nice, captures the original look, scenes aren't too bad, could be because kazuma \nOverall 7.5/10 \"hai kazuma desu\""},{"id":1443847,"gallery_id":341890,"poster":{"id":3329855,"username":"lima57","slug":"lima57","avatar_url":"avatars/3329855.png?_=8f4e4e13338d1877","is_superuser":false,"is_staff":false},"post_date":1609292608,"body":"\"We would do it like monkeys\" monke mention epic doujin"},{"id":1443827,"gallery_id":341890,"poster":{"id":1557610,"username":"lordsofgaming","slug":"lordsofgaming","avatar_url":"avatars/1557610.png","is_superuser":false,"is_staff":false},"post_date":1609292224,"body":"sequel plzzzzzz, id love to see them give the news to everyone and then the other two join in and become pregnant too, then they’d all have a very gentle prego orgy, give birth and then they say they want a second child"},{"id":1443806,"gallery_id":341890,"poster":{"id":229539,"username":"Mr. Brk","slug":"mr-brk","avatar_url":"avatars/229539.png?_=b9366f50660e25f0","is_superuser":false,"is_staff":false},"post_date":1609291863,"body":"This is so amazing and freaking hot! "},{"id":1443804,"gallery_id":341890,"poster":{"id":2069022,"username":"Aguacate","slug":"aguacate","avatar_url":"avatars/2069022.png?_=f7308a58855643d4","is_superuser":false,"is_staff":false},"post_date":1609291853,"body":"Bazuma forgot he said that she is not fap material. "},{"id":1443637,"gallery_id":341890,"poster":{"id":3668154,"username":":tf:","slug":"tf","avatar_url":"avatars/3668154.png?_=8cfe4089157860bb","is_superuser":false,"is_staff":false},"post_date":1609287238,"body":"Sweet, as much as they bickerd they did love ecahother in their weird ass way "},{"id":1443622,"gallery_id":341890,"poster":{"id":2966858,"username":"Fumma","slug":"fumma","avatar_url":"avatars/2966858.png?_=31d5dd590102a338","is_superuser":false,"is_staff":false},"post_date":1609286911,"body":"A blissing from the Lord"},{"id":1443421,"gallery_id":341890,"poster":{"id":2747990,"username":"Mr Vanilla","slug":"mr-vanilla","avatar_url":"avatars/2747990.png?_=9898f2b56824473a","is_superuser":false,"is_staff":false},"post_date":1609280692,"body":"This... THIS! is gold"}]