[{"id":1787577,"gallery_id":343580,"poster":{"id":483273,"username":"m1k3e3e","slug":"m1k3e3e","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622988814,"body":"ntr乐园............."},{"id":1610497,"gallery_id":343580,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615394850,"body":"In short you could say the story is about a guy who wants to be romantic and surprise his gf by marrying her but because he doesn't tell her why he's working so much she thinks he doesn't love her anymore. Their friend, who actually knows what the dude is doing, lies to the gf and seduces her while she's feeling down and drunk. Then they become sex friends that the girl uses as an outlet because she's sad while the friend is aiming for her all along. Eventually girl finds out, and also that the friend knew all along and played her get's mad and wants to make up for her soon to be husband. Friend get's mad and wants to make it impossible for her to be with the bf so he rapes her and then shows and informs the bf of everything, gf just gives up and surrenders to the sex pretty much. "},{"id":1610474,"gallery_id":343580,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615393886,"body":"@Mandingo not sure if you'll see this but basically the ending is that the wife finds out that the reason the husband has been distant and neglecting her is because he's been working hard to afford the ring, wedding, place to live and so on. She feels guilty for betraying him without knowing anything and is mad at the \"friend\". The friend goes over and tells her he wants her, loves her and bla bla bla. She rejects him and tries to fight him off but he pushes her down and starts to rape her. She eventually turns into a wreck drowning in lust friend video calls the husband and shows him + tells him everything. Wife screams no, stop and so on then she confesses everything and say's shes sorry. Husband say's he forgives her and he's already at fault. She say's it's too late now and he can never satisfy her anymore then it's pretty much ends with husband screaming."},{"id":1478976,"gallery_id":343580,"poster":{"id":692223,"username":"dazoevpnsi","slug":"dazoevpnsi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610339220,"body":"@Mandingo79 the summary that fazerlazor made on the part 1 comment section is pretty accurate: https://nhentai.net/g/270880/"},{"id":1478951,"gallery_id":343580,"poster":{"id":3957450,"username":"Mandingo79","slug":"mandingo79","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610338664,"body":"Been waiting for them to translate the first story all the way for the longest, even tho i know she a fucking skank for what she did"}]