[{"id":1623615,"gallery_id":343582,"poster":{"id":3621263,"username":"MyBallsItch","slug":"myballsitch","avatar_url":"avatars/3621263.png?_=f0d5f3872f614144","is_superuser":false,"is_staff":false},"post_date":1615972269,"body":"Its a fake dick?\n\n\n\nก็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊๊ก็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็็ก"},{"id":1512531,"gallery_id":343582,"poster":{"id":3654637,"username":"MoanChomsky","slug":"moanchomsky","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611032932,"body":"It would be nice if it was longer.  And I'm not just talking about my penis.  (Actually I think the length is fine there; but I would prefer 2X or 3X the girth.)  What I don't understand is how girls can take footlong cocks when even a 6 incher can hit the cervix, depending on one's position. Thats a barrier that you don't want to rupture like a hymen.. Ive never heard of that happening- I think they are really tough.  People have crazy ideas about vaginas though, thinking big dicks \"ruin\" them. Babies come out of there, and they are WAY bigger than any penis. No ruinage results, just muscles that require some time to return to normal functionality. "},{"id":1488737,"gallery_id":343582,"poster":{"id":2647065,"username":"dreamexpress","slug":"dreamexpress","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610679753,"body":"so glad to see these and lookforward to your new works"},{"id":1483558,"gallery_id":343582,"poster":{"id":2158921,"username":"tykips","slug":"tykips","avatar_url":"avatars/2158921.png?_=a307fc1de85c09c7","is_superuser":false,"is_staff":false},"post_date":1610510140,"body":"love this oneee"},{"id":1481767,"gallery_id":343582,"poster":{"id":3471530,"username":"Pers-on","slug":"pers-on","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610446990,"body":"Nice. I'm too glad to see your new work!"},{"id":1479807,"gallery_id":343582,"poster":{"id":2655827,"username":"Barbaric Kristina","slug":"barbaric-kristina","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1610368355,"body":"In 314868 i do belive he sticks his dick inside one of them, dunno if it counts as fucking tho xD"},{"id":1478817,"gallery_id":343582,"poster":{"id":546982,"username":"Ravenleaf","slug":"ravenleaf","avatar_url":"avatars/546982.png?_=5e6e2f0ec437fe4f","is_superuser":false,"is_staff":false},"post_date":1610333816,"body":"Why would you bother gender bending Gudako? "},{"id":1478652,"gallery_id":343582,"poster":{"id":4004581,"username":"oeksi","slug":"oeksi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610326828,"body":"I would like to see him fuck the chicks"}]