[{"id":2327712,"gallery_id":343928,"poster":{"id":4757530,"username":"Yo ndak Tau Kok Tanya Saya","slug":"yo-ndak-tau-kok-tanya-saya","avatar_url":"avatars/4757530.png?_=b4cefa68de0cc6c5","is_superuser":false,"is_staff":false},"post_date":1644646333,"body":"when i read this, on one hand i feel sad because my favorite character got raped by ugly bastard, but on the other hand i love it for its good art"},{"id":2278356,"gallery_id":343928,"poster":{"id":2403678,"username":"Phonfo","slug":"phonfo","avatar_url":"avatars/2403678.png?_=428056d63c7408ea","is_superuser":false,"is_staff":false},"post_date":1642707167,"body":"this comment section is funny asf, im reading all the comments here while eating popcorns, also the art is great and all but i think this artist is saying a message to mihiyo that \"Mona's clothes is too revealing, pls change it or add a much more covered outfit\" smth like that, and yeah Mystic077 is right, if you dont like it its right to give opinion whether its bad or good at the same time the artist also have the right to make smth like this and then if you dont want to just ignore it"},{"id":2258922,"gallery_id":343928,"poster":{"id":72017,"username":"dicwolf","slug":"dicwolf","avatar_url":"avatars/72017.png","is_superuser":false,"is_staff":false},"post_date":1641969365,"body":"Esto estuvo enfermo, pero le entro"},{"id":2257950,"gallery_id":343928,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1641930680,"body":"Even though I read this one like a year ago, I got sent back here again by Aiko from youtube: https://www.youtube.com/watch?v=-15-jP23Cjs"},{"id":2250597,"gallery_id":343928,"poster":{"id":3352382,"username":"CulturedMen","slug":"culturedmen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641626041,"body":"Nooo my comfort character is being raped! Nooo i will now proceed to cry about it in social media -Twittards"},{"id":2022312,"gallery_id":343928,"poster":{"id":3734765,"username":"DekuMidoriyaIzuku","slug":"dekumidoriyaizuku","avatar_url":"avatars/3734765.png?_=574969e46d6c0e9a","is_superuser":false,"is_staff":false},"post_date":1631885620,"body":"Mystic077 is a genius"},{"id":2013807,"gallery_id":343928,"poster":{"id":3840694,"username":"Noriaki Astolfo","slug":"noriaki-astolfo","avatar_url":"avatars/3840694.png?_=20c908c2fae12421","is_superuser":false,"is_staff":false},"post_date":1631538981,"body":"If you want to complain go to twitter not to nhentai, like this website never was moraly correct and that’s part of its charm. You can always return to youtube kids no one is forcing you to read hentai."},{"id":1972029,"gallery_id":343928,"poster":{"id":2471348,"username":"patrickhhh","slug":"patrickhhh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629885772,"body":"@Goblinslayer1389 get out of here kid, youre not old enough to even watch youtube."},{"id":1905415,"gallery_id":343928,"poster":{"id":997333,"username":"Roboticpump","slug":"roboticpump","avatar_url":"avatars/997333.png","is_superuser":false,"is_staff":false},"post_date":1627523239,"body":"Bruh, hentai is like 90% rapey, both sexes(mainly women though). Are you new to this goblinslayer? 🤣 7/10 because sex itself is already kinda dirty, so him coming in funky is a no go for me me. The art is ok, but the story could be a bit better. "},{"id":1902279,"gallery_id":343928,"poster":{"id":4234752,"username":"Goblinslayer1389","slug":"goblinslayer1389","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627398027,"body":"Ahh i really want to murder this author but on second thought i shouldn't do it because the author is mentally unstable human who should be in hospital 😢 but still this earth doesn't need people who rape and murder or are psychopath towards womens..so people who love this kinda shit and draw them please do suicide you're really not important to society so please die🥴"},{"id":1893050,"gallery_id":343928,"poster":{"id":1597654,"username":"Mystic077","slug":"mystic077","avatar_url":"avatars/1597654.png","is_superuser":false,"is_staff":false},"post_date":1627086172,"body":"People have the right to complain about this stuff, but on the other hand people have the right to make these types of doujins. If you don't like something u have the right to an opinion but it doesn't make it a right or wrong opinion all you can do is leave it be and try to ignore it. In my opinion if you really like a character to the point of not wanting to sully that character then why read doujins of them in the first place (unless they are canon, looking at you Princess Lover)"},{"id":1871983,"gallery_id":343928,"poster":{"id":577985,"username":"#simpledimpleguy","slug":"simpledimpleguy","avatar_url":"avatars/577985.png","is_superuser":false,"is_staff":false},"post_date":1626283671,"body":"@ZeroTsu Smart move"},{"id":1837005,"gallery_id":343928,"poster":{"id":3023139,"username":"HTBRZ","slug":"htbrz","avatar_url":"avatars/3023139.png?_=b5c0a33f32a0d35e","is_superuser":false,"is_staff":false},"post_date":1624854815,"body":"will there be part 2? I hope yes xD"},{"id":1821382,"gallery_id":343928,"poster":{"id":3465910,"username":"Chengu","slug":"chengu","avatar_url":"avatars/3465910.png?_=01ffb3c2d001261c","is_superuser":false,"is_staff":false},"post_date":1624263894,"body":"both of you shut the fuck up and jack off to the hentai you like"},{"id":1818781,"gallery_id":343928,"poster":{"id":497349,"username":"Zero Tsu","slug":"zero-tsu","avatar_url":"avatars/497349.png","is_superuser":false,"is_staff":false},"post_date":1624174856,"body":"@THEGUYINTHEPICT\nThe start of your very first comment made realize that it's a fucking waste of time to argue with you here. You said \" I made an account just to say fuck you.\" Maybe you try in your next life to be a little bit smarter? Now fuck off. I'm not reading 5 novel chapters from a straw man peasant. "},{"id":1814931,"gallery_id":343928,"poster":{"id":3353705,"username":"THEGUYINTHEPICT","slug":"theguyinthepict","avatar_url":"avatars/3353705.png?_=2fb2bc29ebfc33ec","is_superuser":false,"is_staff":false},"post_date":1624029357,"body":"And that marks the end of Garbage Tounge podcast doujinshi special episode 69. Follow my Twitter join my subreddit to see memes and listen to me on spotify if you hate my face. Cue the outro"},{"id":1814919,"gallery_id":343928,"poster":{"id":3353705,"username":"THEGUYINTHEPICT","slug":"theguyinthepict","avatar_url":"avatars/3353705.png?_=2fb2bc29ebfc33ec","is_superuser":false,"is_staff":false},"post_date":1624028968,"body":"Yes you still have the right to drink milk but why would you. Yes you can but should you? You can read ub doujins that you hate so much and would rather not read it and complain about it in the comment section but you can also just idk, ignore? It’s as simple as that. Fucking hell I just spent like 30 minutes of my life arguing with strangers on a pirate hentai site wth. Also @Imogen thank you at least I’m being an entertaining clown to someone. Disclaimer this is all just my opinion if you don’t agree with it you’re an ignorant ass hole that should’nt live with internet. Again just my 100% biased opinion. Also I was just attacking the people who are like you so good job attacking me like that. LEts end the argument here because I know retards like you cant counter argue wirh anything other than “its just my opinion11!”  Tis  was a nice frendy banter.  Btw Nice cock bro btw no homo we should collab sometime. Thank you to all of my lovely patreons I bet they don’t kinkshame other people"},{"id":1814885,"gallery_id":343928,"poster":{"id":3353705,"username":"THEGUYINTHEPICT","slug":"theguyinthepict","avatar_url":"avatars/3353705.png?_=2fb2bc29ebfc33ec","is_superuser":false,"is_staff":false},"post_date":1624028027,"body":"@Zero tsu Also I’m only triggered by the “we have the right to complain about stuff that we willingly clicked on” statement also your type of people in general. But you know what now I’m triggered by all of your comments. Quoting your previous replies “because some people care for these characters and don't wanna see them get raped/humilated” then don’t click on it. If you click on something then you’re gonna see more of it. That’s how this site works. We clear on that? Also once again I’m not attacking just you. If you don’t do those kind of stuff then that’s fine. I was just ranting about those annoying ass people who comments ntr bad on every ntr doujins ever. Doesn’t specifically have to be you ok? Tldr If you hate something then don’t do that thing and just leave that thing because some other people might like that thing. Also stop complaining when you die because you drink milk even though you’re fully aware of the fact that you’re lactose intolerant. "},{"id":1814867,"gallery_id":343928,"poster":{"id":3353705,"username":"THEGUYINTHEPICT","slug":"theguyinthepict","avatar_url":"avatars/3353705.png?_=2fb2bc29ebfc33ec","is_superuser":false,"is_staff":false},"post_date":1624027271,"body":"@Zero tsu\nLike you have a nhentai account you fucking degenerate And an anime pfp. You think you can complain? Sure but I can complain about your complainings too. If you can’t live with that, then tou’re either work on yourself or avoid the interner as a whole for being an ignorant prick. “Theres no ub tag” bro are you blind did you even see the cover??.  The cover says it all. It’s a ub doujin with prostitution type of stuff. You know you will hate it and yet you still clicked on it. You chose this path yourself knowing what lies ahead and then you think you have the right to complain? Dis like buying and drinking a carton milk knowing you’re lactose intolerant and then complaining you died because of it.  “Not every ub doujins is a rape work” yeah but does the cover looks like it’s one of them? Also who said you can’t dislike it? Of course you can. I have kinks that I heavily dislike too. But when I see 10 other comments saying they hate it I just keep my opinion to myself."},{"id":1814847,"gallery_id":343928,"poster":{"id":3353705,"username":"THEGUYINTHEPICT","slug":"theguyinthepict","avatar_url":"avatars/3353705.png?_=2fb2bc29ebfc33ec","is_superuser":false,"is_staff":false},"post_date":1624026358,"body":"@Zero Tsu\nI thought I was joking when I said you people can’t read. I said I made an account because of your type of people just to say fuck you. It doesn’t necessarily have to be you. It could be any other person with your type of personality that I’ve met last year. The world doesn’t revolve around you. Not everything is about you. Also good job replying to my replys because I’m also happy you’re triggered enough to reply to it. Also no you don’t have the right to complain. If you want to complain about stupid shit you go to Twitter not here you whiny little bitch. Complain all you want there idgaf but you doing it here really irritates me for some reason. Probably because I’ve seen millions of the exact same comment on every slightly unwholesome doujins. Again I’m not talking about just you, I’m talking about your type of people. Also the “mMhmM tHis nEeDs mOrE nTr” on wholesome doujins. Yeah fuck those people too. Don’t kinkshame people you’re not above them. "},{"id":1811720,"gallery_id":343928,"poster":{"id":3512129,"username":"Sleepysushi","slug":"sleepysushi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623903455,"body":"Mona definitely deserve that. That's for ruining my pity drop three fucking times!"},{"id":1808400,"gallery_id":343928,"poster":{"id":732462,"username":"Imogen","slug":"imogen","avatar_url":"avatars/732462.png?_=cba66bf6c8218393","is_superuser":false,"is_staff":false},"post_date":1623762635,"body":"another muneshiro banger, bonus points for the triggered comments lmao"},{"id":1792451,"gallery_id":343928,"poster":{"id":4234752,"username":"Goblinslayer1389","slug":"goblinslayer1389","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623132017,"body":"Why i am seeing this shit when i blacklisted all possible trash tags!? And this is fckin gross..i will fckin cut off all the fingers that this author have fckin piece of shit person who eats his own and others shit in morning i really wanna murder you author fckin rapists"},{"id":1788161,"gallery_id":343928,"poster":{"id":3419665,"username":"Jether21","slug":"jether21","avatar_url":"avatars/3419665.png?_=893ff70ceea74494","is_superuser":false,"is_staff":false},"post_date":1623008554,"body":"This shit is hot man. "},{"id":1787213,"gallery_id":343928,"poster":{"id":1794017,"username":"xXxJohnny97xXx","slug":"xxxjohnny97xxx","avatar_url":"avatars/1794017.png?_=8442d84d757a80d3","is_superuser":false,"is_staff":false},"post_date":1622974552,"body":"PS: You see a penniless astrologer. I see a $1 blowjob xD"},{"id":1786476,"gallery_id":343928,"poster":{"id":1794017,"username":"xXxJohnny97xXx","slug":"xxxjohnny97xxx","avatar_url":"avatars/1794017.png?_=8442d84d757a80d3","is_superuser":false,"is_staff":false},"post_date":1622951376,"body":"I don't play Genshin... But GOD. DAMNIT. MONA IT'S SO F*CKIN' GORGEOUS! I really agree with the uglybastard and some of you people: I'll f*ck mona so SO hard, till my b4lls go dry. "},{"id":1779044,"gallery_id":343928,"poster":{"id":497349,"username":"Zero Tsu","slug":"zero-tsu","avatar_url":"avatars/497349.png","is_superuser":false,"is_staff":false},"post_date":1622681295,"body":"@THEGUYINTHEPICT\nBy the way, all I did was answering someone who was curious about why people are getting triggered over a doujinshi. So good work attacking me like that by just answering it lmao"},{"id":1779034,"gallery_id":343928,"poster":{"id":497349,"username":"Zero Tsu","slug":"zero-tsu","avatar_url":"avatars/497349.png","is_superuser":false,"is_staff":false},"post_date":1622681004,"body":"@THEGUYINTHEPICT\nSo you're telling me that you made an account to tell me fuck you that is already one year old? Try again. Stop acting like I'm an idiot and can't see such informations by just clicking on your profile. I'm happy though that I actually triggered you that much. Yes I do have a fucking right to complain. Complain about everything I want. If I don't like something I have the right to say so. If you can't live with that, then you either work on yourself or avoid the internet as a whole for being an ignorant prick. None of the above you will do though that's why there is a shit ton of people like you. Even if the cover shows an ugly bastard (though there is no tag lol so how about you fix your eyes instead?) I can't click on it? I still have a right to read this doujin and form my own opinion before disliking it. Not every \"ugly bastard\" doujin is a disgusting rape work. I comment on every ugly bastard doujin? Look again I hardly even use this site anymore. So fuck off!"},{"id":1773904,"gallery_id":343928,"poster":{"id":3353705,"username":"THEGUYINTHEPICT","slug":"theguyinthepict","avatar_url":"avatars/3353705.png?_=2fb2bc29ebfc33ec","is_superuser":false,"is_staff":false},"post_date":1622457587,"body":"Also wtf people are saying they rather see the underage kid fucking than an ugly bastard? Truly a society that we live in. Vanilla fags please use all your cum jar karen energy to instead bitch about actually problematic kinks such as lolis and shotas. My final words are fuck you people who bitch about doujins that they can avoid just by looking at the cover. Also learn how to read. I said this whilst also being an ugly bastard hater. "},{"id":1773893,"gallery_id":343928,"poster":{"id":3353705,"username":"THEGUYINTHEPICT","slug":"theguyinthepict","avatar_url":"avatars/3353705.png?_=2fb2bc29ebfc33ec","is_superuser":false,"is_staff":false},"post_date":1622457183,"body":"@Zero tsu\nPeople like you triggers me so much I made an account just to say fuck you. “They have the rights to complain” no they fucking don’t. Think vanilla fags think, If you don’t want to see ugly bastards then why did you pick a doujin, that clearly has an ugly bastard in it’s cover, and also clearly has the ugly bastard tag that also clearly says ugly bastards and then you expect for it to be a vanilla doujins? I say you guys can’t read or doesn’t have eyes or just lack the brainpower to understand but seems like you do when you complain under every ugly bastards doujins that exist. And for what? Self statisfaction? You think after you bitch about it in a pirate hentai site, all the ugly bastards producing artists will spotatenuosly combust leaving only vanilla in the world?  think these artists are gonna stop drawing ugly bastards after a few strangers on the internet told them to? No they’re fucking not."},{"id":1734646,"gallery_id":343928,"poster":{"id":3295622,"username":"sit while avoiding taxes","slug":"sit-while-avoiding-taxes","avatar_url":"avatars/3295622.png?_=55298f0f1f162e74","is_superuser":false,"is_staff":false},"post_date":1620886796,"body":"Oh poor poor Mona, his thighs condemned her to this kind of shit"},{"id":1733379,"gallery_id":343928,"poster":{"id":1761306,"username":"Louei Veiga","slug":"louei-veiga","avatar_url":"avatars/1761306.png?_=feae06010cfc3f87","is_superuser":false,"is_staff":false},"post_date":1620840473,"body":"Man if I got isekai'd in genshin, the first one I'll fuck is mona."},{"id":1704310,"gallery_id":343928,"poster":{"id":4125777,"username":"temmieyeet","slug":"temmieyeet","avatar_url":"avatars/4125777.png?_=eb311a532fe0d48c","is_superuser":false,"is_staff":false},"post_date":1619605317,"body":"@Zero Tsu thank you that was a very good explain"},{"id":1651929,"gallery_id":343928,"poster":{"id":497349,"username":"Zero Tsu","slug":"zero-tsu","avatar_url":"avatars/497349.png","is_superuser":false,"is_staff":false},"post_date":1617189571,"body":"@eivan el @ZoM_\nIt's because some people care for these characters and don't wanna see them get raped/humilated. Ugly Bastard is just the tip of the iceberg! If you guys don't care, good for you. Some do and so they have all the rights to complain about stuff they dislike. "},{"id":1632229,"gallery_id":343928,"poster":{"id":2441366,"username":"waifuRetsu","slug":"waifuretsu","avatar_url":"avatars/2441366.png?_=6023f078c4394438","is_superuser":false,"is_staff":false},"post_date":1616352552,"body":"So this is where you are, No wonder I haven't seen you in my wishes"},{"id":1629007,"gallery_id":343928,"poster":{"id":1670770,"username":"ZoM_","slug":"zom_","avatar_url":"avatars/1670770.png?_=f6136bc688aa095d","is_superuser":false,"is_staff":false},"post_date":1616219400,"body":"@eivan el idk either. I dont care if this is Ugly Bastard stuff, I still wanna fuck her."},{"id":1626731,"gallery_id":343928,"poster":{"id":1861625,"username":"eivan el","slug":"eivan-el","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1616116112,"body":"idk why people still triggered on a fking doujin. it's a DOUJIN "},{"id":1626060,"gallery_id":343928,"poster":{"id":3889063,"username":"Breadstixk","slug":"breadstixk","avatar_url":"avatars/3889063.png?_=9be7c47e0d9bbb70","is_superuser":false,"is_staff":false},"post_date":1616086775,"body":"@Wraith_Stalks this dude probably still fapped to it\n"},{"id":1624760,"gallery_id":343928,"poster":{"id":2649478,"username":"csl_adayns","slug":"csl_adayns","avatar_url":"avatars/2649478.png","is_superuser":false,"is_staff":false},"post_date":1616029964,"body":"@ Wraith_Stalks chill out, it’s just a drawing🤡"},{"id":1613763,"gallery_id":343928,"poster":{"id":2961077,"username":"WraithStalks","slug":"wraithstalks","avatar_url":"avatars/2961077.png","is_superuser":false,"is_staff":false},"post_date":1615524736,"body":"Can you guys stop with this? Like she's poor because she refuses to make a career out of her interest, stop having her become a prostitute or in debt to an ugly bastard. If she's too prideful to make money out of astrology, she definitely wouldn't switch to prostitution or go into debt. "},{"id":1599891,"gallery_id":343928,"poster":{"id":1753956,"username":"Krux Ferd","slug":"krux-ferd","avatar_url":"avatars/1753956.png?_=a597a876ef03b44f","is_superuser":false,"is_staff":false},"post_date":1614933614,"body":"Go get em, Timmie!!"},{"id":1589010,"gallery_id":343928,"poster":{"id":3540801,"username":"Quality Fun","slug":"quality-fun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1614407747,"body":"Why was this uploaded three times in a row?"},{"id":1588100,"gallery_id":343928,"poster":{"id":2083213,"username":"Santedtra","slug":"santedtra","avatar_url":"avatars/2083213.png","is_superuser":false,"is_staff":false},"post_date":1614362294,"body":"Timmie 'bout to get sum"},{"id":1587201,"gallery_id":343928,"poster":{"id":976881,"username":"douchdestroyer","slug":"douchdestroyer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1614319292,"body":"Don’t get why an ugly man fucks a girl is no good but when a girl use a little underage boy for sex is all ok \npretty fucked up some people are "},{"id":1568795,"gallery_id":343928,"poster":{"id":2486185,"username":"henpenlen123","slug":"henpenlen123","avatar_url":"avatars/2486185.png?_=d60bba62e7cd8af0","is_superuser":false,"is_staff":false},"post_date":1613468625,"body":"There is no need for ugly bastards to exist. Just focus on the girl, sure you'll need to show the guy fucking her eventually but you can just show a normal dude that is also facelessm"},{"id":1567340,"gallery_id":343928,"poster":{"id":3535653,"username":"ก็็็็็็็็็็็็็็็็็็็็็็็ SEAM","slug":"k-seam","avatar_url":"avatars/3535653.png?_=3c64f08e41e298ac","is_superuser":false,"is_staff":false},"post_date":1613409270,"body":"Timmie's lucky day ( ͡° ͜ʖ ͡°)"},{"id":1552321,"gallery_id":343928,"poster":{"id":2735489,"username":"NeroBeasts","slug":"nerobeasts","avatar_url":"avatars/2735489.png?_=8e397da0a765b8c4","is_superuser":false,"is_staff":false},"post_date":1612760370,"body":"I prefer this version over the version that has more favorites tbh"},{"id":1547700,"gallery_id":343928,"poster":{"id":1114616,"username":"polarpwn","slug":"polarpwn","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612578872,"body":"#SaveUglyBastard"},{"id":1546776,"gallery_id":343928,"poster":{"id":2389255,"username":"The Communist Wizard","slug":"the-communist-wizard","avatar_url":"avatars/2389255.png?_=7015996cabbdba46","is_superuser":false,"is_staff":false},"post_date":1612542072,"body":"No, Timmie! No! Get out of there and play with pigeons or something. Mom said it's my turn."},{"id":1538996,"gallery_id":343928,"poster":{"id":1218626,"username":"RedBitch","slug":"redbitch","avatar_url":"avatars/1218626.png?_=7e99ec8b59d762c8","is_superuser":false,"is_staff":false},"post_date":1612178608,"body":"Fck idiots with there StopUglyBastards.. And yet if it was the Kid doing it to Mona yall would be Clapping?! Messed up Retards thinking there saints. "},{"id":1528090,"gallery_id":343928,"poster":{"id":1055751,"username":"wibanbandit","slug":"wibanbandit","avatar_url":"avatars/1055751.png?_=17b03b8c9d4b5c86","is_superuser":false,"is_staff":false},"post_date":1611684325,"body":"Help it, get some stop #SaveUGLYBASTARD"},{"id":1526408,"gallery_id":343928,"poster":{"id":3540801,"username":"Quality Fun","slug":"quality-fun","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1611610660,"body":"@forgottenn21 The only bait here is your comment. "},{"id":1519230,"gallery_id":343928,"poster":{"id":1627280,"username":"Zbk","slug":"zbk","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1611305855,"body":"bruh, i tho this is part 2 =_="},{"id":1511903,"gallery_id":343928,"poster":{"id":254507,"username":"Anime David Bowie","slug":"anime-david-bowie","avatar_url":"avatars/254507.png?_=f3fb2fa3c7306cc8","is_superuser":false,"is_staff":false},"post_date":1611011524,"body":"love the way this artist draws ass"},{"id":1506512,"gallery_id":343928,"poster":{"id":3126007,"username":"Bratt","slug":"bratt","avatar_url":"avatars/3126007.png","is_superuser":false,"is_staff":false},"post_date":1610808361,"body":"Mona can pay the rent of this month now 😔"},{"id":1506277,"gallery_id":343928,"poster":{"id":3910135,"username":"FBI Cyber Crime Department","slug":"fbi-cyber-crime-department","avatar_url":"avatars/3910135.png?_=9f6cc3bea8fc2cdc","is_superuser":false,"is_staff":false},"post_date":1610797899,"body":"Ah yes..... R-34 rule, if the characters are very liked by all people, the tags are getting f*cked up, guest im gonna stick with some underrated characters then 😂"},{"id":1505768,"gallery_id":343928,"poster":{"id":262725,"username":"XperiaXZ2c","slug":"xperiaxz2c","avatar_url":"avatars/262725.png?_=2e2ca7e2c18ee073","is_superuser":false,"is_staff":false},"post_date":1610771251,"body":"#I'mTheUGLYBASTARD"},{"id":1489712,"gallery_id":343928,"poster":{"id":1275726,"username":"alaxana","slug":"alaxana","avatar_url":"avatars/1275726.png?_=16096f1ecfda709a","is_superuser":false,"is_staff":false},"post_date":1610713558,"body":"Damn this comment section full of salt.\n"},{"id":1489487,"gallery_id":343928,"poster":{"id":1930146,"username":"KyleCombriver","slug":"kylecombriver","avatar_url":"avatars/1930146.png?_=8ad5844ae3858483","is_superuser":false,"is_staff":false},"post_date":1610703430,"body":"Good Mona doujin but kinda meh for something made by muneshiro. 7/10"},{"id":1489301,"gallery_id":343928,"poster":{"id":3588048,"username":"hornyrtsdils","slug":"hornyrtsdils","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610697353,"body":"Also, quite a bit of salt in the comments lmao"},{"id":1489296,"gallery_id":343928,"poster":{"id":3588048,"username":"hornyrtsdils","slug":"hornyrtsdils","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610697230,"body":"nice. 8/10"},{"id":1489002,"gallery_id":343928,"poster":{"id":3983149,"username":"hinaakimi","slug":"hinaakimi","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1610688003,"body":"#StopTheUGLYBASTARD"},{"id":1488852,"gallery_id":343928,"poster":{"id":2152826,"username":"Tu_mamá","slug":"tu_mama","avatar_url":"avatars/2152826.png","is_superuser":false,"is_staff":false},"post_date":1610682834,"body":"Ah yes, Mona the Five Star prostitute "},{"id":1488371,"gallery_id":343928,"poster":{"id":2860487,"username":"359877 Good Shit Dragon Ball Z","slug":"359877-good-shit-dragon-ball-z","avatar_url":"avatars/2860487.png?_=67bb3da4eadcb02d","is_superuser":false,"is_staff":false},"post_date":1610669914,"body":"God I swear even cannibalism as fetish is more easily explained than this"},{"id":1487908,"gallery_id":343928,"poster":{"id":3304412,"username":"Life go brrrrrr","slug":"life-go-brrrrrr","avatar_url":"avatars/3304412.png?_=4dcaff4117b73cef","is_superuser":false,"is_staff":false},"post_date":1610654489,"body":"#StopTheUGLYBASTARD"},{"id":1487811,"gallery_id":343928,"poster":{"id":3379830,"username":"Spitfire_HD","slug":"spitfire_hd","avatar_url":"avatars/3379830.png?_=278af34596b34c42","is_superuser":false,"is_staff":false},"post_date":1610650655,"body":"#StopTheUGLYBASTARD"},{"id":1487784,"gallery_id":343928,"poster":{"id":3947345,"username":"Carpet007pp.hahaha","slug":"carpet007pp-hahaha","avatar_url":"avatars/3947345.png?_=26945b503a088126","is_superuser":false,"is_staff":false},"post_date":1610649836,"body":"no tag, but this is okay too."},{"id":1487245,"gallery_id":343928,"poster":{"id":3762872,"username":"diabolikFIGHTER","slug":"diabolikfighter","avatar_url":"avatars/3762872.png?_=657f47170d1349ca","is_superuser":false,"is_staff":false},"post_date":1610633132,"body":"Yea I see where ur coming from etherite but to me it just still seems sad"},{"id":1486978,"gallery_id":343928,"poster":{"id":1888806,"username":"NCThomas","slug":"ncthomas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610625455,"body":"stop reposting this "},{"id":1486688,"gallery_id":343928,"poster":{"id":1055644,"username":"forgottenn21","slug":"forgottenn21","avatar_url":"avatars/1055644.png?_=10429b5ea0587603","is_superuser":false,"is_staff":false},"post_date":1610613746,"body":"its a shit game with a ton of bait characters anyway, just like Azure lane and FGO"},{"id":1486635,"gallery_id":343928,"poster":{"id":2062497,"username":"Grait","slug":"grait","avatar_url":"avatars/2062497.png","is_superuser":false,"is_staff":false},"post_date":1610612124,"body":"Prostitution and Mona really goes hand in hand"},{"id":1486624,"gallery_id":343928,"poster":{"id":3668154,"username":":tf:","slug":"tf","avatar_url":"avatars/3668154.png?_=8cfe4089157860bb","is_superuser":false,"is_staff":false},"post_date":1610611887,"body":"God pls let there be an influx of vanila ass Genshin shit I didn't roll for this crctrrs to see em plowed by those bour looking ass things you can hunt in game pls lord answer this atheists prayers "},{"id":1486506,"gallery_id":343928,"poster":{"id":4015985,"username":"Darius5379","slug":"darius5379","avatar_url":"avatars/4015985.png?_=b1b1ba85b2b990d0","is_superuser":false,"is_staff":false},"post_date":1610608754,"body":"The hat stays on during sex.\n\nBut seriously, I can live with the ugly bastard, but the „no showering“ stuff is just disgusting."},{"id":1486486,"gallery_id":343928,"poster":{"id":3725716,"username":"ErenaGrande","slug":"erenagrande","avatar_url":"avatars/3725716.png?_=46062aeec97f9397","is_superuser":false,"is_staff":false},"post_date":1610608027,"body":"This is great"},{"id":1486402,"gallery_id":343928,"poster":{"id":3704207,"username":"wededbrongl","slug":"wededbrongl","avatar_url":"avatars/3704207.png?_=34ab82edc4de7211","is_superuser":false,"is_staff":false},"post_date":1610605346,"body":"3 translations already of the same doujin? can i humbly ask you to translate that 1 doujin with mona, fischl, barbara, and keqing altogether?"},{"id":1486372,"gallery_id":343928,"poster":{"id":1061869,"username":"chromosome","slug":"chromosome","avatar_url":"avatars/1061869.png","is_superuser":false,"is_staff":false},"post_date":1610604581,"body":"Do we really need this many reposts of this?"},{"id":1486104,"gallery_id":343928,"poster":{"id":3408463,"username":"javix155","slug":"javix155","avatar_url":"avatars/3408463.png?_=8c2fd62a16a42f4a","is_superuser":false,"is_staff":false},"post_date":1610595776,"body":"10/10 Timmy Bizarre Adventure"},{"id":1486083,"gallery_id":343928,"poster":{"id":1608261,"username":"waaaaaaa","slug":"waaaaaaa","avatar_url":"avatars/1608261.png?_=bbc3694071157c93","is_superuser":false,"is_staff":false},"post_date":1610595261,"body":"the day timmie learned of a better pastime than feeding pigeons"},{"id":1486030,"gallery_id":343928,"poster":{"id":3370343,"username":"lolipomfer","slug":"lolipomfer","avatar_url":"avatars/3370343.png?_=ff98a1b2025320b5","is_superuser":false,"is_staff":false},"post_date":1610593082,"body":"It's kinda sad that she's always made a whore... But I might be interested in a shota sequel"},{"id":1485996,"gallery_id":343928,"poster":{"id":3295981,"username":"neko_","slug":"neko_","avatar_url":"avatars/3295981.png?_=985ac9bde08ca145","is_superuser":false,"is_staff":false},"post_date":1610592050,"body":"Where’s the fucking ugly bastard tag??"},{"id":1485976,"gallery_id":343928,"poster":{"id":1732159,"username":"Ethernite","slug":"ethernite","avatar_url":"avatars/1732159.png?_=ada1f3cdb6ca4f1c","is_superuser":false,"is_staff":false},"post_date":1610591495,"body":"4. It's possible, but much less likely... \n Some people simply like ugly things."},{"id":1485972,"gallery_id":343928,"poster":{"id":1732159,"username":"Ethernite","slug":"ethernite","avatar_url":"avatars/1732159.png?_=ada1f3cdb6ca4f1c","is_superuser":false,"is_staff":false},"post_date":1610591300,"body":"Several reason:\n1. To amplify the beauty of things, you have to put them in ugly environment.\n\n2. To emphasize \"immorality\", like how evil most of the time are drawn ugly while the good guy are appealing.\n\n3. Trying to relate to fat ugly reader. (Less likely)"},{"id":1485965,"gallery_id":343928,"poster":{"id":1838433,"username":"NTRANDLOLI","slug":"ntrandloli","avatar_url":"avatars/1838433.png","is_superuser":false,"is_staff":false},"post_date":1610590993,"body":"diabolikFIGHTER just don't be so serious, is HENTAI lmao just fap. \n"},{"id":1485961,"gallery_id":343928,"poster":{"id":1055644,"username":"forgottenn21","slug":"forgottenn21","avatar_url":"avatars/1055644.png?_=10429b5ea0587603","is_superuser":false,"is_staff":false},"post_date":1610590792,"body":"It lets them self insert"},{"id":1485907,"gallery_id":343928,"poster":{"id":3762872,"username":"diabolikFIGHTER","slug":"diabolikfighter","avatar_url":"avatars/3762872.png?_=657f47170d1349ca","is_superuser":false,"is_staff":false},"post_date":1610589426,"body":"Please could someone  explain the appeal of ugly bastard rape?"}]