[{"id":1652060,"gallery_id":344260,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617197631,"body":"And if instead this whole thing is a setup by the four brothers so she can come to accept having 4 guys in her life or the oldest brother is just into NTR and wants her to sleep with his brothers. I mean in this chapter the hubby just flat out tells her he's sterile but it's all okey since he's already asked his brothers to impregnate her. While it might be just hentai logic looking at the other two chapters I just can't help thinking that the oldest brother is either a huge NTR freak and got asked by his brothers, since he keeps stating her loves them, and it seems the brothers are all crazy for her. On a side note how does he know his brothers aren't sterile as well if he's sterile, Also how do they know she's not sterile as well when only the husband did a check up, though again it feels like the check up is fake. Wouldn't surprise me one bit if in the end it comes out he's been feeding her birthcontrol pills with out her knowing to set this all up."},{"id":1652052,"gallery_id":344260,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617197319,"body":"Yeah now we got https://nhentai.net/g/351877/ page 20 - 35, from my understanding in this one part 1, as mentioned she get's asked by her sterile husband to sleep with his brothers has to think about it and then she goes to masturbate and then agree's. Part 2 she is about to sleep with the oldest younger brother and he confesses that he loves her and always has since they first met, when the husband introduced her to them, then not much happens except a bj and their about to have sex. Part 3 they have sex and he cums 8 times in her hopping to get her pregnant. Then there is a phone call between her and the hubby, telling him all that happened and it appears like the husband is having a hard on and gettin aroused at being cucked. I then think she is hesitant to sleep with the other brothers hoping to wait to see if she got pregnant or not first. But the husband instead tells her to hurry and sleep with his other brothers. At this point I am even wondering if he's even sterile."},{"id":1581943,"gallery_id":344260,"poster":{"id":1133480,"username":"grudgehell","slug":"grudgehell","avatar_url":"avatars/1133480.png","is_superuser":false,"is_staff":false},"post_date":1614078230,"body":"@haitoku thanks man, ur great! "},{"id":1523598,"gallery_id":344260,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1611483753,"body":"Look like this's series will be long story nhentai.net/g/345095/ page 5 - 16. \n\n@Zacharisma_21 Adoption \"yes\" but Artificial Insemination \"NO\" that not gonna happen in H Doujin.\n"},{"id":1515151,"gallery_id":344260,"poster":{"id":3081691,"username":"Holy Geezuz!!","slug":"holy-geezuz","avatar_url":"avatars/3081691.png?_=ba6261703cef5fe2","is_superuser":false,"is_staff":false},"post_date":1611132308,"body":"Does this Fucknut of a Couple not know about Artificial Insemination is a Thing? or even adoption... Goddamnit Satsuki Imonet could you at least think a bit harder and come up with a plot that actually makes sense"},{"id":1512178,"gallery_id":344260,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1611021176,"body":"Plot like \"298443\" if author want to draw NTR story."},{"id":1511456,"gallery_id":344260,"poster":{"id":2249515,"username":"Guandules","slug":"guandules","avatar_url":"avatars/2249515.png?_=424219b033ebee81","is_superuser":false,"is_staff":false},"post_date":1610992743,"body":"@haitoku damn."},{"id":1511003,"gallery_id":344260,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1610975892,"body":"Husband and Wife want baby but husband he's sterile. So he think will use his 3 brother to help him get babe. After told his wife about his idea she ask \"Are you sure about this. You will accept that I will do with another guy. He said \"Of course not, but he love his brother and you it be OK. Wife need time to think about it and take a bath. While take a bath she wild fantasy about husband 3 brother when she has sex with (all of)them and masturbate. After finish bath she told her husband she accept his idea. And she think \"It's gonna be OK, right? Hope there's another chapter."}]