[{"id":1633307,"gallery_id":344375,"poster":{"id":246200,"username":"S3miaza","slug":"s3miaza","avatar_url":"avatars/246200.png","is_superuser":false,"is_staff":false},"post_date":1616403862,"body":"thanks man, i just figured to come to the comment section to see if someone can point me to the plot or a translated version of it.\nwe still need a proper translation to read, but well done man!"},{"id":1520945,"gallery_id":344375,"poster":{"id":1819047,"username":"toshokan7","slug":"toshokan7","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611384064,"body":"Part 2 \n\n\"Kuzuryu Ai, the captain of the incineration unit, along with her husband and her subordinate Kazuma\nShe is a female captain who has been assigned to take over the trace of her predecessor who died unemployed the other day.\nRumors that she is awesome, but more than that, rumors of her fascinating erotic body\nIt was raging among men ... Hormonal extract is the source of activity\nFor Brain, it was a non-negligible matter.\nPoisonous fangs were about to be directed at Kuzuryu Ai ...\n\n\n* This work is a near-future science fiction manga called Cyberpunk Horror NTR.\nZombies will come out, and there will be a little gloomy expression, so with horror\nI did, but I intend to draw it as softly as possible.\nIt is not a horror comic, so please do not expect it.\nWe also use multiple cross-sectional views, so please be careful if you are not good at it.\n\n* A trial version of 14 pages of prologue is available this time.\nI would like you to take a look and enjoy the atmosphere of this work.\""},{"id":1520941,"gallery_id":344375,"poster":{"id":1819047,"username":"toshokan7","slug":"toshokan7","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611383936,"body":"ok so I figured out  some of the plot. At least the setup this is the summary from the dlsite page in google translate. Posting in 2 parts...\n\n\"20XX ... Half of humankind became zombies due to the appearance of an unknown virus.\nThere was no resistance, and the remaining half abandoned cities and countries, and naturally the world.\nIt will gather in the center and build up the historical area \"Nation\".\n\nInvading in the darkness in a nation where a wide variety of ethnic groups and cultures coexist\nSome zombies are coming ... The security police have set up a special affairs section Z specializing in zombies.\nAn incineration unit was formed to take charge of it.\n... But some zombies have intelligence and seek coexistence with humankind.\nIt was also true that there was a faction called \"Brain\".\n"},{"id":1520808,"gallery_id":344375,"poster":{"id":1819047,"username":"toshokan7","slug":"toshokan7","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611378110,"body":"Looks great too bad I can't read it. I can guess the plot though. monster hunting spy chick gets mind broken ntr sytle by zombie/monster dick... Especially last panel is hot  though I can't read jap beyond 1st grade level I can just barley make it out. she says \"sayoonara watashi no (Kanji for love) some hiragana grammar  (kanji for person). So something like \"goodbye my loved one\".  While point the gun at him I guess.\n\n"},{"id":1511109,"gallery_id":344375,"poster":{"id":1378735,"username":"LoadingUsername","slug":"loadingusername","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1610980852,"body":"English ver masters"}]