[{"id":1543354,"gallery_id":345170,"poster":{"id":522750,"username":"Prince Chan","slug":"prince-chan","avatar_url":"avatars/522750.png","is_superuser":false,"is_staff":false},"post_date":1612370782,"body":"@Stck\n@NezNezNumeros\n\n No, She's not, He's arrogant and thought of himself as 'born-winner'. He only went out with her is so he can brag about his relationship with the female etc. how soft her breast felt when he touched them, sex, like he said in the doujin. And She felt like he didn't like her as much as she likes him so she confronts her frustration in their current relationship with her friends. At this point, all of the classmates already have grudges against him and now they knew what he has done to her. They simply felt like they have had enough of him and isolate him from the rest of them. This hit his ego by a lot. So he went to the roof. And then the girlfriend went to the roof to asks for a breakup. \n\njust a second ago he was isolated from his classmate and now his GL is asking to break up with him, he couldn't take it so he's being apologetic to the GL and ask for her forgiveness. GL is soft-hearted and forgave him. Thus they have sex on the roof. "},{"id":1543298,"gallery_id":345170,"poster":{"id":1036696,"username":"Fluffyfish","slug":"fluffyfish","avatar_url":"avatars/1036696.png","is_superuser":false,"is_staff":false},"post_date":1612369082,"body":"The panels where she has one nipple erect and another inverted are so fucking hot."},{"id":1541650,"gallery_id":345170,"poster":{"id":3421356,"username":"NezNezNumeros","slug":"nezneznumeros","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1612304185,"body":"Oh. I've read this on Fakku. The guy is a jerk. He only dated her because he wants to brag about having a beautiful GF. Then, he kept forcing her until the GF told her problems to her friends. They make out and reconcile at the end and the guy promised that he'll change, but it was hinted at the last panel that he's still a douchebag and the reason why he still wanted to date her is to at least not be an outcast and maintain his position at school."},{"id":1540392,"gallery_id":345170,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612244906,"body":"Did she deliberately get him socially isolated so he'd have only her? And then threaten to break up to manipulate him into treating her better since she was all he had left at that point? \n"},{"id":1539159,"gallery_id":345170,"poster":{"id":1176644,"username":"c93h23wu","slug":"c93h23wu","avatar_url":"avatars/1176644.png?_=84f64719cc9f7f93","is_superuser":false,"is_staff":false},"post_date":1612189101,"body":"這到底是什麼劇情喔齁齁齁齁齁"}]