[{"id":1527724,"gallery_id":345291,"poster":{"id":415682,"username":"dennismueller125","slug":"dennismueller125","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611668981,"body":"german for roleplays?\nBBAFEB3A69F32BBD52F0466C69A657C694D4C746A51C813A05935B0C62897E08CD70D762179F"},{"id":1526865,"gallery_id":345291,"poster":{"id":1856506,"username":"Feitan777","slug":"feitan777","avatar_url":"avatars/1856506.png?_=e27a44b8ecc3c020","is_superuser":false,"is_staff":false},"post_date":1611631321,"body":"anal+loli tag is great , but i actually miss good old works like SINK , Ovacas , Yoroshiku Tarou , Nezumin , Shoutarou , Ozawa Raidou , Omoshiro Burger , Elf-K  etc ... this stuff was really naughty and erotic ... i miss this shit a lot"},{"id":1526609,"gallery_id":345291,"poster":{"id":444854,"username":"random8343","slug":"random8343","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1611619694,"body":"BTW I don't know why you guys are here but an english version of this dojin was already posted before : 345209"},{"id":1526603,"gallery_id":345291,"poster":{"id":444854,"username":"random8343","slug":"random8343","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1611619549,"body":"@MoanChomsky I think that tag is so popular because for a lot of people sex is more about \"dominance / power\" rather than plain reproduction. People with particularly low self-esteem (of which the internet is full of) like this kind of \"power play\" because it vents 2 things at once: Their sexual desire and their frustrations at once by targeting a fictional character since they can't target a real life one.\nAgain, it's not about lust, it's about venting, the weaker the character is(like a loli), the stronger they feel(like a loser).\n\nPS\nI'm not judging here; everyone got his problems and it's better being here on fictional characters than doing the 1000x worse alternative with real life persons."},{"id":1526385,"gallery_id":345291,"poster":{"id":1127570,"username":"Homosexual fire of the north","slug":"homosexual-fire-of-the-north","avatar_url":"avatars/1127570.png","is_superuser":false,"is_staff":false},"post_date":1611609612,"body":"El filo postin"},{"id":1526067,"gallery_id":345291,"poster":{"id":1309525,"username":"mythhalo303","slug":"mythhalo303","avatar_url":"avatars/1309525.png","is_superuser":false,"is_staff":false},"post_date":1611595163,"body":"Nice loli,nice tight pussy! Its put my blood on my penis to work harder"},{"id":1526032,"gallery_id":345291,"poster":{"id":3654637,"username":"MoanChomsky","slug":"moanchomsky","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611593957,"body":"Err the question I actually mentioned was \"why is this kind of doujin so popular\", but I'd also like to know why the rape tag is missing so often. Perhaps its because we are ashamed that so many of the doujin here have that as a central plot element.  The site and art-form are already denigrated enough by the moralists who made such a big deal over 118 sketchy pornhub videos that they almost got pornhub shut down. (Meanwhile 84 *MILLION* similar sketchy posts have been reported at Facebook. Its a bit more than 118, right? Nobody is trying to shut them down though. Moralists just don't like that PH is unashamed of being a porn-only venue, wherewas FB can mask those interests in some of its users.)  Anyway, /rant. You guys are the best. Stay lewd! :)"},{"id":1526006,"gallery_id":345291,"poster":{"id":3654637,"username":"MoanChomsky","slug":"moanchomsky","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1611593501,"body":"Not really my thing, I don't mind it though- fantasy is fantasy.  I came for the discussion... I wanted to pose the question of why the 'rape' tag is left off of so man titles that OBVIOUSLY entail rape. Particularly loli titles like this one, from what I can gather from the thumbnails.  Is it because our notions of sexual competitiveness and fear of sexual inadequacy lead us to idealized forms of our cultures main sexual trope?  That is to say- a big strong forceful older man who has a giant penis versus a tiny  young  weak girl. The idea is she would be maximally satisfied by his aggression, which is something we wish to be able to do ourselves (please women in bed)- to compete for dates, wives, and ultimately be able to spread our genes. With &gt;200 faves in 3 hours, I'm sure *somebody* will read this comment perhaps share their perspective.   I'd appreciate it. :) "}]