[{"id":2021604,"gallery_id":346392,"poster":{"id":2317662,"username":"RevyTwoHand","slug":"revytwohand","avatar_url":"avatars/2317662.png?_=2939e274cbd554b5","is_superuser":false,"is_staff":false},"post_date":1631856066,"body":"Part 2 is out"},{"id":1809877,"gallery_id":346392,"poster":{"id":2163646,"username":"AnonymousPersonaXv","slug":"anonymouspersonaxv","avatar_url":"avatars/2163646.png","is_superuser":false,"is_staff":false},"post_date":1623823923,"body":"@sirfilm, you have my utmost gratitude for your recap of the story"},{"id":1720261,"gallery_id":346392,"poster":{"id":3746456,"username":"Ornstein Ds","slug":"ornstein-ds","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620260335,"body":"Sad very sad "},{"id":1557713,"gallery_id":346392,"poster":{"id":755753,"username":"sirflim","slug":"sirflim","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1613004381,"body":"[PART2] Sea ends up calling Hiro on the phone while Shou is heading to the store for condoms and the call ends with him unable to tell her over the phone that he knows she's about to have sex with Shou and that he doesn't want it to happen because he likes her, but he clams up leading to the event to happen. At the end he walks in, and Shou struts about having taken her virginity for himself first before ushering her into sucking his dick in front of Hiro. Honestly it's a bit weird Sea does that since she's clearly uncomfortable she got caught in that situation, but after some hesitation, she does. During this after sex fellatio, Shou prompts Hiro to join in which causes Sea to react a bit. It ends with his internal struggle and reaching out his hand, presumably to the condom where we can assume they all kinda go the sex friend route with him feeling guilty he isn't able to pursue her properly. "},{"id":1557709,"gallery_id":346392,"poster":{"id":755753,"username":"sirflim","slug":"sirflim","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1613004245,"body":"Don't be led astray by SatchPangit's generic NTR story. That's not really what is happening here. \n\n[PART1] None of them are in a relationship. They're all just childhood friends. Sea (girl) got interested in sex because Hiro (black haired boy) introduced her to some H stuff he found on the internet once when they were young, so she built up a excessive interest in pervy stuff, going the route pervy artist route, using the two of them as material. It basically turns into a bit of a sexual exploration thing asking to see their actual dicks, but only the blonde boy Shou is comfortable enough to attempt it. It really just cascades from there. Shou and Sea get more and more into it over the next days and it forces our main guy to question if he's comfortable with what happened the first night. He ends up discovering the two of them have continued their rondevous and Shou is going in for the full penetration kill. "},{"id":1542468,"gallery_id":346392,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1612338194,"body":"@SatchPangit kinda sucks, but at least both the girl and the black haired boy are now interested. Blonde is all win."},{"id":1542041,"gallery_id":346392,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1612322541,"body":"The three are childhood bestfriends with the girl and black haired boy in a relationship. All of them are interested in sex since they were kids and are virgins but the lovers didn't have sex as the black haired guy is indecisive so blonde took the opportunity to lose his virginity while taking his best friend's with the pretense that it will help her to be aggressive to push her lover to have sex with her. The boyfriend caught them but they didn't stop as it's just practice then blonde invited boyfriend to join them for real sex."},{"id":1541734,"gallery_id":346392,"poster":{"id":1406597,"username":"tarapar","slug":"tarapar","avatar_url":"avatars/1406597.png?_=b2cfa993806f69aa","is_superuser":false,"is_staff":false},"post_date":1612307858,"body":"They are children, that's why it's great"},{"id":1541727,"gallery_id":346392,"poster":{"id":404268,"username":"Golden Snub Nosed Monkey","slug":"golden-snub-nosed-monkey","avatar_url":"avatars/404268.png?_=d167bb8fe8b30ede","is_superuser":false,"is_staff":false},"post_date":1612307435,"body":"Would have been nice if the dudes didn't look like children"},{"id":1541647,"gallery_id":346392,"poster":{"id":3715328,"username":"User28583","slug":"user28583","avatar_url":"avatars/3715328.png?_=718315a25b9f0792","is_superuser":false,"is_staff":false},"post_date":1612304132,"body":"Can someone give a quick summary? this looks interesting not gonna lie"},{"id":1541483,"gallery_id":346392,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1612297093,"body":"more drama than i expected."}]