[{"id":1544729,"gallery_id":346425,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1612430057,"body":"@tobajas The person who's doing the translation said on EH that the one who commissioned it wanted it done in reverse, hence why the most recent chapter was done first and then this one afterward."},{"id":1543242,"gallery_id":346425,"poster":{"id":2770998,"username":"aimanwhite93","slug":"aimanwhite93","avatar_url":"avatars/2770998.png?_=d166d2ef8fc7c75d","is_superuser":false,"is_staff":false},"post_date":1612367174,"body":"they need to translate the prequel first, it kinda confusing how this started. "},{"id":1542917,"gallery_id":346425,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612354026,"body":"Kinda weird that they started they started translating part 2 of this first and not doing them in order either it seems. Some background from what I could see the wife is pretty much super sensative and supossedly \"easy\" to sleep with. In part 1 another guy then this one turn up in her life and it's shown that he forced himself on her back when they were in school. Then now after entering her life again he forces himself on her again and start blackmailing her into sex. After a while and feeling emotionally vulnerable about the whole thing and not able to turn to her husband. In comes this guy he eventually see's the other guy and forces him away from her then invites her in. After drinking he starts hitting on her but she eventually rejects him then when at the door to leave she does a 180 and decides to sleep with him. After that they start a relationship for a while and she starts to get feelings for him, I believe they eventually move away which she seems thankful for since she "},{"id":1542909,"gallery_id":346425,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1612353801,"body":"won't keep cheating on her husband. But of course the new place they move to have the guy living there as well, oh and it also turns out that he's the boss of the husband. Then this part starts with well the boss and wife sleeping with each other and dating behind the husbands back, for some reason the boss seems to never work like in many these NTR stories and just seems to be at home while fucking the wife and instead the husband is always away and even eventually starts having issues sleeping with the wife. One of the reasons being that he suspects her of cheating on him and being overworked."}]