[{"id":1577291,"gallery_id":347680,"poster":{"id":3643449,"username":"NephilimConception","slug":"nephilimconception","avatar_url":"avatars/3643449.png?_=38554e04ee0b4f2d","is_superuser":false,"is_staff":false},"post_date":1613860891,"body":"@wretttched There could very well be a genetic component to it. I am certainly of the view that it is advantageous to one passing along their genes, and pretty much all animals are born with basic breeding instincts, so if we assume animalistic instincts are genetic, I could see a predisposition to maiesiophilia being a result of genetics, with tokophobia perhaps resulting from similar genes producing the opposite result. I can point pretty clearly to events in my life that led to my development of a pregnancy fetish though, and studies have been done that show that older siblings whose mothers had been pregnant with a younger sibling while they were young are more likely to develop the fetish (which is weird because I'm the youngest sibling, but it's not like I'm going to ask my sister if she has a pregnancy fetish lol), so there are almost definitely nurture components as well. "},{"id":1572189,"gallery_id":347680,"poster":{"id":1338162,"username":"wretttched","slug":"wretttched","avatar_url":"avatars/1338162.png","is_superuser":false,"is_staff":false},"post_date":1613621985,"body":"continuing the conversation below, it makes sense that a pregnancy fetish could be somewhat genetic (genetics can have some influence on behavior, right?). I mean, someone with that fetish is more inclined to impregnate someone/get pregnant, and therefore have more children (assuming they don't abort), so if there is such thing as a genetic predisposition to a fetish, they could be more likely to pass it on"},{"id":1565640,"gallery_id":347680,"poster":{"id":3643449,"username":"NephilimConception","slug":"nephilimconception","avatar_url":"avatars/3643449.png?_=38554e04ee0b4f2d","is_superuser":false,"is_staff":false},"post_date":1613338361,"body":"I agree completely with @憂鬱の騎士 here. It's one of the most biologically understandable fetishes as far as I'm concerned. Sex drive even skyrockets during pregnancy in many cases, so the body itself frequently seems to think it's a good idea. Saying it's %0.01 of people who have the fetish or comparing it to scat, vomit, gore, and bestiality of all fetishes is ridiculous. I think pornhub's analytics (depending on how much those mean to you) as of 2017 showed that \"pregnant\" was about as common a search term as \"redhead\", a far more comparable fetish because it's just as vanilla, and it was generally trending upward. I won't deny it has an unfortunate tendency to be paired with more degenerate fetishes though, and the world could always use more hot wholesome vanilla preg.  "},{"id":1563121,"gallery_id":347680,"poster":{"id":405040,"username":"赤の騎士","slug":"chi-noqi-shi","avatar_url":"avatars/405040.png","is_superuser":false,"is_staff":false},"post_date":1613242452,"body":"@machine08\n\nYou really are stupid if you think that it's just 0.01% that's getting off to pregnant porn. Do you also think that all couples completely stop having sex once the woman gets pregnant until she has the baby? Pregnant fetish is extremely vanilla, to put it as if it's some weird niche fetish is fucking stupid."},{"id":1562927,"gallery_id":347680,"poster":{"id":205514,"username":"base1000","slug":"base1000","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1613236527,"body":"The Same reason scat, vomit, gore, beastiality, etc. etc. are things. People get off to different things and when there is money there are content creators satisfying demands. "},{"id":1562745,"gallery_id":347680,"poster":{"id":680268,"username":"machine08","slug":"machine08","avatar_url":"avatars/680268.png?_=e143166d0bfba3fd","is_superuser":false,"is_staff":false},"post_date":1613230722,"body":"No Idea bro but I promise you there's always that %0.01 who's getting off to pregnant porn"},{"id":1562698,"gallery_id":347680,"poster":{"id":3248047,"username":"Elen0766","slug":"elen0766","avatar_url":"avatars/3248047.png?_=eaa822380d68e710","is_superuser":false,"is_staff":false},"post_date":1613229072,"body":"Why is pregnant porn a thing"}]