[{"id":2316002,"gallery_id":349671,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644174797,"body":"From the parts I googled translate the story is pretty much like this first time there are rumours that the doctor is sexually harassing the female staff and patients. So a friend of the hubby tells him to get evidence of it happening, at the same time the hubby is seemingly unemployed so the only one making one is the wife. Then hubby and friend goes to get evidence of the sexual harassments then they find the wife confronting the doctor about it. Then the doctor proceeds to pretty much rape her while threatening her that if she say's anything she'll loose her job and with her useless hubby they'll end up in the streets. At the same time the hubby wants to step in but get's stopped by the friend who tells him they need more for him to have solid evidence and be able to sue the doctor. Then it turns into a full blow rape scene which the friend films and then hands over the the hubby so he can sue the doctor for a lot of money. "},{"id":2315994,"gallery_id":349671,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644174649,"body":"But instead the hubby feels bad about it all and just puts the video away since he thinks he's failed his wife, he acted like a peeping-tom and it would sully her reputation. Then the next time is pure rape where their neighbour or something rapes the wife and again the hubby turns up when it happens but again instead of helping he brings out his phone to film it all, while asking himself what the F he's doing right now. Then after the rape the wife starts crying and calling him saying she's so sorry. So in short the plot is about the wife getting raped while the hubby is always present to help her but instead chooses to film her getting raped and then seemingly has realized her has an NTR fetish."},{"id":2062434,"gallery_id":349671,"poster":{"id":2395043,"username":"DoUjiN MeSsIaH","slug":"doujin-messiah","avatar_url":"avatars/2395043.png?_=81baa50220bf0a92","is_superuser":false,"is_staff":false},"post_date":1633468508,"body":"she's not really getting raped she's kinda allowing it to happen it seems and it looks like she still feels good with the husband, so she just a slut"},{"id":1928743,"gallery_id":349671,"poster":{"id":992443,"username":"Jokke0009","slug":"jokke0009","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628324680,"body":"Bye artist-san, it seems you're trash afterall. "},{"id":1595562,"gallery_id":349671,"poster":{"id":3144116,"username":"Killerbee8991","slug":"killerbee8991","avatar_url":"avatars/3144116.png","is_superuser":false,"is_staff":false},"post_date":1614738793,"body":"Pretty sure that isn’t rape. Unless I missing context, I’m pretty sure she allowing guys to do there stuff. But if there a previous chapter were she being force with blackmail, than I will agree with you. But until than she just seem like a slut lol "},{"id":1593821,"gallery_id":349671,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1614650684,"body":"So pretty much wife is getting raped all over the place, husband knows about it and instead of helping her he films it and gets horny from it?"}]