[{"id":1633449,"gallery_id":350428,"poster":{"id":2126698,"username":"SlutSlayer007","slug":"slutslayer007","avatar_url":"avatars/2126698.png?_=bcba218944fbfd18","is_superuser":false,"is_staff":false},"post_date":1616412209,"body":"Seriously wanted to see the Bitches reaction when she comes to know that the cuck is way more successful than the fag she chose to be a cum bucket for."},{"id":1628394,"gallery_id":350428,"poster":{"id":3015803,"username":"Novelhellsing","slug":"novelhellsing","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1616197769,"body":"Is this a new add section to the hentai? I wonder what is being said and also wondering if the author is going to make more material for this doujin. It be nice if the author show her reaction to the cuck success and the bull downfall. Also to see if she get hooks up with the bull and her reaction when he tossing her aside. It doesn't look like she stays with the bull cuz of the sex scandal the bull of going through lol. Someone translate pls lol"},{"id":1607858,"gallery_id":350428,"poster":{"id":317146,"username":"sleik","slug":"sleik","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615276588,"body":"We already see in 5.0 that she never ends up going through with the breakup, and the douche ends up telling the cuck in one of the worst ways.  \nI'm more interested in the interactions between the cuck, the douche, and the bitch in the immediate aftermath, and how the bitch despairs after getting pregnant and finding out about the marriage fraud scandal with the douche. \nWould be interesting to see her reaction to the cuck's successful career years later as well."},{"id":1607833,"gallery_id":350428,"poster":{"id":317146,"username":"sleik","slug":"sleik","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615275803,"body":"@Jeam125 Nah, the dumb bitch is totally in love with the douche, and loves the sex. She defends him when her friend warns her about how scummy he really is, saying he's changed LOL. The douche in the first part is explaining his process of \"training\" girls like the bitch to become dependent on him, and scoffs at how much she's changed compared to the flashback panels.  He even plays with the bitch by making her tell him how he compares to the cuck when they're doing it.\nShe only feels bad for the cuck and wants to break up with the cuck, even asking her friend how to go about it.  The friend just tells her to keep the cuck as a backup guy, and just treat their walks home together as a \"maintenance fee\".  The final couple panels is her trying to muster the courage to break up, but then decides that it's not a good time.  The friend in the final panel is essentially the \"Devil\" in her thoughts telling her this is good, just \"keep\" him. She feels guilty, but is too chicken to break up. "},{"id":1606856,"gallery_id":350428,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1615244551,"body":"She deserves it. She gave her virginity to the scum and even became lovers wit him and now he's shown his true colors along with blackmailing her that he will show her naked body while having sex to the public if she broke up with him."},{"id":1606706,"gallery_id":350428,"poster":{"id":3924582,"username":"Jeam125","slug":"jeam125","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615238671,"body":"Let me guess, girl is being treated like a sex doll, she's realizing that the relationship with the other dude was a true relationship/wholesome one, and now is starting to regret."},{"id":1605070,"gallery_id":350428,"poster":{"id":1613813,"username":"otakuhybrid","slug":"otakuhybrid","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615175887,"body":"Damn the amount of text is so OP jahaha wonder what the story aside from being ntr"},{"id":1605010,"gallery_id":350428,"poster":{"id":996591,"username":"heavenwing","slug":"heavenwing","avatar_url":"avatars/996591.png?_=93234bf013c7dfa1","is_superuser":false,"is_staff":false},"post_date":1615174234,"body":"Translate this fuck quickkk!!!!"},{"id":1604508,"gallery_id":350428,"poster":{"id":1649066,"username":"LettuceZ","slug":"lettucez","avatar_url":"avatars/1649066.png?_=89001055fe6888e7","is_superuser":false,"is_staff":false},"post_date":1615153564,"body":"God damn this nigga helped edit hunterxhunter or some shit, how much text you need?! "},{"id":1604125,"gallery_id":350428,"poster":{"id":2067832,"username":"HanaBanana","slug":"hanabanana","avatar_url":"avatars/2067832.png","is_superuser":false,"is_staff":false},"post_date":1615135399,"body":"wtf he intubated her with his cock.\n\nyou could get aspiration pneumonia from that."},{"id":1603927,"gallery_id":350428,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1615127906,"body":"guys art seems better but the bubbles are even worse jesus so much text."},{"id":1603733,"gallery_id":350428,"poster":{"id":1742939,"username":"Jaken23","slug":"jaken23","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615119640,"body":"Que hija de puta es esta fmc"}]