[{"id":1622049,"gallery_id":350507,"poster":{"id":949397,"username":"Mzyls","slug":"mzyls","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615900986,"body":"this bitch must die"},{"id":1606006,"gallery_id":350507,"poster":{"id":992443,"username":"Jokke0009","slug":"jokke0009","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615211461,"body":"It's just copy paste ntr like all the rest with the only thing that matters is a big dick. It never changes and aslong as rapists keep buying this crap artist won't put effort into something :)"},{"id":1605551,"gallery_id":350507,"poster":{"id":3819213,"username":"JMissing","slug":"jmissing","avatar_url":"avatars/3819213.png?_=bd10fa04c84af789","is_superuser":false,"is_staff":false},"post_date":1615193246,"body":"I just want a happy ending for this kind of ntr story. I normally tolerate ntr when the male character is rarely even shown in the story, that’s the best ntr"},{"id":1605421,"gallery_id":350507,"poster":{"id":1649066,"username":"LettuceZ","slug":"lettucez","avatar_url":"avatars/1649066.png?_=89001055fe6888e7","is_superuser":false,"is_staff":false},"post_date":1615188082,"body":"Yea this ain't gonna last, she down bad for the coach and him ignorin her and treating her like every other student is gonna drive her insane. "},{"id":1605369,"gallery_id":350507,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1615186000,"body":"@El_Bukis There was a bit of that in the beginning when Yuki had her first time with Shoma and then went right after to have sex with the coach(she had two sets of condoms in her bag, one box for Shoma and one box for coach. Take a wild guess which ones were the bigger size). Of course, what changes things is Shoma getting better at sex and actually making her orgasm like he did in the infirmary and here on the bus. Doubt it's enough for him to win in the end because the coach has started acting like a righteous asshole thinking he's better than Shoma just because he said he'd take responsibility if Yuki got knocked up. Would be a nice twist to see the coach lose in the end, though."},{"id":1605244,"gallery_id":350507,"poster":{"id":1215699,"username":"El_Bukis","slug":"el_bukis","avatar_url":"avatars/1215699.png","is_superuser":false,"is_staff":false},"post_date":1615181597,"body":"You know, I'm kind of doubting that's how it's going to develop because the MC is doing something that I can't remember ever seeing in any NTR series, and that's learning how to actually be good at sex. I can't read Japanese though, so I could almost certainly be wrong. But even in the translated chapters there was never any mention of the standard \"your dick is small and his dick big\" nonsense. Just the comparison between their skills at sex, which going by pictures seems like the MC is improving in that area."},{"id":1605086,"gallery_id":350507,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1615176378,"body":"Ikr? Like this is obviously clear FMC got NTR'd by the douche, and it feels like they are in an insufferable stage. Then, FMC is gonna explode and goes back to douche with the biggest lust crave no other human has ever seen and would make MC despair so bad that the depression kills him. The End. Is this THAT kind of story? It feels like it's taking that direction."},{"id":1605083,"gallery_id":350507,"poster":{"id":1809571,"username":"Haremilf","slug":"haremilf","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615176207,"body":"Cant help but hopimg the boyfriend begans to cheat on her with the ponytail girl too now. That be even worse betrayal revenge"},{"id":1604873,"gallery_id":350507,"poster":{"id":3776613,"username":"ParGeo","slug":"pargeo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1615169996,"body":"Continuation? I thought the story was over. It is clear, then she will still be jumping on the coach's dick. The guy will take some more shit for his stupid decision."}]