[{"id":1803995,"gallery_id":353084,"poster":{"id":3776196,"username":"EDHOLLA","slug":"edholla","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623577935,"body":"English please I want to read the whole thing "},{"id":1754421,"gallery_id":353084,"poster":{"id":3224513,"username":"SasukeU2","slug":"sasukeu2","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621629608,"body":"please english"},{"id":1677705,"gallery_id":353084,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1618366159,"body":"@yellow1984 yeah I pretty much read it with a mtl app when I wanna know stuff like whats happening. Also the first part of this has already been translated here https://nhentai.net/g/291654/"},{"id":1659955,"gallery_id":353084,"poster":{"id":2394250,"username":"yellow1984","slug":"yellow1984","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617561819,"body":"ha ha ha you guys are so fun. @tobajas this critic is so fking fluent and on the point hahaha. But I really wonder, as this is the only version of this doujinshi on this website, do you guys understand Chinese and are only comment in English? Or you are English and only reading this Chinese-translated doujinshi with some translation app or what? I keep seeing comments written in English at a level which I think is clearly of native speakers. I'm just curious how you read Chinese"},{"id":1650374,"gallery_id":353084,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617124761,"body":"Okey this one is just like this author always does just hella confusing from my understanding with mtl she goes to a party get's smashed and then raped then at the end of that the rapists takes a bunch of pictures and sends it to everyone. Rumours spreads to at the school that she's a slut and then she cries in her room. BF comes over and asks her why she cheated on him, she tells him she was raped upon which he asks why she didn't report it or go to the police she doesn't really answer this but just evades it until the bf get's mad believing she cheated on him and slaps her. She cries and starts masturbating then rapist turns up and she half-heartedly tries to fight him of but he just laughs and also ask why she never reported him. Then they just start having sex and why she never reported him was never made clear. Even though during the first rape she kept thinking it hurts it hurts and someone please help me. But I guess h-logic kicked in that after rape and became rapists slave..."},{"id":1647418,"gallery_id":353084,"poster":{"id":3410506,"username":"XV71","slug":"xv71","avatar_url":"avatars/3410506.png?_=42d7cb99aecd5372","is_superuser":false,"is_staff":false},"post_date":1617009745,"body":"same boring shit Laliberte always does"},{"id":1647332,"gallery_id":353084,"poster":{"id":2558779,"username":"narendramodibjp","slug":"narendramodibjp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617005821,"body":"Author mom suffered same this, and author is son of some chad that did her mother. and now he writes story like this"},{"id":1647242,"gallery_id":353084,"poster":{"id":2360097,"username":"I hast come","slug":"i-hast-come","avatar_url":"avatars/2360097.png?_=1b27924d795e9e78","is_superuser":false,"is_staff":false},"post_date":1617002907,"body":"Now i know why it felt like something is wrong in the other one, it's because it was incomplete lol"},{"id":1646797,"gallery_id":353084,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1616989142,"body":"yeah idk why she's crying she wanted it \"he raped me oh but I'm not going to the police even though it ruined me socially\" chad did cuck a favor.. stiill hate this format of boxes hard too tell the flow when reading. Fuck the hoes though you saw her getting walked out."}]