[{"id":1794958,"gallery_id":353071,"poster":{"id":1203916,"username":"xw20hx","slug":"xw20hx","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1623209968,"body":"Please make normal hentai with all those tags, but NO ugly men, NO prostitution, NO old men, NO NTR!"},{"id":1793411,"gallery_id":353071,"poster":{"id":4309637,"username":"Hoshikazaru","slug":"hoshikazaru","avatar_url":"avatars/4309637.png?_=f617849145520e47","is_superuser":false,"is_staff":false},"post_date":1623163356,"body":"Hey, i have translated this comics, i was wondering how to upload the translated one to this website, does anyone know how to do it ?\n\nnote : i have translated  it with images translate apps, like translate with google translate, the results might not be as good as pro translator, but somehow i managed to change the confusing text with my own, so it's not as confusing as if you raw translate it with google translate.\n\nif anyone know  how to do it, please tell me in the comment, \nor maybe willing to upload it in my stead, please contact me in : mirag3777@gmail.com"},{"id":1715922,"gallery_id":353071,"poster":{"id":2527193,"username":"Doukai","slug":"doukai","avatar_url":"avatars/2527193.png?_=ce4b8f666508dd41","is_superuser":false,"is_staff":false},"post_date":1620100115,"body":"Fuking bitch"},{"id":1668380,"gallery_id":353071,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617923588,"body":"Then last sentance is something like. After the baby has been born please take care of me aswell, teach! Which makes this have a similar ending to the previous one https://nhentai.net/g/310776/. Which is pretty similar just that there is a childhoodfriend and an oyakadon where both the mom and daughter has become prostitutes and pregnant and tells the childhoodfriend to become the dad to their kids."},{"id":1668375,"gallery_id":353071,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617923377,"body":"From my understanding pretty much teach calls previous straight girl now turned gyaro into his office to ask her about all the rumours about her being a prostitute and also being pregnant. Girl just goes it's all true, teach starts to imagine if she's being blackmailed or forced into it since she's still in highschool and it all seemed to have happened so suddenly. Girl then forces him to sleep with her teacher then say's something like you have to take care of the child which he kinda agrees to. She then tells him that the child is her younger brothers and she's been working as a prostitute to earn money to give her younger brother whatever she wants cause she loves him so much and is willing to do anything for him. So pretty much she's a crazy brocon who's doing anything, even selling herself, to make him smile. A bit unsure on the last part cause she's either did it all for the brother, or she slept with the bro for fun and then started selling herself for easy money."},{"id":1658581,"gallery_id":353071,"poster":{"id":3395887,"username":"Zetsume","slug":"zetsume","avatar_url":"avatars/3395887.png?_=96571efde2716cae","is_superuser":false,"is_staff":false},"post_date":1617498281,"body":"English please"},{"id":1649589,"gallery_id":353071,"poster":{"id":3899177,"username":"The Big Wood Tony","slug":"the-big-wood-tony","avatar_url":"avatars/3899177.png?_=c11af0c9241d8bbb","is_superuser":false,"is_staff":false},"post_date":1617092142,"body":"Fuck this shit man\n"},{"id":1649425,"gallery_id":353071,"poster":{"id":1863596,"username":"theinfamoose","slug":"theinfamoose","avatar_url":"avatars/1863596.png","is_superuser":false,"is_staff":false},"post_date":1617086509,"body":"we're getting closer to english boys\n"}]