[{"id":1913426,"gallery_id":354107,"poster":{"id":3556995,"username":"Deathlock","slug":"deathlock","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627819300,"body":"Waiting for translate"},{"id":1906064,"gallery_id":354107,"poster":{"id":3514109,"username":"Chorizooo~","slug":"chorizooo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627548571,"body":"part 3 is unlikely and this is like an open-ended ending. if there's a part 3, my speculation is... it would be just boring all day and all night sex and possibly informing the husband that they will divorce or someth. this is how NTR generally progresses. in anyways, in the end, the wife will be broken and will indulge in the feelings of pleasure. another speculation is that - after she gets preggy, she'll come back and fuck the husband to make him think it was his child. after that, she'll fuck the other guy again until she gives birth... and who knows, most likely, they'll still do it after that."},{"id":1901530,"gallery_id":354107,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1627367718,"body":"she really chose hard sex and commit adultery over lovey dovey sex with the man she loves or loved i guess. This will definetly make her feel like shit sooner or later. Came back cause i liked the art better than the first part \n"},{"id":1863651,"gallery_id":354107,"poster":{"id":2891222,"username":"Shuweck","slug":"shuweck","avatar_url":"avatars/2891222.png","is_superuser":false,"is_staff":false},"post_date":1625956730,"body":"Wew just bcz he said aishiteru she allow him to kiss her wtf"},{"id":1858975,"gallery_id":354107,"poster":{"id":2041350,"username":"automachinehead","slug":"automachinehead","avatar_url":"avatars/2041350.png","is_superuser":false,"is_staff":false},"post_date":1625752549,"body":"ntr is life "},{"id":1858746,"gallery_id":354107,"poster":{"id":3964315,"username":"Yanti","slug":"yanti","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625740039,"body":"Tr please. Love it"},{"id":1858419,"gallery_id":354107,"poster":{"id":3644846,"username":"Asier","slug":"asier","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625722494,"body":"lol i think the people who hate NTR will never learn they always think that the good guy can win in NTR or the girl feel bad and that will never happen"},{"id":1858301,"gallery_id":354107,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1625717358,"body":"@bbdo thanks for the info! and from what you said i do hope that the author doesnt keep this a generic NTR but instead progress and develops the drama and the story into something better and add some depth into it. I dont care about how it ends either in a good note ntr note or bad note as long as it doesnt stay generic and plain"},{"id":1858204,"gallery_id":354107,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1625713338,"body":"@stylez479 What's up man! From what I found on other sites, it has only been the first two parts that have been available in JP and CH for some time now and now just today we got the english version for part 1 and most likely will get part 2 in english soon! However, it appears that part 3 is still in the works. I don't know if you have read the author's other works but his other vanilla works have quite a bit of depth and and story and some drama compared to most hentai, but I do agree with your other comment in part 1, her naivety is really high for someone of her age and considering how she still works, it appears she doesn't spend as much time with her husband as they should. Her husband did warn her, so it shows that his head is not in the clouds like most others. I just hope the author writes a bit more into the story and drama and not make it the generic ntr we usually see and based on his previous works I have some hope for that, but we'll see when part 3 eventually comes out. "},{"id":1858159,"gallery_id":354107,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1625711438,"body":"anyone knows if this is the end or if there is more parts in raws? anyway it would be good if at the end the blonde guy just ends up leaving her cause hes bored of her and she realizes he only used her as a personal cum dump and she goes into dispair cause she realized she confused lust with love and let herself be consumed by the lust leaving her to  lose her true love the one who loved her but with every other ntr thats just wishful thinking"},{"id":1661440,"gallery_id":354107,"poster":{"id":3434350,"username":"xvdyx","slug":"xvdyx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617623803,"body":"Part 1 wasn’t uploaded here for some reason but if it’s up on e-hentai. Just google the title without the part 2 part and it should be top result. It’s also not translated though. "},{"id":1660218,"gallery_id":354107,"poster":{"id":2408988,"username":"Sgt. Morningwood","slug":"sgt-morningwood","avatar_url":"avatars/2408988.png?_=79dc690bab62f983","is_superuser":false,"is_staff":false},"post_date":1617576149,"body":"Where is part 1"}]