[{"id":1667159,"gallery_id":354442,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617871529,"body":"@fruitMaster I really suggest picking up actual learning materials first before diving into doujins right away. Other platforms can help you better than me on that regard. Once youve spent considerable amount of time studying, maybe you can start with some of the oneshots that you've previously read in English, this time in Japanese. You won't find easy doujins to read, so it's better to read a story you already know instead. That way, you can focus on the actual texts and have the translation right away to check. That said, pls keep in mind of some things: (1)Eng translations are sometimes done poorly and you cant assess that as a beginner. (2)Doujins have a lot of sex lingos so tbh, these aren't good materials to start with. (3)Chances are this will still be a hard task for you in the end. So just consider this as a hobby rather than a part of your studying. Learning a language is long term investment so results won't always show up right away. Good luck!"},{"id":1666660,"gallery_id":354442,"poster":{"id":3470084,"username":"fruitMaster","slug":"fruitmaster","avatar_url":"avatars/3470084.png?_=3e7e7eb68608b865","is_superuser":false,"is_staff":false},"post_date":1617849146,"body":"@DrinksandDame I really wish want learn japanese, recommend something for this lower beginner please!!!"},{"id":1666565,"gallery_id":354442,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617844880,"body":"Btw, the title is Itaiamai, a combination the words of itai (painful) and Amai (sweet). Blonde said this when they first had sex. But it could also mean something more about the general theme of the story. Hope no one will begin complaining at some point when the story gets a little rocky lol"},{"id":1666560,"gallery_id":354442,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617844760,"body":"--something that Blonde doesn't want to, he won't forgive them. Pretty cool of him. On their way home, she ends up confessing to MC. Of course, MC puts being a teacher a priority, but ends up being forced to give his honest answer. He takes her home and shows his own copy of Blonde's poster on his wall. In order to make her feel disgusted of him, He reveals how he looks at her in a lewd way (it's true after all). But Uno reverse card, she was extremely happy about that and the rest is SEX. Girl was as a virgin in case u want to know. Pretty simple but good start of a story if you ask me. This one may have started with a very vanilla story, but the story introduced other characters who could make the story a little more complicated than it is now. Considering the artist's previous work, this one may also likely have some elements of NTR into it. I dig complicated shit, so I might stick around unless it gets translated every new chapter release."},{"id":1666523,"gallery_id":354442,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617842787,"body":"Summary: Blonde worked as a model for a tourist association's advertisement poster. Everyone seem to like it but the teachers are naturally worried about this. However, Sensei (MC) may be an introvert but he digs Blonde's shit. He would often have this inner conflict within him as he battles his own horniness. Anyway, after school Blonde approaches MC and asks for a consultation. Apparently, a company wants to scout her as their model. Looks like her relationship with her mom is complicated so she wants MC to accompany her. As much as he was surprised by this turn of events, heck he wants to see more of Blonde's pics so he gave in. On the next scene, they did go as planned. But to MC's surprise, Blonde is actually being scouted to do Gravure stuff. He was obviously against it at first but asks Blonde is she really wants to do it. She said that she does, since she also wants to help her mom in ways she can. Sensei accepts but made it clear that if they make her do something NG or--"},{"id":1666056,"gallery_id":354442,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1617815196,"body":"So, this is Ryoh-zoh's new series after Rarefure's completed project? So far, art is fantastic as always, and the female lead (FMC) is pretty cute. We'll have to see how the story progresses later."},{"id":1665974,"gallery_id":354442,"poster":{"id":3715328,"username":"User28583","slug":"user28583","avatar_url":"avatars/3715328.png?_=718315a25b9f0792","is_superuser":false,"is_staff":false},"post_date":1617812293,"body":"I hope this gets translated"}]