[{"id":2226733,"gallery_id":354602,"poster":{"id":3968085,"username":"Mastard666","slug":"mastard666","avatar_url":"avatars/3968085.png?_=2c8f386bbdfaf8ba","is_superuser":false,"is_staff":false},"post_date":1640689080,"body":"Why the hell is Ch. 1 the only one translated!?!"},{"id":1983685,"gallery_id":354602,"poster":{"id":4123038,"username":"jeje1989","slug":"jeje1989","avatar_url":"avatars/4123038.png?_=5485d1df18fbfef4","is_superuser":false,"is_staff":false},"post_date":1630342515,"body":"So I've done some checking online and this series has 22 chapters as of me writing this comment. Anyone out there kind enough to post the raws for the remaining chapters?"},{"id":1680276,"gallery_id":354602,"poster":{"id":3118734,"username":"IdontbelieveinGhost","slug":"idontbelieveinghost","avatar_url":"avatars/3118734.png?_=2c745b195af3ebc1","is_superuser":false,"is_staff":false},"post_date":1618495380,"body":"i can't read chinese but I know a good doujin when I see one"},{"id":1675575,"gallery_id":354602,"poster":{"id":3841653,"username":"AKira-kun","slug":"akira-kun","avatar_url":"avatars/3841653.png?_=36f14f3521119693","is_superuser":false,"is_staff":false},"post_date":1618258008,"body":"at least upload original Japanese version so I can fucking understand a little!!! Also, Why is they are not translating this Hot Quality stuff, rather than fucking Yaoi dojins to english!!!"},{"id":1669901,"gallery_id":354602,"poster":{"id":2059870,"username":"Tinger2012","slug":"tinger2012","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617992350,"body":"407 pages and no-one takes it up the arse. Yer gotta be kidding me."},{"id":1669738,"gallery_id":354602,"poster":{"id":2991329,"username":"Forsaken Aris","slug":"forsaken-aris","avatar_url":"avatars/2991329.png?_=f629bcaef5f3f525","is_superuser":false,"is_staff":false},"post_date":1617984182,"body":"@tobajas thank you for explain it. I just saw a few images so I tried to figured out what the story is about, based on my drunkness and stupidity. I couldn't fap to this while I was drunk, and now that I know that it has NTR, I'm not even going to try to fap to this ever again. Oh silly me, I wanna kill myself."},{"id":1669600,"gallery_id":354602,"poster":{"id":3555253,"username":"urabaki","slug":"urabaki","avatar_url":"avatars/3555253.png?_=4eaf59ced3935bfd","is_superuser":false,"is_staff":false},"post_date":1617977379,"body":"bruh when the english version gonna be out i seriously wanna read this\n"},{"id":1669075,"gallery_id":354602,"poster":{"id":3718217,"username":"RookieDreamsScanlation","slug":"rookiedreamsscanlation","avatar_url":"avatars/3718217.png?_=87f7f38ba1ef9953","is_superuser":false,"is_staff":false},"post_date":1617952087,"body":"Because... well... someone needs to want to do it, of course. Or be asked to do it"},{"id":1668663,"gallery_id":354602,"poster":{"id":3851725,"username":"silentcock22","slug":"silentcock22","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617935629,"body":"can someone say why this isn’t translated yet "},{"id":1668450,"gallery_id":354602,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617926798,"body":"In short MC hit's on his cousins wife and sleeps with her. But because the cousin isn't away all the time or impotent like other stories the wife still loves her hubby so the MC starts sleeping around with lots of other girls but still wants the wife the most. Then for the next part it's kind of in the air if she goes to the US with husband or stays in JP. Though the last few parts hints at her asking the husband if she can stay in JP instead, implying that she wants to stay and fool around with the MC. Still I feel these kind of MC's are the kind I hate the most with them being taken in and taken care of and in thanks they seduce and fuck/rape the wife..."},{"id":1668447,"gallery_id":354602,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617926638,"body":"@Zikakuto not sure if Forsaken Aris is being sarcastic here or not, but yeah I haven't read/translated all of it only parts but pretty much. A young dude goes to live at his cousins house who's married and has a kid, not sure if what Aris said is right or not that the kid isn't his. But anyway the older cousin works a lot and in the first part they are about to have their anniversary dinner but cause of work he can't come. Wife get's sad and a bit drunk MC also get's drunk and when the wife say's he's a catch he pushes her down but then say's sorry and she responds with it's okey just comfort me this one time. Then it goes on with the MC demanding/asking for more and more sex. Then some friends of the wife is introduced along with some other housewives who the MC keeps sleeping with. Then somewhere around midway through the story the cousin tells the MC that they will be moving to the US cause of work and the MC goes apeshit cause he now loves the wife and thinks she belongs with him"},{"id":1668442,"gallery_id":354602,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1617926511,"body":"So he has to come up with someway to make the wife stay with him but again he can't come up with anything. Then more sex keeps happening and eventually at one point while having sex with the husband she asks something of him. Which he agrees to having semi expected it and the wife say's thanks I love you the most, hinting at that she wants to stay behind in JP instead of going to the US. Then the MC goes to the hotsprings to get away/have fun with the girls and in the end he wakes up with the wife saying good morning, thats where it's at right now. So pretty much MC get's taken in by cousin and his family get's free room and food and seduces the wife and starts thinking that she's his woman while also starting a harem."},{"id":1668222,"gallery_id":354602,"poster":{"id":2991329,"username":"Forsaken Aris","slug":"forsaken-aris","avatar_url":"avatars/2991329.png?_=f629bcaef5f3f525","is_superuser":false,"is_staff":false},"post_date":1617916034,"body":"Actually, she isn't a milf, just a stupid single mom who got laid with a thug - because that is what gyarus do - at age 18 and now has a daughter.\nNow that she fuckep up her life because of her early pregnancy, she starts to pay attention to the gloomy beta males that she often use to bully in high school.\nWe still doesn't have the translation, and I still didn't read it to the end, but it's quite obviously that the beta mais character shall end up with the blondie single mom and assuming her daughter as her father in law, just like all stupid betas do, taking responsability for the rest of another guy's semen.\n"},{"id":1668217,"gallery_id":354602,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1617915685,"body":"Anyone explain some aspects of the story? Why is blondie always cheating on her husband? Art and characters are really hot"}]