[{"id":1728361,"gallery_id":357470,"poster":{"id":1660379,"username":"Hidari","slug":"hidari","avatar_url":"avatars/1660379.png","is_superuser":false,"is_staff":false},"post_date":1620615085,"body":"Holy fuck, I am such a fan of all this artist's work. I wish more guys IRL could fuck like the men in these stories. All the sexy details like grasping her jaw, clutching her close and kissing her while he pounds her... gawd, it melts me... The possessive, tender way he holds her on page 37 is gourmet..."},{"id":1725044,"gallery_id":357470,"poster":{"id":1745890,"username":"mixordia","slug":"mixordia","avatar_url":"avatars/1745890.png","is_superuser":false,"is_staff":false},"post_date":1620471282,"body":"Heizo Kitoen is one of my favorites hentai artists "},{"id":1720695,"gallery_id":357470,"poster":{"id":1936981,"username":"SecondLogic","slug":"secondlogic","avatar_url":"avatars/1936981.png?_=1d35d2fefee6cce0","is_superuser":false,"is_staff":false},"post_date":1620280500,"body":"Wow... You are a talented motherfucker @DrinksandDame.\n\nOkay my point here is, this is probably one of the most erotic incest sex scene I’ve ever seen in my life. Props to author. That was really hot.\n"},{"id":1716640,"gallery_id":357470,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620123829,"body":"Summary: Sis has dated many guys but due to her high libido, no guy has satisfied her yet. One day, his lil bro came in asking for her help. It seems that he can't satisfy his gf. Sis was shocked cuz his introverted bro got a gf out of nowhere. Being a good Sis that she is, she was like \"You gotta know how to set the mood, bro. First lemme see how you do it.\" Bro did, he said he loves her and ends up kissing sis and touching her nips a bit. Sis was taken aback but she liked it and fapped to it. Next day, she was like \"lemme help you again but no sex okay?\" And they did. On the scene, it was revealed that Bro actually has no gf and has been turning down every girl that confesses to her. He actually likes Sis and could hear every time she faps in her room. He rapes her which made Sis realizes that incest turns her on the most. In the end, she still seeks to have a bf and bro is just a way to satisfy her needs. But alpha bro here knows he can cuck any man who goes for sis anytime.\n"}]