[{"id":2389605,"gallery_id":358633,"poster":{"id":19905,"username":"raindragon","slug":"raindragon","avatar_url":"avatars/19905.png","is_superuser":false,"is_staff":false},"post_date":1647060612,"body":"I wish the vore contagion of having stories where there's no sex and nothing interesting going on, just some poor woman getting claustrophobically squeezed to death &amp; drowned in acid hadn't invaded the frog category.  Death by digestion - Is this actually something that turns someone on?  Sincere question, cuz I don't get it.  I like frog porny stuff, but now there's fewer frogs doing sex acts with women than there are frogs just eating girls for dinner.  How is that sexy?  Death by stomach acid - where is the sexy in that?  It's just disappointing to me.  5 new horny frog stories and none of them are about horny frogs, just nasty carnivorous snuff frogs.  Plus these stories are not sexual at all, not even a little.  First the vore category turned into vores doing nothing sexier than hunting up a meal.  Now it's frogs sitting down to dine on some poor unfortunate woman. Sorry, yes, I'm venting, but I'm not griping at anyone here.  "},{"id":1733323,"gallery_id":358633,"poster":{"id":3343690,"username":"junk_ass","slug":"junk_ass","avatar_url":"avatars/3343690.png?_=c8b98c63f246884a","is_superuser":false,"is_staff":false},"post_date":1620839168,"body":"giant frog is best character no cap"},{"id":1733113,"gallery_id":358633,"poster":{"id":2404441,"username":"Doge007","slug":"doge007","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620832271,"body":"Lmao, she could still freeze the frog from inside out, anyway poster of this disgusting shit, get help, you need it"},{"id":1733100,"gallery_id":358633,"poster":{"id":4251190,"username":"PG-18+","slug":"pg-18","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620831626,"body":"RIP.            "},{"id":1732083,"gallery_id":358633,"poster":{"id":4330697,"username":"Ejinqus2","slug":"ejinqus2","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1620789619,"body":"Gotta love the fact that there's a \"frog\"  tag for some unholy reason"}]