[{"id":2124759,"gallery_id":359408,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636060651,"body":"well he's the one who started by ignoring her, but he didn't really cheat that's was her doing, the husband must feel a enormous regreat and anger, i have no idea how this gonna end in the preview image she might have fall in to with the old bastard but this artist do vanillas and ntr so no idea what ending they gonna get just hope we don't get a open ending or a one where he became a cuck like other ntr that would ruin the good history until now"},{"id":1946801,"gallery_id":359408,"poster":{"id":2901969,"username":"twaps","slug":"twaps","avatar_url":"avatars/2901969.png?_=62244927075877e6","is_superuser":false,"is_staff":false},"post_date":1629018144,"body":"I dont like NTR.But the story is interesting so im here waiting for the translation and for another chapter."},{"id":1944642,"gallery_id":359408,"poster":{"id":4540335,"username":"huyuu","slug":"huyuu","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1628947808,"body":"I'm waiting for the third chapter.This gonna be a good plot story."},{"id":1944452,"gallery_id":359408,"poster":{"id":3894527,"username":"suityan","slug":"suityan","avatar_url":"avatars/3894527.png?_=064f1a2902245223","is_superuser":false,"is_staff":false},"post_date":1628937750,"body":"Where is the 3rd chapter"},{"id":1943065,"gallery_id":359408,"poster":{"id":3178693,"username":"Animeheaven00","slug":"animeheaven00","avatar_url":"avatars/3178693.png?_=394a6c0e8837bdf3","is_superuser":false,"is_staff":false},"post_date":1628886808,"body":"Pretty stupid story, haha "},{"id":1942818,"gallery_id":359408,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628876149,"body":"Since Chapter 1 got an English translation now, I figured this would get some new attention. If you're interested to know what happened in Ch 2, scroll deep down in the comments for a summary I wrote. Kinda had a couple minor errors there but I think it's decent enough to grasp the story."},{"id":1942734,"gallery_id":359408,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1628873271,"body":"Well this is just painful to read. I dunno if she fell in love with the third or not, but I'm more positive that she's actually glad her husband found her, which is why she's so calm. She will accept anything the husband decide, but the most important part for her is the slap she gave to him. Now it's all up to him to decide, what will he do? Tbh, I don't mind they made up as long as the author didn't use bullshit twist like him being a cuck or the wife continuing her cheating. Kinda a nice take of cheating/NTR where the both couple are idiots in their own way and not just brainless monkey"},{"id":1942710,"gallery_id":359408,"poster":{"id":2266050,"username":"etohno","slug":"etohno","avatar_url":"avatars/2266050.png?_=81999eeef22f6350","is_superuser":false,"is_staff":false},"post_date":1628872061,"body":"well, im not gonna justifying her cheating. but the husband is rejecting her existence for 4 years, not just sex but her whole existence, basically she was trapped with him for 4 years. looking how calm she is, she already have her own answer. looking at the last page, i bet she found her answer with him. whether she cut their marriage off and be with the old man or just be free again. \nor maybe the author made a twist where her husband doesnt want to let her go (and secretly a cuck. he watched a porn possibly an NTR porn) and she took a pity of him. and she continue her journey with another man and tell her husband in story like this format.\nand everybody happy. as long as she happy, i will be happy"},{"id":1942605,"gallery_id":359408,"poster":{"id":1395095,"username":"Episode___","slug":"episode___","avatar_url":"avatars/1395095.png","is_superuser":false,"is_staff":false},"post_date":1628867833,"body":"Well...  could not miss the ugly bastard "},{"id":1942299,"gallery_id":359408,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1628858082,"body":"Let's see how ch3 will lead wife already resolve her mind by last person she met and confession everything to her husband and let's see what husband will do after hear last story."},{"id":1858229,"gallery_id":359408,"poster":{"id":3507409,"username":"SKY26","slug":"sky26","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1625714475,"body":"I don't quite understand how a man can get 4 years without sex with a hot wife, completely neglecting and have a heart to jerk off to a porn. Lol i get that the jerking off takes less energy than the actual deed but still you didn't think about your wife at all. You brought this on yourself. I take wife's side in this one "},{"id":1815503,"gallery_id":359408,"poster":{"id":1649066,"username":"LettuceZ","slug":"lettucez","avatar_url":"avatars/1649066.png?_=89001055fe6888e7","is_superuser":false,"is_staff":false},"post_date":1624051252,"body":"@Kami Nana nah she's so calm cuz this is atonement, she knows she was wrong but couldn't tell her husband, the final chapter should reveal what made her take the step of accepting whatever outcome the husband has in store. If she had already been in love with old dude then she would have brought this up and not let the husband. Remember she's been wanting to come clean but never did and the first chapter shows he brought it up and caught her off guard with it, not the other way around. She isn't calm cuz she's found someone else she's calm cuz whatever happens in the final chapter made her finally realize talking to her husband and being honest is important no matter what she's gonna lose. "},{"id":1813520,"gallery_id":359408,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623971865,"body":"@Kami Nana I think you're mistaken if you read my words as me justifying cheating. I clearly stated that cheating is still wrong. It's just that @TvManga2020 oversimplified the story as \"wife cheated cuz she saw husband fap to porn\" and also even made a farfetched assumption as to why husband was fapping in the first place, so I had to describe in detail how the wife's situation was according to her story. In regards to the points you've raised, you're free to think of whatever cheaters are in your dictionary. But as for the story alone, I think I've said enough to cover what these two chapters have in store for now. That was her situation and it was her impetus to cheat. She never talked about this with her husband until it was too late, so I called this a failed marriage. Anything beyond that is for the final chapter to cover and for readers to have their own take and theories."},{"id":1797379,"gallery_id":359408,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623302376,"body":"Anyway...going by the summary...husband is most likely going to pull out divorce papers...why else confront her about it? I also get the feeling the reason why she's so calm is that last guy has claimed her heart and now she doesn't want to be with the husband anymore. So it's going to be a clean break, I bet."},{"id":1797371,"gallery_id":359408,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623302116,"body":"@DrinksandDame Being sexless for four years is still no excuse. A cheating whore is a cheating whore. Moreover, knowing Japanese work ethic, the poor guy was probably working himself to death trying to give the whore a stable life and was just too tired to bang afterward. As for the porn...well, fapping to porn takes less energy than actual sex. Two...where was the wife when he was actually in the mood? Anyway, any marriage counseller will tell you that so called \"neglect\" is no reason to cheat. What lead to their failed marriage is her inability to stay true and their inability to just fucking talk about their problems(mostly hers). More importantly, this whore is a cheater and will always be one. Fact is cheaters are three times more likely to cheat than normal. Them being sexless was just a convenient excuse for her to use."},{"id":1795259,"gallery_id":359408,"poster":{"id":4301409,"username":"H3ntai Inspector","slug":"h3ntai-inspector","avatar_url":"avatars/4301409.png?_=7397d892cbd7f1aa","is_superuser":false,"is_staff":false},"post_date":1623217443,"body":"idk what this shit is and i dont give a fuck to the story telling or morality. but good arts is good fap, so all good for me"},{"id":1780855,"gallery_id":359408,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622765444,"body":"@TvManga2020 you missed the fact that they were sexless for 4 years. Honestly this couple simply lacked communication. If they only talked about this with each other, maybe they could figure out how they can work things out. Shit like this happens irl where people marry someone that they can't easily talk to about things like this. Instead of confronting the issue, they chose to ignore the elephant in the room and the woman ended up cheating. 6 years of marriage, no kids, only to end up sexless in 4 years. Not to mention, she just hit her 30's. No friends nearby her to meet up with, too. Her days must have sucked so bad. Still, cheating is wrong and no amount of depression can be a valid excuse for that."},{"id":1780752,"gallery_id":359408,"poster":{"id":1064327,"username":"TvManga2020","slug":"tvmanga2020","avatar_url":"avatars/1064327.png","is_superuser":false,"is_staff":false},"post_date":1622759826,"body":"So let me get this straight, you mean to tell me that woman is cheating because her husband is watching a porn. To me that the dumbest thing she ever done. She cheated on a real person. The husband probably jerks off and made be he want to test that skills on his wife. I can’t blame him to be piss off"},{"id":1780641,"gallery_id":359408,"poster":{"id":3344957,"username":"Donnik","slug":"donnik","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622753720,"body":"I don't know how I got here , but I will read ch3 and cry. "},{"id":1774696,"gallery_id":359408,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1622502999,"body":"waiting for chapter 3. The end is gonna be her fucking old guy old guy tells her it isnt worth it to keep on cheating if she still loves her husband. Then she realzies old man is right and thats why she telling all this to the husband and shes gonna say \"Im sorry for doing this but i still love you and thats why i decided to be honest with you about what i did. Will you accept me again even while knowing all this\" and then the husband agrees to accept her. Or she realizes shes worth more than a husband neglecting her for years so she decides to end the marriage so she can continue fucking around or she fell in love with old man lmao but by the looks of it theres no turning back and she completely fell cause on page 53 with the black and white outlines we see old man then someone sucking on a nipple and then the wife looking completely turned on and loving it "},{"id":1774517,"gallery_id":359408,"poster":{"id":3410506,"username":"XV71","slug":"xv71","avatar_url":"avatars/3410506.png?_=42d7cb99aecd5372","is_superuser":false,"is_staff":false},"post_date":1622493240,"body":"\"let's get a divorce\" \nproblem solved \nthey are just a pair fuckwits"},{"id":1764779,"gallery_id":359408,"poster":{"id":3746456,"username":"Ornstein Ds","slug":"ornstein-ds","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622045272,"body":"Por más que leo no se levanta, es más siento asco "},{"id":1764034,"gallery_id":359408,"poster":{"id":3924582,"username":"Jeam125","slug":"jeam125","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622011805,"body":"At least he isn't jerking off to watching his wife get fucked or her retelling the story, then crying while jerking off."},{"id":1752950,"gallery_id":359408,"poster":{"id":2052256,"username":"ntrFTW","slug":"ntrftw","avatar_url":"avatars/2052256.png?_=4f8e56cd99d3c5e3","is_superuser":false,"is_staff":false},"post_date":1621568140,"body":"Fuck this is hot, cant wait for translation and the next chapter"},{"id":1752699,"gallery_id":359408,"poster":{"id":3518320,"username":"Cleo Pepper","slug":"cleo-pepper","avatar_url":"avatars/3518320.png?_=abf8473dd612a0ab","is_superuser":false,"is_staff":false},"post_date":1621559563,"body":"Unfortunately NTR always has superior art style to vanilla for some reason"},{"id":1750313,"gallery_id":359408,"poster":{"id":2220784,"username":"sione7","slug":"sione7","avatar_url":"avatars/2220784.png?_=4aee0dcad3163d48","is_superuser":false,"is_staff":false},"post_date":1621470657,"body":"People talk about Japan like they are fucking experts taking statistics out of their asses. Imagine if I were to assume that all people in the US or the west are down syndrome mutant inbred fuc*s just because incest porn is the most popular genre in western porn sites like pornhub etc. That would explain a lot though."},{"id":1749639,"gallery_id":359408,"poster":{"id":2761470,"username":"ulquiorra_no4","slug":"ulquiorra_no4","avatar_url":"avatars/2761470.png","is_superuser":false,"is_staff":false},"post_date":1621443410,"body":"So  part3 will be  wife x oldman "},{"id":1749061,"gallery_id":359408,"poster":{"id":1087997,"username":"oataoast","slug":"oataoast","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1621419624,"body":"Maybe the tie that husband take off was actually old man tie that forget to take it back, and husband mistake it was his tie, so while wife holding it, it give encourage to confess like she holding old man OwO "},{"id":1748916,"gallery_id":359408,"poster":{"id":1087997,"username":"oataoast","slug":"oataoast","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1621410914,"body":"Dayum this sex scene is so hot especially those juicy and semen it a plus. Anyone can recommend any non ntr which have this art style and quality?"},{"id":1748325,"gallery_id":359408,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1621390489,"body":"Poor little dickless doctor chihuahua. Remember what the other doctors warned you about? Fapping to your daydreams too much stunts your growth. Don't worry. Someday you might grow up enough to become a shihtzu."},{"id":1747708,"gallery_id":359408,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1621362811,"body":"Is that the whimpering of a little dickless doctor chihuahua I hear? It is it is! Hi silly boy. Did you drop your butt plug again? You know how your mouth misbehaves when you let it slide out. "},{"id":1747573,"gallery_id":359408,"poster":{"id":874070,"username":"redgon1998","slug":"redgon1998","avatar_url":"avatars/874070.png?_=eca791baba17c719","is_superuser":false,"is_staff":false},"post_date":1621357207,"body":"That Drinkanddame boy need a throne lmao"},{"id":1747390,"gallery_id":359408,"poster":{"id":2770998,"username":"aimanwhite93","slug":"aimanwhite93","avatar_url":"avatars/2770998.png?_=d166d2ef8fc7c75d","is_superuser":false,"is_staff":false},"post_date":1621348829,"body":"@DrinkandDame you're a legend my guy "},{"id":1747309,"gallery_id":359408,"poster":{"id":3580603,"username":"Habib Rizqie Shahaq","slug":"habib-rizqie-shahaq","avatar_url":"avatars/3580603.png?_=66034ca20d550bfb","is_superuser":false,"is_staff":false},"post_date":1621345733,"body":"And i have a feeling that hubby is also cheating behind her back"},{"id":1747297,"gallery_id":359408,"poster":{"id":3580603,"username":"Habib Rizqie Shahaq","slug":"habib-rizqie-shahaq","avatar_url":"avatars/3580603.png?_=66034ca20d550bfb","is_superuser":false,"is_staff":false},"post_date":1621345196,"body":"Neglecting hot wiafu for 4 friggin years... I honestly pity her"},{"id":1747255,"gallery_id":359408,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1621343190,"body":"@DrinksandDame thanks for the explanation. The art is great "},{"id":1746727,"gallery_id":359408,"poster":{"id":2746968,"username":"bbdo","slug":"bbdo","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1621316953,"body":"@DrinksandDame Thank you for the detailed explanations, I know it's difficult getting the author's intent through a summary but I think you did an excellent job explaining the story, with details and a bit of the themes involved. I look forward to this getting a translation since the author has some pretty solid stories with themes in the background that are more vanilla. From the way you explained it, I predict that something about the interaction with the older gentlemen and maybe something about his past, helps her find resolve in hopefully fixing her marriage, since we can presume the husband is in the prime of his career working really hard and the older gentlemen is the final result of unhealthy working habits. Who knows? I have some hope for both wife and husband to fix their marriage, but it could also end in their separation by both amicably or one or the other. I would like to read the story as a whole and determine what I think afterwards! You're awesome for this!"},{"id":1746412,"gallery_id":359408,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1621304193,"body":"@stylez479 - Well whatever it is, fuck that guy. I like my cheating/netorare with revenge/justice. Cutting off a chick for four years? She's the one who needs justice. Also bet hubby's doing more than just fapping to porn. I'm two plus decades into my second marriage and we hardly ever have sex anymore. But I'm old, got three kids out of her, and for us? A nap trumps a toss almost 24/7. Snores before whores. That lady? Desperately needs loving. Fingers crossed that chapter three shows she finally got some."},{"id":1746345,"gallery_id":359408,"poster":{"id":160,"username":"ThatGuyOverTher3","slug":"thatguyoverther3","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621301250,"body":"@DrinksandDame Thanks for explaining the story. Always interesting to actually KNOW what the story is, especially when it's not \"I couldn't win against the big dick.\" Cheating's never a good thing, but it can be understood where it comes from."},{"id":1746340,"gallery_id":359408,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1621301120,"body":"@SirRobin My guess she came to terms with the fact that she cheated and didnt want to atleast leave husband without him knowing the truth before she leaves him maybe"},{"id":1746310,"gallery_id":359408,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1621300051,"body":"@DrinksandDame - Thank you! So the big question. Did number three NTR her for good? Conquer her heart with his cock? On page 52 he looks like an older guy. Bet she's so calm because she found happiness with senior and is about to leave the asshole who chose to neglect her anyway."},{"id":1746285,"gallery_id":359408,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621299158,"body":"@SpunkMeister uhh thanks I guess? Anyway, we're in a porn site so stuff like that doesn't really matter. But if you think that's relevant, you do you."},{"id":1746275,"gallery_id":359408,"poster":{"id":2315399,"username":"SpunkMeister","slug":"spunkmeister","avatar_url":"avatars/2315399.png","is_superuser":false,"is_staff":false},"post_date":1621298645,"body":"@DrinksandDame https://youtu.be/EBNi9QfPTe4"},{"id":1746272,"gallery_id":359408,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621298536,"body":"--douche for his actions. She thinks of it as her punishment after all. And anyway, at that time she wasn't quite ready to spill everything to H. It was until he met the 3rd man that she apparently managed to find the conviction to do so.  TBC. Sorry if my summary was a little too casual. Again, I can't give justice to how the author wrote the dialogues. Im not sure if this will get an actual Eng translation but they can probably do a better job at this than I did. Next up is the final chapter where we will know how W ended up becoming such a calm person despite all the things she's done behind her man's back."},{"id":1746269,"gallery_id":359408,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621298395,"body":"--Ch 2 takes us a month after her first meet up. As much as W was filled with regrets, she was up for a second time. Next up is the douche. W was too quick to accept his request all because of his \"my wife passed away\" story. As the illustration suggests, she was drugged and was forced into sex. She was definitely resisting at first but douche got her in the palm of his hand. W felt like this is karma's revenge on her for cheating. Her body may have given in, but her words still got some bit of fight to it. She showed disgust to douche but in return, he called her out for being a disgusting cheater herself. Quite a pair, indeed. The kiss was the one that sealed it off. She let her heart and body be dominated until he was satisfied. End of scene. Later on, Douche apparently was wiped away from the site probably because of his fake story and overall doucheness. Back to present, H was like \"That's some serious crime there. You should've talked to me about it.\" But W wasn't resenting--"},{"id":1746266,"gallery_id":359408,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621298206,"body":"--that she met with 3 people in a span 3 months. Despite being late to realize and regret things, H was trying to fully grasp how things ended up like this so he listened to her stories. Again, Ill just lightly summarize these. First man was a college student. A nice person. When they were doing the deed, man had a tough time getting it hard to which W responded with the succ. Definitely there was a sense of guilt but she found that she can still satsify someone. No matter how immoral her action was, to her it was what saved her. Man suggested to meet again, but she was afraid that her heart might fall at some point. Husband was furious at how this all looks like she just wants to play pretend as a lovey dovey couple. But she then revealed that the 2nd man she met was a lying, violent piece of shit man. The worst kind. (end of Ch 1)--"},{"id":1746264,"gallery_id":359408,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621298075,"body":"This is a summary for both chapters. A final Ch has yet to come btw. Failed Marriage. That's what this is about. Story starts of with the couple in the middle of argument. With 6 years under their belt, the married couple finally had the cracks in their relationship out in plain view. Husband(H) apparently had Wife(W) investigated and it turned out that she has been cheating on him. To H's surprise, W calmly admits it and proceeds to explain why she did. Her monologues are pretty well written that my summary can't give justice to it, so Ill just explain it lightly. Basically, it's been 4 years since they banged. No matter how much she invites him, he always seems to be tired. She believed that their love hasnt changed, it's just that there's no sex anymore. When she found out that he be fapping behind her back, she realized that he wasn't rejecting sex, he was rejecting her as a woman. Carrying such a heavy thought in mind, she decides to meet men thru a dating app. she revealed--"},{"id":1746073,"gallery_id":359408,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1621289049,"body":"Also my guess is she been wanting sex with her husband but her husband kept avoiding it then she finds out he jerks off alot to porn so makes her insecure thinking maybe she isnt attractive? so she goes out to find out if she is attractive to other men? eventually she just gets hooked on sex and the feeling of being attractive to other men? idk thats my thoughts"},{"id":1746056,"gallery_id":359408,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1621288437,"body":"Logic the mans just masturbated to some porn and she goes and fucks every man lmao"},{"id":1745987,"gallery_id":359408,"poster":{"id":2315399,"username":"SpunkMeister","slug":"spunkmeister","avatar_url":"avatars/2315399.png","is_superuser":false,"is_staff":false},"post_date":1621285501,"body":"@diddo @SirRobin. Because Sex Sells. It's not about the subculture of Japan etc. It's the money. Alot of Vanilla H Author decided and or become a sellout and devolve their work into things like said NTR it's because they follow what the market demands, and right now the market are in favor of NTR. TLDR- Make NTR get paid more cuz the Market is on high demand of NTR Content. "},{"id":1745967,"gallery_id":359408,"poster":{"id":1222807,"username":"Haise01","slug":"haise01","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621284048,"body":"Ha! I had a feeling this would be ntr even with that cute cover LOL"},{"id":1745803,"gallery_id":359408,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1621277953,"body":"@Diddo - I have not looked at divorce rates. From what I've read the tendency seems to be to stay married but do your own thing. Plus for us western readers? It takes some of the sting out of NTR when you realize the cucked may have already been getting serviced daily on his way home by a local soap land."},{"id":1745789,"gallery_id":359408,"poster":{"id":1794081,"username":"Morpheuseus","slug":"morpheuseus","avatar_url":"avatars/1794081.png?_=47a21bb119b4d06c","is_superuser":false,"is_staff":false},"post_date":1621277621,"body":"Can't believe this is from Otaku Beam guy,WTF?"},{"id":1745674,"gallery_id":359408,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1621274045,"body":"@Euphorism - Japan is almost heaven for cheating. Here is one article - https://blog.gaijinpot.com/looking-for-love-cheating-in-japan/"},{"id":1745669,"gallery_id":359408,"poster":{"id":2512240,"username":"Diddo","slug":"diddo","avatar_url":"avatars/2512240.png?_=7eba742a20568db3","is_superuser":false,"is_staff":false},"post_date":1621273888,"body":"@SirRobin didn't also Japan had an high rate of divorces in the urban areas?"},{"id":1745661,"gallery_id":359408,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1621273521,"body":"@SirRobin NTR Heaven as in popular genre of media not Japanese people being cheaters. Want cheaters? Come to Canada LOL"},{"id":1745603,"gallery_id":359408,"poster":{"id":2512240,"username":"Diddo","slug":"diddo","avatar_url":"avatars/2512240.png?_=7eba742a20568db3","is_superuser":false,"is_staff":false},"post_date":1621271713,"body":"@SirRobin that sucks. So much for Japan as the \"conservative utopia\" lol"},{"id":1745598,"gallery_id":359408,"poster":{"id":1400370,"username":"starfox1234","slug":"starfox1234","avatar_url":"avatars/1400370.png?_=8fe9415a33f35edc","is_superuser":false,"is_staff":false},"post_date":1621271407,"body":"Needs some English "},{"id":1745546,"gallery_id":359408,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1621269702,"body":"@Diddo - Why is NTR popular in Japan? Lots of reasons. Japan's \"cheating\" subculture. \"Endure it\" subculture. \"Can't be helped\" subculture. Divorce considered disgraceful. Custody of children not sharable. Very conservative society. Which makes women abandoning their roles/duties as wives/mothers for pleasure, super taboo. Toss in a nation full of salarymen feeling oppressed, overworked, and underappreciated? NTR heaven."},{"id":1745497,"gallery_id":359408,"poster":{"id":2512240,"username":"Diddo","slug":"diddo","avatar_url":"avatars/2512240.png?_=7eba742a20568db3","is_superuser":false,"is_staff":false},"post_date":1621268299,"body":"Even Ootsuka Mahiro, after making some really wholesome bangers, has decided to sell himself to the NTR crowd, expecially after he made /225084/ parodying gangbang rape doujins. Why nips love this shit?"},{"id":1745404,"gallery_id":359408,"poster":{"id":874070,"username":"redgon1998","slug":"redgon1998","avatar_url":"avatars/874070.png?_=eca791baba17c719","is_superuser":false,"is_staff":false},"post_date":1621265456,"body":"Oh look like after seeing she husband jerk off wth that Jav she chảnge she mind and date every man have look at her ? Wtf ?"},{"id":1745389,"gallery_id":359408,"poster":{"id":1087997,"username":"oataoast","slug":"oataoast","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1621264870,"body":"Lmao look at the history of her cheating it enough to be a book."},{"id":1745375,"gallery_id":359408,"poster":{"id":2558779,"username":"narendramodibjp","slug":"narendramodibjp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621264489,"body":"i see plot. need to be translated"},{"id":1745314,"gallery_id":359408,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1621262288,"body":"Is this even NTR? Looks like she's never met a cock she could say no too. This girl ain't dirty. She ain't wild either. She's just plain broken inside."},{"id":1745279,"gallery_id":359408,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1621261074,"body":"Wow wow plot and drama"}]