[{"id":2237143,"gallery_id":360313,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1641094559,"body":"Dam this was pretty good looks like I'll have to read the rest some time."},{"id":1787765,"gallery_id":360313,"poster":{"id":3653489,"username":"ThighsFTW","slug":"thighsftw","avatar_url":"avatars/3653489.png?_=2947257c9902f39d","is_superuser":false,"is_staff":false},"post_date":1622994947,"body":"This is a gem : a vanilla time stop, unexpected"},{"id":1777381,"gallery_id":360313,"poster":{"id":3645219,"username":"johny8","slug":"johny8","avatar_url":"avatars/3645219.png?_=8fe924b1ad259759","is_superuser":false,"is_staff":false},"post_date":1622612743,"body":"361042 chap. 1-5"},{"id":1772469,"gallery_id":360313,"poster":{"id":3687562,"username":"BreastMaster64","slug":"breastmaster64","avatar_url":"avatars/3687562.png?_=8939268b3cee2b08","is_superuser":false,"is_staff":false},"post_date":1622383096,"body":"Its descent"},{"id":1769000,"gallery_id":360313,"poster":{"id":1220756,"username":"Dunkaccino","slug":"dunkaccino","avatar_url":"avatars/1220756.png?_=61e397133f8105be","is_superuser":false,"is_staff":false},"post_date":1622228022,"body":"Yo there is a whole ass group therapy going on down there. You can't made this shit up"},{"id":1768291,"gallery_id":360313,"poster":{"id":4257703,"username":"minnazzo","slug":"minnazzo","avatar_url":"avatars/4257703.png?_=0eec58a4b0dd9b36","is_superuser":false,"is_staff":false},"post_date":1622195325,"body":"2 people timestop looks like fun. Very interesting manga."},{"id":1765911,"gallery_id":360313,"poster":{"id":3989963,"username":"BSPancake","slug":"bspancake","avatar_url":"avatars/3989963.png?_=07d017968426c5a8","is_superuser":false,"is_staff":false},"post_date":1622088087,"body":"consensual sex in time stop hentai? We found a unicorn"},{"id":1765776,"gallery_id":360313,"poster":{"id":3860138,"username":"The ‘Cuda.","slug":"the-cuda","avatar_url":"avatars/3860138.png?_=3c85c6c37d8d76aa","is_superuser":false,"is_staff":false},"post_date":1622083304,"body":"More plz   "},{"id":1765769,"gallery_id":360313,"poster":{"id":1845547,"username":"zGuQ","slug":"zguq","avatar_url":"avatars/1845547.png","is_superuser":false,"is_staff":false},"post_date":1622082828,"body":"What the fuck"},{"id":1763895,"gallery_id":360313,"poster":{"id":2061364,"username":"hentaienthusiast424","slug":"hentaienthusiast424","avatar_url":"avatars/2061364.png","is_superuser":false,"is_staff":false},"post_date":1622006833,"body":"Uh the guy in the doujin not monika just want to make that clear 😅"},{"id":1763891,"gallery_id":360313,"poster":{"id":2061364,"username":"hentaienthusiast424","slug":"hentaienthusiast424","avatar_url":"avatars/2061364.png","is_superuser":false,"is_staff":false},"post_date":1622006673,"body":"God I hope the guy stops being an absolute bitch "},{"id":1763737,"gallery_id":360313,"poster":{"id":3819072,"username":"Weeblet._","slug":"weeblet-_","avatar_url":"avatars/3819072.png?_=5362c2e0e09ab90e","is_superuser":false,"is_staff":false},"post_date":1622001397,"body":"Fucking i wish i had this item lol, cool story, hot sex scenes and funny girl though👌"},{"id":1763399,"gallery_id":360313,"poster":{"id":2494901,"username":"Amir Syarifudin","slug":"amir-syarifudin","avatar_url":"avatars/2494901.png","is_superuser":false,"is_staff":false},"post_date":1621987556,"body":"Woohooo, Adventure Arc next?"},{"id":1763296,"gallery_id":360313,"poster":{"id":3506730,"username":"rykz","slug":"rykz","avatar_url":"avatars/3506730.png?_=b833a51c3956a516","is_superuser":false,"is_staff":false},"post_date":1621983276,"body":"the art 7,8/10 story 7,3/10 the art style is interesting and it is quite beautiful, the girl look cute and innocent at first but as the story went on she becoming more cute and erotic and also she become a girl that like to teased the person they like and thats a plus on my book. the story itself at first seems to be like your usual time stop hentai but story went on its become more unboring or a little bit more interesting. all and all its a decent or above average. overall rating its about 7,5/10 (for me), the artstyle and the story complement each other quite well."},{"id":1763260,"gallery_id":360313,"poster":{"id":3074984,"username":"uhhuhhuhh","slug":"uhhuhhuhh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621982005,"body":"Uhh so how is there no rape tag?? Like... Dude is literally raping the first girl on like page 20 something ..."},{"id":1763247,"gallery_id":360313,"poster":{"id":4043050,"username":"Wholesome_only_pls","slug":"wholesome_only_pls","avatar_url":"avatars/4043050.png?_=ae74b1522be53781","is_superuser":false,"is_staff":false},"post_date":1621981627,"body":"yeah for plot this is pretty interesting and/or somewhat pretty wholesome in a sense i guess lelz\n\nwelp can't wait for it to unfold more\n\nand for @fking monikammmmmm\nwell dude just cut her off o may not know the full story but relationships are built on genuine support from each other and helping each other from tough times. but if one doesn't genuinely love you or something similar then it all falls apart. And hey we all commit mistakes honestly just reconnect with your old friends they will forgive you especially if their your real friends.\nand to make you more not feeling alone even to it looks like it I'll suggest you this one video from a YouTuber.\nhis name is MrHunteru \nand the video you're gonna watch is \"How Steins;Gate Saved My Life\"\nHonestly it's a great watch give it a try cause you can literally relate to his situation not to mention the similarities of the events you're in and his in. \nAnd as for depression same here you're not alone honestly. "},{"id":1763214,"gallery_id":360313,"poster":{"id":1788932,"username":"I see what you fap to","slug":"i-see-what-you-fap-to","avatar_url":"avatars/1788932.png","is_superuser":false,"is_staff":false},"post_date":1621980374,"body":"Never before have I ever seen such wholesome emotional support in a hentai comment section. Stay strong fking monikammmmmm, definitely know the feeling of being in an abusive relationship. Had an ex who cheated on me... 5 times... within the span of 5 years, and I let it happen because I was emotionally dependent on her. Just a few months ago she told me over text that she got another bf, then I just snapped and told her to get the fuck out of my life. Damn did I feel good. Sure I was depressed for a month, but I reconnected with friends and family, explored hobbies (sometimes hentai related), and went out more. What I'm trying to say is... shit happens. You just gotta make the good shits to cover up the bad shits. There will be a time when the right person comes along, and in the end, it's up to you whether they are the one. Make smart decisions based off your past mistakes and don't be swept up by the mood."},{"id":1763194,"gallery_id":360313,"poster":{"id":2710695,"username":"Animepopcorn_","slug":"animepopcorn_","avatar_url":"avatars/2710695.png","is_superuser":false,"is_staff":false},"post_date":1621979677,"body":"I came here to read some hentai not see people be depressed like me.  At least I'm not suicidal, if you ever read these comments, think about the many strangers who decided to stop reading hentai just to say you aren't alone.  I know the world where anime girls aren't real is a hard one, but hopefully you get through it.  Think of all the hentai you'll never read if you die."},{"id":1763159,"gallery_id":360313,"poster":{"id":3510577,"username":"YourSenpai","slug":"yoursenpai","avatar_url":"avatars/3510577.png?_=06b85066c205bd38","is_superuser":false,"is_staff":false},"post_date":1621978191,"body":"@Lt. Fridrich This doujin has 211 pages in total, so it is not over."},{"id":1763082,"gallery_id":360313,"poster":{"id":4217347,"username":"Moonman03","slug":"moonman03","avatar_url":"avatars/4217347.png?_=21590baa418a94f0","is_superuser":false,"is_staff":false},"post_date":1621975027,"body":"Is this the end?"},{"id":1763066,"gallery_id":360313,"poster":{"id":2521085,"username":"luckyhusky","slug":"luckyhusky","avatar_url":"avatars/2521085.png?_=d2df0d36c772eccc","is_superuser":false,"is_staff":false},"post_date":1621974537,"body":"My points is you're not alone. Sometimes this shit happens to everyone in their life. Well even me still stuck in these loophole. But i don't feel sad anymore. I just using my time to focus reading some manga. It was good. Maybe i just running from my reality. But i don't know everyone had their own way to solved this problem. Maybe in me it will work and not work in your life. Just keep strong and keep loving your self. Sorry bad english."},{"id":1763059,"gallery_id":360313,"poster":{"id":2521085,"username":"luckyhusky","slug":"luckyhusky","avatar_url":"avatars/2521085.png?_=d2df0d36c772eccc","is_superuser":false,"is_staff":false},"post_date":1621974339,"body":"I get it when it come to no friend, toxic relationships, doesn't had any passion for these 1 year. And always fapping evryday. Ehat i can say to keep my sanity all these time was. Just love yourself more. Eventhough your life betrayed you don't feel sad about it, this is life everyone had these depressed feeling at his own life. What we can do now is only love yourself more and stay strong. If it needed stop fapping cuz it just make you worst shit. Try reconnect to your old friend. Eventhough you stop talking to them doesn't mean your relationship with your friend was gone. I feel that whenever i not contact my friend for 1 year and feel embarrassed about contact him again. But it was same to my friend. So try contacting your okd buddies or your new buddies try hangouts with them. And about your empty feeling it was just because you doesn't had passion for life i guessed. In my position i do some plan of future to fill my empty days. Eventhough it was only to read some manga and comic."},{"id":1763035,"gallery_id":360313,"poster":{"id":3836154,"username":"Luckwashere24","slug":"luckwashere24","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1621973308,"body":"@fking monikammmmmm I, almost no experience with depression, I know that anything I say can be dismissed because of that, and that all the advice I can give has already been said in, about 17 minutes, but I just wanted to say this. Whether burnt or not, the bridges you've built are still bridges at their core. Fires burn out, that's a fact, without enough fuel, or energy, or patience, anything can burn out, whether, literally or not, but at the same time you can always rekindle the fire. Even if you've been dating for 17 years or 17 days, at some point you have to see the sights without them. This whole thing I've been on about may be off the mark by a lot, but even if I'm off by a long shot, I hope it can help you once you're done with what you're going through, and that you can do the same to others. \nStay Strong, Stay you."},{"id":1762987,"gallery_id":360313,"poster":{"id":3606880,"username":"DobbyUmu","slug":"dobbyumu","avatar_url":"avatars/3606880.png?_=d3dae338523d7203","is_superuser":false,"is_staff":false},"post_date":1621971556,"body":"@fking monikammmmmm dude I'm not saying you should break it off with her but if it goes too far you definitely should and rekindle ur relationship with ur old friends ,friends helps u during though times and I wish u luck man "},{"id":1762978,"gallery_id":360313,"poster":{"id":3606880,"username":"DobbyUmu","slug":"dobbyumu","avatar_url":"avatars/3606880.png?_=d3dae338523d7203","is_superuser":false,"is_staff":false},"post_date":1621971061,"body":"This is the good shit"},{"id":1762959,"gallery_id":360313,"poster":{"id":587056,"username":"belgopolac","slug":"belgopolac","avatar_url":"avatars/587056.png","is_superuser":false,"is_staff":false},"post_date":1621970225,"body":"@fking monikammmmmm i know this seems like a weird place to seek help but we are here if needed. as you read below  a few of us are giving you advice or tips. If you need a shoulder, mine is available. it's better to talk about it then keep it bottled up and let it eat you from within. (which is ironically what i am doing with the trauma of my brother's suicide) \ni don't know if you have steam but my username there is the same as here. (if you want a non professional person to talk to) \njust stay safe and don't do something you won't be able to regret afterwards like my brother did. "},{"id":1762854,"gallery_id":360313,"poster":{"id":814476,"username":"HentaiLovers~","slug":"hentailovers","avatar_url":"avatars/814476.png","is_superuser":false,"is_staff":false},"post_date":1621965995,"body":"Lol this is what i always imaginary when time stopped"},{"id":1762840,"gallery_id":360313,"poster":{"id":2394912,"username":"Horny Hei","slug":"horny-hei","avatar_url":"avatars/2394912.png","is_superuser":false,"is_staff":false},"post_date":1621965633,"body":"@fking monikammmmmm Yo hey, sounds like you got alot going on there. Ive been diagnosed with clinical depression before. But to say I know how you feel would still be a lie. Im not in your place. If what youre saying is true, all I can say is youre showing similar symptoms, and your environment is feeding more to it. If your girl is that toxic, to the point you gotta stop talking to your friends, then she's not worth it man. Depression only gets to us when we have noone else to trust. Find your friends again, or family, or therapist even. It's good that you game, or watch anime, at least you have something that keeps you going still. Find more of that. If youre with someone who keeps you from having those, then dont be scared to cut them off. But again, Im not you so Idk the full story. It might be better if you find someone you can trust who knows you and talk it out. If you dont have any, find a therapist who's willing to listen. If all else fail well we're here for you. Goodluck man"},{"id":1762810,"gallery_id":360313,"poster":{"id":3900216,"username":"MeruBite","slug":"merubite","avatar_url":"avatars/3900216.png?_=257c7ed7d04d6401","is_superuser":false,"is_staff":false},"post_date":1621964524,"body":"i never thought ill see a wholesome conversation here on nhentai\nmonikammmmmmmm be strong man! bros is with you\nanyway i like this 10|10 i need more!"},{"id":1762784,"gallery_id":360313,"poster":{"id":2394912,"username":"Horny Hei","slug":"horny-hei","avatar_url":"avatars/2394912.png","is_superuser":false,"is_staff":false},"post_date":1621963593,"body":"I never thought I would find anything wholesome in a \"timestop\" genre before, feels good to be wrong man."},{"id":1762779,"gallery_id":360313,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1621963425,"body":"@fking monikammmmmm: dang, hey bud, we are all here with ya. Don't look down on yourself. While fapping helps to relieve the stress, ultimately, you'll have to find a way to break these chains that are bounding you in this current state. Is it a chronic depression? You might want to see a doctor, it could simply be a medical condition. Is it stress from a toxic relationship? You'll have to pick up that courage to do what you must do (end the abuse, end an addiction, etc) like intervening whatever it is that's causing you pain. Don't give up!"},{"id":1762753,"gallery_id":360313,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1621962819,"body":"Man, this is getting really good. Art is pretty good but I like where the story is headed to. Tip from my own experience: When a girl makes the initiative to get involved with you (anything), she likes you and you are in (as in the last page indicates). Because girls are intimately connected to her own emotions, if she doesn't like you or something, she will most likely show that lack of interest (and a fast one too, not even shy at all) unless she's hiding something or has an ulterior reason or motive."},{"id":1762744,"gallery_id":360313,"poster":{"id":3972239,"username":"FullBlownDegenerate","slug":"fullblowndegenerate","avatar_url":"avatars/3972239.png?_=8f612b576eaf27d8","is_superuser":false,"is_staff":false},"post_date":1621962493,"body":"@fking monikammmmmm hey man we all make mistakes, after all that's what makes us humans if you really do feel sorry for not talking to your friends anymore you can apologize to them, maybe they will forgive you, that's what my friend did as well.\nAll I'm saying is it wasn't your fault, you were being manipulated emotionally by your ex so don't beat yourself up over it.\n\nP.S I hope you feel better"},{"id":1762741,"gallery_id":360313,"poster":{"id":3153283,"username":"fking monikammmmmm","slug":"fking-monikammmmmm","avatar_url":"avatars/3153283.png?_=a93e0ac145080a2f","is_superuser":false,"is_staff":false},"post_date":1621962070,"body":"Dobrinus3 yeah, she even admitted she's not busy and she just don't want to talk to me, saying I should kill myself, and stuffs like her regretting being with me. I didn't even do her bad stuffs, like scold her, being mean to her, not a single time. I cant even say my feelings bcs one time she told me no one cares about my side. But it's okay, Im not hurting like before anymore im used to it, my friend says I should leave her too, but instead I stopped talking to my friends because she doesn't like them. Im the worst."},{"id":1762729,"gallery_id":360313,"poster":{"id":3153283,"username":"fking monikammmmmm","slug":"fking-monikammmmmm","avatar_url":"avatars/3153283.png?_=a93e0ac145080a2f","is_superuser":false,"is_staff":false},"post_date":1621961689,"body":"@Poyopoyo thanks for the advice man 🫂.\nI appreciate it, I hope so too that I'll stop being inlove with her. It's been 3 months maybe that she's being like that, starting an arguement over little things that we can just fix instead of making it worse. And getting mad at me for no reason at all, I do so much shit for her but all she do is call out my wrongs ;~; I can't even imagine doing those horrible stuffs to her. And about my mental illness, I'm not really sure if it's depression. I'm just feeling empty? I don't know what to feel, I don't eat that much only once a day most of the time. I stare at my phone all day scrolling in facebook and playing games. And I sleep at 5 or 6 in the morning even if I'm tired and waking up at 2PM. I've been like this since December maybe. But it's cool, I'm watching anime like Nagatoro-san, and read manga like Tokyo Revengers and more. I hope I can turn my life around one day. Stay strong guys."},{"id":1762719,"gallery_id":360313,"poster":{"id":2888398,"username":"Dicky97","slug":"dicky97","avatar_url":"avatars/2888398.png?_=0c3e259938851905","is_superuser":false,"is_staff":false},"post_date":1621961277,"body":"best hentai ever"},{"id":1762714,"gallery_id":360313,"poster":{"id":2824497,"username":"Dobrinus3","slug":"dobrinus3","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621960983,"body":"Monikammm, hey man, from your comment I sugest to leave her, she really doesn't sound like she's worth the pain or the sacrifices. If you love her then try your best to forget her, I know you can do it. Such a person won't make you happy, just more depressed. Try to reach out to your friends and apologize if you have to, if they're real friends they will come back to you I'm sure. Start over, it's not too late, you can do it."},{"id":1762695,"gallery_id":360313,"poster":{"id":3404634,"username":"DarkestLight95","slug":"darkestlight95","avatar_url":"avatars/3404634.png?_=3ece78d7afad2cd4","is_superuser":false,"is_staff":false},"post_date":1621960136,"body":"I was scared this would turn into ntr or something since this author does that type of degenerate content.\nBut after seeing all of it raw, I'm glad it has a happy ending and stays wholesome, maybe a redemption arc for Tanaka-kun"},{"id":1762693,"gallery_id":360313,"poster":{"id":1950338,"username":"owowhatsdis","slug":"owowhatsdis","avatar_url":"avatars/1950338.png?_=360443fd0b7cab3c","is_superuser":false,"is_staff":false},"post_date":1621960036,"body":"This is so great"},{"id":1762681,"gallery_id":360313,"poster":{"id":2384484,"username":"Poyopoyo","slug":"poyopoyo","avatar_url":"avatars/2384484.png","is_superuser":false,"is_staff":false},"post_date":1621959678,"body":"And another thing, monikammmmmmm, since that's already a depression it's better if you go and see doctor(if available). I really can't just give an advice when I'm not that well-versed with depression, and it may look insensitive for you. If you want, just watch some comedy anime or cute animals in youtube or something. But man, how can you just cope up with that, you're really impressive."},{"id":1762679,"gallery_id":360313,"poster":{"id":662854,"username":"Goodest Christian Boi","slug":"goodest-christian-boi","avatar_url":"avatars/662854.png?_=eff8aeaa731d6adf","is_superuser":false,"is_staff":false},"post_date":1621959634,"body":"Woooo Keep it going, my dude"},{"id":1762657,"gallery_id":360313,"poster":{"id":4299142,"username":"DaoistHentai","slug":"daoisthentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621959135,"body":"Finally, chapter 4"},{"id":1762654,"gallery_id":360313,"poster":{"id":4307797,"username":"JadeusTibedes","slug":"jadeustibedes","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621959058,"body":"Damn, that's sad\n @fking monikammmmmm"},{"id":1762652,"gallery_id":360313,"poster":{"id":2384484,"username":"Poyopoyo","slug":"poyopoyo","avatar_url":"avatars/2384484.png","is_superuser":false,"is_staff":false},"post_date":1621959010,"body":"Hey, umm, monikammmmmm, you want some virtual hug? I suck at comforting someone through words, so I always show it through actions. If your girl keeps abusing you, don't endure it and break up with her, even for a while. Toxic relationship like that will go nowhere but it will keep getting worse like hell. If you want, just expose her or something. Sincerely, a single person giving advice"},{"id":1762618,"gallery_id":360313,"poster":{"id":3153283,"username":"fking monikammmmmm","slug":"fking-monikammmmmm","avatar_url":"avatars/3153283.png?_=a93e0ac145080a2f","is_superuser":false,"is_staff":false},"post_date":1621957518,"body":"I'm jerking off many times a day just to feel happy, but in the end I still feel depressed. I hate myself, gived everything to the girl I love, my time, my friends, my mental health, but she still treat me like shit. Already in an abusive relationship and living this way at the same time, I don't even have any friends. I suck.\n\nI even lost my passion to play piano, now I don't have any hobbies at all. All I do is fap to these beautiful arts and suffer after. Fuck my life"},{"id":1762602,"gallery_id":360313,"poster":{"id":1742418,"username":"los montis","slug":"los-montis","avatar_url":"avatars/1742418.png?_=b51552a3bc1e5cd7","is_superuser":false,"is_staff":false},"post_date":1621957067,"body":"Let's go! "},{"id":1762557,"gallery_id":360313,"poster":{"id":2967805,"username":"Gin-san :3","slug":"gin-san-3","avatar_url":"avatars/2967805.png?_=696709256b4ad224","is_superuser":false,"is_staff":false},"post_date":1621954959,"body":"Finally some fucking food"},{"id":1762541,"gallery_id":360313,"poster":{"id":186105,"username":"domoben","slug":"domoben","avatar_url":"avatars/186105.png","is_superuser":false,"is_staff":false},"post_date":1621954214,"body":"THIS IS FUCKING AMAZING"},{"id":1762522,"gallery_id":360313,"poster":{"id":2360097,"username":"I hast come","slug":"i-hast-come","avatar_url":"avatars/2360097.png?_=1b27924d795e9e78","is_superuser":false,"is_staff":false},"post_date":1621953140,"body":"Seeing big things rn pog"},{"id":1762514,"gallery_id":360313,"poster":{"id":1830962,"username":"Dquags334","slug":"dquags334","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1621952892,"body":"wow that was quick, i just read chapter 3 a few minutes ago, CHAPTER 5 CHAPTER 5 CHAPTER 5. lets goooooo"},{"id":1762502,"gallery_id":360313,"poster":{"id":3944135,"username":"paulhwright","slug":"paulhwright","avatar_url":"avatars/3944135.png?_=e2de54819233aae7","is_superuser":false,"is_staff":false},"post_date":1621952431,"body":"ALREADY?????"}]