[{"id":1931729,"gallery_id":361650,"poster":{"id":4365989,"username":"Vindicta_01","slug":"vindicta_01","avatar_url":"avatars/4365989.png?_=111d13ac6981bf31","is_superuser":false,"is_staff":false},"post_date":1628443507,"body":"Reading the essays down there gave me a chuckle, that was fun. Welp, from the looks of thing , NTR is definitely gonna happen in the next chapter. Hope the sensei does something and not get cucked xD Good doujin though 9/10"},{"id":1860238,"gallery_id":361650,"poster":{"id":2181037,"username":"otomono","slug":"otomono","avatar_url":"avatars/2181037.png","is_superuser":false,"is_staff":false},"post_date":1625806490,"body":"drawing polygamy synonymous to ntr is connecting polyandry to cheating.One's a consensual harem and other's reliving their trauma. One who is oblivious to quintessential desires and art with thin line of disbelief  a mirror for the audience is either lying to themselves or as in the usual case dissonant.\nNtr is gaining traction as the nativenese becomes more herbivore and their thirst for a family remains unquenched"},{"id":1853283,"gallery_id":361650,"poster":{"id":2397346,"username":"Zenfaker","slug":"zenfaker","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1625503455,"body":"i thnik the fmc is quite easy to ntr'd since she is an airhead, it depends to the protag will to protect this girl.\n"},{"id":1853201,"gallery_id":361650,"poster":{"id":3219074,"username":"Shheerrlleeffff","slug":"shheerrlleeffff","avatar_url":"avatars/3219074.png?_=7b0176fc2a65aedc","is_superuser":false,"is_staff":false},"post_date":1625499610,"body":"AAHAHAHAHAHAHA THIS COMSEC IS LIT"},{"id":1853156,"gallery_id":361650,"poster":{"id":3440514,"username":"OburciTroll","slug":"oburcitroll","avatar_url":"avatars/3440514.png?_=02724ead8a6d3d26","is_superuser":false,"is_staff":false},"post_date":1625497696,"body":"My disappointment is immeasurable, and my day is ruined"},{"id":1852799,"gallery_id":361650,"poster":{"id":1368237,"username":"JVZR","slug":"jvzr","avatar_url":"avatars/1368237.png?_=e471f1a86f715a62","is_superuser":false,"is_staff":false},"post_date":1625481881,"body":"@Yafutsuki is about to get his heart destroyed. Won't be able to leave his bed in the next coming months."},{"id":1852696,"gallery_id":361650,"poster":{"id":3825369,"username":"faq you","slug":"faq-you","avatar_url":"avatars/3825369.png?_=8cb56b681e4d3b14","is_superuser":false,"is_staff":false},"post_date":1625477552,"body":"This goes from 100 to 0 real fucking quick"},{"id":1851191,"gallery_id":361650,"poster":{"id":1877620,"username":"ibarak1","slug":"ibarak1","avatar_url":"avatars/1877620.png?_=47f2f88fcd9429ef","is_superuser":false,"is_staff":false},"post_date":1625419849,"body":"holy fucking shit you keyboard warriors go yonder if its not your fetish god damn get some bitches on yo dick before you complain how sex plays out"},{"id":1851189,"gallery_id":361650,"poster":{"id":3825369,"username":"faq you","slug":"faq-you","avatar_url":"avatars/3825369.png?_=8cb56b681e4d3b14","is_superuser":false,"is_staff":false},"post_date":1625419686,"body":"Pls just kill me"},{"id":1845018,"gallery_id":361650,"poster":{"id":3279411,"username":"Jeon Jungle-Book","slug":"jeon-jungle-book","avatar_url":"avatars/3279411.png","is_superuser":false,"is_staff":false},"post_date":1625186367,"body":"Kill yourselves you essay-writing long message cuck vanillafag motherfucking soft cock premature ejaculating sack of shit faggots. Really kill yourselves. Imagine writing a whole fucking paragraph because your feelings are hurt. Go back to where you came from you fucking vanilla faggot motherfuckers. Fucking soyboys ruining ntr mangas with their fucking messages as if the message is as long as their soft cocks. "},{"id":1804373,"gallery_id":361650,"poster":{"id":2217263,"username":"MayuraVirus","slug":"mayuravirus","avatar_url":"avatars/2217263.png?_=27258899a881886a","is_superuser":false,"is_staff":false},"post_date":1623595207,"body":"THIS\nTHIS I WHY I HATE RYOH-ZOH MOTHERFUCKER DOESN'T FUCKIN DRAW WHERE IS WHOLESOME AND WHERE IS NTR "},{"id":1802739,"gallery_id":361650,"poster":{"id":1951146,"username":"Rozotoko","slug":"rozotoko","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623524725,"body":"I really really really realllllly hope its a \"special nutrient drink\".  Not getting invested in this till another chapter or two are released.  Don't wanna get blindsided."},{"id":1802658,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623521621,"body":"oh and funny thing,the taking-fiction-too-seriously thing doesnt even happen when i watch normal movies or series,it only happens if i read or watch anime,manga and hentai. Maybe anime seems more real than irl acting,maybe i just do self-insert when i read hentai, i dont even know why."},{"id":1802645,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623520893,"body":"And extra note : If NTR or cheating gets involved the story will just be ruined for me"},{"id":1802640,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623520515,"body":"I definitely agree that i might be taking fiction too seriously,i dont think i was being toxic tho,i just got mad. And btw,since NTR is a huge no for me,i always treat it with bias. I cant see NTR being an enjoyable factor of a story,everyone has their tastes but yeah,really doesnt do it for me. And sorry if i was being an asshole its just a soft spot. but yeah, i really have to stop taking fiction too seriously, i've been telling that to myself."},{"id":1802467,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623512508,"body":"Extra note: I think I might have meant something different with polygamous. What I wanted go say is that there are those who hate when the woman fcks other men, but likes it when the man fcks other women. My bad. Anyway, I definitely wasn't referring to you alone on that \"polygamous\" statement neither was it a big issue to me to begin with. People can like whatever type of fiction they want as long as they don't fuck things up irl. "},{"id":1802463,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623512204,"body":"@Yafutsuki What I mean by having an open mind is to recognize the fact that NTR works the same way as other genres, that there will be variations in elements and storywriting just like this one. Otherwise, the genre would be very one dimensional, right? Being a 1D story for porn is fine yes, but having variations is always appreciated by many of their fans regardless of genre. At the end of the day, these are all ficitonal works. I think you take fiction too seriously that you would end up swearing on the author's name. Your life experiences are no excuse for toxicity and bad behavior even in pornsites. Im also one of those who enjoy reading for the plot, but I do not act like how you do when there are things that I dislike or even despise about what I read. Anyway, if fiction hurts you that much, then I think you might need some help. The author doesn't mean you harm with his work."},{"id":1802323,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623504374,"body":"oh and one more exception about polygamous male mc,its when love isnt included and its just straight up sex. But any kind of polygamous relationship or ntr shit? Hell no dude. Japanese dudes are fucking weird"},{"id":1802315,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623504106,"body":"Im probably getting repetitive at this point but i have to say that cheating/ntr is the clearest and the biggest red line for me. After being cheated on 2 times its just painful to read shit like this when i just come to jack off,thats why i am so aggresive about cheating/ntr,it just being a fetish/kink alone is enough to make me get disturbed,so yeah. And Even though i want to stop thinking about this shitshow,i want to know whats really going to happen. Oh if this is going to be one of those with like 50 fucking chapters than im probably going to suffer a lot since 45 chapters of it is probably going to be some cuck/ntr shit. One more time,fuck you ryoh-zoh.\n"},{"id":1802308,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623503828,"body":"and side note : i dont enjoy polygamous male mcs either,the only time i enjoy that kind of things when the mc chooses a girl by the end of the hentai/story."},{"id":1802305,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623503701,"body":"and since i already got hooked up with this series,i cant just let it go,im one of those people who mean it when they say they read it for the plot. I wouldnt even give the single fuck about this hentai if it wasnt wholesome in the first place and i knew what kind of shit the author drew before,as i said,if cheating or ntr is the only way you can create a story you are a bad writer.Also yes,thank you for the summary anyway.\n"},{"id":1802301,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623503544,"body":"@DrinksandDame i get what you mean about being open-minded,but being open-minded about NTR or cheating? Thats where i draw the line along with rape,blackmail etc. I wouldnt get this upset over this if it didnt start so fucking wholesome,its just fucking unnecessary in my opinion. I dont even get how can someone enjoy ntr or cheating,like whats the point? its just fucking sad lmao. And also,if you are going to write a story about NTR or cheating just do it right off the bat. Dont trick the reader first,thats just fucking scummy."},{"id":1802179,"gallery_id":361650,"poster":{"id":3341996,"username":"stfuvanillafag","slug":"stfuvanillafag","avatar_url":"avatars/3341996.png?_=29267e82d3cfcf28","is_superuser":false,"is_staff":false},"post_date":1623498346,"body":"@DrinksansDame Thank you for the summary. It's been a while since I've been this interested in a doujin. It's like reading an adult manga, tbh (well it is, right? lol). I am quite split if I want a wholesome or ntr path tho I lean more on the latter. Regardless, I'll happily take it. The author is a great writer, I hope this story continue to progress."},{"id":1802140,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623496721,"body":"Anyway, I come back here in case there are feedbacks or questions about my summaries. I would feel bad if my summaries dont give enough details to those who read them. So if ya'll got some maybe even regarding the artist's previous work, feel free to shoot it here. The previous work btw only had like just 2 or 3 chapters of consensual NTR (it wasn't FMC even). Story was just about highschool students having complicated relationship with one another. Not necessarily cheating either since most characters arent even actually dating each other. Ended with a happy ending. Good story, but definitely wasn't just a full on wholesome one."},{"id":1802108,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623495931,"body":"I kinda expected this kind of reaction once this series gets some attention.  Considering how Rarefure went(author's previous work), I could say this author knows how to write a good story. Take out the porn and itll probably make a decent regular manga. Regardless, I know many just straight up hate it when the woman ends up fcking with other guys but at the same time enjoys works with polygamous male MC. That's double standards tbh, but hey it's all just porn so who cares. Point is, I dont see any reason to complain or to be disappointed when clearly these kinds of doujins aren't even meant for an audience like you. People can enjoy/tolerate a story with a rocky road and still have a good fap, clearly that is the author's audience considering the many red flags he already gave. If you're not one of those, that's fine. But at the very least, try to have an open mind when it comes to stuff like this."},{"id":1801918,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623487510,"body":"and also yes,THAT FUCKING COVER. Oh my fucking god dude this is definitely going to be a full blown NTR. fuck you ryoh-zoh."},{"id":1801901,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623486946,"body":"+But not gonna lie,the author knows how to get you into the story,i was just into this because it was a loving and a wholesome story,now its living in my head literally rent-free because of what the fuck is happening in this chapter. I never wanted so much to be proven wrong about a plot."},{"id":1801897,"gallery_id":361650,"poster":{"id":3539492,"username":"Yafutsuki","slug":"yafutsuki","avatar_url":"avatars/3539492.png?_=f2149f180df5eafe","is_superuser":false,"is_staff":false},"post_date":1623486632,"body":"I'm so fucking disappointed. I swear to god,cant you motherfuckers create a nice story without including cheating or netorare? this is just retarded fucking writing. And since the author is literally a full blown ntr author there is no doubt there will be a good amount of ntr or cheating,maybe we'll get a happy ending afterwards but this is just fucking retarded. Oh man i cant fucking wait for the next chapter so we can see obvious blatant cheating."},{"id":1801691,"gallery_id":361650,"poster":{"id":4424641,"username":"Chen Beixuan","slug":"chen-beixuan","avatar_url":"avatars/4424641.png?_=3a93f9c6d2161c6d","is_superuser":false,"is_staff":false},"post_date":1623479680,"body":"let's be honest though we all know this is going to be ntr cause even if the author is known for ntr or whatever, the cover is so sus with the unspecified guy fucking the girl and I don't know but the font of the title looks sus too and also the teacher isn't built like the guy that's fucking the girl in the cover and even if the chef guy or whatever he was, was giving her some drink or whatever why he gotta be so weird and say weird shit and give a sus look and @igotnostuffs let's be honest that there's at least a thirty percent chance that shes gonna get either blackmailed or end up fucking someone else at work"},{"id":1800828,"gallery_id":361650,"poster":{"id":1993618,"username":"booty hugger","slug":"booty-hugger","avatar_url":"avatars/1993618.png?_=6b53450b5c2015db","is_superuser":false,"is_staff":false},"post_date":1623441895,"body":"........Why there gotta be ntr at all!? Don't this author know how to make a story interesting without cheating!? "},{"id":1800661,"gallery_id":361650,"poster":{"id":3032570,"username":"igotnostuffs","slug":"igotnostuffs","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623432846,"body":"I wonder when the obvious ntr starts. I hope the cause isnt blackmail or rape though, i hate those type. Someone will probably find that she is fucking the teacher, and get blackmailed."},{"id":1799909,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623400827,"body":"@Newbie637 Im very certain that wasn't pubic hair or even a hair. Considering the context, it's definitely the drink that she had a hard time drinking. You can check page 23 and see that the way the author draw liquid on skin surface looks like that."},{"id":1791778,"gallery_id":361650,"poster":{"id":2297777,"username":"Newbie637","slug":"newbie637","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623115338,"body":"@DrinksandDame It's the pubic looking hair that sends me alarm signals"},{"id":1783640,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622854368,"body":"Also one more thing that could be relevant later on is the content of the overheard convo. Guy actually made a mistake and said \"Eroi yo, Karin-chan\" which means \"That's erotic, Karin-chan\" instead of \"Erai\" which in this context translates into: \"good girl (for drinking it all)\". He corrected himself after girl was like \"e, Eroi?\". Can't blame sensei for overthinking it to much lol. Anyway, it's a likely theory that the guy might have a thing for blonde also because of the staredown. But yeah, it could all just be a red herring too. "},{"id":1783621,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622853793,"body":"@chuck0089 Im guessing page 6, right? So sensei was shocked after overhearing that thing. He was about to ask her what what she doing just now when a guy/girl offscreen called for them (blonde and guy) to set the tables which was what they were supposed to do in the first place. Blonde bows to sensei thanking him for talking with mom. Guy tells blonde that have to go now. And then, staredown. Blonde says that she'll head to sensei's place after work. End of page. Btw, the guy is a chef in training and his name was mentioned so he might actually be a recurring relevant character to the story later on."},{"id":1783433,"gallery_id":361650,"poster":{"id":818839,"username":"chuck0089","slug":"chuck0089","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622848758,"body":"@DrinksandDame Yeah that \"special Nutrient Drink\" is just the way author played with readers since the author always shows blatant cheating not this kind of overheard one and the girl didn't bother to completely clean it while going outside. It is too early for some cheating. Thank you for the summary.\n\nAnyway I wanted to know what is the conversation when the girl came out of that room."},{"id":1783408,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622848132,"body":"-two were reminded of what kind of job blonde is getting into. Sensei somehow brought up the topic about the guy before. Apparently, guy was just worried about blonde so he gave her a \"special nutrient drink\". Anyway, it looks like it's punishment time cuz girl made sensei jealous. Looks like girl wants the butt slamming action once more, but sensei misunderstood her words and gave her actually butt slapping. It was painful but girl liked it so the slap continues and the rest is sex. She swallowed his cum and funnily they had a similar dialogue from the one he overheard earlier. TBC. Ok just to be clear, it may look like the story is going south with the thing with the other guy, but I think the author is playing with us for now. The mood of the story is still pretty vanilla so imo, it's very unlikely that the \"special nutrient drink\" was sus. Of course, I could be wrong, but this author doesn't usually drop heavy stuff right right off the bat. Feel free to comment what you think"},{"id":1783403,"gallery_id":361650,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622847959,"body":"Summary: chapter starts with Sensei having the talk with blonde's mom regarding her working as a gravure model. Looks like she's giving a go signal for it pretty much as long as sensei will watch over her until she gets used to it. In the middle of the talk, a guy walks in to call blonde to set the table (looks like they're running a japanese inn). Sensei was left alone with mom. He was curious why Mom seems to trust him too much with Blonde to which she says: \"it's because my Karin(blonde) believes in you\". As sensei was taking his leave, he overhears Blonde and other guy having a SUS talk. It goes like: \"Did you manage to drink it all?\"\"Yeah, it's bitter and some of it got stuck on my throat\" \"good girl\". This activated sensei's wide imagination on page 8. Anyway, blonde came to his house. As they were talking about the earlier convo with mom, he finally remembered where he had seen the gravure company rep before. Turns out, she was a gravure model herself. Looking at the photo, the-"},{"id":1783106,"gallery_id":361650,"poster":{"id":3482176,"username":"yumi_san","slug":"yumi_san","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1622839202,"body":"so author is same as rarefure...where girl and boy both cheat and at the end they get together"}]