[{"id":2182135,"gallery_id":362693,"poster":{"id":2323351,"username":"Multi-culturist","slug":"multi-culturist","avatar_url":"avatars/2323351.png?_=5cb9b0b2fb25a8a3","is_superuser":false,"is_staff":false},"post_date":1638723547,"body":"I do not understand the words, yet, I understand the plot. It is quite good actually. While it is great that one can be with their 'destined partner', sometimes life ain't gonna be like that. When the 'destined' part are just a thread and some vague feelings that are left to fade over the years, it is highly possible that the 'destined' route gonna be crushed and destroyed. Nothing gonna last forever, even those strong feelings for someone. This particular doujin is not suitable for some vanilla consumers but it could be what would actually happens without plot armor. This doujin is just some made up dramatic events that followed if Taki and Mitsuha never encountered again which is realistically more convincing. Thus, what I think after skimming through the doujin is: \"It needn't to be the destined person that one always waiting for, if they have a person that treasures them, that's destiny.\""},{"id":2047152,"gallery_id":362693,"poster":{"id":4444321,"username":"Mr.Gold","slug":"mr-gold","avatar_url":"avatars/4444321.png?_=83674659d5640f7b","is_superuser":false,"is_staff":false},"post_date":1632824383,"body":"Well, I was initally hesitant but thinking about it, Taki and Mitsuha never met in this timeline, the only real thing that bothered me is that she still had the Red Thread. That signified their connection, it feels sullied if she kept it this whole time, glad it's finally gone from her hands, hopefully it lands back on Taki and he either destroys it or gives it to someone he can have a connection that actually \"exists\""},{"id":1997429,"gallery_id":362693,"poster":{"id":2809969,"username":"Tatuki","slug":"tatuki","avatar_url":"avatars/2809969.png?_=803e93e8308196e8","is_superuser":false,"is_staff":false},"post_date":1630907308,"body":"Bro it's been 2 years yo it's still going what a chad"},{"id":1854297,"gallery_id":362693,"poster":{"id":40471,"username":"boboxxx86","slug":"boboxxx86","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625543007,"body":"YES PLEASE.......!"},{"id":1818917,"gallery_id":362693,"poster":{"id":1745567,"username":"blackyblack","slug":"blackyblack","avatar_url":"avatars/1745567.png?_=9469b3457fad8909","is_superuser":false,"is_staff":false},"post_date":1624180060,"body":"anime over years ago but this dude is a man of focus, commitment, and sheer fucking will"},{"id":1807320,"gallery_id":362693,"poster":{"id":3308058,"username":"Garlen","slug":"garlen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623710545,"body":"Ganso777 quick rundown. Girl leaves small hometown and goes to uni in Tokyo. She's single and has someone she likes. She's hit on by a popular well mannered rich student and denies wanting a relationship several times. The MC whos hitting on her sees her as a mark because hes a big dick hard body rich chad, finally frustrated with her he decides to drug her as an absolute last resort. He then takes her to a hotel and as he was making love to her, FMC wakes up. The MC continues to make sweet love to her and take a video of it. MC then uses the video to convince FMC to have fun with him. While they are in a hot and heavy relationship FMC is emotionally cheating on MC by still having feelings for a boy who rejects every woman who hits on him and states that he is in love with someone else, possibly the FMC. "},{"id":1807316,"gallery_id":362693,"poster":{"id":3308058,"username":"Garlen","slug":"garlen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623710419,"body":"A woman who is in love with the MC blackmails the FMC into having sex with the friends of the MC in an orgy while recording it. When the MC finds out he smashes the camera, demands all of thier SDcards and burns them on the spot. He than confronts the FMC with bondage sex in order to claim her body while revealing that he has trust issues becuase girlfriend cheated on him and that he didn't believe in love until he met her."},{"id":1807312,"gallery_id":362693,"poster":{"id":3308058,"username":"Garlen","slug":"garlen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623710281,"body":"FMC continues to have sexual relations with MC. During one of the MC orgys, the woman who is in love with him feels dejected that he does not treat her the same as the FMC. After having sex with several of the the man their she then calls the cops on the orgy while 3 other woman lay on the floor passed out drugged. MC is able to escape by running away from the cops and finds FMC in the elevator on her way to see him. He then runs away with her without explaining and they go to a hotel to have sex. MC at this point is just hiding away in the hotel and waiting for news from hes rich father hoping that the false charges will be dropped. In this chapter the MC confronts FMC for still having feeling for someone else despite being in a relationship with him, he then treatans to throw away the symbol of ther feeling, a red hair band while spiking her drink with the same drug he used on the day they first made love."},{"id":1806046,"gallery_id":362693,"poster":{"id":4318792,"username":"satsuki0925","slug":"satsuki0925","avatar_url":"avatars/4318792.png?_=4e6b03127b996c9d","is_superuser":false,"is_staff":false},"post_date":1623656846,"body":"wait sooo long  ~ omg "},{"id":1805712,"gallery_id":362693,"poster":{"id":3341668,"username":"Ganso777","slug":"ganso777","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623645494,"body":"Can someone give me a quick rundown on this series?"},{"id":1805457,"gallery_id":362693,"poster":{"id":2478659,"username":"ghostt","slug":"ghostt","avatar_url":"avatars/2478659.png?_=67e814759fd8703c","is_superuser":false,"is_staff":false},"post_date":1623635353,"body":"She should just kill herself"},{"id":1804932,"gallery_id":362693,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1623614851,"body":"Now that's some dedication right there."},{"id":1804800,"gallery_id":362693,"poster":{"id":2974588,"username":"Alim kalbar","slug":"alim-kalbar","avatar_url":"avatars/2974588.png?_=3be1dec86e72ef9d","is_superuser":false,"is_staff":false},"post_date":1623610169,"body":"hahahaha this still on going haha wtf"},{"id":1804622,"gallery_id":362693,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1623604055,"body":"This is still ongoing?"}]