[{"id":2326451,"gallery_id":362742,"poster":{"id":3186953,"username":"suci&amp;polos","slug":"suci-polos","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644604833,"body":"ra mudeng blass"},{"id":2169524,"gallery_id":362742,"poster":{"id":3338918,"username":"RLHainne","slug":"rlhainne","avatar_url":"avatars/3338918.png?_=3edae7743ed84a16","is_superuser":false,"is_staff":false},"post_date":1638127967,"body":"@augu unless it's non consensual.... thats bad"},{"id":1915926,"gallery_id":362742,"poster":{"id":312303,"username":"augu","slug":"augu","avatar_url":"avatars/312303.png","is_superuser":false,"is_staff":false},"post_date":1627896325,"body":"@culture horny Love is an abstract concept and very subjective. So we can put love in the line because is not really matters, you can have sex whit someone for whatever reason (gratitud, love, becase, etc) and you dont have to be in love for that. For what the autor tries to say is \"can an underage girl freely have sex whit an older man no matter the reason\" and the answer is yes. \n"},{"id":1868388,"gallery_id":362742,"poster":{"id":3773750,"username":"Debolina5","slug":"debolina5","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1626147930,"body":"I wish it was translated"},{"id":1810377,"gallery_id":362742,"poster":{"id":4337105,"username":"culture horny","slug":"culture-horny","avatar_url":"avatars/4337105.png?_=8a6b65d03f099402","is_superuser":false,"is_staff":false},"post_date":1623846983,"body":"well, I think we are worshiping loli and also worshiping 'pedophilia'. so I'm going to write a little bit about this story.\nwe are 'trapped' by the author because we think that the girl loves him but does she really love him, it may just be her gratitude and curiosity. so we assume it's not his fault because she loves him, grateful to him. What a perfect justification\n honestly, the author doesn't support pedophilia, the author manipulates readers to support pedophilia without the readers knowing. anyway I will still stand my point of view \"this is not a love story, this is a pedophilia story\".\n\nSorry for my bad grammar  I don't  really good in my english class "},{"id":1807405,"gallery_id":362742,"poster":{"id":312303,"username":"augu","slug":"augu","avatar_url":"avatars/312303.png","is_superuser":false,"is_staff":false},"post_date":1623714645,"body":"@culture horny those arr the best love stories. Trust me I can confirm it."},{"id":1806214,"gallery_id":362742,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1623662442,"body":"Summary: Girl was poor and is being bullied for it. They tease her that she's dirty and doesn't take a bath. Baker dude has been giving her some free food ever since she was young. When she got home, she wonders if her mom carried her in her arms when she was a baby. She doesn't remember if her mom has ever held her hand. She was wondering if kids die if they aren't held(touched) by their parents. As stupid as it may sound, this is a big thing to her because she thinks that everyone thinks she's dirty that no one wants to touch her. Baker was different since he just touched her back then. That made her want for him to touch her more. A few days later, he came to her place wondering why she hasn't come to his store for a while. Overcome by her emotions, she hugs dude from behind and asks to be touched. He resisted at first but gave in. The rest is sex and the dude definitely had regrets. He wants to apologize to her mom but she apparently hasn't been home for half a year. "},{"id":1806002,"gallery_id":362742,"poster":{"id":4337105,"username":"culture horny","slug":"culture-horny","avatar_url":"avatars/4337105.png?_=8a6b65d03f099402","is_superuser":false,"is_staff":false},"post_date":1623655147,"body":"Guys, this is not a love story. this is a pedophilia story"},{"id":1805993,"gallery_id":362742,"poster":{"id":3487528,"username":"Sex god","slug":"sex-god","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1623654708,"body":"Wholesome "}]