[{"id":2313419,"gallery_id":363235,"poster":{"id":3506142,"username":"ANhentaiUser","slug":"anhentaiuser","avatar_url":"avatars/3506142.png?_=19960245a3ec1b61","is_superuser":false,"is_staff":false},"post_date":1644083722,"body":"@Typical japanese Main Character Nah fam, shitty take. Kirito's strong, but you're deluding yourself if you think he's a self-insert. You'd have to ignore the multiple scenes where he needs someone else to save him, where he fails, and where he comes out feeling like shit. Second arc is literally a power fantasy deconstruction, where Kirito goes into the game trying to use his strength to make him feel better about himself, only to realise that such a mentality is fucked up and wrong. \n\nFeels like Kirito is stronger in the minds of SAO haters than SAO fanboys. Like yeah, no shit, when you ignore a character's weak moments, and exaggerate his strong ones, he's gonna seem like a self insert.\nAlso : \"get all the bitches\"\nKirito's only interested in and only has been interested in one girl: Asuna. He has no intention of going the harem route, and it's doubtful Asuna would let him if he wanted to. Barely has even 5 min of \"harem romcom drama\" in the whole 4 seasons of anime either."},{"id":1979145,"gallery_id":363235,"poster":{"id":1250559,"username":"Jackforest","slug":"jackforest","avatar_url":"avatars/1250559.png","is_superuser":false,"is_staff":false},"post_date":1630160302,"body":"Ntr where Kirito was never going choose any of them "},{"id":1834423,"gallery_id":363235,"poster":{"id":1104066,"username":"Kuutearica","slug":"kuutearica","avatar_url":"avatars/1104066.png?_=7cb763677e776941","is_superuser":false,"is_staff":false},"post_date":1624758189,"body":"The good ending."},{"id":1821556,"gallery_id":363235,"poster":{"id":1714639,"username":"Yurifag95","slug":"yurifag95","avatar_url":"avatars/1714639.png?_=963aa231e8a81f9c","is_superuser":false,"is_staff":false},"post_date":1624271599,"body":"THE COVER LIED TO ME. Not the first time though"},{"id":1818497,"gallery_id":363235,"poster":{"id":2193199,"username":"ImTired","slug":"imtired","avatar_url":"avatars/2193199.png?_=480a3803a7cc9d44","is_superuser":false,"is_staff":false},"post_date":1624164712,"body":"I'm happy it got translated, I enjoy a good ol' mind control"},{"id":1818196,"gallery_id":363235,"poster":{"id":1392698,"username":"Fap-Lord","slug":"fap-lord","avatar_url":"avatars/1392698.png","is_superuser":false,"is_staff":false},"post_date":1624154076,"body":"@Typical japanese MainCharacter I unironically agree with your analysis thanks for that."},{"id":1817181,"gallery_id":363235,"poster":{"id":296409,"username":"laughinggore","slug":"laughinggore","avatar_url":"avatars/296409.png?_=0eed32a0c1fe90c3","is_superuser":false,"is_staff":false},"post_date":1624115972,"body":"they saw potential and took the chance"},{"id":1817030,"gallery_id":363235,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1624109315,"body":"@prodigalscarab\nHere's a little secret, go to your account settings and click/tap on [Blacklist Tags], imput all the tags that make your heart ache and balls shrivel (use this hentai work's own tags as imitial reference, that would in your case probably be the \"netorare\" \"rape\" and \"mind control\" ones), hit [Save] and then for the mother that birthed you, don't ever hit/click/tap on the blurried works, it's for your own good, boy, you'll just end up hurting your mind and getting all sad &amp; upset. Now, run off to your precious vanilla and stop leaking social media flavoured soy on the comment section of hentai works featuring things you know you can't handle, like an attention thirsty twatter media drama queen."},{"id":1817003,"gallery_id":363235,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1624108519,"body":"At least .hack GU (also culprit of having its sasuke-like mc getting all the bitches, at the end of volume.3 with a post game one-time \"select character -&gt; send marriage card\" item) spends  3 games building the mc's power up and that fucker gets nerfed down to level zero right at the beginning/end of prequel anime series. That SAO hack of an author did is \"I'm gonna write my highschool self wishful dream scenario where I- the mc gets all the power and all the bitches like the standard kadokawa/kyoani harem romcom but with chuuni rpg elements in an future-tech™ isekai world that appeals to otakus and normies by simplicity, it has girls, op mc, fantasy tech, and harem romcom drama\". That franchise is a mashup of ingredients but with no inherent substance, similar to a japanese \"ultra-man\" type show, \"the hero must always win, no matter how corny/cheesy it gets\", this rant would describe much of todays japanime industry and it's largely SAO's fault there's every year 3-4 similar isekais."},{"id":1816997,"gallery_id":363235,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1624108246,"body":"I don't approve of this particular \"oji-san\" either, bad design, suspicious nose and his way of getting things done are too easy and convenient, at least, if going for a \"bastard gets his way with the entire cast with no sign of anyone able to stand against him\" type if narrative, make it more complex, try to put some layers of intricate details in it, some effort, not: no-name bastard got (thing) which essentially enables an un-blockable mind rewrite, zero risks, minimal to no investments other then got (thing) and used it for my own selfish desires BOOM godmode cheat enabled GG the end.\nThat being said... Fuck your \"wholesum\" crap, not everything needs to be vanilla-soy flavoured because your snowfee-fees gets irritated whenever the fucking harem mc is no where in sight of a hentai fan work, plenty of that shit, heck, fucking SAO is one of the biggest perpetrator of the plague that is \"typical japanosuke mc gets the world handed down to him while everybody sings and dances kumbaya\"BS"},{"id":1816963,"gallery_id":363235,"poster":{"id":3357601,"username":"JosefuuJuztar","slug":"josefuujuztar","avatar_url":"avatars/3357601.png?_=186b27c923343cc6","is_superuser":false,"is_staff":false},"post_date":1624106683,"body":"lmao looks obviously bs to me"},{"id":1816602,"gallery_id":363235,"poster":{"id":4413781,"username":"prodigalscarab","slug":"prodigalscarab","avatar_url":"avatars/4413781.png?_=5415371d16caf6de","is_superuser":false,"is_staff":false},"post_date":1624090764,"body":"Could’ve been wholesome but you had to go with NTR you sicko"},{"id":1816453,"gallery_id":363235,"poster":{"id":3934648,"username":"Cute Cerberus Loli Waifu","slug":"cute-cerberus-loli-waifu","avatar_url":"avatars/3934648.png?_=33862384a2405bd5","is_superuser":false,"is_staff":false},"post_date":1624085820,"body":"It finaly got translated"}]