[{"id":1999102,"gallery_id":363932,"poster":{"id":2843660,"username":"Only Pedos like shota","slug":"only-pedos-like-shota","avatar_url":"avatars/2843660.png?_=cc0c6b8dec4f6dfd","is_superuser":false,"is_staff":false},"post_date":1630959406,"body":"How tf is this not translated yet?? Instead its only is shitty chinese bro like wtf are the translators doing not jumping on this?? "},{"id":1838730,"gallery_id":363932,"poster":{"id":2687426,"username":"H_Homster","slug":"h_homster","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1624920231,"body":"Hey there! It's good to be a king, huh? But how can you be a succeessful king without good eyesight? The guy was drugged, those two are sisters. But lemme start from the top. And I'm interpreting just from the pictures mind you, I don't know the Commuspeak. The younger sister had a firend/boy to bully over. She got bored of a game and talked about something with her elder sis, after which the elder gave her imouto a drug to try out on the boy. But it backfired and some time later she finds her imouto getting FUCKED UP by the boy who's on drugs again. Turns out little sis got fucked good after the boy got drugged. Some kinda super-libido enhancer. He came to apologise some time after, because he had a blackout and didn't know what he wos doin'. But she acutally liked it and drugged him again. Then when older sister found them they dragged her into this SHIT. There, I think I'm spot on. If not ignore this comment."},{"id":1834102,"gallery_id":363932,"poster":{"id":3955800,"username":"The laughing orca","slug":"the-laughing-orca","avatar_url":"avatars/3955800.png?_=3da8d9b67d69675a","is_superuser":false,"is_staff":false},"post_date":1624745782,"body":"I am confused on what just happened, can someone explain?"},{"id":1832882,"gallery_id":363932,"poster":{"id":4471978,"username":"btypleser","slug":"btypleser","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1624698167,"body":"8 of 10 nice"},{"id":1832447,"gallery_id":363932,"poster":{"id":3248114,"username":"zetaman","slug":"zetaman","avatar_url":"avatars/3248114.png?_=bf7d44497d40c1c3","is_superuser":false,"is_staff":false},"post_date":1624682969,"body":"Link me to the english version guys if there are any"}]