[{"id":2269431,"gallery_id":364684,"poster":{"id":4442043,"username":"kenway211","slug":"kenway211","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642385145,"body":"This is like netori disguised as netorare."},{"id":1988403,"gallery_id":364684,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630546254,"body":"MC needs to dump her and end up with the other chick..."},{"id":1987263,"gallery_id":364684,"poster":{"id":4085310,"username":"Rexx19doom","slug":"rexx19doom","avatar_url":"avatars/4085310.png?_=160b6f905c5493b4","is_superuser":false,"is_staff":false},"post_date":1630494641,"body":"Ah yes, it's quite predictable. Nothing new on ntr realms"},{"id":1960565,"gallery_id":364684,"poster":{"id":3776613,"username":"ParGeo","slug":"pargeo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629497460,"body":"It was predictable. Was someone expecting something else?"},{"id":1852153,"gallery_id":364684,"poster":{"id":2560727,"username":"Paladdin","slug":"paladdin","avatar_url":"avatars/2560727.png?_=2434396a0b6fcbf1","is_superuser":false,"is_staff":false},"post_date":1625457755,"body":"In fact, the coach's accusation was not to let her break her career because she could get pregnant while having sex, but lol, he does the same thing himself. These Japanese authors..."},{"id":1852010,"gallery_id":364684,"poster":{"id":3602918,"username":"Rialtoir","slug":"rialtoir","avatar_url":"avatars/3602918.png?_=397783e5877c74c2","is_superuser":false,"is_staff":false},"post_date":1625451913,"body":"So she went back just like that uh. Also if this whole thing is suposed to make the coach more sympathetic or \"less of a bad guy\" is totally failing to do that in fact I would this just makes him worse xd"},{"id":1851208,"gallery_id":364684,"poster":{"id":2430715,"username":"Smenek","slug":"smenek","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625420313,"body":"well, there's no going back if she's that gone tho'. Honestly, i was a \"little\" bit raged when she be like that, but fuck it. It's not over yet so shall we wait for some ending.\n\n"},{"id":1849583,"gallery_id":364684,"poster":{"id":2560727,"username":"Paladdin","slug":"paladdin","avatar_url":"avatars/2560727.png?_=2434396a0b6fcbf1","is_superuser":false,"is_staff":false},"post_date":1625359570,"body":"Mangaka is now trying to show the coach as a good guy. But that's not how it works. Lol. And it is already clear how all this will end. Nothing new."},{"id":1847825,"gallery_id":364684,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1625290159,"body":"All credit for the summary goes to defan752 from EH."},{"id":1847822,"gallery_id":364684,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1625289972,"body":"\"Coach slams it into her and says that he'll hold her forever and make her forget everything. Inside, Coach is thinking about how only he can see Yuki's cumming face like this, and she's someone who has never left his side. He tells Yuki to run when he tells her to, and let him fuck her when he asks for it. He tells her to entrust her talent, her body, her everything to him. By now Yuki has fully given into the pleasure and her mind is going blank. Coach calls her by her first name and they fuck even harder. Then they both climax at the same time and he finishes inside her. He reflects on how in that moment, she's his, and her cumming face belongs to him and him only. They continue to fuck.\n\nBack in the dorms, Shoma's (?) phone buzzes.\""},{"id":1847814,"gallery_id":364684,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1625289777,"body":"\"Coach and Yuki embrace passionately, with Coach pinning her to the wall as they make out. Coach's erect dick pokes Yuki's pussy through his pants and she climaxes immediately. Noticing this, Coach teases her for it. He leads her to a van inside the woods and pounds her fiercely from behind. He comments on how she's tightening up and asks if she likes sex that much. Yuki replies by saying that she feels good, but doesn't know if she's lying or not, and can't go back. She wants to forget everything and all she knows is that sex with Coach just feels amazing.\" "},{"id":1847808,"gallery_id":364684,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1625289594,"body":"\"To this, Yuki smiles and tells Coach that every time she sees him and Asahi get along and laugh together, it's been making her uneasy for some reason. She thought she'd been freed from his grasp thanks to Shoma, but just now, she's realized that there is nothing about her that can go back to the way she was. Lifting her shirt and dropping her track pants, she confesses that Coach has changed everything about her. Exposing her almost fully naked body, Yuki says that now, all she want is to take a \"breather\" with Coach like always. Taken aback, Coach asks what she's doing. Yuki tells him not to worry about Shoma anymore. Coach still hesitates, but Yuki takes his hand and puts it on her breasts, asking if he doesn't want to.\""},{"id":1847800,"gallery_id":364684,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1625289412,"body":"\"Coach reminds Yuki that it's past bedtime and she should go back. Disregarding this, Yuki asks if, to Coach, she was supposed to be Asahi's replacement. Coach denies it. Yuki then asks why he did all of those things to her, if not. Coach replies that he did it because Yuki, by having a relationship with Shoma and getting busted for having sex at school, had given into her foolish desires and was throwing away her promising future. It frustrated him because he could no longer have things like talent, a future, or potential, no matter how much he wanted them. He wanted to teach people like that a lesson. But when he saw Asahi and her family, he finally understood that he had been wrongfully imposing himself on his students' way of life all along, and he was taking it out on Yuki because she hadn't been doing exactly what he wanted from her as his ace runner. Coach finally apologizes to Yuki.\""},{"id":1847791,"gallery_id":364684,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1625289220,"body":"\"Later, Coach is walking back to the dorms, clearly pained by both his leg and what he just saw. He reflects on how happy Asahi's family looked and expresses disbelief that he was ever so caught up in athletics himself, while neglecting other things. He resigns to the fact that he can't turn back now. His leg gives and he crashes to the ground. He condemns himself as just a washed up former athlete only good for seeing off other, better students with more promise. Yuki appears in front of him and extends her hand, asking if he's okay. Coach is taken aback by her appearance.\""},{"id":1847783,"gallery_id":364684,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1625289039,"body":"\"Kazuki confirms that Ayumi is his and Asahi's daughter, and apologizes for what he said to Coach back then, confessing that he and Asahi were too naive, that Ayumi has been a significant burden on them, that they needed to rely too much on their own parents, and that Asahi has been unable to find a job until Aoshima-sensei introduced her to this current job as training camp staff. Kazuki apologizes for causing Coach so much trouble as a student and invites Coach to hit him if he likes. However, Coach tells Kazuki that it is his own life, and he had no right to interfere in it. He tells him that he and Ayumi have both turned out well. Moved, Kazuki bursts into tears. Ayumi tells Coach to apologize for making her dad cry because it will make Ayumi upset. Embarrassed, Asahi tells Ayumi that her dad is crying tears of joy. Eri is moved by the scene, while Yuki says nothing.\""},{"id":1847776,"gallery_id":364684,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1625288818,"body":"\"Summary: Picking up from Chapter 13, Asahi asks if Coach wants to know if she'd aborted her baby from years ago. Overhearing her, Yuki and Eri think that Coach might have impregnated her. Eri is in disbelief that Coach would do such a thing, but Yuki hesitates before agreeing, remembering what Coach did to her in the shower room.\n\nA young girl runs up and hugs Yuki from behind, mistaking her for her mom. Neither Yuki nor Eri recognize her, until the door opens and Asahi identifies her as Ayumi. Coach sees that both Yuki and Eri were eavesdropping. Ayumi asks where her daddy is, who shows up right on cue and we learn that his name is Kazuki. Kazuki was watching Ayumi until she ran off; apparently he had to go in for an early shift at the store he works at. He sees Coach, who recognizes him as Takeyama, Yuki's boyfriend from years ago.\""},{"id":1847535,"gallery_id":364684,"poster":{"id":949397,"username":"Mzyls","slug":"mzyls","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625279763,"body":"just kill this fucking whore"},{"id":1847363,"gallery_id":364684,"poster":{"id":1649066,"username":"LettuceZ","slug":"lettucez","avatar_url":"avatars/1649066.png?_=89001055fe6888e7","is_superuser":false,"is_staff":false},"post_date":1625273160,"body":"@How Dull nah its the same version, the boyfriend was assertive and the coach was backing off but she went back to him "},{"id":1847028,"gallery_id":364684,"poster":{"id":2478659,"username":"ghostt","slug":"ghostt","avatar_url":"avatars/2478659.png?_=67e814759fd8703c","is_superuser":false,"is_staff":false},"post_date":1625260116,"body":"This is still going on? Wtf "}]