[{"id":1851119,"gallery_id":364683,"poster":{"id":2348254,"username":"MattEz_","slug":"mattez_","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625416840,"body":"damn bruh poor husband, this slut is getting fucked by everyone lol , cum dump\nhope the guy gets revenge "},{"id":1848770,"gallery_id":364683,"poster":{"id":2761470,"username":"ulquiorra_no4","slug":"ulquiorra_no4","avatar_url":"avatars/2761470.png","is_superuser":false,"is_staff":false},"post_date":1625326486,"body":"Wife is slut at this point now waiting for her to became pregnant and getting huge amount of money from husband by divorce"},{"id":1847926,"gallery_id":364683,"poster":{"id":411666,"username":"QuetzalCoatl","slug":"quetzalcoatl","avatar_url":"avatars/411666.png?_=da7e264028bc4145","is_superuser":false,"is_staff":false},"post_date":1625294278,"body":"I pity more the subordinate's position because it seems like he is being cucked in real time while having the chance to fuck her, it's hilarious, even the alpha let a sigh out in one panel. I don't know the author perspective but as a mental exercise I would theorize that the alpha recognize that this idiot don't get that the reason why he can't make her scream is because he is thinking the whole time about dominion instead of giving in to pleasure affecting his overall performance. Instead of thinking \"how can I get more pleasure out of this?\" and creating erotic situations like the aplha just did in the bathroom with her, he is like \"maybe if I thrust harder and more times monotonously she will like it more\" XD"},{"id":1847764,"gallery_id":364683,"poster":{"id":1326768,"username":"Eliot201","slug":"eliot201","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625288511,"body":"Dis just keeps getting better and better "},{"id":1847351,"gallery_id":364683,"poster":{"id":3585932,"username":"kurumixchan","slug":"kurumixchan","avatar_url":"avatars/3585932.png?_=3f6939790999416f","is_superuser":false,"is_staff":false},"post_date":1625272724,"body":"I really want it uncensored. It hot"},{"id":1847308,"gallery_id":364683,"poster":{"id":1064327,"username":"TvManga2020","slug":"tvmanga2020","avatar_url":"avatars/1064327.png","is_superuser":false,"is_staff":false},"post_date":1625271000,"body":"I kind agree with y’all two it’s going to like Karami Zaharia  Vol. 3  when the MC find out from the girl friend how  the girl he like to become a slut and when MC confronted her about what her whereabouts she told him the whole story how she becomes like that. In the end MC is cuckolding at end I was piss!!! But it’s was hot though "},{"id":1847228,"gallery_id":364683,"poster":{"id":3551755,"username":"CoolMan","slug":"coolman","avatar_url":"avatars/3551755.png?_=251f72b749e25bd6","is_superuser":false,"is_staff":false},"post_date":1625267650,"body":"tshwmtxuj Man you really are right. i really do want to see her get fucked real hard and for de husband to revenge or whatsoever but the chance of that is freaking low. still this shit is hot its just i want to see her in pain and im afraid it will propably have a cuck end for de husbund.. fuck dis shit dont think just fucking fappp"},{"id":1847142,"gallery_id":364683,"poster":{"id":1909135,"username":"tshwmtxuj","slug":"tshwmtxuj","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1625264613,"body":"As I was Re-reading from the beginning, I've realized how submissive she is. The wife/FMC seems to think that she doesn't want it, but subconsciously wants the sex. She said she doesn't want it, but due to her husband's lack of libido, she's never experienced a hard fuck. When she does experience it, she turns down her husband's request for sex probably because she knows she won't cum. So instead of talking or seeking help from her husband, she instead seeks to just continue on cheating (by will now) so she doesn't lose her house to live in, food that her husband provides for (I mean, they work at the same place, but if he has to move to another location, I would assume he's a manager), and the free fuck from her co-worker/husband's subordinate. I'm sort of disgusted with the wife, but I keep on reading on \"hoping\" she gets her ass left in the dust by her husband, so she can pay her bills by becoming the whore she is. But I also know, there is a 0.1% chance of that happening."},{"id":1847109,"gallery_id":364683,"poster":{"id":4299825,"username":"Ultraman Z","slug":"ultraman-z","avatar_url":"avatars/4299825.png?_=4dea6980f8e8ef84","is_superuser":false,"is_staff":false},"post_date":1625263499,"body":"Things sure are getting interesting "},{"id":1847070,"gallery_id":364683,"poster":{"id":2408988,"username":"Sgt. Morningwood","slug":"sgt-morningwood","avatar_url":"avatars/2408988.png?_=79dc690bab62f983","is_superuser":false,"is_staff":false},"post_date":1625261940,"body":"Moar, i need moar before the translation "}]