[{"id":2517461,"gallery_id":367007,"poster":{"id":4925452,"username":"Annalbelle69","slug":"annalbelle69","avatar_url":"avatars/4925452.png?_=6a4a7e02cc2c722a","is_superuser":false,"is_staff":false},"post_date":1652277903,"body":"Hope this information was helpful for you, now if you'll excuse me my big ass cock is all swollen, rock hard and leaky after writing all of that shit so I'm going to empty that motherfucker before I get blue balls or something. Have a nice day."},{"id":2517452,"gallery_id":367007,"poster":{"id":4925452,"username":"Annalbelle69","slug":"annalbelle69","avatar_url":"avatars/4925452.png?_=6a4a7e02cc2c722a","is_superuser":false,"is_staff":false},"post_date":1652277612,"body":"She had no consciousness at that point obviously but her body wasn't quite finished shitting itself empty, this page is the real continuation showing the remaining part of the slime get pushed and sharted out by her body on auto pilot as the Nuirikabe creature arrived to possess her empty shell of a body. The remaining half of her personality slime is seen getting flushed by her own possessed body here. A truly cock hardening and humiliating defeat for the arrogant vice president. "},{"id":2517445,"gallery_id":367007,"poster":{"id":4925452,"username":"Annalbelle69","slug":"annalbelle69","avatar_url":"avatars/4925452.png?_=6a4a7e02cc2c722a","is_superuser":false,"is_staff":false},"post_date":1652276989,"body":"Let me explain just in case you are confused. The club's vice president was the only one that managed to keep her anus and fat butt cheeks clenched until she reached the toilet because of how high her spiritual power was, the other JK brats failed miserably and started shitting insanely hard before reaching any bathrooms. Even though the vice president got to the toilet she was already doomed. She didn't know she was about to die, none of the girls did they just thought that whatever was happening to their digestive systems would stop after taking a dump.(The process of the soul getting absorbed by the slime inside the girls intestines is permanent and irreversible) so she also pooped herself to a rather comedic and darkly funny death, but she still had a large part of the slime remaining inside her lower guts as the majority of it was automatically flushed away, go look at that massive pink log sticking out of her stretched asshole if you don't believe me. "},{"id":2517418,"gallery_id":367007,"poster":{"id":4925452,"username":"Annalbelle69","slug":"annalbelle69","avatar_url":"avatars/4925452.png?_=6a4a7e02cc2c722a","is_superuser":false,"is_staff":false},"post_date":1652275812,"body":"@ImTired - A rather hopeful and optimistic way of thinking that you have I see, that JK Whores are somehow saved in the end. BUT ALAS, THEIR FATES ARE INEVITABLY SEALED FROM THE MOMENT THEY SPLIT THEIR MOMMAS TENDER TWATS WIDE IN BIRTH TO ARRIVE IN THIS UNFORGIVING AND CRUEL UNIVERSE OF FAN NO HITORI!!! Basically what I'm saying is that the vice president died on the toilet due to the soul slime pushing itself out of her guts in season 1 just like you said but this right here is not a different route or alternative timeline. This is the exact same one from when the large group of dumb JK cunts in the club room explosively defecated themselves to death (Fucking love that scene btw) after they were tricked into drinking the fatal underworld slime mixed drinks offered by the already dead mind controlled body of Toujou chan (That massive boobed nerd)."},{"id":2215066,"gallery_id":367007,"poster":{"id":4532635,"username":"Choklykly","slug":"choklykly","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640241956,"body":"hope to see the sequel of page 3"},{"id":1938747,"gallery_id":367007,"poster":{"id":3323076,"username":"itskitsundere","slug":"itskitsundere","avatar_url":"avatars/3323076.png?_=f3722d80757396b9","is_superuser":false,"is_staff":false},"post_date":1628720005,"body":"guys, these are all skeb requests that fan did that were translated. so someone requested this pic of mind control of the vice president."},{"id":1930205,"gallery_id":367007,"poster":{"id":3354435,"username":"FakeFaceWeeb23","slug":"fakefaceweeb23","avatar_url":"avatars/3354435.png?_=f7ea4dde92aba6cc","is_superuser":false,"is_staff":false},"post_date":1628378971,"body":"What the fuck"},{"id":1904816,"gallery_id":367007,"poster":{"id":3048462,"username":"Red Kaiser","slug":"red-kaiser","avatar_url":"avatars/3048462.png","is_superuser":false,"is_staff":false},"post_date":1627498682,"body":"@Rolay7 No there doesn't, because scat dressed up as something else is still scat."},{"id":1901666,"gallery_id":367007,"poster":{"id":1458370,"username":"Rolay7","slug":"rolay7","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627371335,"body":"There needs to be a personality extraction tag. "},{"id":1900290,"gallery_id":367007,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1627327493,"body":"Really seems to be an alternative timeline, asin the original story it was even mentioned, that the vice presidents excreted personality was mostly flushed down the toilet due to the automatic flusher. But in this special page she not only gets possessed by a demon but he also flashes her personality intentionally down the sewer."},{"id":1900063,"gallery_id":367007,"poster":{"id":532087,"username":"ayy lmao1","slug":"ayy-lmao1","avatar_url":"avatars/532087.png?_=0a3c465cf50ed857","is_superuser":false,"is_staff":false},"post_date":1627320004,"body":"Wish we'd get more of girls being stuck in girls assholes, that was surprisingly hot help"},{"id":1898724,"gallery_id":367007,"poster":{"id":3338098,"username":"The Pepsi In The Comments","slug":"the-pepsi-in-the-comments","avatar_url":"avatars/3338098.png?_=7fa5182ffaa43002","is_superuser":false,"is_staff":false},"post_date":1627278269,"body":"I want to see more soulless body possession with some good sex in more pages. This a good fetish, and can definitely become the diamond in the rough!"},{"id":1898531,"gallery_id":367007,"poster":{"id":2193199,"username":"ImTired","slug":"imtired","avatar_url":"avatars/2193199.png?_=480a3803a7cc9d44","is_superuser":false,"is_staff":false},"post_date":1627273222,"body":"Wait a minute, the vice president in season 1 pooped herself out, but during the end of season 1, she was hypnotized and it was said that she was already being mind controlled and that she was going to be a puppet as the next president. She also seemed to have her original personality at that time. So if this creature takes her body in this instance, does that mean this is an alternative timeline or is she going to get her body back at some point. If the latter, that is a lot of crap whoever found her had to sort through to save her. "},{"id":1898165,"gallery_id":367007,"poster":{"id":3221810,"username":"TheCurse09","slug":"thecurse09","avatar_url":"avatars/3221810.png","is_superuser":false,"is_staff":false},"post_date":1627263993,"body":"This shit had no reason being this fire "},{"id":1898007,"gallery_id":367007,"poster":{"id":3641492,"username":"Rednaxela.ExE","slug":"rednaxela-exe","avatar_url":"avatars/3641492.png?_=99306eafb730163e","is_superuser":false,"is_staff":false},"post_date":1627257913,"body":"Wow! Uh, ok? This shit's really fucked up.That felt way longer than 3pages "},{"id":1897993,"gallery_id":367007,"poster":{"id":3735610,"username":"FapperPai","slug":"fapperpai","avatar_url":"avatars/3735610.png?_=f9478561b3b9a658","is_superuser":false,"is_staff":false},"post_date":1627257199,"body":"Confused wank"}]