[{"id":1908660,"gallery_id":367532,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627653880,"body":"It might even include 367509 which would make sense to some degree in that she's a hentai/eroge artist and she's sleeping around to gather material for her work. So with that one being called Material No. 1 it could be that all the other chapters are her gathering material for hentai. Since in the last one with the otaku 367531, he's actually a fan of her compared to all the other guys so he quickly finds that she used their sexy time to make a hentai manga and he uses it all the time to fap. Then again this one is either the first guy she actually wants to date, she just wanted a handsome guy as material and/or because she was dissapointed in his size she decided to go with a different kind of setting to use as material for her hentai. Thats the feeling I got after checking all the one's that were put up and thinking it over. Since in the very first one in the end she thinks that she has to go gather more material, then we see a girl sleeping around and turning her sex into hentai."},{"id":1908642,"gallery_id":367532,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627653139,"body":"@Zanuska Well it's just my guess from looking at this and the other 4 chapters that seems to include her. Probably in the right order 367511/367529/367530/367531 then this one. In all of them she's wearing a face mask and doesn't seem to dress up and just sleeps with random guys and I didn't read any mention of her having a bf though some of the guys are thinking \"I'm sorry future boyfriend\" because they soiled her already or something. Then in this one she's all dressed up, fixed her hair and not wearing her face mask. So it implies this is the \"future boyfriend\" she wanted but once she see's his dick she's dissapointed. So while still unsure I am not getting an NTR vibe and more of a shaming vibe were the girl has slept around and then when she finally get's the guy she wants he turns out to be trash so she get's all mad and goes on to humiliate him."},{"id":1908609,"gallery_id":367532,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1627651487,"body":"@tobajas Thought that it was that but when I looked at the miniature of Chap1 I thought they looked alike so just assumed they where going out. Seems it was just a sexually active girl that trash talked a guy and made it like it was ntr, huh. Thank you sir, for enlighting me :)"},{"id":1908592,"gallery_id":367532,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627650684,"body":"@Zanuska I think their all or most of them are of the same girl and her sex life. It would seem she writes manga, not sure if it's the sexual kind or not but she is seemingly sleeping around with a bunch of guys. Here she's with a handsome guy and once he pulls his pants of his dick is so small she get's mad and calls it false advertising with how he's just a fancy package with only trash inside since a man needs a big dick to even be considered as a man. She then tells him how she had for a long time been looking forward and been willing to have sex with him but now he can't even compare to the otaku they saw before. Then she shows him vids/pics of her fucking the otaku and telling him what a beast he is and how he's reshaped her pussy bla bla bla. Feels like it's missing a page or so, but from what I could understand their not a couple he's just a guy she had a crush on while the other chapters are filled with her sleeping around with dudes cause of random reasons."},{"id":1908495,"gallery_id":367532,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1627645842,"body":"Didn't even notice but he's the guy from chap 1 and her boyfriend, and people knew of her cheating so it was ntr all along"},{"id":1908488,"gallery_id":367532,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1627645611,"body":"This looks like an actual storyline? I'd guess that she is famous in the otaku circle and idolized by them by being called a \"princess\", and this guy didn't know jack about it and got dumped after she saw his low sexual prowess until he learned of the truth of how she just goes around fucking with otaku (and the other chapters would be a build up I guess?)"}]