[{"id":2230603,"gallery_id":367655,"poster":{"id":754385,"username":"MeniL","slug":"menil","avatar_url":"avatars/754385.png","is_superuser":false,"is_staff":false},"post_date":1640828157,"body":"Lmao indeed that poetry is something"},{"id":2210382,"gallery_id":367655,"poster":{"id":1887980,"username":"oldFart_Jiancuk","slug":"oldfart_jiancuk","avatar_url":"avatars/1887980.png?_=d82ea549aca614a9","is_superuser":false,"is_staff":false},"post_date":1640061518,"body":"@Buzzlebeep, udah di tempat lain. Kalau agan teliti juga ketemu."},{"id":2210207,"gallery_id":367655,"poster":{"id":4917009,"username":"Buzzlebeep","slug":"buzzlebeep","avatar_url":"avatars/4917009.png?_=d032294559ebde24","is_superuser":false,"is_staff":false},"post_date":1640054523,"body":"Ini yg translate orang indo tapi knapa gk ditranslate pake bahasa indonesia aja"},{"id":2207135,"gallery_id":367655,"poster":{"id":1612110,"username":"AI NI AI NI AI NI AIAIAIAIAIAI","slug":"ai-ni-ai-ni-ai-ni-aiaiaiaiaiai","avatar_url":"avatars/1612110.png?_=9cf92ed17c82f584","is_superuser":false,"is_staff":false},"post_date":1639913120,"body":"Author's afterword \"poetry\" has enough power to change lives"},{"id":2206610,"gallery_id":367655,"poster":{"id":4905051,"username":"pengencrotan","slug":"pengencrotan","avatar_url":"avatars/4905051.png?_=a90802a1d2cede19","is_superuser":false,"is_staff":false},"post_date":1639886735,"body":"Smart animal on the comment section"},{"id":2191450,"gallery_id":367655,"poster":{"id":4604558,"username":"Kingdom_Come","slug":"kingdom_come","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639152610,"body":"This is Stockholm Syndrome at its finest... or worst depending on your PoV"},{"id":2189556,"gallery_id":367655,"poster":{"id":4793476,"username":"ARZICRON","slug":"arzicron","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1639061372,"body":"lahh page terakhir lawak"},{"id":2189541,"gallery_id":367655,"poster":{"id":3055318,"username":"Icedtea","slug":"icedtea","avatar_url":"avatars/3055318.png?_=8b5bd005bb290eb5","is_superuser":false,"is_staff":false},"post_date":1639060941,"body":"Aside from the Top tier art, I really love the leg lock."},{"id":2189495,"gallery_id":367655,"poster":{"id":61830,"username":"homer666","slug":"homer666","avatar_url":"avatars/61830.png","is_superuser":false,"is_staff":false},"post_date":1639058676,"body":"If they're happy, then I'm happy."},{"id":2189302,"gallery_id":367655,"poster":{"id":771228,"username":"onemore7","slug":"onemore7","avatar_url":"avatars/771228.png?_=b35a93e10bdf7dff","is_superuser":false,"is_staff":false},"post_date":1639050327,"body":"Good ending."},{"id":2188168,"gallery_id":367655,"poster":{"id":1016795,"username":"DamnMen","slug":"damnmen","avatar_url":"avatars/1016795.png","is_superuser":false,"is_staff":false},"post_date":1638998491,"body":"Wholesome!"},{"id":2098360,"gallery_id":367655,"poster":{"id":1687289,"username":"Michael Yumizuri","slug":"michael-yumizuri","avatar_url":"avatars/1687289.png?_=7057532b0e690229","is_superuser":false,"is_staff":false},"post_date":1634928561,"body":"MOTHER OF ALL HOLY, THE COMMENT SECTION HERE IS A BATTLEFIELD. When you scroll down past my comment, first thing you'll think is \"I'm not reading all that shit.\"\n\n"},{"id":1962712,"gallery_id":367655,"poster":{"id":2447562,"username":"wira6444","slug":"wira6444","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629567425,"body":"This ScrubLoser is hilarious, look like this guy got gay fcked by ugly fat men thus induced his trauma"},{"id":1961253,"gallery_id":367655,"poster":{"id":4553213,"username":"mugen23","slug":"mugen23","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629521479,"body":"This is entertainment, the fat guy served its purpose.\na. Visual appeal: By having an \"ugly\" person near someone \"pretty\", it increases the appeal of the better looking. \nb. Psychology: ... ( It will take me too long to explain, but there is at least 3 different reasons)\nc. Story: If you change MC's appearance, the interaction / reader's perception changes completely. You no longer have the same story.\n...\nI have to say though, MC is a disaster for the society and for human genetics :T"},{"id":1960622,"gallery_id":367655,"poster":{"id":4504626,"username":"alceste007","slug":"alceste007","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629500258,"body":"If you care that much about how good and cute the guys look there is a ton of vanilla cute guy and gay stuff  on the site. I personally do not give a dam about how the guys look. If bbm bothers you, just blacklist it. I do not why you guys are here other than to whine.  "},{"id":1954464,"gallery_id":367655,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1629267512,"body":"At that point there would be one, crucial thing left to do and that is: \"DO NOT. FUCKING. CLICK/TAP ON THE BLOODY BLACKLISTED HENTAI WORKS.\" And finished, as long as you follow these instructions and stay away from the blacklisted stuff, you ought to be fine. You say you worry about missing out on impregnation works? Don't worry boy, take it from me, there is P.L.E.N.T.Y of vanilla hentais out there with that tag aaand your favorite bishonen (pretty boys) beefy men. So have no fear, there is no need to be upset, everything is going to be \"daijobu\",  you and your fit, 10/10 normie friends can have your sessions of jerking each other off on the count of lacking fat, sleazy brown men in your precious vanilla stuff, you bunch can be happy-fappy bois I won't get to accidentally glance at your bullshit,  yes? Okay. Good.\n... who the fuck am I kidding, as I mentioned before, you and your types always. come back. for more... For more \"discussion\", with more flimsy \"arguments\".  Every time. -_-"},{"id":1954429,"gallery_id":367655,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1629266549,"body":"@ScrubKing \"what is even the point of the \"come back for more\" line?\". As in, \"you irrational chumps always come back for more ntr works\", you don't like? Great, I get it, most do to, no problem, hey, I personally despise the typical vanilla \"wholesum\" stuff where the mc gets everything handed down to him from the author (its self-insert after all, or of the jap target demographic, go figure) on a silver platter. What do I do? If possible, I fucking blacklist each and every. single. typical jap mc from my search results, boom, clears about a good 75% of the issue, the rest? I can tell by now, out of exp, if not from the cover + title that it's going to be vanilla crap, avoid that shit like the plague and I am one pleased with my hentai sessions. What can you, your alt accounts/butt buddies do? Fucking blacklist the following: \"BBM, DILF & NETORARE\" tags and boom, you never have to be annoying scrub about things you don't like for they will be filtered, blurred and shadowed away."},{"id":1948735,"gallery_id":367655,"poster":{"id":4317791,"username":"maa_12","slug":"maa_12","avatar_url":"avatars/4317791.png?_=67da35df2eb35855","is_superuser":false,"is_staff":false},"post_date":1629078458,"body":"Kisei toukyoku really really likes ugly b isnt he"},{"id":1946665,"gallery_id":367655,"poster":{"id":4112796,"username":"zainulngage","slug":"zainulngage","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629015203,"body":"Bangsat orang indo ternyata "},{"id":1929205,"gallery_id":367655,"poster":{"id":3722335,"username":"SluttyKitsune","slug":"sluttykitsune","avatar_url":"avatars/3722335.png?_=db44d38a36d1d423","is_superuser":false,"is_staff":false},"post_date":1628343710,"body":"@Hilldog So... are you into fat disgusting bastards or no?"},{"id":1925408,"gallery_id":367655,"poster":{"id":3838130,"username":"The Shrimpster","slug":"the-shrimpster","avatar_url":"avatars/3838130.png?_=166c53504b9054c6","is_superuser":false,"is_staff":false},"post_date":1628209220,"body":"cuckboi2.0 https://i.imgur.com/9UnkbEy.jpeg"},{"id":1924678,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628186583,"body":"You do you.if you enjoy it sure.  I don't think you get actual interaction out of him . He isn't like a video game . He isn't interactive .It doesn't matter what you say. He is just going to trow out some bad punchlines that he picked up over the years of neglect and convince himself that he is a big winner . "},{"id":1924642,"gallery_id":367655,"poster":{"id":3838130,"username":"The Shrimpster","slug":"the-shrimpster","avatar_url":"avatars/3838130.png?_=166c53504b9054c6","is_superuser":false,"is_staff":false},"post_date":1628185328,"body":"@ScrubKing ironically using his idiotic punchlines against him would be a good idea, besides i have considerable time in my hands playing with the special needs \"boomer\". and actually socializing with other people and have time for my gf while im at it"},{"id":1924617,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628184512,"body":"You are wasting your time Shrimpster . Just tell him that you will get back to him once he deliveres something halfway decent. like a point or at least a punchline that isnt barking cringe . and then get back to him once he does. Until then there is no point in repeating yourself "},{"id":1924603,"gallery_id":367655,"poster":{"id":3838130,"username":"The Shrimpster","slug":"the-shrimpster","avatar_url":"avatars/3838130.png?_=166c53504b9054c6","is_superuser":false,"is_staff":false},"post_date":1628184058,"body":"Look everyone, yet another delusional  text from Cuckboi2.0 full of nonsense , who would have guessed..."},{"id":1924562,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628183054,"body":"1. yeah lets ignore the actual evidence i laid out \n2. publishers missing the point due to a lack of feedback and communication not something unheard of . In older media for example . or in a less outspoken society like japan . just take a look at artists like ratatata74. that are booming because they get directly compensated through patreon wich also lets them get a clear picture of their audience. that guy is booming because he essentially covers the spicier topics while not having the disgusting side dish . \n3. nice how you essentially dodged any and all question . GG on that one \n\nbtw lets wave to Madboi2.0 new alt account . i wonder how long it will take this time for him to get banned "},{"id":1922911,"gallery_id":367655,"poster":{"id":519200,"username":"Hilldog","slug":"hilldog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628129688,"body":"@ScrubKing \"Are you into fat disgusting, ugly men ? I am not\" That's your whole argument.  Complaining about something you don't like, assuming others don't like it either, and then arguing when people tell you to fuck off.  You have built this entire idea in your head that \"since I don't like it, most people don't like it,\" and then concocted this bizarre situation where somehow people are \"tolerating\" it and only \"pretending\" to like it and somehow the entire \"industry\" has collectively decided to push what you don't like because they think it would make them money.  If it didn't make them money, or if what you want made them more money, they wouldn't do it.  They would notice that doujins made a certain way would sell more and thus do more of those.  You're delusional and dedicating way too much time to porn.  Get perspective and stop arguing about porn."},{"id":1922732,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628123900,"body":"And having an ugly bastard in is by no means rare. And having a really disgusting case isn't either. How realistic is it really that people are genuinely into fat bastards ? We know the JAV industry only has fat ugly old people in their porn because they think that is their target audience ( pretty insulting tbh) . Artists like ratatatatatatatatatatata74 are booming in popularity because they cover the more spicy content without insulting their audience. What I'm saying is that we could have a lot more better content . And that it is a lot more likely that people tolerate the archetype rather then actually wanting it. While the industry just thinks that their audience are ugly , discussing and fat so they try to cater to them. I don't think nhentai comment sections will change anything but why pretend we are into fat bastards when we likely aren't? Are you into fat disgusting, ugly men ? I am not "},{"id":1922710,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628123255,"body":"First. That is an empty point that litteraly means the same . Second. Same logical fallacy . \n\nThird. If we simply accumulate all the fat bastards we can quickly gather the time requirements you just made up. 4th . Do you really think it's realistic that so many people have a fetish for fat bastards that it warrants having so many of them ? I do not have any statistics at hand but i doubt that a lot of people are into fat ugly peoe considering people tend to be attracted to the exact opposite. \n5th ironically i actually made points in pretty much all comments and never went \"wahhh\" while you just started making a point and stopped doing \"wahhh\" .\n\n6th. There is a lot of porn on this website to be sure but if we simply take the impregnation focus again and take it as an example it is really not difficult at all to keep up with all impregnation releases . There are propably about 3 or so per week. I never actually kept track but that is my assumption. So content burns down pretty fast "},{"id":1922646,"gallery_id":367655,"poster":{"id":519200,"username":"Hilldog","slug":"hilldog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628121000,"body":"@ScrubKing First, I didn't say you were an incel, I said you were acting like one.  Second, I didn't say you couldn't critique porn, I just said it makes you fucking retarded.  It's not a TV show or a movie that you pay to see and takes up hours of your day.  It's something you look at for 5-10 minutes that gets you off, and it's very niche.  People have certain fetishes and others don't, to be like \"THIS DOESN'T APPEAL TO ME...WAAAAH!\" makes you retarded.  A normal person would just realize they don't like it and look for something else.  And if you look at the 400,000+ doujins on this website and be like \"WAAAAAH!  Because there too much fat bastard on this website, there's less content for me!\" among 400,000 searchable-by-fetish doujins you're either too stupid or too lazy to use this website.  There are a fuck-ton of doujins even if you black out the BBM tag.  Stop thinking the world revolves around your tastes and you can't be wrong and fuck off."},{"id":1922249,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628106081,"body":"Let's just make an easy example ( so even you understand) . Presume we are into impregnation. A shit load of those doujins have the fat bastard archetype. \nSo if we just blacklist those we miss out on a lot of content. So as long as we like impregnation more then we dislike fat bastards that is not a good trade off. However that doesn't make the fat bastard archetype good. That wasnt so difficult right ? On the other hand .why would fat bastards make them better ? Are they relatable ? Or appealing? Or anything positive? You tell me xD"},{"id":1922242,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628105777,"body":"Also by what logic does porn form an exception from the simple logic we just established. What does it matter whenever it's porn or not? Either we follow your logic through and you can't critique anything. Or we don't because it's obviously stupid. Why should there be an exception for porn ? Why do I even have to explain this contradiction to you? Isn't it kind of obvious ? "},{"id":1922230,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628105405,"body":"@Hilldog\nI already addressed these points previously.\nYour punchlines are horrendously bad dude. Having a point = being an incel. \nAt least google your buzzwords before your trow them around . That's just weak dude "},{"id":1921526,"gallery_id":367655,"poster":{"id":2083213,"username":"Santedtra","slug":"santedtra","avatar_url":"avatars/2083213.png","is_superuser":false,"is_staff":false},"post_date":1628083692,"body":"Oh hey it's Richard again. Better hope he doesn't have any daughters. Or at the very least he's completely satisfied with this as his outlet."},{"id":1920519,"gallery_id":367655,"poster":{"id":519200,"username":"Hilldog","slug":"hilldog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628052182,"body":"@ScrubKing Not about porn on the internet you knob-headed scrublord.  If I don't like the particular porn, I click on something else and never go back to it, or for instance, I BLACKLIST tags I don't like (you know, like the BBM (big beautiful man) tag), but I guess that isn't something a big-brained connoisseur like yourself is capable of.  I don't write giant bricks of text like a fucking incel edgelord trying to justify why everyone in a doujin has to have people I find attractive or it's bad.  Get a life."},{"id":1920014,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1628037445,"body":"It's not about this one in particular but how many get ruined by it. But following your own logic i guess you have never critiqued or complained about anything ¯\\_(ツ)_/¯"},{"id":1919406,"gallery_id":367655,"poster":{"id":519200,"username":"Hilldog","slug":"hilldog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628014853,"body":"Oh my god people if you don't like the doujin don't read it."},{"id":1918655,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1627986184,"body":"And yet you do it as well. And what is even the point of the \" come back for more\" line? Yeah go figure people are going to respond to you. That is how conversations work. What a concept . \n\nAs for the actual point . I really don't feel that there is an even amount of normal looking dudes in hentai. Of course I don't have any statistics at hand but there is a reason the fat bastard archetype is so well known. And either way it doesn't improve or fix the fat bastard. And while that is just my personal gripe i really dislike the mobile wooden plank mcs. They have no personality whatsoever and always just go with whatever the girls do. This that's just me . Back to the actual point the distribution of fat bastards is definitely out if proportion. And that isn't even limited to doujins. The trash taste crew often does content with a former japanese porn actress and she told them in a video that they rely on  fat,ugly,old men because that is essentially their target audience.kinda insulting"},{"id":1917578,"gallery_id":367655,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1627952215,"body":"@scrub\nLooks like someone really wants to argue in the comment section of a hentai work containing thing they don't like and therefore want- needs to have it remove entirely, as if there weren't so many (probably even more) works featuring either the typical jap main character, the standard generic jap self-insert design used by most (with the same fucking hair, face, build and peanut skin color, occasionally glasses or eye/faceless, eg: harem/isekais/romcoms/shonen power fantasy action/mobile gachas cashgrabs with an enfacis on \"player = master, loads of combat girls = slaves under command\" or in some cases even buff characters (which are the same as the others, but buffed up).\nPoint is, there are a vast amounts of options out there and yet there you individuals are, \"reeee-ing\" about it and trying to pick fights on comment section of works that upset you. Can't fucking make this up, it's simply bizarre really. Oh and the best part? You bunch always come back for more. Always."},{"id":1917003,"gallery_id":367655,"poster":{"id":2568165,"username":"Starkout","slug":"starkout","avatar_url":"avatars/2568165.png?_=5ead24d6b4313477","is_superuser":false,"is_staff":false},"post_date":1627932592,"body":"Remind me of A korean movie SILENCED\n"},{"id":1916810,"gallery_id":367655,"poster":{"id":1391820,"username":"HAHA NICE","slug":"haha-nice","avatar_url":"avatars/1391820.png","is_superuser":false,"is_staff":false},"post_date":1627926817,"body":"I love loli tags, but this doujin fix me"},{"id":1916773,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1627925619,"body":"That doesn't fix the inherent issue. \nJust think about how many doujins would just improve by replacing fat bastards with at least normal looking people. It's not an instance where the thing that lowers the end quality is the core point of the work. For instance . You can't remove ntr from an ntr story because that is the point of the story is that it's a power fantasy about taking someone's girl away. If you have a problem with ntr then there is no way to fix this aspect without removing the core point if the work. With fat bastards however you can improve literally every work they appear in by swapping them out for good looking or at least decent looking guys. Ratatatatata 74 is doing that and his popularity is booming. \nDo you guys find fat, disgusting,ugly bastards so incredibly relatable ? I don't get it. "},{"id":1916402,"gallery_id":367655,"poster":{"id":3792654,"username":"Allstar803","slug":"allstar803","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1627914804,"body":"For the people who hate fat bastards, you do realize you can blacklist the 'bbm' and 'dilf' tag, right?"},{"id":1915453,"gallery_id":367655,"poster":{"id":3037546,"username":"Dunnowatudu","slug":"dunnowatudu","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1627881057,"body":"Gagak meneh wkwkw asw asw"},{"id":1915154,"gallery_id":367655,"poster":{"id":1887980,"username":"oldFart_Jiancuk","slug":"oldfart_jiancuk","avatar_url":"avatars/1887980.png?_=d82ea549aca614a9","is_superuser":false,"is_staff":false},"post_date":1627872855,"body":"I bet a lot of children there actually his"},{"id":1915110,"gallery_id":367655,"poster":{"id":1684748,"username":"D0NaTz","slug":"d0natz","avatar_url":"avatars/1684748.png?_=2210fc31557b44f6","is_superuser":false,"is_staff":false},"post_date":1627871741,"body":"Quote kang TL nya njirr"},{"id":1914757,"gallery_id":367655,"poster":{"id":2215852,"username":"IDiedForHentaiSins","slug":"idiedforhentaisins","avatar_url":"avatars/2215852.png?_=06697ff9edc85f07","is_superuser":false,"is_staff":false},"post_date":1627861360,"body":"This is some sexual cult starter set, but with extra steps."},{"id":1914625,"gallery_id":367655,"poster":{"id":2330085,"username":"undeadbone69","slug":"undeadbone69","avatar_url":"avatars/2330085.png","is_superuser":false,"is_staff":false},"post_date":1627857638,"body":"This got translated but the 2nd part of Houkago Dairizuma still hasn't. WTF???"},{"id":1914600,"gallery_id":367655,"poster":{"id":927029,"username":"engineerkitty","slug":"engineerkitty","avatar_url":"avatars/927029.png","is_superuser":false,"is_staff":false},"post_date":1627856323,"body":"I mean....she happy i guess"},{"id":1914390,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1627849958,"body":"@Edholla \nYou should really google your buzzwords before you use them. Just because you can relate to the fat bastard doesn't mean it works for the rest of us "},{"id":1914228,"gallery_id":367655,"poster":{"id":2723555,"username":"Prince Cumelot","slug":"prince-cumelot","avatar_url":"avatars/2723555.png?_=1f0d2dfd837e2bb4","is_superuser":false,"is_staff":false},"post_date":1627844360,"body":"This shit is so bland"},{"id":1914147,"gallery_id":367655,"poster":{"id":3215420,"username":"Lewd dinoz","slug":"lewd-dinoz","avatar_url":"avatars/3215420.png?_=ca5d19513ceee98c","is_superuser":false,"is_staff":false},"post_date":1627841711,"body":"My daddy issues feel happy"},{"id":1914006,"gallery_id":367655,"poster":{"id":3776196,"username":"EDHOLLA","slug":"edholla","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627837382,"body":"Fat bastard is awesome the cucks under me are mad because they’re virgins "},{"id":1913918,"gallery_id":367655,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1627834709,"body":"Why the fat bastard tho ? \nIt's just disgusting. \nLiterally everything gets worse with a fat bastard"},{"id":1913901,"gallery_id":367655,"poster":{"id":791555,"username":"AnchiraWantMyBanana","slug":"anchirawantmybanana","avatar_url":"avatars/791555.png","is_superuser":false,"is_staff":false},"post_date":1627834138,"body":"What a nice guy. Pick up homeless girl and give her all the love she need 🥰. Now she's a happy momma 🥰"},{"id":1913819,"gallery_id":367655,"poster":{"id":4439116,"username":"♍VoidTraveler","slug":"voidtraveler","avatar_url":"avatars/4439116.png?_=46f7fc2a402accc2","is_superuser":false,"is_staff":false},"post_date":1627831935,"body":"Okay fuck it, it felt disgusting enough to read about orphanage, but i decided i can't do it when the word \"daddy\" appeared."},{"id":1913723,"gallery_id":367655,"poster":{"id":4476573,"username":"Vastcall","slug":"vastcall","avatar_url":"avatars/4476573.png?_=05bbec0ce0396d7f","is_superuser":false,"is_staff":false},"post_date":1627828795,"body":"Why this is one of the most popular?\nThis website is going crazy man"},{"id":1913702,"gallery_id":367655,"poster":{"id":1082672,"username":"Synonym","slug":"synonym","avatar_url":"avatars/1082672.png?_=d83ab8595501a893","is_superuser":false,"is_staff":false},"post_date":1627828399,"body":"Shit, the author knows"},{"id":1913538,"gallery_id":367655,"poster":{"id":3992420,"username":"DefinetlyNotaWeeb","slug":"definetlynotaweeb","avatar_url":"avatars/3992420.png?_=5ac0868332cfeeb1","is_superuser":false,"is_staff":false},"post_date":1627823609,"body":"People in this site need to learn what a dilf is..."},{"id":1913356,"gallery_id":367655,"poster":{"id":2580641,"username":"Jousebu Sutarin☭","slug":"jousebu-sutarin","avatar_url":"avatars/2580641.png?_=c334ee92bb8f8e8f","is_superuser":false,"is_staff":false},"post_date":1627817055,"body":"The girl looks almost the same with author's other work lol"},{"id":1913189,"gallery_id":367655,"poster":{"id":1561236,"username":"NeatoRARE","slug":"neatorare","avatar_url":"avatars/1561236.png?_=73ad2459c2b9953f","is_superuser":false,"is_staff":false},"post_date":1627810805,"body":"Anyone remember that creepypasta of some doctor who \"adopts\" orphan girls and turns them into sex slaves? Not sure why I suddenly remember that while reading this"},{"id":1913147,"gallery_id":367655,"poster":{"id":3357220,"username":"That random degenerate","slug":"that-random-degenerate","avatar_url":"avatars/3357220.png?_=95f0f2bb55bc5b7c","is_superuser":false,"is_staff":false},"post_date":1627809516,"body":"How come this is translated earlier than the artist's other works? weird. "},{"id":1913143,"gallery_id":367655,"poster":{"id":1089869,"username":"prama99","slug":"prama99","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1627809419,"body":"bangke... page terakhir  adalah konspirasi tim gagak hitam"},{"id":1913079,"gallery_id":367655,"poster":{"id":1845547,"username":"zGuQ","slug":"zguq","avatar_url":"avatars/1845547.png","is_superuser":false,"is_staff":false},"post_date":1627807095,"body":"i really love  girls with glasses or the megane tag in general, but feel bad for them cuz they have this stigma of getting involved with uglybastards smfh\n"},{"id":1913043,"gallery_id":367655,"poster":{"id":261212,"username":"Nudeclear","slug":"nudeclear","avatar_url":"avatars/261212.png?_=347810fb81a2da19","is_superuser":false,"is_staff":false},"post_date":1627805530,"body":"This Richard guy been dropping bangers next after another, I better keep my eyes on him, he's making moves in this industry!"},{"id":1913001,"gallery_id":367655,"poster":{"id":754605,"username":"goatsin69","slug":"goatsin69","avatar_url":"avatars/754605.png?_=7616740d5d1e0fba","is_superuser":false,"is_staff":false},"post_date":1627804585,"body":"Damn really that nite from the last page triggers me! Do you think asking readers to amswer your question is good? Hell Ueah"},{"id":1912896,"gallery_id":367655,"poster":{"id":3910144,"username":"Outlaw_Christian","slug":"outlaw_christian","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627801692,"body":"Ayo this is first time i'm seeing this Pepsi man account being serious, holy cow."},{"id":1912843,"gallery_id":367655,"poster":{"id":3338098,"username":"The Pepsi In The Comments","slug":"the-pepsi-in-the-comments","avatar_url":"avatars/3338098.png?_=7fa5182ffaa43002","is_superuser":false,"is_staff":false},"post_date":1627800405,"body":"Also, subscribe to Oppai-Sama on YouTube. They got some real good hentai codes and great posts almost everyday!"},{"id":1912839,"gallery_id":367655,"poster":{"id":3338098,"username":"The Pepsi In The Comments","slug":"the-pepsi-in-the-comments","avatar_url":"avatars/3338098.png?_=7fa5182ffaa43002","is_superuser":false,"is_staff":false},"post_date":1627800283,"body":"Actually no, NOT cool. I don’t like how this nigga did her. Fuckin’ filthy ass bastard. Mf can’t get even pick up a whore off the street, so he goes after some innocent kids. Normally, I don’t ever, EVER condone suicide since I’ve attempted it more times than I can count, but this fuck should do it in the most painful way. I know this just a doujin, but I honestly can’t tolerate fuck niggas who don’t want their partner to feel pleasure via consent, and only delving on their own lust. This is NOT the way of the dominant male gang. STAND DOWN."},{"id":1912814,"gallery_id":367655,"poster":{"id":3338098,"username":"The Pepsi In The Comments","slug":"the-pepsi-in-the-comments","avatar_url":"avatars/3338098.png?_=7fa5182ffaa43002","is_superuser":false,"is_staff":false},"post_date":1627799535,"body":"MM... I don’t KNOW about this one... I wanna say “Cool.” But I’m getting a really uneasy feeling in this doujin..."},{"id":1912600,"gallery_id":367655,"poster":{"id":4510734,"username":"Kassandra<3fatbastards","slug":"kassandra-3fatbastards","avatar_url":"avatars/4510734.png?_=f6b2dbbf4d7a0d65","is_superuser":false,"is_staff":false},"post_date":1627793956,"body":"I want to be raped by gross fat old men : GothKassandra#3212 discord"},{"id":1912236,"gallery_id":367655,"poster":{"id":2509899,"username":"DgGs","slug":"dggs","avatar_url":"avatars/2509899.png?_=b9b12fc71aeb6153","is_superuser":false,"is_staff":false},"post_date":1627785878,"body":"The story is good, but it would be better if the guy was not the \"ugly bastard\". At least make a quite handsome guy."},{"id":1911908,"gallery_id":367655,"poster":{"id":3378229,"username":"Kuskus","slug":"kuskus","avatar_url":"avatars/3378229.png?_=d758a0f8cb939ce1","is_superuser":false,"is_staff":false},"post_date":1627775246,"body":"Author didn't lie in his postface, i nutted"},{"id":1911873,"gallery_id":367655,"poster":{"id":754385,"username":"MeniL","slug":"menil","avatar_url":"avatars/754385.png","is_superuser":false,"is_staff":false},"post_date":1627773816,"body":"Bruh                   "},{"id":1911530,"gallery_id":367655,"poster":{"id":4289277,"username":"Msfan","slug":"msfan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627760343,"body":"Meh. Mediocre. "},{"id":1911470,"gallery_id":367655,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1627758345,"body":"Let us unite if ever someone decides to hate this ok guys?"},{"id":1911430,"gallery_id":367655,"poster":{"id":653865,"username":"lord zero","slug":"lord-zero","avatar_url":"avatars/653865.png","is_superuser":false,"is_staff":false},"post_date":1627757333,"body":" The art is so good. I have been studiying some digital art recently and i can see clearly all the brushes he is using. Good shit."},{"id":1911403,"gallery_id":367655,"poster":{"id":68048,"username":"Stellarium","slug":"stellarium","avatar_url":"avatars/68048.png","is_superuser":false,"is_staff":false},"post_date":1627756229,"body":"Are we sure this isn't Maruwa Tarou?  The artstyle similarity is uncanny."},{"id":1911393,"gallery_id":367655,"poster":{"id":3738461,"username":"Oresama da","slug":"oresama-da","avatar_url":"avatars/3738461.png?_=1ec7d82deddc9b84","is_superuser":false,"is_staff":false},"post_date":1627755874,"body":"Why not just make a normal dude instead bbm"},{"id":1911295,"gallery_id":367655,"poster":{"id":1539140,"username":"stylecontent","slug":"stylecontent","avatar_url":"avatars/1539140.png?_=979f588540ee7e59","is_superuser":false,"is_staff":false},"post_date":1627753107,"body":"Uenak Tenan Cook"},{"id":1911155,"gallery_id":367655,"poster":{"id":3092014,"username":"BENTHOS","slug":"benthos","avatar_url":"avatars/3092014.png?_=8d1bda19cefd8477","is_superuser":false,"is_staff":false},"post_date":1627748913,"body":"Still waiting for part 2 of the China daughter from this artist to get translated"},{"id":1911115,"gallery_id":367655,"poster":{"id":2802901,"username":"whatthefuck111","slug":"whatthefuck111","avatar_url":"avatars/2802901.png","is_superuser":false,"is_staff":false},"post_date":1627747128,"body":"wedew, this is something to bust my nut on for sure."},{"id":1911074,"gallery_id":367655,"poster":{"id":2738613,"username":"hacaro","slug":"hacaro","avatar_url":"avatars/2738613.png?_=e99e2373e2cac5f7","is_superuser":false,"is_staff":false},"post_date":1627745167,"body":"Goof sht.     "},{"id":1911047,"gallery_id":367655,"poster":{"id":2772711,"username":"SeeYouInHell","slug":"seeyouinhell","avatar_url":"avatars/2772711.png","is_superuser":false,"is_staff":false},"post_date":1627744221,"body":"497 short hair = i lost Kreygasm"},{"id":1911040,"gallery_id":367655,"poster":{"id":1392237,"username":"Kergrer","slug":"kergrer","avatar_url":"avatars/1392237.png","is_superuser":false,"is_staff":false},"post_date":1627744058,"body":"@terence0709 The fact it's real makes it even better"},{"id":1911013,"gallery_id":367655,"poster":{"id":4162039,"username":"nippalhaim","slug":"nippalhaim","avatar_url":"avatars/4162039.png?_=49d0897594ab025b","is_superuser":false,"is_staff":false},"post_date":1627742945,"body":"sungkem pada lord gagak ireng"},{"id":1910948,"gallery_id":367655,"poster":{"id":2084578,"username":"jkdewa18","slug":"jkdewa18","avatar_url":"avatars/2084578.png?_=c7e75e1242bba2e8","is_superuser":false,"is_staff":false},"post_date":1627740363,"body":"Panti asuhan sesat"},{"id":1910896,"gallery_id":367655,"poster":{"id":1596644,"username":"terence0709","slug":"terence0709","avatar_url":"avatars/1596644.png?_=953c2c7c80e22bd9","is_superuser":false,"is_staff":false},"post_date":1627737633,"body":"not to soften your boners but... there are actually plenty real stories of these in 3rd world countries. difference is the fat rich dude won't care once she's knocked up. What a world we live in right?"}]