[{"id":2147546,"gallery_id":367879,"poster":{"id":2413010,"username":"Admin [✅]","slug":"admin","avatar_url":"avatars/2413010.png?_=0ff478cf936f1944","is_superuser":false,"is_staff":false},"post_date":1637117808,"body":"It become meh story"},{"id":1971716,"gallery_id":367879,"poster":{"id":2126698,"username":"SlutSlayer007","slug":"slutslayer007","avatar_url":"avatars/2126698.png?_=bcba218944fbfd18","is_superuser":false,"is_staff":false},"post_date":1629873919,"body":"Is hard for the writers to write an Revenge NTR or something. Cause all i see is the same NTR shit it's either the girl hoeing for the dick or its a gangbang.  Like seriously get something new dude's."},{"id":1942937,"gallery_id":367879,"poster":{"id":4450147,"username":"kamil254","slug":"kamil254","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628880749,"body":"So she romantically likes one friends but sex is better with the other friend. "},{"id":1940790,"gallery_id":367879,"poster":{"id":362846,"username":"Masterped","slug":"masterped","avatar_url":"avatars/362846.png?_=7aa247a134a520de","is_superuser":false,"is_staff":false},"post_date":1628797597,"body":"can he comeback ?"},{"id":1918495,"gallery_id":367879,"poster":{"id":592653,"username":"bukoug","slug":"bukoug","avatar_url":"avatars/592653.png","is_superuser":false,"is_staff":false},"post_date":1627980641,"body":"What's the point of making sequels if it's the same exact thing all over again? The real pity here is not even the current situation, it's what will happen later. Clearly, the protagonist will never be able to trust anyone after this, possibly developing trauma. To be honest, a sequel where he learns to cope with his past will definitely be far more interesting than this unoriginal and repetitive mess. Right now, the one who has to move on is not the protagonist but the author. "},{"id":1918298,"gallery_id":367879,"poster":{"id":2223616,"username":"Hmm omoshiroi","slug":"hmm-omoshiroi","avatar_url":"avatars/2223616.png?_=ea0db8aa211d43d1","is_superuser":false,"is_staff":false},"post_date":1627974020,"body":"Why tf does he looks like kei tsukishima"},{"id":1917023,"gallery_id":367879,"poster":{"id":4495523,"username":"hbrosius","slug":"hbrosius","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627933089,"body":"This whole situation is a mess \n😭 and toxic as hell bro "},{"id":1916994,"gallery_id":367879,"poster":{"id":51183,"username":"andresk","slug":"andresk","avatar_url":"avatars/51183.png","is_superuser":false,"is_staff":false},"post_date":1627932354,"body":"This manga seems to me with very good art but it irritates me too much the protagonist is a complete fag, in this manga the antagonist his friend gives him the opportunity to fuck his beloved whenever he wants with the freedoms he wants (I add him to the group of sexual friends ) Instead of conquering her by demonstrating his sexual desire, he decides to get scared and look pathetically bad after a single push, I understand that it could happen to you once but already two and also after that always run away, man, do something, kiss her, caress her, recover and keep fighting for your girl (or will it be that he only gets one shot, I can't believe that), in other netarare manga I have seen that the protagonist leaves his life fighting until the end, but here the mc has everything served and does nothing, I glad that the girl begins to think better what she wants, in the next chapter I think we will see a very rough sex camp in the house of the blonde, after this she will not have a chanc"},{"id":1916988,"gallery_id":367879,"poster":{"id":51183,"username":"andresk","slug":"andresk","avatar_url":"avatars/51183.png","is_superuser":false,"is_staff":false},"post_date":1627932190,"body":"este manga me parece con muy buen arte pero me irrita demasiado el protagonista es un completo maricón, en este manga el antagonista su amigo le da la oportunidad de follarse a su amada cuando quiera con las libertades que quiera (lo agrego al grupo de amigos sexuales) en vez de conquistarla demostrando su deseo sexual decide asustarse y quedar patéticamente mal tras un solo empujón, entiendo que te pueda pasar una vez pero ya dos y ademas después de eso siempre salir corriendo hombre has algo, bésala acariciarla recuperate y sigue luchando por tu chica (o sera que solo le da para un disparo, no puedo cree eso), en otros mangas netorare he visto que el protagonista se deja la vida y aun así pierde luchando hasta el final, pero aquí el tío tiene todo servido y no hace nada, me alegra que la chica empiece a pensar mejor lo que desea, en el siguiente capitulo creo que veremos un campamento de sexo muy rudo en la casa del rubio, después de esto ya no tendrá ni una oportunidad  "},{"id":1916942,"gallery_id":367879,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1627930932,"body":"Just move on dude, you lost from the start..."},{"id":1916569,"gallery_id":367879,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1627919855,"body":"@omegaindebt - If it follows the usual recipe then we still have to see the girl get gangbanged, the girl tell the beta she can't live without the alpha's cock, and the beta choose to be a cuck or move on."},{"id":1916256,"gallery_id":367879,"poster":{"id":3732000,"username":"omegaindebt","slug":"omegaindebt","avatar_url":"avatars/3732000.png?_=26d87c2e8a619b32","is_superuser":false,"is_staff":false},"post_date":1627908780,"body":"How fucking long is this shitshow gonna go on for. I mean it has already been three chapters and all we see is the same cucke being the fuck and the same bull being the bull and the same cock-whore being the cock-whore. This shot just keeps repeating and nothing new is coming on and the author even has the balls to write that the next one is coming. Fucking hell, just put that fuck out of his misery and let the slut choose the fucking bull over him. Atleast then there won't be any more sequels to this mild aas shit"},{"id":1916079,"gallery_id":367879,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1627901763,"body":"Good art but horrible story, guess it will be placed in the popular now pool, as the average hentai gooner loves such stories."},{"id":1916021,"gallery_id":367879,"poster":{"id":35030,"username":"foxdash","slug":"foxdash","avatar_url":"avatars/35030.png","is_superuser":false,"is_staff":false},"post_date":1627899458,"body":"isn't it funny when japanese men, when they look to a hot girl they're all like \"if this girl is this hot and don't wanna be with me, then she's not gonna be for anybody\" and then act like girls, bein envy and jaded to guys she approaches. like... man this is so dumb and childish! same goes to idol girls, they must be like real \"angels\" and \"pure\" man i can't respect people who act like that! that's why i hate idols... not the idols per se, but what they represent in their society"},{"id":1915973,"gallery_id":367879,"poster":{"id":3364290,"username":"Akip0y0","slug":"akip0y0","avatar_url":"avatars/3364290.png?_=3c9e3d0eaf1b91f3","is_superuser":false,"is_staff":false},"post_date":1627897757,"body":"sHe bElOngS tO tHe StReEtS"},{"id":1915900,"gallery_id":367879,"poster":{"id":266627,"username":"SnooSnoo","slug":"snoosnoo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627895141,"body":"Did no one translate the super cringe 2nd chapter? There was one page where the MC was still going \"Hey even if it was just the tip I 'came' inside her! Only I did!\" while the glasses chad full on emptied his balls into her pussy.\n\nThe MC never even broke her hymen lmao. He's so beta I feel like the glasses dude is the MC."},{"id":1915780,"gallery_id":367879,"poster":{"id":4069858,"username":"The Mischievous Gentleman","slug":"the-mischievous-gentleman","avatar_url":"avatars/4069858.png?_=1862f47404851cef","is_superuser":false,"is_staff":false},"post_date":1627891418,"body":"See this on popular I guess."},{"id":1915756,"gallery_id":367879,"poster":{"id":4177002,"username":"qwerty_asdf__","slug":"qwerty_asdf__","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1627890678,"body":"damn man I tried to read NTR doujinshi to control my emotions but damn even thought I only look at the scenes and not the story I can still know how will the story proceeds. Damn I wish what happens in doujinshi stays in doujinshi, but I can't get out of my head that it also happens everyday in real life, especially the cucks and the innocent-but-soon-to-be-whore big dick lover. Well what can I say, putting aside my comment the art still amaze me, I hope the MC move on and have a new happy life or go buy some penis enlarger pills then impregnate the girl or the cuck's mom to take revenge. \\_(ツ)_/"},{"id":1915647,"gallery_id":367879,"poster":{"id":1356967,"username":"bohlsbbt","slug":"bohlsbbt","avatar_url":"avatars/1356967.png?_=7566a6fb51b66e2a","is_superuser":false,"is_staff":false},"post_date":1627886521,"body":"This is the first time seeing glasses chad cucker"},{"id":1915644,"gallery_id":367879,"poster":{"id":3947018,"username":"TJ456","slug":"tj456","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627886415,"body":"Go “train” and fuck his mom, this is hentai so who knows."},{"id":1915631,"gallery_id":367879,"poster":{"id":3950489,"username":"MangKanor v4.20","slug":"mangkanor-v4-20","avatar_url":"avatars/3950489.png?_=e2496219a49001b4","is_superuser":false,"is_staff":false},"post_date":1627885906,"body":"damn @sir robin "},{"id":1915604,"gallery_id":367879,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1627884946,"body":"Meh... No surprises here. Friend's a royal douche and girl's now a broken whore. Only thing left for part 4 is to rub it in MC's face. Though glasses did give the chump two chances to satisfy the skank. The rookie just couldn't deliver. Time to move on bro. If you can't fix your quickshot problem then at least start using ED pills and have a soapland training montage."}]