[{"id":1960503,"gallery_id":368097,"poster":{"id":1951146,"username":"Rozotoko","slug":"rozotoko","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629494393,"body":"NTR deserves to be kinkshamed.  There's something wrong with the people that enjoy it.  And the mangakas that only make NTR.  \nSeek professional help, and never get in a relationship.  Man, what a waste of talent."},{"id":1924634,"gallery_id":368097,"poster":{"id":4368210,"username":"Susan07k","slug":"susan07k","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628185026,"body":"lets fuck tonight. for fast contact sign up here (  litelink.at/n_hentai ) my id 31290"},{"id":1923760,"gallery_id":368097,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1628158845,"body":"I'm not a native speaker tho? Great arguments lol. Not talking further, your brain is rotten, it's like talking to a baboon kusa"},{"id":1922397,"gallery_id":368097,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1628111648,"body":"Further explaining the pirating stuff, take anime as an example, the cost for it's works and merchandise is high for japanese people in general, what about people outside of japan that need to pay more fees in order to make use +the time it takes to reach them. And don't even talk about streaming plataforms in this case, we all know it's rubbish. For doujins, to properly read them, one would need to learn japanese, or wait for an OFFICIAL/AUTHORIZED translation that god knows IF it will ever be done. Pirating might not be right or the better course but it also got it's meaning and importance and wont ever die out until poverty and other problems are delt with properly."},{"id":1922374,"gallery_id":368097,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1628111053,"body":"@DRRNTR first of all, I said \"guy\" in a generalized sense, and it's of no importance what gender the author identifies or is biologically to this conversation. Second, we all have the right to state our minds and trying to stop that is what annoying dumb fucks like you do. Third, you're in a pirate site so don't talk shit about that when you yourself are making use of it and furthermore don't ignore the importance of those sites, since they bring accessibility to the masses. Forth you lost the entire purpose of our civilised discussion, also blowing it up idiotically and Fith, not even touching this generation bullshit, it's cause of u toxic shits that a lot of people look down on the ntr gang."},{"id":1921619,"gallery_id":368097,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628086243,"body":"@Zanuska Hey it's fine, man. As for me, I just felt like I had something to say to your comment but in the end, you're free to have your own expectations on whatever doujins you read. At best, I was just merely suggesting. Glad we got this one out without much arguing. Have a good one."},{"id":1921435,"gallery_id":368097,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1628081143,"body":"@DrinksandDame Yeah maybe I was a over the top and it was stupid to talk about good writing just because of the material's length. It's like saying that, because it's a first place medal, it should be made of gold and the likes. My error there but it's true that, overall, this work isn't for me one way or another... That was what got me irritated enough to even rant uselessly after all..."},{"id":1921367,"gallery_id":368097,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628078545,"body":"@Zanuska Having such takeaway from reading porn like the one you gave is rare since this is primarily a fap material. It's nice that you're reading these beyond the fap, but I don't think you should be expecting most or all doujins (of NTR?) to have one even if they are on the lengthly side. In the end, most doujins regardless of genre and length are \"usually\" the kind of read where you can just turn off your brain and still enjoy. This definitely doesn't excuse bad writing but in this work's case, it just seems like you were setting your standards uncessecarily high and was easily disappointed. I myself have read some that excelled in portraying human's train of thoughts and society, but I don't think doujin authors need to have such intricate writing to sell their works. Nevertheless, that is something I also appreciate whenever I find one. If you feel like what I said here doesn't apply to you, then my main point earlier stands: that this work, chance are, is just not for you."},{"id":1921118,"gallery_id":368097,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1628068120,"body":"@DrinksandDame What I really mean is that, if you're doing so much pages then isn't it kinda natural to expect a bit of work in writing as well? For exemple, I like the part where she talks about how we can only hold on because of our sins. It takes you out of your shell to realize that following a strict moral conduct is nearly impossible since we are flexible creatures with emotions that change flows like a river, so those errors and sins are like pain reliefs. Aside from that I don't see anything worth while in his writing, but again, just wanted to get this off me senseless lol"},{"id":1921008,"gallery_id":368097,"poster":{"id":46343,"username":"x789965414","slug":"x789965414","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1628064992,"body":"這部作品終於變成單行本了⋯⋯這麼多段的劇情總算都拼湊起來變成一本漫畫了，如果是純愛就更好了哈哈⋯⋯可惜了作者畫風這麼美"},{"id":1920920,"gallery_id":368097,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628062776,"body":"@Zanuska I think the conclusion there is that this work is just not for you. Don't expect all works to be right up to your standards just because you're fine with its genre. Treat it just like any other porn where there are good ones and bad ones for your taste. All you have to do is move on if you unfortunately find one that didn't fit what you like. That's all."},{"id":1920666,"gallery_id":368097,"poster":{"id":2406139,"username":"hentai tensai","slug":"hentai-tensai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1628055608,"body":"all we need now is to have someone combine the translations into a single compilation "},{"id":1920242,"gallery_id":368097,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1628044994,"body":"Ah shit, here we go again. Nothing new here, just a tankoubon all parts compiled into one with all the content related to this series, including the extra colored pages and all."},{"id":1920131,"gallery_id":368097,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1628041445,"body":"It's just my opinion on a personal matter but at least it got a bit of reason I guess?"},{"id":1920127,"gallery_id":368097,"poster":{"id":2511860,"username":"Zanuska","slug":"zanuska","avatar_url":"avatars/2511860.png?_=55bd69ab98ac4a6b","is_superuser":false,"is_staff":false},"post_date":1628041323,"body":"I know there's people that like ntr and all but this guy's works and some others as well are just unbelivable. Like, motherfucker you're doing more than just 3 fucking chapters, you got almost 300 pages to work on and you still do some crappy shit? U wanna do ntr all right i'll just not fap but if you're putting so much work into it at least make it readable"}]