[{"id":1953867,"gallery_id":369660,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629251925,"body":"Simple summary here: JK Girl just came home after making out with some middle aged man in a net cafe(?). Turns out, he was a dude that she plays game and video chat with a lot online. He didn't know she was a JK until that meetup. Actually, they already met by chance before that but girl ran away cuz it was too sudden for her. So as an apology she offered to go somewhere with him and so that's the net cafe meet up thing. Girl faps to their making out at home when guy texted asking to meet again. Next day, she be talking to her friends and they confronted her about the man. She casually admits she likes him. He's a nice guy, but friends tells her to still be careful. On to their meetup, well... they went to do sex right away anyway. Hottest scene for me was when guy was pressuring girl to say she likes her back to which she did say eventually. Happy end. skipped some details here and there but that's the story pretty much."},{"id":1953843,"gallery_id":369660,"poster":{"id":1721722,"username":"kuuga03","slug":"kuuga03","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629250954,"body":"I thought that the girl on the cover was Edelgard from Fire Emblem "},{"id":1953838,"gallery_id":369660,"poster":{"id":3859400,"username":"zenmon","slug":"zenmon","avatar_url":"avatars/3859400.png?_=c4c4d26773bf7543","is_superuser":false,"is_staff":false},"post_date":1629250688,"body":"This person below me spitting facts"},{"id":1953666,"gallery_id":369660,"poster":{"id":3825600,"username":"Prf.NTR","slug":"prf-ntr","avatar_url":"avatars/3825600.png?_=f791d735ed572eb0","is_superuser":false,"is_staff":false},"post_date":1629246069,"body":"Actually I'm surprised that it wasn't ntr or mind control/hypnosis. Bc if you just look on the cover page it feels like there would be an ugly bastard involve or there would be some cheating scene, but there's not, it's just pure \"Diabetes\"\n"}]