[{"id":2071103,"gallery_id":369921,"poster":{"id":4141202,"username":"GIL","slug":"gil","avatar_url":"avatars/4141202.png?_=204969cb4efc05d2","is_superuser":false,"is_staff":false},"post_date":1633800041,"body":"@anonymouslybrowsing send the link please. Which site did you read it on? "},{"id":2067952,"gallery_id":369921,"poster":{"id":4404795,"username":"averagefartenjoyer","slug":"averagefartenjoyer","avatar_url":"avatars/4404795.png?_=1e08dc1bf1663a1d","is_superuser":false,"is_staff":false},"post_date":1633681143,"body":"what an actual disappointment lmfao"},{"id":2065113,"gallery_id":369921,"poster":{"id":3519325,"username":"✨Tachibana Rui✨","slug":"tachibana-rui","avatar_url":"avatars/3519325.png?_=d76564927be8c973","is_superuser":false,"is_staff":false},"post_date":1633577846,"body":"@anonymouslybrowsing where did you read it? Please send the link"},{"id":2061317,"gallery_id":369921,"poster":{"id":4160451,"username":"anonymouslybrowsing","slug":"anonymouslybrowsing","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1633424644,"body":"Ch 5 shows a picture of fmc with (not certain) the chef kinda dude having sex(but the genital parts weren't showed, she was also enjoying it but again they might not be having sex),and the mc called her but the fmc was moaning(?), I didn't translate it but I'm pretty sure that's what's happening( high ntr potential so stop reading it if you want some vanilla) fmc is probably a cheating slut by now"},{"id":2053435,"gallery_id":369921,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1633099128,"body":"Ch 5 was released as of the time of this post oct 1 2021 \n\nHere is a google translated summary\n\n\"Itai Amai Episode 5\"\nSuma feels happy with Amuro's handmade bento. However, behind her in the photo sent to her smartphone is a glimpse of a naked man!\nAnd is there a kiss mark on your body? What do you mean by Mr. Amuro! ??"},{"id":1977186,"gallery_id":369921,"poster":{"id":2429217,"username":"Melufa","slug":"melufa","avatar_url":"avatars/2429217.png","is_superuser":false,"is_staff":false},"post_date":1630083921,"body":"Go full NTR with AV video please."},{"id":1969578,"gallery_id":369921,"poster":{"id":3219074,"username":"Shheerrlleeffff","slug":"shheerrlleeffff","avatar_url":"avatars/3219074.png?_=1d83770ebed37079","is_superuser":false,"is_staff":false},"post_date":1629799786,"body":"Yooowwwwwww NTR arc is here myguys"},{"id":1968962,"gallery_id":369921,"poster":{"id":1053889,"username":"morningrain","slug":"morningrain","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629780176,"body":"If she did cheat on him, I bet she would gladly tell him with a smile and saying that it was part of the job that she  dreamed or maybe a sexual training kekw. "},{"id":1966555,"gallery_id":369921,"poster":{"id":4160451,"username":"anonymouslybrowsing","slug":"anonymouslybrowsing","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1629690184,"body":"100% ntr, pretty sad shit but you could always find a much better vanilla if you just browse nhentai, you could even find a better artist(which is obvious lol)"},{"id":1963571,"gallery_id":369921,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1629595683,"body":"Honestly i can see this going the it was all bait route and paranoid sensei cheats first with houra thinking it's justified, &amp; then karin finds out so she ntr's him with every tom dick &amp; harry that he had suspicions about. She most likely does av as well, but i guess it's all just conjecture at this point. Anyway @DrinksandDame your summaries are excellent &amp; much appreciated thanks."},{"id":1962538,"gallery_id":369921,"poster":{"id":1681961,"username":"enochi","slug":"enochi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629563103,"body":"Also, it doesn't really help that the sensei cant speak up and acts like a keyboard warrior"},{"id":1962518,"gallery_id":369921,"poster":{"id":1681961,"username":"enochi","slug":"enochi","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629562663,"body":"For fcks sake, I have no problems with ntr, but did it really have to happen to one of the few vanilla's that I actually took a liking too? At this point, I just hope this wont last 30 chapters like the authors previous work"},{"id":1962503,"gallery_id":369921,"poster":{"id":4141202,"username":"GIL","slug":"gil","avatar_url":"avatars/4141202.png?_=204969cb4efc05d2","is_superuser":false,"is_staff":false},"post_date":1629562227,"body":"@DrinksandDame Thank you so much, after reading your summary i kinda have a very very slight hope that it won't turn into NTR, but it sure is SUS. I'd say there's still 80% chance this might turn into ntr considering the Author's other works, then again thanks for the translation hope to see you again when chapter 5 comes out XD"},{"id":1962400,"gallery_id":369921,"poster":{"id":944227,"username":"ffunor","slug":"ffunor","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629558791,"body":"身為Jimny車主 這集真的讚"},{"id":1962220,"gallery_id":369921,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629553665,"body":"Afterword: It took quite a while for this chapter to come out and it looks like we won't get a new chapter again next month unless there are some changes.\nSorry if the summaries are longer now. At this point, anything can be relevant so I don't want to skip too much details. Also, this is the Chinese upload so I had to wait for the Japanese one so I can read. Hope ya'll don't mind if I post this comment again once the Japanese one is uploaded here."},{"id":1962215,"gallery_id":369921,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629553513,"body":"(3/3) Yay for stickers. But sensei gotta punish her for coming to work braless. Can't spank her now so he punishes her by tying her hands up and making her admit that she likes hard sex play. Then he did this weird play thing where he left her alone tied and naked in the car. The rest is sex and her peeing when she came cuz she been holding back that one for a while. They arrived home with chef boy outside. Apparently they're neighbors. Before going inside, she gave sensei a flashdrive containing the photoshoot data for sensei to feast on at home. She walks away with chef boy and they're talking about the nutrient drink again. Big sus butt touch here, but sensei believes in her. When sensei got home, he did not feast on Karin's pics, but looked up Houra's AV instead. He decides to not tell Karin about the AV thing... but this made Sensei sus of the company they're working with. TBC. "},{"id":1962208,"gallery_id":369921,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629553216,"body":"(2/3) This ain't quite exactly about marriage but rather gravure models use screen names and she wanted to use sensei's surname. This is just a small talk but the point is, she now goes with Rinka Nonami as her gravure name. Sensei then asks her what happened in the fitting room with Cman. She says that she was done changing when he came in and he just taught her how to pose that's why she was breathing heavily when she came out. He was a little touchy but she thinks it was part of the job. Still, Sensei insists that she should say No to that. This led into an argument but she made it clear that she has no eyes for any other man except Sensei. With an embarrassed face, Sensei asked why she even like him in the first place. Apparently, she really liked this painting that Sensei made wondering what kind of person the artist is. So she went her way to learn more about him. She eventually fell in love with him and here we are. This activated Sensei's switch and so the car sex begins."},{"id":1962190,"gallery_id":369921,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629552884,"body":"Summary: (1/3) Chapter starts with Karin in the middle of her first shoot. Everything seems to be going well that even Sensei wants a copy of this shoot's data for his own use. Houra pointed out that Karin's ass is a little reddish ( ͡° ͜ʖ ͡°). Anyway, Karin goes to change her clothes when Mr. Cameraman (Cman) also went in there. This surprised Sensei but it's nothing out of ordinary here apparently. Houra asks him what he thinks of (Karin's) gravure modelling, but with his mind being preoccupied of Karin and Cman, he mistook the question and talked about Houra's gravure modelling instead. This made her embarrassed, she then casually revealed that she didn't just do gravure but also did AV. Sensei was yet again shocked but soon after, the two in the fitting room came out with Karin looking a little flustered. SUS. On to the next scene, Sensei's driving Karin home. She talks about how she wanted to be Karin Suma (Suma is sensei's surname)."},{"id":1962132,"gallery_id":369921,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629550695,"body":"The FMC probably doesnt even view it as cheating, just as working and as building her sexual appeal and practicing techniques for the MC, she is literally that gullible and dumb. "},{"id":1961899,"gallery_id":369921,"poster":{"id":4424778,"username":"Kuro67","slug":"kuro67","avatar_url":"avatars/4424778.png?_=a3bfdad8b7bca9de","is_superuser":false,"is_staff":false},"post_date":1629541809,"body":"@HentaiKingTestamentBasara yeah just a quick comparison between page 1 and 49 makes it very clear. The other guy has abs while the black haired dude didn't.."},{"id":1961880,"gallery_id":369921,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1629541155,"body":"Remember homies, don’t get your hopes up and you won’t be disappointed. This is 100% going the NTR route because if it wasn’t, we’d already get the “you cheated!” From the MC and the FEMC would show she didn’t. "},{"id":1961825,"gallery_id":369921,"poster":{"id":4424778,"username":"Kuro67","slug":"kuro67","avatar_url":"avatars/4424778.png?_=a3bfdad8b7bca9de","is_superuser":false,"is_staff":false},"post_date":1629539328,"body":"I hope no one translates this."},{"id":1961710,"gallery_id":369921,"poster":{"id":3503010,"username":"w.a.y","slug":"w-a-y","avatar_url":"avatars/3503010.png?_=9f33d0e0835ab6ed","is_superuser":false,"is_staff":false},"post_date":1629536025,"body":"so many many red flags "},{"id":1961613,"gallery_id":369921,"poster":{"id":4141202,"username":"GIL","slug":"gil","avatar_url":"avatars/4141202.png?_=204969cb4efc05d2","is_superuser":false,"is_staff":false},"post_date":1629532751,"body":"Someone who knows chinese please write a short summary for the chapter 4, need to find out what they saying cuz this is beyond sus now. No way is this just ntr bait  something going on behind the scenes and after seeing everyone's predictions and assumptions i feel like this gonna be like their previous work. Someone please help, who knows chinese :D"},{"id":1961564,"gallery_id":369921,"poster":{"id":4004195,"username":"MyLife4Today","slug":"mylife4today","avatar_url":"avatars/4004195.png?_=f49e9489c6ca2353","is_superuser":false,"is_staff":false},"post_date":1629531422,"body":"@stylez479 The title means \"Sweet Pain\", yes, your right, it goes to \"hard\" NTR route in order for the MC to progress through...Literally fucking ass for the FMC man. I get wheres shes coming from, she a porn model and shit--but just to get to that ending like wtf??"},{"id":1961349,"gallery_id":369921,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1629524697,"body":"@Stck doesnt the title mean something like painful sweetness or something like that? going from that i bet this will go the hard NTR route where MC will suffer and go through alot of pain to be able to obtain a sweet ending. I just hope it doesnt take a shit load of chapters like Rarefure im not trying to read 700+ pages lol"},{"id":1961317,"gallery_id":369921,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1629523572,"body":"@GoogleMeBitch yeah the black haired rep definitely seemed to distract him on purpose. Also I think she tells the MC that their agency also does AV.  "},{"id":1961236,"gallery_id":369921,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629520688,"body":"Yeah this seems like its gonna be a rough ride. The girl is definitely naive and submissive enough to be Ntrd under the guise of work and/or practice for your boyfriend. The modeling agency is actively going to push her into porn, and the guy living at her house feeding her weird drinks (jizz?drugs?) is hella sketchy. --- Lets take bets though, do you think this will have a Rarefure type ending where after all the Ntr the MC and FMC end up back together happily ever after? (Unfortunately I think itlle take us 20/30 chapters to find out) "},{"id":1961234,"gallery_id":369921,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1629520670,"body":"@stylez479 yeah you are right about that she is definitely naive. That was in the old hentai i think this is based off, i just can't for the life of me remember what it was called. I actually think it was animated but i can't be sure, anyway i said in my drunken chapter 2 comment the black haired rep said something along the lines of you're inexperienced and need to learn how to please a man if you don't want to lose him to another woman, also i think she said it would've been better if you had some experience with other men first. Hentai logic the fmc thinks it's for the mc's sake. Plus the rep was getting guys to make a move on her just like what seems to be happening here. She definitely distracted him on purpose when the old guy went into the changing room. It seemed pretty obvious she walked away as soon as the job was done."},{"id":1961019,"gallery_id":369921,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1629513722,"body":"@GoogleMeBitch  plus to reinforce the theory that she is too naïve i feel like she would be the type of girl to ask for \"advice\" or be \"taught\" about sexual stuff so that she can be better at it when she does it with the one she loves or be tricked into that scenario and the clear example is in chapter 2 she was bad at giving blowjobs and then in chapter 3 we see that \"bait\" of her drinking that \"drink\" that guy gave her. But if you pay attention when MC hears them the guy says \"come on in one big gulp\" and at the end he says \"awesome! you swallowed it all! Im proud of you!\" and then at the end of the chapter when she is fucking MC she says \"ah wait\" and proceeds to drink MCs semen and says \"I did it! I drank it all!\" \"Did i do good?\" and this makes me speculate she has been \"practicing\". You can see the parallels between the two dialogues with the other guy saying \"Awesome you drank it all \" - FMC saying \"i did it i drank it all\"  and \"Im proud of you!\" - FMC asking \"Did i do good\" "},{"id":1960995,"gallery_id":369921,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1629512886,"body":"@GoogleMeBitch Yeah im really leaning towards your prediction. I feel like something very similar to what you said is what will happen. But whatever happens i just hope it doesnt take 20 chapters to get to the point and to end the story. I feel like as some people have stat the problem will be the FMC who acts and is too naive and people take/will take advantage of her"},{"id":1960793,"gallery_id":369921,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1629506708,"body":"@GoogleMeBitch Yeah that definitely looks like her and im guessing like always she was either tricked into doing forced into doing it or blackmailed"},{"id":1960718,"gallery_id":369921,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1629503931,"body":"@GoogleMeBitch also did you see page 92 when the old guy goes in to the changing room it looks like hes unzipping his pants or something and then look at their silhouette and on the bottom right panel on page 93 you can also see their silhouette and as you say on page 94 they came out all messy looking and sweaty and the FMC had her clothes on as of she put them on in a hurry or doing something else. Plus that short dark hair girl is really giving me sus vibes i feel like she will be the cause of something. Plus notice how all the guys are very touchy with FMC.  I dont think this will be bait anymore guys"},{"id":1960652,"gallery_id":369921,"poster":{"id":4004195,"username":"MyLife4Today","slug":"mylife4today","avatar_url":"avatars/4004195.png?_=f49e9489c6ca2353","is_superuser":false,"is_staff":false},"post_date":1629501394,"body":"The fact I thought the whole chapters were vanilla till I saw hints of fuckin NTR vibes and saw the last page ffs, aghhh forgot this author makes vanilla then NTR.."},{"id":1960610,"gallery_id":369921,"poster":{"id":2642279,"username":"syfan","slug":"syfan","avatar_url":"avatars/2642279.png","is_superuser":false,"is_staff":false},"post_date":1629499961,"body":"This is only looking worse and worse... time to blacklist this artist so I don't have to worry about it lol"},{"id":1960525,"gallery_id":369921,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629495805,"body":"Also from a purely logical perspective there are too many threats for nothing to go wrong. The studio shes modeling for is gonna make her do porn, and that sketchy guy who lives with her making her some drink all the time? Thats beyond a red flag. That drink could be sperm, aphrodisiac, stimulants, drugs that knock you out or make you forget, etc. Plus the girl is really sweet but also way to naive and stupid; any man will be able to make her do what he wants if he pressures her enough. This is a time bomb. "},{"id":1960515,"gallery_id":369921,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629495407,"body":"For context in his last story (rarefure) there was no NTR involving the Main FMC or even the Secondary FMC, until literally after chapter 20. Until that point it was all romance with a bit of drama, then a huge amount of Ntr and a total loss of logic, then more ntr and a lot of drama, and then a happyish end with the MC and Main FMC together ----- so I would expect something similar from this, but dont expect to see it coming since youll be 20 chapters into the story thinking its all okay and then bam ntr, be warned. "},{"id":1960509,"gallery_id":369921,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629494876,"body":"I think it'll save us all some pain if we just assume right now theres going to be NTR in this. This is what this author does, he writes wholesome manga length love stories, stays vanilla for so long you think it's safe (10+chapters), then blasts the story full of NTR for another 10 chapters, before trying to tie it all back together with a \"happy\" ending. The Ntr is almost guaranteed, what we should hope for instesd is that he puts the MC and FMC happy together again as an exclusive couple at the end. "},{"id":1960480,"gallery_id":369921,"poster":{"id":3341996,"username":"stfuvanillafag","slug":"stfuvanillafag","avatar_url":"avatars/3341996.png?_=29267e82d3cfcf28","is_superuser":false,"is_staff":false},"post_date":1629493329,"body":"So in the last pages of chapter 4, she looks like a jav actress or what? Anyway, I still believe this will be ntr or something."},{"id":1960456,"gallery_id":369921,"poster":{"id":3506752,"username":"SourCat","slug":"sourcat","avatar_url":"avatars/3506752.png?_=1d07ec63b24725e3","is_superuser":false,"is_staff":false},"post_date":1629492325,"body":"NTR bait since chapter 3 now its getting worse...😅😅😅"},{"id":1960453,"gallery_id":369921,"poster":{"id":4141202,"username":"GIL","slug":"gil","avatar_url":"avatars/4141202.png?_=204969cb4efc05d2","is_superuser":false,"is_staff":false},"post_date":1629492243,"body":"@GoogleMeBitch Brooo... Also did you see when the old guy went to help her change or whatever. He came back without his jacket whereas he went in with his jacket on. Plus yeah the sweat just on her thigh plus the old guy is also sweating 💀 Bro this is sus "},{"id":1960448,"gallery_id":369921,"poster":{"id":4141202,"username":"GIL","slug":"gil","avatar_url":"avatars/4141202.png?_=204969cb4efc05d2","is_superuser":false,"is_staff":false},"post_date":1629491928,"body":"BRUH... I'm a little worried now even tho i cant read chinese, that cook is kinda sus. Also the old guy with glasses from earlier. Plus the Cover picture of this doujin, plus the name of this doujin XD\n\nI hope it is just bait. And it doesn't end up like one of their previous work, if you know which one i mean :) "},{"id":1960424,"gallery_id":369921,"poster":{"id":611516,"username":"BakeANeko","slug":"bakeaneko","avatar_url":"avatars/611516.png?_=20417bde5d30cbde","is_superuser":false,"is_staff":false},"post_date":1629490533,"body":"wait holy shit dude the ntr bait gets even worse"}]