[{"id":2008816,"gallery_id":370161,"poster":{"id":3986186,"username":"Rafhaelh","slug":"rafhaelh","avatar_url":"avatars/3986186.png?_=d2a48d92c4ad46ae","is_superuser":false,"is_staff":false},"post_date":1631345202,"body":"crot             "},{"id":1988055,"gallery_id":370161,"poster":{"id":1951146,"username":"Rozotoko","slug":"rozotoko","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630529809,"body":"This is fuckin retarded. Great art gone to the fuckin trash because of NTR. What a shame. people who enjoy this need professional help.\nAnd you commissioned this? God damn, there is better stuff to waste your money on there cuck."},{"id":1981712,"gallery_id":370161,"poster":{"id":3477581,"username":"L.A.T.O.M","slug":"l-a-t-o-m","avatar_url":"avatars/3477581.png?_=84c38b4e012fc457","is_superuser":false,"is_staff":false},"post_date":1630259478,"body":"Bro why yall fighting "},{"id":1970305,"gallery_id":370161,"poster":{"id":949151,"username":"Release","slug":"release","avatar_url":"avatars/949151.png","is_superuser":false,"is_staff":false},"post_date":1629824869,"body":"Wuzapp You're calling me shit yet you're human waste, how fucking moronic can you even be? I bet I have more people in my life than you do and you get more bullied than me, hence why you're projecting your life onto me, lmfao. The fact you think I care about grammar says all we need to know about you and your inferior complex. Not my fault you got nothing going on in your life.  My arguments have been more coherent than yours, from an objective standpoint. My insults were more original than yours, again. Even your username says how unoriginal you are.  Cunt, I could meet you irl, say all of this shit to you in your face and you'd do nothing but fucking whine like the pathetic excuse you are. I said what I said, you worthless chimp. Go beat your chode to shit garbage doujin, IDGAF, you attention seeking whore. Like I said, stfu or just end your life. Nobody cares about you, hence why you argue with me for not enjoying a shitty doujin you do, fuck off."},{"id":1970261,"gallery_id":370161,"poster":{"id":769440,"username":"wuzapp","slug":"wuzapp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629823743,"body":"you are such a shit person i bet you were bullied in real life huh? what kind of despicable person wishes someone to kill themselves and death upon a stranger? you have zero morals and have no life. unlike you, i call you out on your bullshit entitled behavior and yet you wish death upon me, look at my level and then look at you. you're absolutely disgusting. most hilarious is you are trying so fucking hard by typing in fuckin grammatically correct way to sound more intelligent. \n\nyou cant even form a coherent argument against me so you resort to regurgitating insults you found on the internet. I can tell you never worked on anything worthwhile in life because you dont know how things work in the real world. you insult not only me, but the doujin artist. you insult the translator who put time and effort into translating it. you insult the typesetter who had to redraw the scenes. you insult everyone who put together a creative project. so fuck you, you little ungrateful parasyte"},{"id":1970135,"gallery_id":370161,"poster":{"id":949151,"username":"Release","slug":"release","avatar_url":"avatars/949151.png","is_superuser":false,"is_staff":false},"post_date":1629819650,"body":"Less pathetic than you, clearly. \"Recycle my words\" yeah because what you said was so original you inbred yankee ape. Virgin commissioner malding because someone called his paid doujin trash, which it is. I could buy your fucking family if I wanted to, you worthless chimp. Imagine talking shit while living in your moms basement and buying fucking doujins with your allowance. Peak virgin we got here. Do everyone on the planet a favor and end your pathetic excuse of a life."},{"id":1969945,"gallery_id":370161,"poster":{"id":769440,"username":"wuzapp","slug":"wuzapp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629813943,"body":"you're pathetic. nice copy and paste, couldnt come up with an insult yourself so you had to recycle my words? shows how fucking dumb you are you swine. keep talking you fucking ugly ass nerdgin, and keep living off your mom and the government food stamps you broke ass faggot. unlike you I make a fuck ton of money. why are you here if you think this is a garbage commission, fuck outta here you "},{"id":1968931,"gallery_id":370161,"poster":{"id":949151,"username":"Release","slug":"release","avatar_url":"avatars/949151.png","is_superuser":false,"is_staff":false},"post_date":1629779240,"body":"Wuzapp, you're the fat malding worthless inbred ape, I don't care that you spent all your fuckin allowance on this garbage, that's YOUR problem. I mean more to society than you do and ever will. You might as well just hang yourself, nobody will care anyway. You would know about being a virgin, since you commission garbage like this."},{"id":1968004,"gallery_id":370161,"poster":{"id":769440,"username":"wuzapp","slug":"wuzapp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629744385,"body":"of course im going to read the comments because I commissioned it. but here I am checking comments I see some 20 yr old virgin ungrateful parasite whining like a bitch"},{"id":1967994,"gallery_id":370161,"poster":{"id":769440,"username":"wuzapp","slug":"wuzapp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629744175,"body":"@release because I commissioned this you fat malding piece of shit. what have you done all your life you worthless reject. fuck outta here. parasite to society"},{"id":1967556,"gallery_id":370161,"poster":{"id":949151,"username":"Release","slug":"release","avatar_url":"avatars/949151.png","is_superuser":false,"is_staff":false},"post_date":1629727913,"body":"wuzapp Let my use your braindead logic against you: Why are you whining about me whining? If you just want to look at this then look at it and fap, you faggot. You went into the comments, now fuck off."},{"id":1966279,"gallery_id":370161,"poster":{"id":769440,"username":"wuzapp","slug":"wuzapp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629680294,"body":"release why are you whining, if you want don corneo then go to gensou kyonyuu 1. this is #2, what you wanted the same thing twice? so dumb"},{"id":1965014,"gallery_id":370161,"poster":{"id":3013194,"username":"Ring_1092","slug":"ring_1092","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1629637967,"body":"No group and mmf threesome tag?"},{"id":1964924,"gallery_id":370161,"poster":{"id":252309,"username":"Mikeachu","slug":"mikeachu","avatar_url":"avatars/252309.png","is_superuser":false,"is_staff":false},"post_date":1629634409,"body":"Imagine if Cloud was her next client and she got passed he was hiring a prostitute. "},{"id":1964913,"gallery_id":370161,"poster":{"id":717861,"username":"Already_dead_18","slug":"already_dead_18","avatar_url":"avatars/717861.png","is_superuser":false,"is_staff":false},"post_date":1629633954,"body":"I don't care, she\"s so cute"},{"id":1964898,"gallery_id":370161,"poster":{"id":2153366,"username":"HereForThemHentais","slug":"hereforthemhentais","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629633410,"body":"Poor release, how are you so damn angry at a dojin"},{"id":1964613,"gallery_id":370161,"poster":{"id":1990793,"username":"Quattro Bajeena","slug":"quattro-bajeena","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629624451,"body":"Release is totally right"},{"id":1964521,"gallery_id":370161,"poster":{"id":949151,"username":"Release","slug":"release","avatar_url":"avatars/949151.png","is_superuser":false,"is_staff":false},"post_date":1629621762,"body":"Randoms in hentai is the most useless and worthless shit, period. Nobody cares about them."},{"id":1964316,"gallery_id":370161,"poster":{"id":4443269,"username":"Señor Luigi","slug":"senor-luigi","avatar_url":"avatars/4443269.png?_=f8b9dc2f6a0aa07e","is_superuser":false,"is_staff":false},"post_date":1629615757,"body":"Someone really said they'd rather have Don Corneo impregnate Tifa than having randoms, first off I don't think Don Corneo would bother considering he almost fucked Cloud. And second, hell no, that would ruin my image of the game &gt;:("},{"id":1964148,"gallery_id":370161,"poster":{"id":949151,"username":"Release","slug":"release","avatar_url":"avatars/949151.png","is_superuser":false,"is_staff":false},"post_date":1629612478,"body":"Eh, random no name fucks are so boring. I'd rather have Don Corneo impregnate Tifa or some shit like that."},{"id":1964132,"gallery_id":370161,"poster":{"id":2647608,"username":"Vartranger69","slug":"vartranger69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1629611924,"body":"This is very nice\n\n"}]