[{"id":2119830,"gallery_id":371625,"poster":{"id":3406072,"username":"Kami Nana","slug":"kami-nana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635830844,"body":"That Miyama seems to have feelings for the MC...so hopefully he moves on to her after getting over the dumb slut that falls for her rapist. Maybe that's the twist I heard someone mention the author has in mind for this...that the MC actually gets to move on. Even better if the dumb whore ex-gf realizes how much she fucked up by being so weak-minded...kinda like the end of Zutto Suki datta."},{"id":2118486,"gallery_id":371625,"poster":{"id":4693676,"username":"AJAXBLACKBEAR","slug":"ajaxblackbear","avatar_url":"avatars/4693676.png?_=c76d4534ab056557","is_superuser":false,"is_staff":false},"post_date":1635764227,"body":"Oh by way douche bag coach had same thing happened to him do I feel sad for guy yeah but don’t fucking do that to another person like I hope the author turns the bf into a chad and shows his slut fake gf he is better than the washed up coach "},{"id":2118149,"gallery_id":371625,"poster":{"id":1521280,"username":"WNFan_","slug":"wnfan_","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1635748100,"body":"She's damaged goods. Fuck her"},{"id":1992382,"gallery_id":371625,"poster":{"id":3057807,"username":"Killenkillenkillen","slug":"killenkillenkillen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630709645,"body":"Yeah this manga is about the coach and the fmc to begin with. The NTR is just to spicy things up. Well this is new for me that there is am author who dragging hentai story kekw. "},{"id":1991780,"gallery_id":371625,"poster":{"id":4250101,"username":"SrDP","slug":"srdp","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630683852,"body":"A blackmail and rape hentai where the author changed the course of the story to \"support\" the rapist kkkkk. to alleviate the beginning he inserted romance in the story and will probably give a happy ending for everyone, since most of it has exhausted its 2 main characters. It certainly ends with FMC saying it doesn't deserve MC2 and MC2 ends with another girl."},{"id":1991682,"gallery_id":371625,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1630680844,"body":"Well, the author said that there's a twist coming, so that more than likely happens next chapter. Kinda wondering what it is as Shoma supporting both of them just so Yuki can be \"happy\" isn't really a twist given how that happens quite a bit in NTR stories, so I'm guessing this is the final push Shoma needed to expose everything. Feel like both Shoma(quits) and Yuki(expelled) leave the team and the coach gets fired/arrested. "},{"id":1991629,"gallery_id":371625,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1630678938,"body":"Recap, \"bullshit\" more like milking it for all it's worth. I know it's stupid to expect anything to happen but shoma looks fucking angry in the last panel maybe he finally grew a pair, still this slut and the coach will probably get a happy ever after with no consequences. I am glad i only read a couple of chapters and gave up on this shit because it was far too predictable."},{"id":1990991,"gallery_id":371625,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630655254,"body":"Wow, Shoma was an extreme believer/annoying guy trying so forcefully to deny the facts, Yuki is at fault to be so indecisive too since the beginning (ntr in a nutshell, how to delete uneccessary 15 chaps lol), well don't change my mind that Yuki and Coach are scum people though, even knowding the \"sad\" past blablashit.\n\nBreak up seems done if i understand the last panels correctly. The ending? Who cares ... even if they are discovered, so predictable that would finish like this https://nhentai.net/g/368176/"},{"id":1990965,"gallery_id":371625,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1630654499,"body":"She basically turned into a slut and only has feelings for douchebag coach as sex is everything in hentai world. This chapter felt more like a filler, a lot of recalling flashbacks from previous events, probably author trying to clarify something in the story."},{"id":1990856,"gallery_id":371625,"poster":{"id":3057807,"username":"Killenkillenkillen","slug":"killenkillenkillen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630650264,"body":"Looks like mc and fmc relationship is over. Since fmc only has feeling for the coach. "}]