[{"id":2173039,"gallery_id":374059,"poster":{"id":2764954,"username":"Raburadōru","slug":"raburadoru","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638287542,"body":"I was searching for this for almost 3 years. "},{"id":2076639,"gallery_id":374059,"poster":{"id":2203307,"username":"Casimir_Feet_Lover","slug":"casimir_feet_lover","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1634021571,"body":"I was waiting for this one to be translated but, fuck, why are there so many translator who don't translate the afterword?!"},{"id":2038245,"gallery_id":374059,"poster":{"id":1451690,"username":"kurei","slug":"kurei","avatar_url":"avatars/1451690.png","is_superuser":false,"is_staff":false},"post_date":1632483435,"body":"Imagine cumming inside ochako while she is afloat. Also, I want Mina Ashido's pussy fluid to be stingy, just a little. Every bodily fluids of her is harmless but useful to sex. For Tsuyu, I want her tongue to be everywhere. Like what she did behind door. And what I meant is for dick pleasuring, we all want that tongue to wrapped around our dicks, any time at any place. For Momo to summon a sex toy is awesome. I wanna challenge her to put a vibrator inside her pussy the whole day and tries not to cum or squirt before the class ends. For Mt. Lady... Ooh damn. I wanna put myself inside that giant pussy and practice my boxing skills to that g-spot and clit. For Jiro, I... Dunno man. Put her earlobe jack in the tip of my glans and use frequency while fvcking her pussy? Thats some CBT shit. For Toru, she could easily sneak into boys room and suddenly suck someones dick or you could be both alone inside a classroom thinking that you are fvcking a ghost. & To fuck a crazed toga is a dream"},{"id":2035134,"gallery_id":374059,"poster":{"id":671338,"username":"Vaush","slug":"vaush","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1632361594,"body":"this is what i like. characters using their ability in the lewd to improve the lewd. too many mha hentai don't do this. what is the point of parodying unusual characters and abilities if ur not using them to full potential."},{"id":2035084,"gallery_id":374059,"poster":{"id":4400393,"username":"Ilinker","slug":"ilinker","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1632360276,"body":"Deku could use one for all to super charge his nut shooting it through something giving him the power of pew pew cumthat shoots through people"},{"id":2034900,"gallery_id":374059,"poster":{"id":1814478,"username":"megasean3000","slug":"megasean3000","avatar_url":"avatars/1814478.png","is_superuser":false,"is_staff":false},"post_date":1632353660,"body":"Other heroes who use Quirks for sexual purposes: \n\nKendo: She can enlarge her hands to finger herself with fingers as large as cocks.\n\nSetsuna: She can split her head away from her body to give herself cunnilingus.\n\nPony: Can use her horns to pleasure four different spots at once.\n\nKumori: Can make a mushroom that can act as a vibrator.\n\nYanagi: She can make toys move independently without having to touch them.\n\nYui: Can increase the size of toys, giving her more pleasure."}]