[{"id":2301097,"gallery_id":374865,"poster":{"id":2677982,"username":"NinjaOrder","slug":"ninjaorder","avatar_url":"avatars/2677982.png?_=86937e6ad215b631","is_superuser":false,"is_staff":false},"post_date":1643592487,"body":"Still waiting for this to get translated"},{"id":2245609,"gallery_id":374865,"poster":{"id":964953,"username":"Mr.Fapping","slug":"mr-fapping","avatar_url":"avatars/964953.png?_=929822222f5096f3","is_superuser":false,"is_staff":false},"post_date":1641434297,"body":"This hentai have 2 part .\nFirst one is about masseur guy try to steal wife of the clueless retard husband but he fail at the end . Wife stay with the husband ( 01 - 29 )\nSecond is about 10 years ago when the masseur still young . He got his wife stolen from him by another masseur guy. ( 30 - 33 )"},{"id":2121037,"gallery_id":374865,"poster":{"id":1573168,"username":"setsunafseiei00","slug":"setsunafseiei00","avatar_url":"avatars/1573168.png","is_superuser":false,"is_staff":false},"post_date":1635886863,"body":"Looked this one up on Comic Festa and this story ends on Chap. 33.  Hopefully someone will upload the final 3 chapters."},{"id":2120804,"gallery_id":374865,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635874724,"body":"she is bitch"},{"id":2093041,"gallery_id":374865,"poster":{"id":3853848,"username":"Lalmirchs","slug":"lalmirchs","avatar_url":"avatars/3853848.png?_=844797a91dde08af","is_superuser":false,"is_staff":false},"post_date":1634708493,"body":"So it seems that the masseur guy got his wife/gf stolen the same way he is doing it with the FMC and it seems that his wife/gf resembles a lot to the FMC.\n\n(Funny thing I actually noted that the masseur guy seems a lot like the guy in another story by the same author \"I Kept Watching While a Man Made My Wife Cum Over and Over\" #341892)"},{"id":2048298,"gallery_id":374865,"poster":{"id":3304778,"username":"HuekiYuuki","slug":"huekiyuuki","avatar_url":"avatars/3304778.png?_=c9c3c6cfa605d6eb","is_superuser":false,"is_staff":false},"post_date":1632875098,"body":"- Since I don't understand the language at all and just flew by all these chapters in a few minutes trying to leave a message sort of explaining stuff. . .Hopefully it gets translated since I wanna know what the fuck actually happened.\n\nSeems interesting,but quite silly since the MC guy definitely didn't seem like a cuck so I don't know how he accepted her back when she didn't even have his kids or anything like that."},{"id":2048295,"gallery_id":374865,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1632874982,"body":"So finally the 18-23 missing chapters are included here. Hmm alright, gonna dip in and see what's going on."},{"id":2048294,"gallery_id":374865,"poster":{"id":3304778,"username":"HuekiYuuki","slug":"huekiyuuki","avatar_url":"avatars/3304778.png?_=c9c3c6cfa605d6eb","is_superuser":false,"is_staff":false},"post_date":1632874975,"body":"- Back to being fucked by the masseur guy for another while, then the original couple meets once more, have a talk, argue and then the girl comes with the masseur. Masseur guy probably tell our MC that he's been fucking the shit out of his gf and then straight up walks out the door lmao and then the woman follows him out and then gets fucked,and some hobos or friends of the masseur start coming into the woods after them and probably gang bang the hoe for a bit.\n\n- Then the hoe gets back with the original guy ( somehow lol how the fk would that work idk, our guy is dumb af ) and then after a while she goes back to the Masseur parlor for a session,gets sexually assaulted and enjoys the sht out of it but doesn't get fucked, then starts working there? I think, and then she fucks one of the other new Masseur dudes that looks like one of the guys earlier from the woods while again ignoring the MC dude .\n\nAll in all can't give a rating since this is all literally purely 100% speculation---"},{"id":2048288,"gallery_id":374865,"poster":{"id":3304778,"username":"HuekiYuuki","slug":"huekiyuuki","avatar_url":"avatars/3304778.png?_=c9c3c6cfa605d6eb","is_superuser":false,"is_staff":false},"post_date":1632874766,"body":"Mmmhhm so the plot from what I've seen goes something like so :\n\n- They're either a fully married couple or just a normal couple. . .She ends up cheating on him with some masseur dude, our homeboy finds out that she's cheating on him and also starts having an affair after he's basically being ignored / abandoned for a few possible days / weeks. . .His so called \"girlfriend\" sees him with the other girl going to a hotel and somehow SHE is the one feeling hurt and betrayed,goes back to fucking the masseur,and other dudes and a woman while pretty much I think abandoning the dude / breaking up with him for a long period of time.\n\n- Our guy is together with the other girl ( And here I'm unsure since there's a few women that look incredibly similar in this artstyle or it might just be the affair girl with  different style hair ) for a while but then I don't know if it's the same chick that ALSO fucks the masseur guy. . .Our MC's former gf meets with his \"current gf\" have a talk then goes----"},{"id":2048196,"gallery_id":374865,"poster":{"id":4692320,"username":"RoWe_Naz","slug":"rowe_naz","avatar_url":"avatars/4692320.png?_=dfce70047473aa70","is_superuser":false,"is_staff":false},"post_date":1632871270,"body":"no comments?"}]