[{"id":2476823,"gallery_id":375211,"poster":{"id":3074165,"username":"Animefantraveler","slug":"animefantraveler","avatar_url":"avatars/3074165.png?_=4e8c031b1a225459","is_superuser":false,"is_staff":false},"post_date":1650700603,"body":"@alonerone he leave her and don't want to see her again"},{"id":2475493,"gallery_id":375211,"poster":{"id":4128223,"username":"Omurice","slug":"omurice","avatar_url":"avatars/4128223.png?_=c8d944184fac0c40","is_superuser":false,"is_staff":false},"post_date":1650647401,"body":"Is there an English translation? There was a translated version of the last page going around FB. "},{"id":2060633,"gallery_id":375211,"poster":{"id":1299331,"username":"alonerone","slug":"alonerone","avatar_url":"avatars/1299331.png","is_superuser":false,"is_staff":false},"post_date":1633400724,"body":"Disgusting slut. I hope glasses guy would lose interest on her"},{"id":2054995,"gallery_id":375211,"poster":{"id":696495,"username":"conscript117","slug":"conscript117","avatar_url":"avatars/696495.png?_=c15333a79568e0f8","is_superuser":false,"is_staff":false},"post_date":1633164554,"body":"@revolnrop thank you very much for the pretty much translation bro, you're a Chad..\n\nMc did deserve better..I don't know her circumstances but I really would like a continuation of this...him moving on."},{"id":2054650,"gallery_id":375211,"poster":{"id":1610376,"username":"AnotherRat","slug":"anotherrat","avatar_url":"avatars/1610376.png?_=caeb786f3ad0f622","is_superuser":false,"is_staff":false},"post_date":1633151140,"body":"@revolnrop Damn, that's sad. Poor MC, he deserved better"},{"id":2054569,"gallery_id":375211,"poster":{"id":3294131,"username":"Kneel before Vlad","slug":"kneel-before-vlad","avatar_url":"avatars/3294131.png?_=61bd1415a0c03af0","is_superuser":false,"is_staff":false},"post_date":1633147618,"body":"ok this seems good hoping for good TL"},{"id":2053949,"gallery_id":375211,"poster":{"id":3907772,"username":"revolnrop","slug":"revolnrop","avatar_url":"avatars/3907772.png?_=983be4031cb3fe79","is_superuser":false,"is_staff":false},"post_date":1633119898,"body":"Contd...Glasses-Kun responds that he can't like a bitch like her leading to her shocked face next page. She continues mocking him saying \"spit out your sperm quickly. If you beat the other boy's sperm you can get me pregnant\". I am not entirely sure but I think he doesn't cum (maybe I am wrong) and stops instead. He apologises to her for making her late for afternoon classes and that he won't be seeing her anymore. The prostitute responds with \"That's fine\" and strikes a seductive pose again mocking him. Either MC-Kun says goodbye or the prostitute says goodbye in her head as she sits there crying implying either she did catch feelings for him too or at the very least didn't want to say all that stuff and hurt him but had to to make him give up.\nTL;DR: Guy has sex with the girl for money. Guy catches feels. The girl probably catches feels too but turns down the guy by insulting him."},{"id":2053938,"gallery_id":375211,"poster":{"id":3907772,"username":"revolnrop","slug":"revolnrop","avatar_url":"avatars/3907772.png?_=983be4031cb3fe79","is_superuser":false,"is_staff":false},"post_date":1633119345,"body":"Contd...She was probably texting Glasses-Kun, but stopped when the guy objected saying \"Let's go crazy then\". As the guys were coming out one guy apologized for making Glasses-Kun wait. When she saw him she said something like \"You were outside. Wait let me clean out their cum\". Glasses-Kun is in full simp mode and hands her a bento. The prostitute starts laughing and proceeds to say some very mean but very necessary (IMO) things to Glasses- Kun. \"Was I your first love? I am scared I am going to be stalked or maybe you wanted to fuck me for free\". When Glasses-Kun starts to cry she makes fun of that and tells him he can comfort his broken heart by fucking her as her pussy is still usable. Glasses-Kun tells her to turn around and proceeds to doggy her while thinking why he accepted her invitation after all that. The prostitute continues to make fun of him \"I have never had someone shake their hips while crying. What made you like a slut like me?\". "},{"id":2053923,"gallery_id":375211,"poster":{"id":3907772,"username":"revolnrop","slug":"revolnrop","avatar_url":"avatars/3907772.png?_=983be4031cb3fe79","is_superuser":false,"is_staff":false},"post_date":1633118821,"body":"I machine translated it so will be wrong in parts. But here is a slightly more detailed summary. The prostitute is running a monthly subscription service in the school with different plans, the first time is free. Glasses- Kun didn't know that when he had his first time with her. He tries to resist but keeps thinking about sex and ultimately subscribes to her prostitution plan. That is when they have sex in the toilet. On pg 27, she suggests he switch from condom to raw plan which he does and ultimately only cumming inside her can satisfy him. Whenever he has free time he has sex with her. On pg 31, I think he muttered he likes her or just that he wants a kiss. Either way, the prostitute realise Glasses-Kun is falling in love with her. As he is walking before the gangbang scene same is conveyed in his monologue. It appears the prostitute had been having sex mostly with Glasses- Kun neglecting other members leading to everyone wanting to do it at the same time."},{"id":2053407,"gallery_id":375211,"poster":{"id":4707125,"username":"寝覚め獣","slug":"qin-jue-meswu","avatar_url":"avatars/4707125.png?_=51dae3b8ce4cc002","is_superuser":false,"is_staff":false},"post_date":1633097519,"body":"@conscript117 \nRegret and the MC finally stopping having sex with her"},{"id":2053336,"gallery_id":375211,"poster":{"id":696495,"username":"conscript117","slug":"conscript117","avatar_url":"avatars/696495.png?_=c15333a79568e0f8","is_superuser":false,"is_staff":false},"post_date":1633094701,"body":"Can someone explain to me the context of why she's crying at the end if she was already doing the mc for money?"}]