[{"id":2110432,"gallery_id":375380,"poster":{"id":3236286,"username":"larssonchear","slug":"larssonchear","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635425715,"body":"I need Chinese version please"},{"id":2075637,"gallery_id":375380,"poster":{"id":2218988,"username":"VIVID","slug":"vivid","avatar_url":"avatars/2218988.png?_=8b07dcd03dd33e4c","is_superuser":false,"is_staff":false},"post_date":1633977602,"body":"This girl belong to the street 😂🤣"},{"id":2075426,"gallery_id":375380,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1633969972,"body":"@Destroyer If your referring to the one I mentioned with the Female Teacher Reverse Blackmailing her Male Student, then it's called \"Top Gear, Artist: [Aoki Kanji]\" After I referenced it, I went back to Favorite it, so your in luck :) Hope you enjoy "},{"id":2072314,"gallery_id":375380,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1633851322,"body":"@LordCellofEarth9\nWhat is the name of that hentai?"},{"id":2064378,"gallery_id":375380,"poster":{"id":762315,"username":"phanlongtran","slug":"phanlongtran","avatar_url":"avatars/762315.png","is_superuser":false,"is_staff":false},"post_date":1633549632,"body":"Becareful out there my guy"},{"id":2060664,"gallery_id":375380,"poster":{"id":1299331,"username":"alonerone","slug":"alonerone","avatar_url":"avatars/1299331.png","is_superuser":false,"is_staff":false},"post_date":1633401756,"body":"First half is good but they destroyed it on last part"},{"id":2058366,"gallery_id":375380,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1633305338,"body":"@OvaLoaf To that I agree with you. Always good when you see something \"uncommon\", \"rare\" or even \"something new and unique\" (In a good way!)"},{"id":2058046,"gallery_id":375380,"poster":{"id":1903205,"username":"OvaLoaf","slug":"ovaloaf","avatar_url":"avatars/1903205.png?_=c87990a7eeed6551","is_superuser":false,"is_staff":false},"post_date":1633289636,"body":"Guy bit off more than he could chew. This is a nice change of pace from the generic tropey blackmail ntr we usually get. Interesting dynamic of blackmail into blackmail reversal into getting cucked by what was supposed to be yours. Ngl he made a poor decision trying to blackmail an obviously sexually active/experienced girl, he read too much hentai."},{"id":2057224,"gallery_id":375380,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1633256709,"body":"To add to my last one, the Teacher more or less \"reverse blackmailed\" him. Deciding she needed a boy toy to deal with her lust. But she didn't want to risk her job or getting exposed if she was caught or it went south....he ended up \"helping\" in that situation because he was so stupid to do what he did (copying too many hentai where this only ended well for the blackmailer because \"idiot ball/Hentai Logic\"). Basically, a guy tries to rob you and fails....so you rob him since \"who's anyone going to believe, a Thief who accuses others of stealing, or the victim who they tried to rob!\". Plus as she stated, she was popular, he was not and she could abuse that popularity to ruin his future if he disobeyed her (pretending to act like a \"concerned for your future\" teacher, when even he called BS! But she wasn't wrong in she had all the power at that point)."},{"id":2057036,"gallery_id":375380,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1633248475,"body":"@Destroyer.......You're new at this, aren't you! Common Sense doesn't apply outside Vanilla Hentai. That's what's called \"Hentai Logic\" where no matter how much it makes no sense. Character's will literally carry \"an idiot ball\" if it assures \"the plot happens!\" So don't bother trying to understand why character's don't do exactly that! (I mean, for example there was one funny Hentai I viewed, where a Male Student caught the Teacher masturbating and took a picture, trying to blackmail her. Only she \"knee\" him then \"took his phone\" even pointing out if he kept \"extra\" it wouldn't work as he wasn't a popular, while she was, so blackmailing her would fail and she'd expose him which would ruin HIS reputation! Seriously though, the Janitor blackmail gets stupid when the story starts with them being looked down on and disliked! The Blackmail should have been the straw that resulted in a job lose if the story didn't make everyone stupid to make it work!)"},{"id":2056903,"gallery_id":375380,"poster":{"id":4642046,"username":"just_a_reader","slug":"just_a_reader","avatar_url":"avatars/4642046.png?_=2ab6c00be4d7a091","is_superuser":false,"is_staff":false},"post_date":1633244502,"body":"damn 😳              "},{"id":2056717,"gallery_id":375380,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1633238067,"body":"Can't he take her phone from her?"},{"id":2056603,"gallery_id":375380,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1633235001,"body":"@Destroyer It looks like she took a picture of HIM during the sexual act! (Specifically when he was forcing her to do him at the early part of the story!) Likely \"reverse Blackmailing him\" and seeing it, it was a game of \"chicken\" between two blackmailers.....and he blinked! \n\nI think I saw another similar story where the Guy Moral Degenerated a girl into a tan skin gyaru slut, ending with him putting a collar on her like she was \"his bitch!\"....only for an extra to show she got SO GOOD at sex that he could keep dominance anymore as she forces HIM into the \"bitch\" position. Calling his friends for a gang bang and making it clear he's going \"to watch it quietly\" before taking her collar off and putting on him! As a show that she was the one in charge! \n\nSo now I have another tag to bring up.  Where's \"Domination Loss\" (or does it not count since he was in the dominant position for long?)"},{"id":2056373,"gallery_id":375380,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1633227548,"body":"How the girl force him to do that?"},{"id":2056346,"gallery_id":375380,"poster":{"id":4249534,"username":"M9onlight","slug":"m9onlight","avatar_url":"avatars/4249534.png?_=404cbf2e1a2900dd","is_superuser":false,"is_staff":false},"post_date":1633226909,"body":"I agree.   "},{"id":2056228,"gallery_id":375380,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1633222806,"body":"It's funny, in a way, it's not NTR because the guy was a piece of shit fan who had the classic \"I know you're a cam whore, do as I say or I'll reveal you\" moment. But on the other hand, it is NTR in that he's being forced to watch and witness her sexcapades like a cuck &amp; even forced into a Chastity Belt as her slave (she seems to have a fetish of being a \"super slut\" specifically if she knows she's being witness or watched (Not feeling sorry for him, he did try to forcefully make her his woman through blackmail and rape...so to be \"forced\" into the BF role and permanent watcher mode was just so karma-tic LOL_ But yeah it's NTR in the \"forced to stand aside quietly on the side\" part! But this is why I wish NHentai would just separate the NTR into their seperate tags already! It sucks that blacklisting NTR for the crap means the good stuff like Netori and Reverse NTR is effected! "}]