[{"id":2111855,"gallery_id":375340,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1635486671,"body":"Alright, Vol 77 should be around the corner, it's been 3 weeks already..."},{"id":2073792,"gallery_id":375340,"poster":{"id":2936916,"username":"Rserpens","slug":"rserpens","avatar_url":"avatars/2936916.png?_=de74b206ff80163e","is_superuser":false,"is_staff":false},"post_date":1633910092,"body":"Thanks @DrinksandDame.  I don't think it's actually NTR, just that it's that annoying trope that gets the reader wound up with all the suspense of waiting."},{"id":2060228,"gallery_id":375340,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1633381627,"body":"Thanks @DrinksandDame. But guys, you know how Ryoh-zoh is, should we expect any different from Rarefure and some of his/her previous works? Chances are slim but who knows. Anyway, I love Ananga Ranga, it's got a lot of juicy shit to read and enjoy."},{"id":2058050,"gallery_id":375340,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1633289810,"body":"@DrinksandDame, i skimmed this yesterday but it's great to know what is actually happening so you have my thanks as well. I actually came back here hoping you had done a summary and it was excellent as always so thanks again m8."},{"id":2057466,"gallery_id":375340,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1633267389,"body":"Thanks @DrinksandDame, you make a ntr loser like me happy to see a glimpse of what is happening, I am ok with either a vanilla route or ntr route, I'm not really picky"},{"id":2056742,"gallery_id":375340,"poster":{"id":2250527,"username":"ギミック","slug":"gimitsuku","avatar_url":"avatars/2250527.png?_=99768ea3748cb582","is_superuser":false,"is_staff":false},"post_date":1633238853,"body":"Thanks for the summary! @DrinksandDame\nThe general theme seems indeed to be fake cheating scenes every chapter. I do hope it stays like this, not that I don't like NTR but the couple is pretty sweet so far. Although I don't see the story going really far if it stays like this, Ryoh likes drama as far as I know."},{"id":2056654,"gallery_id":375340,"poster":{"id":1387591,"username":"WizardsOnlyFool","slug":"wizardsonlyfool","avatar_url":"avatars/1387591.png?_=24ddf9787d70df9f","is_superuser":false,"is_staff":false},"post_date":1633236510,"body":"thank you for the summary @DrinksandDame 👍"},{"id":2056636,"gallery_id":375340,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1633236109,"body":"(Afterword) My summary has yet again gotten longer since this had so many scenes compared to previous chapters. Also, this time around the Anthology was uploaded first so I figured I'll just put my summary here. I dont think many will see this so Ill put this up again if there will be a separate upload for this new chapter. Anyway, I think at this point, these sus scenes are just straight up comedy now and I actually get a good chuckle from them. Still, it's not an impossibility that Karin is actually cheating but I worded things comedically since the atmosphere and delivery of the scene isnt really all that serious in tone. Oh yeah, I don't know yet if were getting a new chapter on next month's release, but from the recent pattern, it could also be that we wont."},{"id":2056633,"gallery_id":375340,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1633235947,"body":"(4/4) After feeling jealous over a burnt mark, sensei later on went and gave her a bite mark on her nape cuz she's his and no one else's. On the last spurt, she was begging hard for the spanking which sensei was initially against for but in the end, he gave her one mega SLAP. After sex, Karin asks about that painting he made before that she really liked. Apparently, he had an ex-gf and the painting was made with the feelings he had when they broke up. Lots of details here but to keep it short, it was a very beautiful yet very sad painting. The work's title was apparently Itaiamai (sweet and painful). Karin said that sensei can't draw a similar painting now that she's here with him. TBC"},{"id":2056631,"gallery_id":375340,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1633235824,"body":"(3/4) Before parting ways, Masked asked him what he thinks of love relationships between a teacher and a student. This made sensei nervous. He answered with the standard \"It's definitely a no no\" but she was mysteriously disappointed by his answer. Next scene, Karin was gonna be late so as compensation, she sent sensei a sexy photo of her. Sensei noticed the naked dude behind her. He panics so he spammed her with calls. He gets another panty service but he aint got no time for that. Karin picked up and apparently, Naked dude was chef boy and he's helping her clean the hotspring area, hence why he's topless. The phonecall convo was highly suggestive, but it was overall comedic. Yet another stressful day for sensei. Good thing she gets to have sex with Karin afterwards. She got a sus mark on her collarbone, but it was just from when she was frying some tempuras, no worries. "},{"id":2056624,"gallery_id":375340,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1633235589,"body":"(2/4) She was glad and they had sex, sensei was also craving really hard since morning. As for Karin, she may have been busy helping at the inn, but she's been drinking a lot of chefboy's special drink so she's still got the stamina. Next day we see sensei being inquired by the other teachers about Karin's case. As usual, They are worried if her modelling is making her stand out in a not good way. With all the grilling, sensei wasn't able to respond but luckily the masked female sensei came to his aide. She argues that there shouldn't be any problem about Karin doing modelling. Masked is a very strong-willed woman and she's definitely making good points. Like the only valid concern imo is that someone stole Karin's posters (which was sensei btw lol) but other than that, Masked was adamant enough to diffuse the barrage of questions on sensei. Afterwards, sensei approached Masked to thank and assure her that Karin's a good kid and that there aint no problem. "},{"id":2056621,"gallery_id":375340,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1633235464,"body":"Summary for Itaiamai (p230)\n(1/4) Chapter starts off with sensei getting a homemade lunch from Karin which made him happy. Still, his growing concern about the gravure company has stresses him out. Next, during his art class, we see Karin being very chummy with Kise, the cool looking dude. Sensei overhears the two girls in class gossiping about how those two look like a good match and that Kise apparently part-times as a delivery man. Btw, these two girls are cameos from Rarefure. Next we reach lunch break where sensei was about to eat Karin's bento when two students entered to get some art stuff in his room. Some panty service here for sensei (and for us). Anyway, takeaway here is that there's an upcoming school festival so people are preping. Next scene, Karin visits sensei's home to retrieve the bento box, but to her surprise, sensei is giving him a key. He figured it's inconvenient for her to not be able to enter his apartment in the morning so he gave her a spare key."},{"id":2055863,"gallery_id":375340,"poster":{"id":1636058,"username":"okita_tbc","slug":"okita_tbc","avatar_url":"avatars/1636058.png?_=bebad57dd966ea6a","is_superuser":false,"is_staff":false},"post_date":1633202401,"body":"Welp the first one is creepy as hell"}]