[{"id":1837199,"gallery_id":37630,"poster":{"id":1508449,"username":"flying riceball","slug":"flying-riceball","avatar_url":"avatars/1508449.png?_=c5af5462da3b9987","is_superuser":false,"is_staff":false},"post_date":1624860406,"body":"great , he even made clannad darker than it used to be"},{"id":1401063,"gallery_id":37630,"poster":{"id":3709133,"username":"Khrysostamos","slug":"khrysostamos","avatar_url":"avatars/3709133.png?_=6ffd96e447d7b1f5","is_superuser":false,"is_staff":false},"post_date":1607785551,"body":"Came here to nut after finishing her route and after story VN. I banned the ntr tag but every now and then I check it out if the art looks good and it's not messed up, if you guys also have a problem with ugly bastards, ban the dilf tag."},{"id":88155,"gallery_id":37630,"poster":{"id":832804,"username":"TorakWolf","slug":"torakwolf","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1485559100,"body":"@?h7M0iqA3 This is what netorare is, and Carn is known for NTR works. Yes, contrary to what those sickos say, NTR is shit. Not that reading it makes you a worse of a person, but the genre itself cannot be defended by any argument except that \"this is a free society we live in\" and this serves to deepen the understanding of how stupid the concept is.\r\n\r\nThe worse thing? Japanese readers mostly see violent sexual content as harmless, while it isn't. So those mangas sell pretty well, and therefore artists aim to the money this industry produces.\r\n\r\nTo all you complaining about this: The reason is simple, sex is a natural part of the modern human socialization, violence isn't. Mix the two and you eventually won't be able to tell, aside perhaps under the weight of laws, what is acceptable and what isn't."},{"id":82193,"gallery_id":37630,"poster":{"id":687355,"username":"?h7M0iqA3","slug":"h7m0iqa3","avatar_url":"avatars/687355.png","is_superuser":false,"is_staff":false},"post_date":1483414464,"body":"I thought artist carn was interesting after his play at Comic1*4 with tons of foreplay and effort from the male part. I wish this had been a continuation of that episode, but this another whole plot that fails as about 99% of porn where the male urinates women and performs like a gross machine made of flesh, his purpose more ego-pleasing by humiliating others than orgasm. One more crap in the internet."}]