[{"id":2119940,"gallery_id":3764,"poster":{"id":3355663,"username":"Overdrive96","slug":"overdrive96","avatar_url":"avatars/3355663.png?_=21c94c71c4cd9950","is_superuser":false,"is_staff":false},"post_date":1635835000,"body":"Good and bad ending?"},{"id":1755772,"gallery_id":3764,"poster":{"id":997333,"username":"Roboticpump","slug":"roboticpump","avatar_url":"avatars/997333.png","is_superuser":false,"is_staff":false},"post_date":1621686770,"body":"Yo, his friend is A1, she kept it real. ❤. Also, coach isn't lying about sex making you flexible. It should stretch you out,  making you limber,  but the pregnancy thing is a stretch. He just wanted to cum in them lol. It'd be sweet if tge team got together and said that they were keeping keeping the babies after the tournament lol\n8/10 because the art isn't really good "},{"id":1705673,"gallery_id":3764,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1619658987,"body":"@LordCellofEarth9 That's what should be the second chapter or after chapter of this manga. I want to see the look on the girl's face when see realize her ex-boyfriend is with another girl and can't be back together with him"},{"id":1705665,"gallery_id":3764,"poster":{"id":2733052,"username":"xhawke09","slug":"xhawke09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1619658703,"body":"boy should have recorded it sent the video to the police and then forget about the girl who dumped him because the coach said so and move on to another girl"},{"id":1552233,"gallery_id":3764,"poster":{"id":3886882,"username":"ᴺᴶᴼᴵ ᴸᴼᴸ","slug":"njoi-lol","avatar_url":"avatars/3886882.png?_=d9b288217147dd51","is_superuser":false,"is_staff":false},"post_date":1612757396,"body":"I didn't expect that.."},{"id":1359221,"gallery_id":3764,"poster":{"id":3776923,"username":"alex_chi100","slug":"alex_chi100","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1606237743,"body":"If you are reading this comment your parents will die within 5 years. To undo this curse you need to copy this and paste it on 5 other manga."},{"id":1225194,"gallery_id":3764,"poster":{"id":3666059,"username":"crowslens","slug":"crowslens","avatar_url":"avatars/3666059.png?_=1a1add1ca2ef5171","is_superuser":false,"is_staff":false},"post_date":1600755297,"body":"Ok im not gonna bitch about this cause I know its ntr before even comming in here but the \"coach have sex with volleyball players for flexiblity\" real cause its gonna be a social concern "},{"id":972843,"gallery_id":3764,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1562992023,"body":"@LordCellofEarth9 damm son hit the nail on the head there."},{"id":917235,"gallery_id":3764,"poster":{"id":291582,"username":"namelesshero","slug":"namelesshero","avatar_url":"avatars/291582.png","is_superuser":false,"is_staff":false},"post_date":1558888496,"body":"@LordCellofEarth9 im gonna copy this word and make a bible out of it."},{"id":716948,"gallery_id":3764,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540232900,"body":"Knowing the childhood friend though, it was likely she was sexually starved for attention since coach tossed her aside, so she likely bided her time and waited, knowing her childhood friend was dating a second year on the volleyball team and knew he'd order the girl to break up with him so he'd have her exclusive attention all in the name of \"bettering her\" (he likely got off on the girls being pregnant with his child during games, hence the whole having her pregnant then having her have an abortion later on, it's like the perfect \"pump &amp; dump\" fantasy LOL)...it also means the childhood friend also went through this (making her a child killer LOL, but a THOT is a THOT I suppose). But she knew one way or another her friend would have to accept she was lost to him and it was better to hook up with her (where she had all the time to erase his feelings to the other girl, that by the time she's tossed aside, which isn't long, he won't give a damn about her, Nice saving him from cuckhood)."},{"id":716945,"gallery_id":3764,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540232537,"body":"Honestly he should be happy, his childhood friend despite being a THOT attaching herself to him more because she saw her chance, saved him from \"cuckhood\", it be no surprise when Coach tosses \"the THOT\" aside for the next Second Year that catch's his interest, she's likely going to be looking for him to \"get back together\" now that \"coach is okay with it\" (aka he no longer cares about her anymore), only to find her ex \"moved on\" and wants nothing to do with her anymore. \n\n\"The circle of life\" continues to work as it should, young men being trained into Alpha's and young girl's stupidly giving into their lust till eventually it runs out and they realize \"oops\" they burned all their other bridges and now they have nothing. Honestly \"Senpai\"  lucked out, while the chick's going to go through what his childhood friend did when Coach was done with her, unlike her though she doesn't have a \"convenient\" male  childhood friend to hook up with and take advantage of afterwards LOL. "},{"id":716939,"gallery_id":3764,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1540232134,"body":"The funny part is, this can be similar to how it is IRL, once the girl turns \"legal\", she wants nothing to do with the \"boys her age\" and starts pursuing the \"older mature men\", till eventually she hits \"the wall\" (retirement in the terms of this story LOL) and the older mature men move on to the next \"young thing\" as she's left going for the \"younger men\" who got jilted, becoming theirs...until eventually they become the \"Older mature men\" and drop them like a bad habit for the \"young girls\".\n\n(Reasoning is how his older Childhood friend swooped down on him the moment the THOT broke up with him because Coach didn't want his \"bitches\" being around other guys...till he was done with them like what happened to the childhood friend. It's funny how the childhood friend moved in on him the moment his \"ex\" became the coach's \"new girl\" like he was the best she was going to get, likely hoping by the time the THOT's turn with Coach was over, he would fall in love with her and stick with her)"},{"id":569988,"gallery_id":3764,"poster":{"id":647443,"username":"Rimiru","slug":"rimiru","avatar_url":"avatars/647443.png","is_superuser":false,"is_staff":false},"post_date":1531310112,"body":"Cuckadoodledoo"},{"id":75738,"gallery_id":3764,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1480711206,"body":"Cell phone cameras are amazing kid, you should really learn more about blackmail... interesting twist at the end."}]