[{"id":2086364,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634425344,"body":"Mmmm you re right but for now lets wait the proper english transalated and we can talk about it more"},{"id":2086349,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634424700,"body":"Honestly, after looking back over it myself, I’m not seeing much similarity beside the simple fact that they have short black hair. But then you could also make the argument that most of their untranslated “more wholesome” content also has a few MC’s that share that similarity."},{"id":2086317,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634423369,"body":"I had fun speculating and discussing, it’ll be… “interesting” to see how this story ends. Though we might continue this conversation a bit earlier, once the proper English translation comes out and we have a full grasp on the story thus far. As for the face, it could just be a style thing, most of the Milfs in their other work are basically just the Moms here with different hairstyles"},{"id":2086303,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634422693,"body":"@puddingdragon21 @googlemebitch That was a good talk of speculations gentlemen even for me I had fun transalating  This story lol But for now lets settle down and wait until december 10 for chapter 3 "},{"id":2086293,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634422246,"body":"I feel the same way, I’ve no expectations for the ending, but would like it to be more positive because I really like the art and would love to see one of their stories that didn’t end as basic Dollar Store NTR"},{"id":2086286,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634421956,"body":"@googlemebitch you are right lol its a fucking routine and we are having enough of ntrs shit but there is something impactful about This artist he acttually made one vanilla doujin it was in hentai café but the website vanished"},{"id":2086278,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634421549,"body":"For example mom hunter ended with orgy"},{"id":2086254,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634420690,"body":"In ep 2 part2 (This) the main character lasted a while in the woods and the room witch means he wasnt a quick shot anymore in the previous chapter he lasted about what? 1or 2 pages? but here he lasted 3 pages in the woods and 5 pages in the room in My opinión the aunt was enjoying it and sure you guys mentions in hope doesnt  kick the balls about \"I was lying and you fell for it\" "},{"id":2086249,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634420515,"body":"Also, If the Aunt did have some convoluted revenge plot, it would then be especially odd that she wasn’t the focus character, since that’s how basically all of this Authors other stories have worked"},{"id":2086247,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634420393,"body":"My thought now, after looking at this Artists other translated works, is that it wouldn’t be too far-fetched to have this end in NTR. But at the same time: all of those other stories have the focal character be the Woman “being stolen“ and barely feature the actual boyfriend/husband besides the very beginning and end, and they never find out about the affair. I just personally think it would be odd for the Author to let this story drag on for multiple chapters and have the Perspective Character be the guy “losing out” in the end, if it’s literally just going to end the same way as most of his other works, when it could have just been a 1 chapter thing ending without the Son learning the truth. Although I guess the story has gone on for this long because the Author wanted to try something “different” (though still potentially the same type of content as his other works, but I’d like to hope it ends in a reverse situation from the first chapter, as unlikely as that would be)"},{"id":2086240,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634420123,"body":"@googlemebitch mmmm I dont think \nThe mother can be cruel with his son I mean Like seroiusly it would be so stupid and sad about the main character Like @puddingdragon21 said why bringing him in the first place? We are talking about single mothers who didnt have sex and seeing This chapters is a excuse of their mother and their aunt why are having an incest"},{"id":2086226,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634419458,"body":"While I took My time transalating the aunt didnt explain what happened next when she was caught by his sister and My thoughts is This:\n1. The mother stood frozen and the aunt twisted her mind about incest\n2.the most tipical excuse of a hentai woman is she was having sex with tomoki because they are single mothers and therei is other male to fuck with\n3. Like @googlemebitch said she did by revenge? because she was enjoying with tomoki before her twin came by surpise and interrupted her playtime\n4.another logical thought the aunt didnt wanted to get empty handed while seiing her twin sister having sex with his son"},{"id":2086205,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634418719,"body":"To @puddingdragon21 and @googlemebitch read me: every ntr story starts with the mc and her woman or girlfriend and the villain is a ugly bastard,fat guy or buff guy so ripped, but never see a shota as the villain sure but in a lewd ending of some doujins\nAnd tomoki doesn't look ugly only his face is annoying witch is imposible to predict if This little fucker has something to do with it. ok Like i was saying in the NTR world it doesn't focus on the mc too much but here since chapter 1 and chapter 2 intro and part 2 the mc is focused instead of tomoki fucking his mom at his back"},{"id":2086154,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634417387,"body":"The issue with that would be the Author having to take the time to explain why the Aunt decided to do all that, especially assuming that the next chapter is the finale. It would feel incredibly contrived and come out of nowhere since so far (as far as I can tell) there hasn’t been anything in the story hinting to that being the case. And it would be really questionable as to why the Aunt would decide to spite the MC specifically, there’s no benefit to it. Also, with NTR, the author usually tries to show the “cuck” being poor at sex, I don’t think this author would go out of their way to have the MC (presumably) satisfy his Aunt for 2 parts just to have it end up “you loser, I was faking it the whole time, you’re shit at sex”, it’s generally a more in your face out the gate with those story beats"},{"id":2086108,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634415983,"body":"@puddingdragon21 if the artist fucked This ending up then it was a waste of time for some readers and ours including and believe me I would daré send a message to the artist's profile on twitter sending negative things of his stories so retarded( transalated of course hahaha)"},{"id":2086072,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634414997,"body":"Plus there is no dialogue of the aunt mentioning about tomoki's dick is better than hito's and you know thta some ntr the Female dialogues mentions this: his dick is too thicc and large that My husband's or boy friend's"},{"id":2086047,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634414167,"body":"@GoogleMeBitch: If the Mom or Aunt drugged his dinner to keep him from waking to keep him from finding out (which does seem to be what that page is implying), then -again- WHY THE HELL did his Mother bring him on this trip in the first place, It makes this whole plot set up incredibly contrived, especially since, as I said before: This wouldn’t be a plot issue if they just swapped the living situation. (not arguing against what you’re saying, just venting over how frustrating it is that the entire story only happens because the Mom’s a goddamn moron) That said, I doubt it’ll (or at least HOPE it doesn’t) end in NTR because of the focus on the last 2 parts being the MC actually “winning” without some obvious failure or deficiency like him being a quick shot or having a small dick"},{"id":2085918,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634410781,"body":"3) “Good” Ending [least likely to happen, what I’d like to see most]: MC proves himself “superior ” to his Cousin, “takes back” his Mom, and makes her promise to stop fucking the Cousin because now she has him (Bonus if it turns out the Aunt enjoys doing it more with the MC than her own Son)"},{"id":2085908,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634410645,"body":"2) NTR ending [would be dumb, but NTR never cared for good writing]: MC isn’t able to “perform” as well as his Cousin, so both the Mom and Aunt prefer doing it with the brat (could either end in an acceptably depressing “MC’s still part of it but clearly 2nd place”, or the Author could go full on spiteful kick in the dick and have the others try and “cut out” the MC/the Mom decides to stay and send the MC home)"},{"id":2085902,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634410470,"body":"1) Neutral Ending [imo most likely]: The whole family has sex together and both the MC and cousin are equally “skilled”, everybody is satisfied (may just end there, may have an epilogue saying that the MC and Mom decided to stay with them in the Woods, or continued having their own relationship at home)"},{"id":2085886,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634409824,"body":"Given everything that’s happened so far, the details for the next part could be a variety of things but I feel like there’s only 1 real “logical” way to continue: Group Sex, Big Ol’ Orgy, and if any thing else happens I’ll be both surprised and baffled because that would require some dumb bullshit contrivances. After that we’ve got 3 potential, encompassing multi-branch endings that could go a variety of ways."},{"id":2085871,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634409503,"body":" The mc fuck the aunt and she's stills enjoying it look at her face, this proves what she said in the first chapter page 22, @googlemebitch you thinking to much on ntr route maybe you re right the mother planning malicious things to his own son( wich I doubt) then This story is so poor written and the artist would recieve a lot or few negative reviews Look the point is if This a was a complete NTR then the 1rst chapter the aunt would also joined with her twin and the little bastard(thresome) that night and the mc wakes up and he would be peeking at the Door but no, the aunt Makes her move and she broke the mc's virginity and I fact there was no dialogue on the aunt saying that her son's cock is better than hiro."},{"id":2085840,"gallery_id":376407,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1634408312,"body":"Even if the mc loses his temper one word from his mom and he will fold because he's a mommy's boy. Chapter 2 page 4 there's a chance the aunt had been drugging the mc's dinner, maybe she made a deal with the mom to keep the mc none the wiser, but i think she didn't that night to make sure the mc catches them, it's strange she mentions this but maybe she's just covering her tracks, of course a lot of this is conjecture and relies on stupid plot convenience, also there is still a big chance the aunt just wants to bring the mom down to her level and get all 4 of them into a even more fucked up relationship but i think this is going the ntr route."},{"id":2085782,"gallery_id":376407,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1634406790,"body":"It seems the mc's mom only fucks the cuz because she doesn't think mother and son incest is ok, but aunt and nephew is, does that make sense? of course not. She only visits during the summer so for the rest of the year the sister and nephew are still fucking. It's stated the aunt and cuz are lonely living in the countryside so they probably just told the mom to make sure she brought the mc with her, why? corruption they are trying to make the mom lose her inhibitions and abandon the mc, the aunt misses her twin and the cuz just wants that pussy."},{"id":2085506,"gallery_id":376407,"poster":{"id":2556901,"username":"FunnyFear","slug":"funnyfear","avatar_url":"avatars/2556901.png?_=2b8cff737924837b","is_superuser":false,"is_staff":false},"post_date":1634396374,"body":"I had high hopes for a sequel, but nothing happened. Only at the end did they put the fishing line on the next part. Meh."},{"id":2084989,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634374645,"body":"Also now the entire plot hinges on stupidity, like I said in a previous comment: If the intention was getting the MC involved from the start, then the Mom and Aunt went about it in the most roundabout way possible, and relied on the MC being “at the right place at the right time” and not reacting potentially violently at what he witnessed. If there was no plan to get him involved, and they tried to completely keep it behind his back, then He shouldn’t have been on the goddamn trip in the first place. And the stupidest part is: This would not be an issue if you literally just swapped the living situation (MC and Mom live out in sticks, Aunt and Cuz coming to visit, doing this would allow the story to play out the exact same without the entire plot happening purely because the Mom is a complete moron)"},{"id":2084970,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634374073,"body":"Thanks for the rough translation Azrael, I’ve gotta say: The Aunt being a part of the affair was expected, but straight revealing it to the MC here seems a bit not smart. At that point, being the only one who wasn’t “in on it” he didn’t really have a reason to not openly confront his Mother with the fact that he knew what was going on. (And, of course, “realistically” the MC should have reacted to that reveal WAY worse, but it’s hentai (ntr specifically), so I guess I can’t get my hopes up of people acting reasonably)"},{"id":2083158,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634300613,"body":"It could be none of that, it could be as simple as: MC’s Mom and Cousin fuck, Aunt finds out, plans on fucking MC in revenge. But that just begs the question of how she knew they were watching at the end."},{"id":2083150,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634300466,"body":"And if the plan was to literally just be malicious and have the MC watch his Mom get “stolen” from him, then that relies on Him not retaliating in any way. This story ending in pure NTR would require all of the characters to make explicitly stupid decisions for the sake of plot advancement and that’s boring, dumb, and stale."},{"id":2083141,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634300223,"body":"If the next part does reveal that there was some overarching plan going on throughout the story then it’s probably a really stupid one, that would rely too much on different variables and dumb decisions.\n\nif the plan was to get the MC involved in the affair, then it shouldn’t have to rely on Him accidentally stumbling upon his Mother and Cousin, and once he fucked his Aunt the first time there shouldn’t have been a reason to not just openly reveal the whole thing immediately after.\n\nif there was no plan to get the MC involved in anyway (and the Aunt just fucked him out of pity/to make sure he doesn’t expose them), THEN WHY THE HELL DID HIS MOTHER DRAG HIM ALONG FOR THE TRIP (the first page of this whole story is the MC complaining that he didn’t want to come, the Mom could have left him home and he wouldn’t have had any reason to suspect anything was going on)"},{"id":2082858,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634288905,"body":"@MadMan the artist will not be convinced doing that, because that would be a shit of story and a waste of time of every reader "},{"id":2082839,"gallery_id":376407,"poster":{"id":4572962,"username":"[MadMan]","slug":"madman","avatar_url":"avatars/4572962.png?_=2dcca2607e7f3269","is_superuser":false,"is_staff":false},"post_date":1634287931,"body":"It does seem planned and probably will be ntr, you guy's are trying to apply logic to ntr, the mc will probably just run away or cry and start fappin."},{"id":2081995,"gallery_id":376407,"poster":{"id":2673195,"username":"puddingdragon21","slug":"puddingdragon21","avatar_url":"avatars/2673195.png?_=436cd33674692605","is_superuser":false,"is_staff":false},"post_date":1634254757,"body":"If this does end as blatantly basic NTR (I doubt it, it’ll probably just be an open group thing, with the MC and his Mom continuing the relationship at home and going back out every year to do a “swap”), it’ll kinda destroy my suspension of disbelief, even for a Hentai. If the MC does get fully cucked in the end, then he could easily take a few pictures/video and blackmail them, or just resort to assault (I’m not saying he should, but he could). Seriously, he’s a young adult of average build against 2 “hefty-ish” middle aged women and a prepubescent boy whose at least a good 8” shorter than him, they really couldn’t do anything to stop him from completely bodying his cousin and forcing himself on his Mom and Aunt. (And if they did anything to retaliate or call the cops he could just threaten to reveal the whole incestuous pedophilic affair)"},{"id":2081574,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634235539,"body":"Plus, his dick was normal sized (you know how authors love to depict MCs with small PPs to further humiliate them when going full NTR)."},{"id":2081564,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634235301,"body":"@iwillbetheone This artist has never ever done a story where the main character guy that has the story focus gets ntred himself atleast so far i can see. There have been stories where the main character guy takes girls himself from another guy tho or where a main girl decides to take another guy she wants instead of the original guy she wants but thats it.\n\nIt could be that the aunt and her son have a plan but honestly even if they dith and even if the main character sucks at sex what is the point of his aunt wanting to have sex with him if the cousin has both his mom and his aunt to himself then honestly he is the one getting cucked. If this was real hard ntr the main character guy would have no sex my gues is that this will be a shared ending or maybe the main character gets better at sex. I dont think to mutch ntr will happen he already fucked his aunt he already had something so thats a win. In either case mom and son incest will win in the end somehow even if the cousin wins. "},{"id":2080276,"gallery_id":376407,"poster":{"id":1506510,"username":"iwillbetheOne","slug":"iwillbetheone","avatar_url":"avatars/1506510.png","is_superuser":false,"is_staff":false},"post_date":1634180995,"body":"Bro the mother and kid planned this and is probably going to end in NTR "},{"id":2079788,"gallery_id":376407,"poster":{"id":3564930,"username":"Ubuntu ghh","slug":"ubuntu-ghh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634158368,"body":"Why do I have to wait two months for the next chapter is too long"},{"id":2079703,"gallery_id":376407,"poster":{"id":2506292,"username":"Sumiin","slug":"sumiin","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634154301,"body":"This is not \"zenpen\", this is kouhen. This is the second part of the chapter 2, guys. Not be confused. "},{"id":2079214,"gallery_id":376407,"poster":{"id":3968085,"username":"Mastard666","slug":"mastard666","avatar_url":"avatars/3968085.png?_=2c8f386bbdfaf8ba","is_superuser":false,"is_staff":false},"post_date":1634134755,"body":"I don't want foursome. i want a threesome with the little shit watching the three of them doing it"},{"id":2079209,"gallery_id":376407,"poster":{"id":3968085,"username":"Mastard666","slug":"mastard666","avatar_url":"avatars/3968085.png?_=2c8f386bbdfaf8ba","is_superuser":false,"is_staff":false},"post_date":1634134622,"body":"@AJAXBLACKBEAR no shit he's better than a elementary school student at sex"},{"id":2079097,"gallery_id":376407,"poster":{"id":3617642,"username":"flexingdick","slug":"flexingdick","avatar_url":"avatars/3617642.png?_=d67254a219e3cec7","is_superuser":false,"is_staff":false},"post_date":1634128040,"body":"i wanted that little prick have the same experience as mc had in chap 1"},{"id":2079065,"gallery_id":376407,"poster":{"id":3408097,"username":"someguy0098","slug":"someguy0098","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1634126471,"body":"Hell yea keep em comin"},{"id":2078682,"gallery_id":376407,"poster":{"id":1738770,"username":"</>","slug":"_","avatar_url":"avatars/1738770.png?_=3b02e45824f9b5d5","is_superuser":false,"is_staff":false},"post_date":1634107678,"body":"noiceeeeee"},{"id":2078630,"gallery_id":376407,"poster":{"id":4693676,"username":"AJAXBLACKBEAR","slug":"ajaxblackbear","avatar_url":"avatars/4693676.png?_=c76d4534ab056557","is_superuser":false,"is_staff":false},"post_date":1634105981,"body":"I feel like he gonna dominate both because you can see he satisfied her hunger meaning his mom saw that and now in her mind is I bet he better than that kid "},{"id":2078549,"gallery_id":376407,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1634103867,"body":"If I'm not mistaken, usually in manga the eyes like MC (Hiro) at the last page means anger, surprised or something like that. I hope that the eyes of anger toward his mom and that kid. I hope on the next chapter Hiro will say : What are you looking at mom? Am I not allowed to fuck too? If that's happen, next chapter will be more interesting"},{"id":2078432,"gallery_id":376407,"poster":{"id":1343501,"username":"Rathvern","slug":"rathvern","avatar_url":"avatars/1343501.png","is_superuser":false,"is_staff":false},"post_date":1634099428,"body":"Foursome, foursome, foursome, foursome!!!!!!!!! "},{"id":2078146,"gallery_id":376407,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1634088540,"body":"It's not even correct no matter how much they try if they don't pay attention. Look at first page, it clearly says CHAPTER 2 - Part AFTER (Part 2 for us) roughly translated (Kouhen I believe). Anyone who has read hentai for a while would recognize those \"Japanese characters\". Until a translation comes, these reposts are pretty much pointless."},{"id":2078131,"gallery_id":376407,"poster":{"id":1415433,"username":"shethiccaf","slug":"shethiccaf","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634088021,"body":"Nice partner swapping"},{"id":2078124,"gallery_id":376407,"poster":{"id":3971711,"username":"Tamulak","slug":"tamulak","avatar_url":"avatars/3971711.png?_=0df6871372d64662","is_superuser":false,"is_staff":false},"post_date":1634087815,"body":"Foursome obviously 🥳"},{"id":2078107,"gallery_id":376407,"poster":{"id":3447969,"username":"Azrael2020","slug":"azrael2020","avatar_url":"avatars/3447969.png?_=cb2333bd6845bfb0","is_superuser":false,"is_staff":false},"post_date":1634087412,"body":"TRANSLATION!!!!!! "}]