[{"id":2121549,"gallery_id":376522,"poster":{"id":4817708,"username":"eatingspaghetti","slug":"eatingspaghetti","avatar_url":"avatars/4817708.png?_=4357e19c230ad05e","is_superuser":false,"is_staff":false},"post_date":1635916703,"body":"Wow most of this comment section has been filled up by just 2 guy's that's kinda nuts "},{"id":2107108,"gallery_id":376522,"poster":{"id":3359514,"username":"YURICON","slug":"yuricon","avatar_url":"avatars/3359514.png?_=39bea9f4b58749a2","is_superuser":false,"is_staff":false},"post_date":1635288427,"body":"Damn, now I'm depressed more than usual. Hentai's like this makes me depressed and add it up when I'm dona masturbating the world just becomes so sad..."},{"id":2102638,"gallery_id":376522,"poster":{"id":3401701,"username":"RayTC","slug":"raytc","avatar_url":"avatars/3401701.png?_=4ce202cca29c7c26","is_superuser":false,"is_staff":false},"post_date":1635097575,"body":"sweet, a schizo thread"},{"id":2083351,"gallery_id":376522,"poster":{"id":4712219,"username":"Kirby Hakurei Cosmico","slug":"kirby-hakurei-cosmico","avatar_url":"avatars/4712219.png?_=75d0dc17aedcb836","is_superuser":false,"is_staff":false},"post_date":1634309003,"body":"One person could refer Sakuya’s absolute devotion to Remilia aka a vampire being similar to that of the antagonist of Jojo’s Bizarre Adventure Part 6: Stone Ocean, an Italian catholic priest known as Enrico Pucci who is also incredibly devoted to DIO although this could likely be simply a coincidence."},{"id":2083347,"gallery_id":376522,"poster":{"id":4712219,"username":"Kirby Hakurei Cosmico","slug":"kirby-hakurei-cosmico","avatar_url":"avatars/4712219.png?_=75d0dc17aedcb836","is_superuser":false,"is_staff":false},"post_date":1634308840,"body":"Hahaha, this doujin by the name of “Looks like Remilia finds her true love” or Jack the Ludo bile or something like that on the website known as nhentai does indeed incite the feeling in me that one would call as “humorous”. For those who don’t know, this is a clever homage to the popular manga/anime series Jojo no Kimyōu na Bouken (or more popularly known as Jojo’s Bizarre Adventure worldwide) in which the antagonist Dio Brando (later changed to simply “DIO”) is often referenced by those around the character Remilia Scarlet such as Remilia herself, the 6th stage boss of the critically acclaimed Embodiment of Scarlet Devil, and Sakuya Izayoi, the 5th stage boss of the same game. During the years many fans have noted some similarities from Sakuya such as her tendency to throw knives, a weapon that DIO ironically used as a ranged weapon in Part 3: Stardust Crusaders due to guns being useless in stopped time, and Sakuya’s ability to stop time being named “The World”."},{"id":2083155,"gallery_id":376522,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1634300606,"body":"Part 2: but vin is on the other side, somehow already there before you, posting a picture of an elephant with an inspirational quote on social media. He looks up at you and says \"I'm doing a live guys so just have a seat and this is going to be fun, I'm giving you big hugs in a second, I'm doing a live, I'll give you big hugs in a second\" you let out a terror filled scream that splits through the stillness of the night... then the night falls silent. Your found 2 days later by some pothead's looking for a spot to smoke, Your sitting in a corner of the building your body is muscle bound like a Greek God and your constantly whispering... \"I'm doing a live guy's\"."},{"id":2083148,"gallery_id":376522,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1634300454,"body":"Part1: the abandoned house sits silently amongst the dead trees dimly lit by the crescent moon.  you walk up to the door and reach out a hand to open it but it creaks open by itself \"it's coincidence, this place isn't haunted stuff like that is bs and I'll prove it\" you think to yourself as you walk in. the door slams shut behind you, startled you turn to the door... nothing... must of been the wind... you start heading forward once again,  your dim flashlight poorly lighting the rotting interior of the ancient house, as you move into the next room you suddenly stop, terror turning your blood to ice, a muscular figure stands ahead of you... you slowly move the beam of your weak light up to it's face... it's vin diesel... the rumors were true. your frozen with fear. he opens his mouth and says \"if I were to be a vegetable which one would I be and why? I guess I would be a turnip\" a terror and fear wracked sob escapes your mouth, you turn and run for the door, you open it"},{"id":2082192,"gallery_id":376522,"poster":{"id":3131120,"username":"oskarmoped","slug":"oskarmoped","avatar_url":"avatars/3131120.png?_=f97bacb0ab728786","is_superuser":false,"is_staff":false},"post_date":1634263236,"body":"Good and cute "}]