[{"id":2167527,"gallery_id":376604,"poster":{"id":289607,"username":"KirinoLover","slug":"kirinolover","avatar_url":"avatars/289607.png","is_superuser":false,"is_staff":false},"post_date":1638056430,"body":"Pretty good it's been a while since I've seen good moral degeneration doujin. \n\nPeople taking a out NTR and vsnulle but moral degeneration is such an underused tag ad I'd wish that there's more of it. "},{"id":2124371,"gallery_id":376604,"poster":{"id":3189439,"username":"ArchAngel of Justice_Raguel","slug":"archangel-of-justice_raguel","avatar_url":"avatars/3189439.png?_=cb5e01fa3c40f1a6","is_superuser":false,"is_staff":false},"post_date":1636040712,"body":"what a bitch also man up u idiot"},{"id":2104427,"gallery_id":376604,"poster":{"id":2538916,"username":"ReinnRine","slug":"reinnrine","avatar_url":"avatars/2538916.png?_=9367775daf26aaa9","is_superuser":false,"is_staff":false},"post_date":1635169752,"body":"Another boring ntr plot, hope can find another doujins to fulfill my lust"},{"id":2094441,"gallery_id":376604,"poster":{"id":827006,"username":"ndoujin","slug":"ndoujin","avatar_url":"avatars/827006.png","is_superuser":false,"is_staff":false},"post_date":1634772092,"body":"cucks are not made, they're already born that way, they just need their cuck potential to be unlocked"},{"id":2091450,"gallery_id":376604,"poster":{"id":3707010,"username":"Nastys","slug":"nastys","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1634622069,"body":"Wtf is this cuck shit"},{"id":2091409,"gallery_id":376604,"poster":{"id":745465,"username":"SukebeMx","slug":"sukebemx","avatar_url":"avatars/745465.png?_=bd3db8d9522c231b","is_superuser":false,"is_staff":false},"post_date":1634620817,"body":"9/10 really good history and great character development"},{"id":2091241,"gallery_id":376604,"poster":{"id":1532452,"username":"JackOffCenter","slug":"jackoffcenter","avatar_url":"avatars/1532452.png?_=1a00607a7cfe86ce","is_superuser":false,"is_staff":false},"post_date":1634615458,"body":"Bro this is pretty fucking bad even for ntr lmao"},{"id":2087326,"gallery_id":376604,"poster":{"id":3357691,"username":"Lurker774","slug":"lurker774","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634460170,"body":"It's always funny how vanilla fans cry about 'mUh sAmE pLoT'.They will never waste an opportunity to slam ntrs while at the same time admitting it has better art and best sex scenes unlike the chaste vanilla ones maybe they even secretly wish to have their wives fucked by others 🤣🤣"},{"id":2087002,"gallery_id":376604,"poster":{"id":254891,"username":"Godpk11","slug":"godpk11","avatar_url":"avatars/254891.png?_=ab4e5e460a36e3f4","is_superuser":false,"is_staff":false},"post_date":1634449807,"body":"LOL these comments. "},{"id":2086755,"gallery_id":376604,"poster":{"id":400093,"username":"jmas081391","slug":"jmas081391","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634440608,"body":"My PP turned softy while reading this even tho it didn't happen before in other doujins with NTR and even Ugly Bastards tags. That ending is just too low and trashy af! \nAlso is this even NTR and Cheating? The girl is just a free2play whore!"},{"id":2086263,"gallery_id":376604,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1634421058,"body":"@usamiharu Nah, just deflecting because you have no real argument and are just bitching to be contrarian. And yes, copy-pasta stories are the fault of the creators being lazy. Do better? Drawing-wise, no. Writing-wise, yes. I'd bet I'm not the only one around here that thinks so, either. \"Right to complain?\" Why even have a comments section if we can't give our honest thoughts on a story? Sorry if it somehow hurts your feelings that I like to say more than \"Dat wuz a gud fap!\" like a mindless drone. I never said anything about the NTR genre's popularity, so I don't even know why you're bothering to bring it up. And yes, I've seen a lot of different types of vanilla that isn't childhood friend stuff. If you haven't, that's on you, champ."},{"id":2084902,"gallery_id":376604,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1634372032,"body":"@BZo1480 Deflection ha, was what i deflecting your ignorance? fault of the creator? so you can do better than them? to begin with have you ever even bought their manga/doujinshi and as if you have right to complain about their creation in a pirated site? theirs a reason why NTR is still popular because somebody is paying this creators end of the story, nice talk also for your ignorance, read different type of vanilla your just probably deepthroating the idea or sunshine and rainbows not the vanilla itself you just don't like seeing depressing plot don't open NTR, i always love seeing people saying \"different types of vanilla\" right cause childhood friends,sitting beside each other,teasing troupe,accidental meeting ARE SO NEW i rather watch School Days 24/7 than seeing someone spouting as if Vanilla is always evolving genre whatever."},{"id":2084747,"gallery_id":376604,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1634366224,"body":"@usamiharu To answer the question: Yes, I've read lots of different types of vanilla. I already knew that about the genre, it's the same as the Chinese abusive CEO romance novels/manhuas that have exploded in popularity over the last few years and has the same exact issues that NTR stories have. Has absolutely nothing to do with what I said, but nice try at the deflection. And no, everything doesn't need to look the same no matter how much I read/watch it, that's the fault of the creator for being lazy. Everything else you said is just more boring pointless deflection so I'll just ignore it. Nice talk, champ!"},{"id":2084710,"gallery_id":376604,"poster":{"id":2061364,"username":"hentaienthusiast424","slug":"hentaienthusiast424","avatar_url":"avatars/2061364.png?_=1c3c2bff85a7f074","is_superuser":false,"is_staff":false},"post_date":1634365272,"body":"Disgusting trash"},{"id":2084615,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634362568,"body":"@usamiharu I agree with you that this hate is getting out of hand! I dislike NTR, but this is how it is! The Artist make the choices of what genre they wish to do and NTR has it's fans like everyone else! Feels more like jealousy at the art work in NTR then NTR itself! But again, they're are still good dedicated artists of the other genres! And while NTR will creep up and mix with other genres (I hate it more because it's creeping into my favorite Genre \"Corruption\" more then it SHOULD!), in the end it doesn't mean it's the staple! I wish Netori, Reverse NTR and Netorase would get their own TAGS already, but then I doubt that will help much (Seeing how they keep tagging shit wrong to the point I think their doing this on purpose just to start Wars between the salty \"Vanilla's vs NTR\" fans of both sides! Already see Salty NTR Fans appearing in other genre comments looking for fights!) . but at least it would help in avoiding looking into a Classic NTR by accident more often then not! "},{"id":2084607,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634362218,"body":"@Supercerati Can't really say it hurts at all and I very much dislike Classic NTR! Ruining the story as the writer did hurt the \"Semi-Happy/As in Completely Bad End\" the writer was hoping for! So really, not anything new much less above sub-par!\n\nAlso @Yuzuna don't worry, my \"previous\" comment was just my only response! I know better then to be baited, Let the \"Won't be named, but they know who they are\" loser comment, I'm only stating this more to state they'll be wasting their time and I won't be responding to them (hence why I'm not saying their name!) with \"acting reasonable just to keep the target's attention\" comments as it's been done to death, as they say, \"don't feed the trolls\", I hope they enjoy the tiny crumb here because they'll get no more from me! Moving on anyone have anything more interesting to say on this Hentai :)"},{"id":2084588,"gallery_id":376604,"poster":{"id":1411428,"username":"SuperCerati","slug":"supercerati","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634361353,"body":"duuuuuuuuuude this is fucked up haha, but this doesn't hurt as other NTR..."},{"id":2084422,"gallery_id":376604,"poster":{"id":96184,"username":"yuzuna","slug":"yuzuna","avatar_url":"avatars/96184.png?_=bfa333fd893a79f5","is_superuser":false,"is_staff":false},"post_date":1634354007,"body":"Sigh...here we go again! "},{"id":2084379,"gallery_id":376604,"poster":{"id":519200,"username":"Hilldog","slug":"hilldog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634351570,"body":"@LordCellofEarth9 U mad bro?"},{"id":2084331,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634349274,"body":"@Hilldog Now what \"I\" really like, the people who write \"meaningless\" comment's about people writing essays about NTR in the comment section (that they can avoid by the way since they love using \"shut up and just nut\" also by the way \"practise what you preach my friends!\") of a porn site! I love them SOOOO MUCH, That I could \"Squeeze them to Death!\""},{"id":2084260,"gallery_id":376604,"poster":{"id":519200,"username":"Hilldog","slug":"hilldog","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634345810,"body":"You know what I really like?  People writing fucking essays about NTR in the comment section of a porn site."},{"id":2084133,"gallery_id":376604,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1634340830,"body":"@damonsykes Definitely not using a brain and being blinded by hate, the main reason why Japan is having birthrate problems is not because of NTR whatever crap you're spouting its because of their work culture or should i say most work culture nowadays where most men are expected to work how many hours a week add that with rising cost of living, that's main reason why, btw most first world country nowadays are having birth rate problem, in US people are avoiding marriage and having a family like plague not only because of work,rising cost of living but also adding the feminazis destroying the men and the court easily sides with women, probably try to research on the subject first before you spout nonsense hurr durr japan likes NTR that most be the reason why they're having population problem."},{"id":2084119,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634340040,"body":"Think of it like why some cheaters don't just leave their partner when there's no disadvantage for them! They like she feels \"they belong to them!\" as you note they love to call their partner who LEFT THEM (Or they're the one who left) a \"cheater\" if they dare move on from them (and with someone who looks way better then they are at that!). She feels she \"deserves\" her happy childhood friend marriage ending since they got together, but she's like a recovering addict who just got a fix after being clean for so long! Hell the \"Mysterious Drug\" and her insults feel majorly suspect and feel more like she's mentally abusing him simply to get him \"hooked!\" But it's clear it's selfishness to the extreme! She gets to have wild cheating sex, and as long as she keeps it Netorase for him and gets him addicted, he'll never leave because like an abuse victim, he's too scared of what will happen if he does (The kids make it worse for him, if he leaves, they're illegitimate status becomes known!)"},{"id":2084112,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634339644,"body":"@JohnMichealGarcia The ending was done poorly, but to make sense of a \"silly writer\". It was likely the guy with his \"I don't know what to do\" was at his lowest point, and she realized exactly as you did that she's can't be saved, SHE WANTS IT ALL NOW, and if he's given a chance to think about the situation seriously, he'd have done what you stated, LEAVE! Hence she moved quickly to \"brainwash him\" into believing all that cuck shit was acceptable (him thinking it's \"noble\" feels more \"what she wants\" then himself!) But like brainwashing, he can eventually unbrainwash himself, which is why she needs to keep him \"broken\" with the constant spiritual abuse. But she's more or less digging her own grave with this \"have her cake and eat it\" mentality and ruined everything by just \"embracing what she believes herself to be!\" In the end she CHOSE to go back to the whore life AND breaking him instead of letting him make a decision! She deserves what happens if he gets his balls back!"},{"id":2083947,"gallery_id":376604,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1634331699,"body":"Just leave the slut in the dumps. As simple as that...sure, it sounds noble to love like that but that's just stupidity. There are plenty of fishes in the sea as they say. "},{"id":2083936,"gallery_id":376604,"poster":{"id":193594,"username":"damonsykes","slug":"damonsykes","avatar_url":"avatars/193594.png","is_superuser":false,"is_staff":false},"post_date":1634331178,"body":"it's pretty sad how popular NTR is in japan. it's no wonder that the guys are known worldwide as the country of betas. full of Japanese women and yet the country suffers from the birth of children. NTR is for cucks, beta males and Japan is full of them."},{"id":2083841,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634327727,"body":"But yeah, people need to stop getting salty on NTR cause it's a waste of their time to do so! I use to be like them, but as I've established, I stopped getting mad \"at a cow for saying moo instead of Meow!\" Seriously stay away from NTR Chapter stories, they're not going to end differently, those that have are as rare as seeing a pig get catapulted in the sky after saying when pigs fly! Your just going to be disappointed! This one was not a surprise, but damn was the writer so desperate to satisfy certain folk, they satisfied NO ONE! Interesting Start, very poor ending (It was obvious her bitchiness at the end was her attempt to crush his spirit so she can like the writer \"have her cake and eat it!\" She wants to go back to being a Nympho Slut, but doesn't want to lose him, so why not turn him into a broken cuck, at least then he has to stay cause \"he's in love with her and it would be too painful to leave\" as she did it when she knew he was at his lowest, better set up would be good!)"},{"id":2083830,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634327383,"body":"@usamiharu Though to be truthful Vanilla's specifically those with art work reaching what you see in NTR are starting to become uncommon enough with the rate of NTR and those trying to get on that train, that they've actually gotten BETTER then just plain BECAUSE of the sameness factor NTR is starting to show (specifically It's Syndrome's \"And when everyone is super...no one will be\") Sameness can be forgiven if it's not annoying, Anyone else BUT NTR can't really afford to play sameness all the time because it's strength was \"it was something different\" (rather then happy endings, instead they were unhappy in a certain viewpoint endings!), now it's bland, though Reverse NTR and Netori have been the better alternatives then \"classic\" NTR because they don't have the annoying stupid shit (Cuck having small dick syndrome, ETC) and there rarity helps (more so with godly art). NTR is seeing Diminished returns because like this one, they don't want to veer from the familiar!"},{"id":2083653,"gallery_id":376604,"poster":{"id":11982,"username":"usamiharu","slug":"usamiharu","avatar_url":"avatars/11982.png","is_superuser":false,"is_staff":false},"post_date":1634319919,"body":"@BZo1480 You can only make so much story etc eventually most stories will just become look identical, its also no different from vanilla to normal anime or really whatever, like do you think Vanilla you read are all different? lol formula all look identical only differences are the char. and you be surprised the one who made NTR popular are mostly women, just accept the fact eventually if you read too much porn or anything everything will look identical you're just butthurt over the fact your trying to take seriously a doujinshi you probably didn't even bought it and as if you have right to complain about it lol, your acting same as idiots from twitter etc who get angry over games,movies that \"hurt\" their feelings that they didn't even buy."},{"id":2083500,"gallery_id":376604,"poster":{"id":3373131,"username":"bgin","slug":"bgin","avatar_url":"avatars/3373131.png?_=98c351a6552ecfa0","is_superuser":false,"is_staff":false},"post_date":1634314788,"body":"Of course it's a \"dark\" past if the guy has no eyes!"},{"id":2083343,"gallery_id":376604,"poster":{"id":1868269,"username":"leeto1414","slug":"leeto1414","avatar_url":"avatars/1868269.png","is_superuser":false,"is_staff":false},"post_date":1634308742,"body":"Goddamn...."},{"id":2082732,"gallery_id":376604,"poster":{"id":1588277,"username":"Criticaster","slug":"criticaster","avatar_url":"avatars/1588277.png","is_superuser":false,"is_staff":false},"post_date":1634284275,"body":"Disgusting cuckshit."},{"id":2082719,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634283634,"body":"Funny enough, because of this boredom and finding no reason to get upset over the \"rage inducing\" shit NTR tries to invoke that starts the \"Vanillafag vs NTRCuck\"  I ended up reading Netori and Reverse NTR (Or as I call it \"Male Taken\") and found those WAY more interesting story wise AND hentai wise! No matter how much they try to detract story critiquing of hentai, if it has a story, it's going to be analyzed! Story in Porn is to SET the mood! Do it badly and no matter how godly the art and sex is, your going to get pulled out of it really fast, even if your not a story guy (if I wanted no story! I'd look at IMAGES! Hell I do that anyway WITH NTR that have good sexy art! Just go to their Non-ENG and only look at the pages of the fucking! Sadly Many CLASSIC NTR are too focused on getting the Cuck involved that makes it ruins the art). Art for this gets a 7/10 (Seen Better), Story Gets 6/10 as the landing fucks it all up (but I can see the potential of the ending in a different manner) "},{"id":2082716,"gallery_id":376604,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1634283550,"body":"NTR stories will probably never change unless the fanbase starts rejecting all the lame cookie-cutter stories that have been flooding the market the last 10 years or so. And that includes popular artists like Sanbun Kyoden and Rocket Monkey whose stuff is quite literally the exact same story with barely any alteration."},{"id":2082713,"gallery_id":376604,"poster":{"id":1082419,"username":"LearnWithDoujins","slug":"learnwithdoujins","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634283339,"body":"He hadn't even talked to her for like 5 years, why's he still acting like a cuck lol. Good shit tho"},{"id":2082708,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634283253,"body":"Less a professor and more someone who's \"seen them all!\" up to this point! Not a Fan of NTR, specifically \"the classics\" (I title them \"Female Taken\" as it's the woman being stolen), it's less to do with being mad or upset as \"you get use to it!\" (LOL) and more \"annoyed now\" that feeling you get when you eat the same meal over and over again till your BORED with it! I mean seriously this whole \"baiting people to think this NTR is going to do something different then go the normal route\" is starting to loses it's flavor now (Not even \"It's NTR what do you expect\" crap, I see no reason to \"chapter\" NTR, especially if you can do it all in ONE DOUJIN (Feels like a waste of time to make chapters! You're building up NOTHING!)"},{"id":2082661,"gallery_id":376604,"poster":{"id":4005124,"username":"Professor Monke","slug":"professor-monke","avatar_url":"avatars/4005124.png?_=1f306761978213e1","is_superuser":false,"is_staff":false},"post_date":1634281096,"body":"art 9/10 plot 8/10, guy below me is a Professor of Ntr"},{"id":2082630,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634279448,"body":"I get that the end was suppose to be her deciding on her own that if she gave him time to \"commute\" the information naturally, he'll pack his shit and leave her (Looking at it, she was likely in the \"thrown away\" state when they \"reconnected\" and believed he was \"her last chance to be a bride and proper woman\" then asshole came along and \"reawaken the beast\", deciding \"she'll have her cake and eat it\" so what if he's broken, he's \"happy\" so \"it's all good!\" \"who cares if the babies I birth aren't his, just the fact he WON ME AND I COME BACK is more then enough!\" She went full on Bitch Mode...would be funny if he wakes up and abandons her and the brats in the future! She'd be redeemable abit if she was lying about the \"other men's kids\" and was pregnant with his before she fucked around and it was just RP on her part!) but seriously, if you're making a story, try to stay consistent! Unexpected shit is only expected in \"COMEDY\" stories. Plus Open Endings still garbage! ESPECIALLY IN NTR!"},{"id":2082621,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634278974,"body":"@blackjack Most likely the writer's first part wasn't well received, and he already had the start and middle part made for this, so backtracked (\"tobajas\" pointed out how Glasses dick was big in the first story, yet suddenly became small and himself a P.E. all of a sudden! I'm guessing the artist want's us to believe those things happen to a guy the instant he got cucked...despite the fact it was diverted!) The start and the end of this story is confusing cause it looks like the artist wanted to have his cake and eat it! Subvert expectations with the \"Asshole\" getting caught cause \"reality\" is a thing (what with that love of \"snitching on themselves\" by \"sending pics\" and KEEPING THEM where the cops can seize them for evidence!) then decided \"nah I'm going to end it traditionally without it making much sense!\" (He was likely going with \"MC was SO confident till he discovered his Childhood Love was already stolen. Even if Long AGO! That Virgin obsession they feel their fans have)"},{"id":2082609,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634278611,"body":"@tobajas It's why I said the artist isn't very good at \"consitincy\" with his stories! I mean if he can't do it well in single stories, he damn well can't do it in \"two chapter\" ones LOL. Someone noted that same shit too! That it looked like he was going in one direction with the story, already had the first and mid point of the second half already made...but then chickened out or feared he was \"going to far from NTR tropes\" (they seem scared that if they deviate from the classics like \"Small Dick, Premature Ejaculator, ETC\" with the NTR Male Protagonist then the NTR fanboys will riot! Don't get it, I'm sure they'd be happy to see something new then something familiar to the point IT might as well be Vanilla rather then the actual genre for how plain it's become!). Artist ain't great at \"acing the landing\" if you know what I mean seeing how all his stories end \"badly\" as in not well! Might have been the first story wasn't well received like he hoped and so he backtracked stupidly!"},{"id":2082536,"gallery_id":376604,"poster":{"id":4630950,"username":"yk930","slug":"yk930","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634276168,"body":"What the hell is this, fucking bitch...\nIm so annoyed when she said let's raise other people \"babies\"... \n"},{"id":2082499,"gallery_id":376604,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634274646,"body":"Funny how in the first part the guys dick is pretty much as big as the rapist but he's a premature ejaculator and bad at sex since he was a virgin then in this part his penis has shrunk to be barely half his previous size"},{"id":2082477,"gallery_id":376604,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1634274054,"body":"Damn that's hurt...       "},{"id":2082461,"gallery_id":376604,"poster":{"id":847082,"username":"Evidenox","slug":"evidenox","avatar_url":"avatars/847082.png?_=60d51aab2cb60003","is_superuser":false,"is_staff":false},"post_date":1634273049,"body":"I don't feel the usual rage with this one I just feel defeated and sad... just a deep sadness."},{"id":2082411,"gallery_id":376604,"poster":{"id":1048432,"username":"blackjack69","slug":"blackjack69","avatar_url":"avatars/1048432.png?_=7edaa63e63fcc231","is_superuser":false,"is_staff":false},"post_date":1634270508,"body":"Damn, it be better if the mc wasn't a cuck"},{"id":2082393,"gallery_id":376604,"poster":{"id":3715328,"username":"User28583","slug":"user28583","avatar_url":"avatars/3715328.png?_=718315a25b9f0792","is_superuser":false,"is_staff":false},"post_date":1634269790,"body":"Lmao this was alright. I’d give it a 7.1"},{"id":2082224,"gallery_id":376604,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1634264218,"body":"SIMP LORD MC"},{"id":2082194,"gallery_id":376604,"poster":{"id":3529260,"username":"mashu8282","slug":"mashu8282","avatar_url":"avatars/3529260.png?_=22f496002333ea5d","is_superuser":false,"is_staff":false},"post_date":1634263393,"body":"HELL YEAH BABY!  "},{"id":2082177,"gallery_id":376604,"poster":{"id":231401,"username":"hentie85","slug":"hentie85","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1634262663,"body":"My heart hurts\nbut its fappable as hell"},{"id":2082162,"gallery_id":376604,"poster":{"id":3960399,"username":"Mecanicus","slug":"mecanicus","avatar_url":"avatars/3960399.png?_=0ae12805d577304c","is_superuser":false,"is_staff":false},"post_date":1634262057,"body":"The author did his best at making a somewhat believable story for an ntr including pacing.\nHer solution to the problem is forced as well as the mc being the typical cuck mc of every other story. Other than that this is one of better ntr stories in recent uploads. The art isn't bad either 8.5/10 if the cuck mc had been normal and just broken it would of been higher imo."},{"id":2082058,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634257771,"body":"But then this artist has a record of \"badly written stories\" that I'll give points for the start of this one being that he called the cops (seriously why sent FUCKING EVIDENCE of your crime! Even more funny since reality ensused where they found all his other Blackmail pictures, which assures he's never getting out anytime soon....and if he does he'll wish he didn't as no one's waiting on him LOL)\n\nHe makes an interesting start, but then fudges the ending for no good reason (small cock, her suddenly being a bitch for no good legit reasoning, at least in this one, it's explained she knows the only thing waiting for her if he leaves is being a pump and dump till she's no longer viable for even THAT, but it's just fucked up she would go as far as cucking him and being cruel just to keep him. Best End I see is he finally realizes how fucked up everything is by the time the kid is born if it's not his and gets out, causing the self fulfilling prophecy she assured for herself to come true)"},{"id":2082047,"gallery_id":376604,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1634257357,"body":"@Xinoelat Makes sense! Looking at the intro page on her and the story, she's aware she's thrown away used goods and Kyou her \"last chance\" at having a \"staple life\" (It did say she was almost \"disowned\" so I figure her relationship with her family isn't good at this point!). She can't let him go after everything and so she became just as bad as the person who broke her. Basically she wasn't giving Kyou \"a choice in leaving her or not!\" If she can break his will now and get him into \"Netorase\" then she assures no matter how bad she falls, he'll always be there to pick her up...just like when they met again that started the relationship! She's just full of \"as long as he's happy, it doesn't matter what fucked up shit she does to him\" BS (explaining the breaking him and open cucking him....that's IF she's not pregnant with his kid BEFORE that guy to give the illusion of cucking him!)"},{"id":2082005,"gallery_id":376604,"poster":{"id":4059903,"username":"Xinoelat","slug":"xinoelat","avatar_url":"avatars/4059903.png?_=50e67eb3eac5afde","is_superuser":false,"is_staff":false},"post_date":1634255126,"body":"HAHA \"Then you should be broken too\" damn she's a bitch. Pretty good art though."}]