[{"id":2298531,"gallery_id":376957,"poster":{"id":4717644,"username":"PrawnCatcherShiko","slug":"prawncatchershiko","avatar_url":"avatars/4717644.png?_=1a9160e61d4118f4","is_superuser":false,"is_staff":false},"post_date":1643502221,"body":"@nightmarenico I can tell you, this would be quite the endeavor to translate the whole thing. Even if you don't speak Japanese at all, the first story is about a boy who is being bullied by some girls, and he discovers an app on his phone that says it can hypnotize people and make them do whatever you want. Then the part 2 it seems the first girl who was bullying him when she looks at him she gets flustered and it seems like even cums while doing a problem at the board in class... and the second girl, like the rest of the girls are hypnotized but the girl he's fucking isn't. Somehow. Then they decide to play the reverse card and try using the app on him because one of the girls actually likes him. I'm having trouble telling who is saying what after a point. The dialogue isn't much that you wouldn't be able to figure out. In the second part he's telling the girls to take lots of pictures and the girl he's fucking is like NO DON'T TAKE PICTURES and \"oh your breasts are cute\" etc."},{"id":2094146,"gallery_id":376957,"poster":{"id":3445281,"username":"TheHorniMelon","slug":"thehornimelon","avatar_url":"avatars/3445281.png?_=6bb42523fe513f32","is_superuser":false,"is_staff":false},"post_date":1634758370,"body":"such a masterpiece"},{"id":2091862,"gallery_id":376957,"poster":{"id":1874987,"username":"IzumiKei","slug":"izumikei","avatar_url":"avatars/1874987.png","is_superuser":false,"is_staff":false},"post_date":1634635659,"body":"It's really weird to see a doujinshi trying to do a plot twist. Like the first one, the cute girl did the hypnosis app and molested the boy before giving him the app to take revenge..."},{"id":2091571,"gallery_id":376957,"poster":{"id":2546209,"username":"TheDankDoge","slug":"thedankdoge","avatar_url":"avatars/2546209.png?_=ac1d393e37a9c7dd","is_superuser":false,"is_staff":false},"post_date":1634625753,"body":"We really do"},{"id":2090223,"gallery_id":376957,"poster":{"id":1125475,"username":"nightmarenico","slug":"nightmarenico","avatar_url":"avatars/1125475.png","is_superuser":false,"is_staff":false},"post_date":1634570534,"body":"I know it's pathetic to ask for this, but we need eng translation :{"}]