[{"id":2144144,"gallery_id":377049,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1636946302,"body":"Some addition about the ending. Yuma was actually hesitant about their S&M play Rena asks from him. He realizes it can spiral out of control. Yet Rena says it's alright, because even if Yuma became abnormal, she will love him. In fact, it's better if he became someone who wouldn't be able to have proper relationship with any other girl. Rena starts to have interest on Gen when he scolded her about the sushi counter, but seeing how devastated she is when seeing Yuma's affair, she still loves her boyfriend. I think it really starts their ruin when Rena decided to stay rather than following Yuma to university after graduation. At least they can still be couple. Yuma is definitely addicted and being unable to put it out is stressing him, but he can never found any other woman who can properly fill that need after Rena. Rena wants to stay in romantic relationship with Gen who loves her, so both never got back together further than being sex friends."},{"id":2092295,"gallery_id":377049,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634657846,"body":"Slight correction: Yuma and Rena met again and resumed S and M play before their respective marriages, not after (hence 10+ year affair). They kept dating and married their own partners during that time, and at some point they even considered breaking off the affair but ended up doing it again before being exposed by Yuma's wife."},{"id":2092242,"gallery_id":377049,"poster":{"id":3576751,"username":"martinex","slug":"martinex","avatar_url":"avatars/3576751.png?_=4f0669cbc94b9ca2","is_superuser":false,"is_staff":false},"post_date":1634655174,"body":"@shadowfairy Thanks for the summary bro!"},{"id":2091726,"gallery_id":377049,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634630940,"body":"Story (cont.): Meanwhile Gen also gets on a whole new level of mad at Rena (saying things he would never say before), but he also blames himself for always being at the sushi shop and leaving Rena at home. They try to repair their relationship for the sake of their children, Rena stopped having affairs, but because of their inner feelings (Gen being pent up mad at the 10 yr+ affair, Rena still feeling M for Yuma), they awakened a new play where Gen chastises Rena during sex about Yuma. Fast forward later again, Yuma still hitting on girls at work, finally gets caught after strangling a prostitute, goes to jail, people who knew him at school are surprised (he was outwardly a nice guy) and call Rena to inform her about it, she doesn't bat an eyebrow for him or the news, flashback to high school Yuma asking Rena if she still wanted to be with him despite his S play, high school Rena says she'll take all of it no matter what it is, she'll be with him forever, the end."},{"id":2091700,"gallery_id":377049,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1634630148,"body":"Story: S (boy, Yuma) & M (girl, Rena) couple. Rena's parents run a sushi restaurant where a sushi-chef-in-training boy Gen works at . Gen discovers couple going at S & M play, later Rena tries to seduce Gen but he flatly rejects after she disrespects the sushi counter. Fast forward later Yuma goes to college while they maintain long-distance relationship, fools around with other girls, is exposed by one of them and they break up. Rena then hooks up with sushi boy but he is an M while she secretly craves an S to fuck with. Fast forward later again and Yuma gets married to that same girl who exposed their affair, Rena gets married to Gen. Yuma and Gen meet each other again and they resume S and M play. They continue this affair for more than 10 years until Yuma's wife (now 32) discovers the affair, throws a fit, takes their kid and divorces Yuma."}]