[{"id":2542510,"gallery_id":378582,"poster":{"id":4873270,"username":"Adowsh","slug":"adowsh","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1653211768,"body":"DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS DO NOT READ THIS If you are reading this comment your dick will be shortened by 4 inches whitin 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry, please forgive me. I know this may be seem nonsense but not gonna risk."},{"id":2123799,"gallery_id":378582,"poster":{"id":3761347,"username":"DemonWithinJ","slug":"demonwithinj","avatar_url":"avatars/3761347.png?_=2018ea0d43772b3f","is_superuser":false,"is_staff":false},"post_date":1636010962,"body":"so the coach is the actual mc, hmmm. better than beta bf i guess"},{"id":2121287,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635904695,"body":"@GoogleMeBitch While they could just be red herrings, I've been wondering if the \"Judas\" might be Eri or Shoma(or maybe both) since Coach weirdly brought them both up for no clear reason. It'd kinda fit with Eri being jealous of Yuki and Shoma bearing a massive grudge against both of them. Shoma spills on what's been happening to Eri and she snitches to Yuki's parents that Yuki went off with Coach alone and blows up her alibi about sleeping over with friends for the tourney afterparty. Just my thoughts on what the big twist could be."},{"id":2119368,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635809295,"body":"Initially, I was leaning toward Coach getting a happy ending(ugh...), but with this filler chapter and the supposed importance of the Bible quote on the first page, I feel like whatever the twist is that's coming will end with Coach getting exposed and possibly getting jail time because he throws himself under the bus to protect Yuki from any blowback."},{"id":2119360,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635808888,"body":"As always, credit for the summary goes to defan272 from EH."},{"id":2119336,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635807744,"body":"Summary/9: She wraps her legs around him and screams out how good it feels, and how much she loves it. Coach interprets this as her telling him she loves him and replies that he loves her too. End of the chapter."},{"id":2119334,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635807560,"body":"Summary/8: He notices that she's still soaking wet and has been making wet sounds all this time. He fingers her. Yuki thinks she's going crazy; she keeps thinking someone will see them, and the greater the possibility of that, the more excited she gets. Coach gets hard. He makes Yuki walk in front of him to hide his erection. They shuffle forward in this awkward position. Yuki can barely move her legs, even though she'd get there in five seconds if she ran. She thinks that everything will come out if she opened her legs, and prays that they hurry up and reach the room so that he can stick it in her. As soon as they get in and close the door, Coach plunges it into her. They barely take one step in before both drop to their knees with Coach inside of her. Coach pounds her harder and harder, and they make their way slowly into the bedroom, and Coach falls on top of Yuki. He drills her even deeper and Yuki lets out a loud scream that she's afraid others will hear. "},{"id":2119331,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635807360,"body":"Summary/7: They make out in the elevator. Coach scolds her for not enduring it until they got back; her switch has been totally flipped. He comments on how hot they both feel, and that the elevator is warm enough already. Then he teases her with the possibility that someone might be waiting for the elevator. At this hour there are bound to be people walking around. What will she do if someone sees them? Yuki's panic rises as the door opens, but nobody is there. Coach admits that he would have gotten in trouble too. Yuki falls weakly to the ground, admitting that her legs gave way from the excitement. Coach pulls her up and calls her a pervert. She blames him. They hear people coming, and go down the hall quickly. A group of older men tease them by asking that they keep it inside the privacy of their room. After they leave, Coach asks Yuki to keep walking, but she won't move."},{"id":2119324,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635807141,"body":"Summary/6: Yuki wonders why he's bringing Shoma up now. He starts eating her out and tells her to keep her voice down or they won't be able to come here again. Yuki realizes that she can't cum with anyone except Coach, but when she's with Coach, she can cum over and over again. Coach asks her if she likes being eaten out. Weakly, she responds that she loves it when Coach does erotic stuff to her. Coach calls her a pervert and remarks on how defenseless and addicted she is, and how the splashing sounds they hear aren't coming from the hot spring. Yuki suddenly feels some pain and realizes that he's doing her raw. She cums again. Coach tells her that this was better than he expected and he's bringing her here again next year, since she likes it so much. Yuki doesn't know what'll happen in the future, but she just wants to enjoy this moment. She tells him she's about to cum, but he pulls out and tells her to exit the hot spring because their time's up, so they'll keep going in their room."},{"id":2119320,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635806937,"body":"Summary/5: Yuki asks why he would say something like that. Coach reminds her what she said: We don't have to worry about Shoma anymore, do we? Coach tenderly kisses Yuki; she doesn't push him away. She says that she did promise him that night of camp to devote both her talent and her body to him, and she intends to keep that promise. Coach gets hard. Yuki begins to suck his cock, thinking silently that this is what she wants right now: to push her body to the point of exhaustion so that all of her thoughts and feelings can disappear. She sucks him off faster and faster, and suddenly he pulls his dick out of her mouth. She swallows whatever pre-cum/cum came out of his dick, unable to breathe but thinking that it feels so good. Coach asks her when she has gotten to the point where she could almost cum just from sucking his cock. They change positions. Coach fingers her while asking if Shoma ever had weird sex with her for her to be this wet right now. "},{"id":2119306,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635806033,"body":"Summary/4: Bath time. Coach offers to rub Yuki's feet with mud and put them into the bath, which she initially is reluctant to do. He explains that the hot springs here do wonders for pain. Yuki insists that she wash her feet first, but Coach reminds her she already promised him she's do whatever he asked. While he's rubbing her feet, Yuki feels almost as if he's doing post-practice care for her, but it's different this time; it's something... more than that. Coach asks if it's helping her aching muscles. She says she's not sure. He reminds her to keep an eye on her physical condition at all times. She suddenly pulls away. Coach sighs and answers her question from earlier: Asahi was only ever a student to him. He was just worried about Asahi when she was forced to quit track, which is something he's not worried about for Yuki, because she's not quitting. He then sits next to and admits to her she's the first person he's ever wanted to bring to this hot springs resort. "},{"id":2119300,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635805601,"body":"Summary/3: They get to their room. Yuki's getting turned on already at the prospect of \"taking a breather\" in a place like this. But first, they have dinner. Yuki remarks that it's like they're on a school trip, causing Coach to do a double take and ask her if she's never come to places like this with her family. She explains hat her mother can't take holidays off, and that they didn't get food this good at the training camp anyway. But Yuki looks happy and Coach is secretly glad. She observes him drinking and notes how this is the first time he's seen this side of him, apart from all of his other sides she's seen (cooking together, sleeping together, training together). She notes again that he seems weirder lately."},{"id":2119293,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635805253,"body":"Summary/2: Coach tells her that Eri had praised her recently, but she suspects that she was just sucking up to him. Yuki wonders where they're going and asks if there's a training ground this deep in the mountains. She remembers that she's stayed over at Coach's place many times by now, and this is the first time they're going somewhere else together. Coach replies that they're \"taking a breather\" today, since she ran well in the tournament and looks exhausted. But something is bothering Yuki. She asks if Coach once took Asahi here too; she thinks Coach and Asahi used to date. Coach dodges the question. They arrive. Yuki mentions payment for the room but Coach insists on paying for them both since he's a working adult. "},{"id":2119287,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635805068,"body":"Summary: According to the artist, the first panel is a Biblical reference to when Jesus washes Judas's feet despite his future betrayal, as a proof of unconditional love. Some time after training camp, Yuki and Coach are at the national inter-school athletic meet; she placed sixth in the women's 400m regionals to qualify. Back at school, Shoma and the other guys now they feel far away from the action and are only practicing in the morning since the staff have to prepare to prepare for the tournament. Coach isn't even at school and they wonder if he's chaperoning for the tournament. Shoma looks unimpressed. On a mountain road, Coach and Yuki are driving somewhere. He asks what she told her parents. She told them she's sleeping over with friends for the tournament afterparty. He says that she seems to be getting along well with Himeko and Eri lately, but she's worried that Eri might hate her."},{"id":2119283,"gallery_id":378582,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1635804885,"body":"I'm gonna post the summary from EH, but be warned that this is in essence a filler chapter."},{"id":2119222,"gallery_id":378582,"poster":{"id":2820002,"username":"Tsunamiii","slug":"tsunamiii","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1635801651,"body":"有情人终成眷属吧，苦主何必为难自己"},{"id":2118491,"gallery_id":378582,"poster":{"id":4693676,"username":"AJAXBLACKBEAR","slug":"ajaxblackbear","avatar_url":"avatars/4693676.png?_=c76d4534ab056557","is_superuser":false,"is_staff":false},"post_date":1635764731,"body":"The twist better be the bf kills the coach because I feel like he is slowly going to the point of insanity because is it wrong to want see the douchebag get killed by the MC or destroy the coaches job by showing everyone in school and everyone he knows and police so he can’t find any job and when he is in shitty apartment 17 years later the MC grown up and visit the coach and kills him and you see the slut ex gf eight collar around her neck and pulls away with the line thank you for showing me I need to control a bitch only way you can domination and punishment "},{"id":2118265,"gallery_id":378582,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1635753362,"body":"When a series reaches to a hot spring scene, usually it represents as a serious deepened relationship to affirm \"this is it\". So, let the fuckfest begin for Coach x Yuki. Shoma, pls do us a favor, just give up and save yourself the trouble; hell even the character's purpose has already shifted many chapters ago from trying to keep Shoma into the team to 'idgaf' stance. And the promised 'twist ending' better not be again one of those retarded \"my heart &amp; soul belongs to you but my body belongs to Coach\" or any of its variants."}]