[{"id":2230279,"gallery_id":378611,"poster":{"id":112361,"username":"8milesaway","slug":"8milesaway","avatar_url":"avatars/112361.png","is_superuser":false,"is_staff":false},"post_date":1640813689,"body":"On pg. 56 and pg. 101, its clearly viewed that protagonist(武村) were unhappy about female protagonist(深月) kept asking for supply while he has to risk his life scavenging an additional supplies for 3 person in the apocalyptic world, so it's a matter of give and take.\n\n Although he did admit he has an interest on her body(underage yet anime busty, from my point of view you can ignore it) on pg.101.\n\nHopefully you boys can get a clear view on protagonist's mindset."},{"id":2200556,"gallery_id":378611,"poster":{"id":63542,"username":"asdtgfh27","slug":"asdtgfh27","avatar_url":"avatars/63542.png?_=0b1f1dfe174b74cc","is_superuser":false,"is_staff":false},"post_date":1639580491,"body":"我覺得弟弟們比較可愛"},{"id":2124107,"gallery_id":378611,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636026634,"body":"Correction: the two kids are FMC's lil bros. I made a mistake and used \"his\" instead of \"her\" when I first mentioned it. Just gonna point it out in case it has misled some to think the other way. Also, just to further explain, MC is taking advantage of FMC here but to MC, it doesn't really matter to him if FMC chose to decline his offer to help. He's kinda portrayed as an apathetic guy in a sense. For the most part, it's his own survival and needs that he prioritizes so if FMC declined there, it's just one thing off the things he has responsibility for. His action is evil, but he isn't quite an evil character here. I mean, he's meeting his ends of the deal by ensuring the 3 are alive. I don't quite feel this doujin gave it much detail but here it is."},{"id":2124092,"gallery_id":378611,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636025829,"body":"(Afterword) I forgot to add the part where he discovered a campsite cabin that seems to be isolated and free of zombies. Another is a flashback detailing FMC's story. Their fam was attacked as they were evacuating along with their neighbors. The 3 of em found the building they were now trapped in and there were a lot of people there at first. But knowing that they can't stay there forever cuz food and stuff, people after people started venturing out but failed to return. Eventually, it was just the 3 of em and a creepy dude. Scared, she locked themselves away from the dude and we never saw him again. Thinking back, these two are actually kinda relevant and I should've included em. My bad. Kinda spoiler-y but it's better that I mention it now than never."},{"id":2124079,"gallery_id":378611,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636024827,"body":"(2/2) manged to lived that one because he had a gun with him. As they talked, FMC realized that she still needs MC to survive, so she decided to pay him back with the real deal sex at night. She was a virgin.Next scene, MC eventually cleared the lower floor of the building FMC's stuck in of zombies so they looted for stuff. They also had sex while she's wearing a school uniform. Little by little, FMC seems to enjoy their sex now. Anyway, next scene MC got a radio call from a school. They are asking for help, so MC decided to go on his own. To his surprise, the whole place is infested. Not only that, there seems to be a male zombie that is much stronger and more intelligent than the usual. He found a video cam in which he was able to theorize that the more humans zombies eat, the closer they get to having human-like traits. He didn't like this. As he was about to leave, he saw a female zombie wielding a weapon. He got back to FMC's place but something doesn't feel right. TBC"},{"id":2124061,"gallery_id":378611,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636023709,"body":"I kinda just skimmed thru this one since the plot is just a simplified ver of the VN and I played it. Anyway, here's a summary: (1/2) MC got bitten by some dude, he got sick, and locked himself up for days. When he woke up, zombie apocalypse happened and for some reason, he's the only one that zombies don't attack. He later found a zombified hot neighbor who he locked up in her flat and use for his sexual needs. Anyway, he freely goes around the city and found FMC and his 2 lil bros stuck in building. He decided to help em without telling his special ability. At some point, he felt that it's pointless to help em so he offered for FMC to pay with her body. Desperation calls and she eventually did it with her hand. (MC isnt necessarily portrayed as an evil character here but yeah). FMC had enough and decided to escape with her bros, but MC managed to stop and save them. He was mad at her for her stupidity. To FMC, it looks like he almost died and to convince her, he told her that he --"},{"id":2122748,"gallery_id":378611,"poster":{"id":4486949,"username":"justrandominternetuser","slug":"justrandominternetuser","avatar_url":"avatars/4486949.png?_=78c70432d5936292","is_superuser":false,"is_staff":false},"post_date":1635971526,"body":"This is the type of hentai i liek not straight to the point seg but have a little i mean a lot of story to it 100/10 i don't have the authority to rate this so 1000/10, i know if i ask for translation i died but screw it, please make the English translation "},{"id":2120444,"gallery_id":378611,"poster":{"id":4436334,"username":"HLnoobHentai","slug":"hlnoobhentai","avatar_url":"avatars/4436334.png?_=0078eaabd1317993","is_superuser":false,"is_staff":false},"post_date":1635858233,"body":"@connerlikescake agreed"},{"id":2119016,"gallery_id":378611,"poster":{"id":3070111,"username":"ConnerLikesCake","slug":"connerlikescake","avatar_url":"avatars/3070111.png?_=85c5233693402763","is_superuser":false,"is_staff":false},"post_date":1635789878,"body":"Ok so it was others now its zombie hentai doujin? I wish it had English tho I guess"},{"id":2118768,"gallery_id":378611,"poster":{"id":2457320,"username":"Whyt","slug":"whyt","avatar_url":"avatars/2457320.png?_=f88fd6a73c165afe","is_superuser":false,"is_staff":false},"post_date":1635778874,"body":"Mitsuki was much better in LN/VN version"},{"id":2118715,"gallery_id":378611,"poster":{"id":263219,"username":"Unrecognized","slug":"unrecognized","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635776625,"body":"This comic is adapted from a galgame which has same name. I played 2 volumes, and I think it is good. You guys can try it."},{"id":2118710,"gallery_id":378611,"poster":{"id":3182959,"username":"ZGN","slug":"zgn","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1635776462,"body":"they did it bois they went from novel, visual novel, and now doujin\nand im not complaining"},{"id":2118692,"gallery_id":378611,"poster":{"id":263219,"username":"Unrecognized","slug":"unrecognized","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1635775965,"body":"卧槽？末世孤雄出漫画了？666"}]