[{"id":2309578,"gallery_id":379148,"poster":{"id":483535,"username":"Saaya Y","slug":"saaya-y","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1643916531,"body":"亀山しるこ --&gt; 神やっぱしるこ"},{"id":2136267,"gallery_id":379148,"poster":{"id":2936916,"username":"Rserpens","slug":"rserpens","avatar_url":"avatars/2936916.png?_=de74b206ff80163e","is_superuser":false,"is_staff":false},"post_date":1636573065,"body":"Bruh, just when I was hoping we'd get a bit more actual progress with Itaiamai, we're still stuck in this same loop!  Goddammit, now the tension of whether it's ntr or just sussy is gonna be plaguing me for even longer."},{"id":2128485,"gallery_id":379148,"poster":{"id":2771432,"username":"fuka09","slug":"fuka09","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636231060,"body":"Thank you for the translations and the details DrinksandDame!! I dont know how this will turn out, I am rooting for them together. This will probably have 25 chapters, I am hoping she doesnt become the classic ryoh-zoh girl, that just gets manhandled by every dude. "},{"id":2127666,"gallery_id":379148,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636194466,"body":"GoogleMeBitch Thanks! Frankly, I also feel like the story could use a little faster pace. With this many characters introduced, it might take a while for them to start being relevant to the story which sucks tbh. "},{"id":2127641,"gallery_id":379148,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1636193562,"body":"I thought masked sub was dating kise, if she's not maybe she has something to do with his ex-gf in the picture, the conspiracy theorist in me is thinking she's manipulated karin to get with the mc in an attempt to hurt him or her and karin are actually working together. There's definitely simpler explanations but i think there is more there than meets the eye, anyway from chapter 5 onwards i felt my interest waning, we're being drip-fed information and it's really starting to bug me. @DrinksandDame your summary was perfect, if it was anymore detailed i would have lost interest in reading the translated, so thanks again."},{"id":2127608,"gallery_id":379148,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636192514,"body":"@Man who sold the world Considering that they are recurring characters who essentially did pretty much the same exact thing every time they appeared, Im guessing they're just there for that usual gag. It's hard to say for certain though. "},{"id":2127211,"gallery_id":379148,"poster":{"id":4747215,"username":"Man who sold the world","slug":"man-who-sold-the-world","avatar_url":"avatars/4747215.png?_=d6fb444dceecdf7a","is_superuser":false,"is_staff":false},"post_date":1636177146,"body":"@DrinksandDame what do you think about the art couple, do you think they play a role, or just for show?"},{"id":2127098,"gallery_id":379148,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636172477,"body":"(Afterword) It's pretty chill chapter compared to the previous one. Not much of a new revelation, just a bunch of usual jealousy, sus scenes, you know it. If anything, Im curious what roll Masked will play in this story. At first, I though she's actually secretly dating Kise and she's thinking that Sensei's on the same boat as her, that's why she seems to be interested on what deal Sensei got with Karin. but I feel like that isn't the case since she seems to be unrelated to Kise with this chapter. Idk. On another topic, it looks like Karin's has been talking about Sensei to the two female students. They're friends after all. But it's not sure how far she's told about em. Anyway, I feel like my summary might have been less detailed for this one so ask away if any part piques your curiosity."},{"id":2127091,"gallery_id":379148,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636172008,"body":"(3/3) She said that she wants to make it so that he can't live without her. Next scene, we see sensei again with the two girls. As much as they can, they really want to take care of Karin so sensei wouldn't be so worried about her.   Sensei noticed a very sus silhouette of Karin and the boys. He was about to go there himself but one of the girl says \"lemme handle this\". Looks like they're just painting. No problem. Karin's got the drip... well a drip of white paint on her face. As usual, their dialogues were very suggestive here and sensei was really sus about it, but despite this he continues to believe in her. TBC"},{"id":2127084,"gallery_id":379148,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636171871,"body":"(2/3)-- them out. Out of jealousy, the boys grilled Kise saying he totally did it in purpose since he's a pervert. In the end, it wasn't revealed if it was or nah. Anyway, the two girls called Karin to join them instead of the boys which sensei was really happy for. Next scene, sensei moves to the art room and we see the couple from before yet again giving some panty fanservice. Unfortunately, Karin walks into it and she was definitely not happy. Next scene we see these two getting into a hot argument about today's incidents. You can pretty much guess what they're fighting about. When she said that she don't mind going public with their relationship, Sensei raised a big voice at her making her cry thinking that sensei might leave her. In the end, they made up and had sex in the bathroom. Amazing peeing climax scene. We see Karin getting horny as usual, she gets turned on hard when called out for being a horny girl. She even gives sensei a good licking up his ass. --"},{"id":2127079,"gallery_id":379148,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636171727,"body":"Itaiamai Ch 6 (p266) Summary: (1/3) Picking up from the previous chapter, school's busy preparing for their upcoming school fes. Looks like Sensei's class will be doing a horror theme. The two sensei's took notice that Karin and Kise(cool dude) is getting along as usual. Masked starts talking about those two but Sensei managed to show that he's not that interested about it which just like before, Masked is unimpressed about. Moving on, Karin and Sensei is having sex but this time around Karin's the one rambling about how she noticed Sensei's being a little friendly with Masked. How the turn tables. They managed to settle this peacefully tho. Next scene, we see Sensei with his two female students. Apparently, they seem to know something's up between Karin and Sensei since theyre her friend.  Meanwhile, we see Karin lifting the curtains for the boys to behold when she accidentally tripped into a very suggestive position with Kise. Sensei finds himself raising his voice as he calls--"},{"id":2127076,"gallery_id":379148,"poster":{"id":428923,"username":"protohype","slug":"protohype","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1636171640,"body":"aaaa fumitsuki lets goooo"},{"id":2127016,"gallery_id":379148,"poster":{"id":3637164,"username":"Esas","slug":"esas","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1636169304,"body":"well, pretty nice. good cover art."},{"id":2126920,"gallery_id":379148,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1636165345,"body":"Ikr, Ryoh-zoh is certainly trolling more and more and we all know how his/her works turn out late game. At least, we've got something milder with an Xmas chapter from Azuse's series, though that nurse story is getting crazier and crazier, poor MC."},{"id":2126859,"gallery_id":379148,"poster":{"id":2750885,"username":"glad1985","slug":"glad1985","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636162699,"body":"Fucking Itaiamai just keeps pushing... how much more suggestive can they make it? I can't trust Ryoh-zoh at all."},{"id":2126736,"gallery_id":379148,"poster":{"id":1509523,"username":"sambucety","slug":"sambucety","avatar_url":"avatars/1509523.png","is_superuser":false,"is_staff":false},"post_date":1636156675,"body":"Yeey more Akao wincest"}]