[{"id":2437107,"gallery_id":379453,"poster":{"id":2850022,"username":"amjadian","slug":"amjadian","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649059667,"body":"god the hentai took me 20 seconds but the comments kept me busy for 30 minuts😂 the fuck is wrong with you writing essays here?go to some forum like reddit already dummies 😅"},{"id":2434104,"gallery_id":379453,"poster":{"id":4332307,"username":"Zæon","slug":"zaeon","avatar_url":"avatars/4332307.png?_=9c69af8c324f47fe","is_superuser":false,"is_staff":false},"post_date":1648926113,"body":"I have no words, I mean not judging here, you do you, Just hoping these types of kinks or fetish will stay in fiction and fiction Only"},{"id":2341396,"gallery_id":379453,"poster":{"id":3980317,"username":"littleboykiller","slug":"littleboykiller","avatar_url":"avatars/3980317.png?_=5f30fd1d897ea930","is_superuser":false,"is_staff":false},"post_date":1645003977,"body":"Some good stuff👍 it'd be better if they could kill him tho"},{"id":2188955,"gallery_id":379453,"poster":{"id":4902099,"username":"LOOPY","slug":"loopy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639034342,"body":"@WoahGodDamn You do realize that you are hypocrite right? This is a gore porn judging by the tag and thumbnail. You been complaining for way too long for the people who have the tags blacklisted."},{"id":2177165,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1638504230,"body":"Dude don't say it like you know me or something. Just because you can assume doesn't mean you'll be right. I've made my points about this several times and only if you would actually read it for once instead of just some of it,you would just say \"ok now i get it\" and then just leave like nothing ever happened. Simple as that"},{"id":2176783,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1638484266,"body":"I think my first comment made you mad because it describes you. “ Sadly they haven’t found a cure for stupidity yet”. Just admit that you commented just get some attention and troll. "},{"id":2176619,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1638476382,"body":"Now I'm not gonna write a whole ass paragraph full of roasting or insulting because that's not how arguments works like if I keep insulting you it's not like the arguments gonna explode and then the winner is the most person with cursing or something"},{"id":2176579,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1638473343,"body":"If these things turns you on I can't really say \"Hey it's OK! That's totally fine! I completely understand why you would get turn on by these! Have a nice day!!\" . Also Lmao your \"roast\"is the funniest shit I've seen today despite you not knowing this is a picture i took from the internet like years ago and like bruh roast me by my profile pic LMFAO like am i supposed to feel bad afterwards or something? I'm more surprises that someone can write 2 paragraphs \"roasting\" a random meme pic since it's obvious that it's meant to be a funny profile picture which also kinda suit well considering that i use it in a doujin site. While yours is just the \"Sad boy\" type of profile and still proceed to \"roast\" me like I'm the hand itself. Never have i ever see someone tries to roast a hand this hard smh. "},{"id":2176558,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1638471960,"body":"@No U Reading your replies is just painful because you never understand a simple sentence. Stupid people should know when to shut up? Ok so why don't you shut up then. Aren't you so smart to knowing that upon \"winning\" this argument isn't gonna do anything better. Didn't you said that i wanted the internet attention? Why are you replying to me then hm? Is it that you wanted internet attention too? Oh but it's ok for me to keep replying because i \"wanted\" internet attention. And dude now I'm intentionally look through guro? Bruh. I didn't blacklisted guro and other things because I'm not gonna spend my time listing every tags that i hate then keep blacklisting one by one? And YOU think that I'm gonna be on this site every day just so i can find someone like you on doujin's tags like these to argues you and gain attention? Ok 👌 sure whatever you think. Like uh sure enjoy whatever you wanna enjoy in a guro doujin ig. Creativity? Like what? Different ways to torture someone?"},{"id":2176502,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1638469181,"body":"@tsugutteru a simple \"huh?\" Is enough for you"},{"id":2173406,"gallery_id":379453,"poster":{"id":4640506,"username":"tsugutteru","slug":"tsugutteru","avatar_url":"avatars/4640506.png?_=906784cc2b382b9d","is_superuser":false,"is_staff":false},"post_date":1638309128,"body":"@WoahGodDamn why are you arguing over a work of fiction? nobody is forcing you to read or enjoy it 💀 and it's not like you can stop others from liking this type of stuff. you're literally no better than any of us"},{"id":2172166,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1638246451,"body":"You know when three people have sex with each other it’s called threesome. When it’s two people it’s called twosome, and now I know why you are labeled handsome. Getting chicks isn’t easy when you are a wannabe coomer. That right hand is probably bigger then your left arm. You look like the charger zombies off of “Left for Dead” you know the one with the big right arm and shrivel left arm. When are you going to man up and stand up for yourself instead following everyone else. You have your right arm doing all the battles for you. Are you not ashamed that the only pussy you felt was when you exited your mom’s vagina. You are a waste of sperms. Kids in Africa could have eaten that sperm."},{"id":2172145,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1638245873,"body":"Since you decided to stoop down to that level. I’ll just roast you instead. Your profile pic with your right hand as your girlfriend is not a convincing relationship. Even coomer don’t cheat on their right hand with their left hands. That middle finger is the longest member attached to your body. You can use that middle finger and shove it up your asshole, and pretend you getting fuck instead. Maybe after you fuck yourself both literally and physically you can put some cum you got from this comment section onto your fingers and give yourself a finishing blowjob. There is a reason why you only date your hand because it can’t say no or scream and fight back. The human race might be disappointed in you, but not your hand never does. Have you tried drawing some faces onto your hand and making that a profile picture? Next thing you know you gonna start a harem with a fivesome. Both hands and feet are going to arch up and give yourself the ultimate blowjob like a dead spider."},{"id":2172107,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1638244507,"body":"You’re right people should have the right to say whatever the fuck they want, but you know what else? Stupid people like you should know when to not say anything. You know the thumbnail is guro because you don’t blacklisted. You intentionally look for guro because you are a brain dead NPC. You act surprise and regurgitate the same normiest line to earn some sort internet morality medal, and you repeat the process again. I’m not surprised by your type. That why you are a loser with your hand as a profile picture. My taste is not simply guro. It’s everything with the art, the story, the creativity. If I were to rate this guro. It would be a 1/10 because it short with a language barrier, nothing erotic about it beside pure gore, and not enough fap material. I might sound defensive about guro because you assume my taste is simply guro. Your brain hasn’t registered that I fighting against retards like you. "},{"id":2171446,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1638210467,"body":"And I still stands by my logic because it seems legit,it's just that your assumption is fucking stupid like a newborn baby trying to understand 2+2=4 . Now let me insults you like you keep doing because you can't make out the points. You dumb fucking degenerated bitch trying to look smart over people disliking a guro doujin. I wonder how can someone this fucking ignorant still alive after getting mad at something so fucking common. Makes me pity your parents (if you have one) that they have to raise you after all these years just for you to get offended by people disliking a weird doujin about a boy getting torture. But what can i say,this is probably the best sperm that your dad can produce."},{"id":2171421,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1638209566,"body":"Your \"responses\" legit didn't included anything i have said in the previous replies. Not once did i said you were wanting people to like this doujin. Yes i know you're complaining about the people that come here knowing that this is guro because that's the only thing you've been talking about other than insulting me randomly instead of actually try to understand the points. Also like bruh,sure fap to whatever you want i guess but then don't get mad at other people for disliking your \"taste\" then. And again, assuming i am here for vanilla porns. Fucking dumbass if i wanted one i wouldn't be here in the first place. You think nhentai have that much of vanilla doujin huh? You fucking retard. ...Wtf is this now,trying to tell me the difference between 2D and real life? If I'm that dumb I would've just killed myself when i heard that the world's gonna explode from a random news articles Shitass. "},{"id":2171333,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1638206852,"body":"Damn bruh you really pulled out another topic that I wasn't even talking about"},{"id":2166369,"gallery_id":379453,"poster":{"id":4640506,"username":"tsugutteru","slug":"tsugutteru","avatar_url":"avatars/4640506.png?_=906784cc2b382b9d","is_superuser":false,"is_staff":false},"post_date":1638010167,"body":"@No U based"},{"id":2165797,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1637987024,"body":"@WoahGodDamn So eat up your semen once you finish fapping to this comment section and act like white knight for your waifu. No normal or sane person will fuck you loser. "},{"id":2165790,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1637986830,"body":"@WoahGodDamn I don’t expect people to like this, dipshit. So, why do you keep assuming that I want other people to like it. I’m complaining about people who know it’s guro and continue to act dumb while retreating to their morality. Your whole argument is about me trying to get more people to normalize gore porn. Are you retarded, because I couldn’t care less about what people fap to. Unlike you uncultured normie fag. There are porn specifically for you on pornhub. If you want vanilla porn so much then just watch normal porn. For the record there is a difference between fictional fantasy and real life taboos, and I doubt anyone is psychotic while fapping to cartoon. Considering there is a world of differences between real life human and some ink on paper. If you are basing your real life moral standard to this fictional work then you are truly idiotic. I guess people are now Ted Bundy for reading this shit in their mom’s basement by your logic."},{"id":2165036,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1637954930,"body":"While your first comment is straightforward insulting people because they didn't like the doujin. And last thing is you don't get to decides who wins. People who read all of this argument get to. Stop thinking like you're the protagonist or something. Look by the overall view to see how stupid you look to everyone that have saw your comments."},{"id":2165031,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1637954574,"body":"Don't know what's going on inside your head but your brain is probably bursting trying to make a comeback. Don't know when did i targeted your grammar other than pointing out your strange points. Yet so far all of your assumption are all far from correct. Is it even correct to call someone dumb just because they've chosen to click on this doujin with fully understanding of what will be waiting for them just so they can take a look at it then whether decides if they like it or not or in another way of saying,to see how fucked up this doujin is. And again,everyone already know this is a guro doujin. They just wanna see what's in there. And like \"I'm no expert\" like what?? You think an expert would be on this site looking at a boy getting his arms and legs cut off???? What even kind of expert is that? Psychopathic expert? And woow now you're seeing me condemning/threatening people from the arguments. But as far as i can tell,i haven't commented anything harmful in this comment section."},{"id":2160800,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1637757278,"body":"I will allow you to win because you are that sore loser that assume you won the argument. Meanwhile targeting my grammar. The weakest counter you have towards me and that just makes you look even more pathetic that you didn’t even realize that you intentionally pick this fight looking for attention."},{"id":2160795,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1637757021,"body":"@WoahGodDamn First of all, you and everyone else knows what this doujin was going to be about. So don’t act surprised when you saw guro on the thumbnail and then act all disgusted once you read through it. If this was me a 5 years ago I would have equally been disgusted, but I’m not dumb enough to click on this doujin if I didn’t know it was guro. You paint a clear picture of a loser and won’t accept that you are in the wrong. Yeah, I know anyone can say whatever the fuck they want, and so can I. You obviously have a problem with me speaking up against the people who are brain dead enough to not know this was a guro doujin. I’m no expert, but I don’t condemn what people are allow to fap on this site or threaten the artist for posting this shit. That’s something I can see you doing to other people. I bet you are that hypocrite that think everyone but you is stupid. I, for one knows what type of people who uses this site and I’m no better than them."},{"id":2157399,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1637601444,"body":"I do hope this will be my last reply over this dumbass argument because i am too lazy to continue and i want the people who just clicked on the doujin able to comment their thoughts/say what they wanna say like before this argument which literally shouldn't be a problem in the first place. \n-WoahGodDamn off"},{"id":2157392,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1637601102,"body":"And the \"You must be sad that no one IRL will wanna fuck you. Even desperate animal in heat refuses to mate with you, that you have to resort to fapping to cartoons.\" ...ok? But did i asked to be fucked? Like i literally could say the opposite to you. You must be sad that no one IRL will EVER wanna love you. And like bruh,your words really reflected yourself. \"Fapping to cartoons\" Bitch you really just stated that you fap to \"the pictures\" . Another one is saying I'll say \"hah i was trolling\",\"I'm not mad you are\" like bruh who do you think you are? Joseph Joestar or something? there's no point for me to troll a disappointment of the family over a guro doujin, I can't even get mad over some dumb degenerated dude who have an obsession with guro. Also one last thing \"pay my internet bill\"? What are you? A single dad with divorced wife or something? Stay in your mother fucking lane."},{"id":2157388,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1637600970,"body":"@No U I don't know if you failed your English class at reading or what,but tbh you're just embarrassing yourself by all of your saying,like you're the definition of \"everybody is stupid except me\" and your points like \"That’s sad so what you are saying is that you intentionally look through gore just to pick apart individual comments that points out the obvious function of this site.\",\"you are a no life loser. I know your kind you just want internet attention, so you can fap to them and make yourself feel better.\" And blah blah so on. Like woow you got me shaking~ not because of your trying to sounds educated over a guro doujin but because my toilet is fucking freezing. Like dude seriously? Want internet attention? No one fucking care over a comment section in a doujin website. There's literally like thousands other way to gain internet attention but you had to pick one of the most dumbest way up. Like bruh assuming I'm this I'm that because you're mad over me point out something."},{"id":2155929,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1637534876,"body":"@WoahGodDamn That’s sad so what you are saying is that you intentionally look through gore just to pick apart individual comments that points out the obvious function of this site. I could understand if this site didn’t have a feature like black listing or people who are too stupid to not know any better, but you are a no life loser. I know your kind you just want internet attention, so you can fap to them and make yourself feel better. This is your particular fetish so I won’t discriminate, but I can’t help but feel pity for you. You must be sad that no one IRL will wanna fuck you. Even desperate animal in heat refuses to mate with you, that you have to resort to fapping to cartoons. Eventually, I guess you found a life of fapping to comments arguing with you right now. I know what you are gonna say next. “Hah, I was trollin” or “I’m not mad U R”. Lecture me about the morality of 2D cartoons, once you start paying for your own internet bill."},{"id":2153853,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1637429177,"body":"@No U you know the main reason i didn't blacklisted the tag is because once in a while they're gonna be people like you in the comment section saying shits like this EVEN THOUGH they know EXACTLY how people gonna react to this and then still get mad at them for being honest and still say \"but for people who just fap to the picture like I do and don’t really care about the story or the fake gore shit that can be draw by a monkey.\" Like ok??? Tell me what did you fap to in this doujin then,huh what about it? Actually nvm if you thought of something that is a no good for anyone to hear about it. Keep it for yourself. -WoahGodDamn off"},{"id":2153373,"gallery_id":379453,"poster":{"id":4130629,"username":"Senpai_Yaoi","slug":"senpai_yaoi","avatar_url":"avatars/4130629.png?_=57f2d22e8e828d5f","is_superuser":false,"is_staff":false},"post_date":1637406186,"body":"If this is your taste...I respect it...but I would be glad to not know you 🙂"},{"id":2150791,"gallery_id":379453,"poster":{"id":4503825,"username":"✨ɐʇıʞıɥɔ ıǝᴚ✨","slug":"atikiyo-i@r","avatar_url":"avatars/4503825.png?_=93415def2a4fe081","is_superuser":false,"is_staff":false},"post_date":1637276902,"body":"That was, .... interesting "},{"id":2146450,"gallery_id":379453,"poster":{"id":4640506,"username":"tsugutteru","slug":"tsugutteru","avatar_url":"avatars/4640506.png?_=906784cc2b382b9d","is_superuser":false,"is_staff":false},"post_date":1637065320,"body":"damn, way too short"},{"id":2146138,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1637050507,"body":"@WoahGodDamn. Thanks for pointing out the obvious, shithead. If they are so disturbed by it then why the fuck read it. There are several ways to avoid encountering guro. For example “Black Listing” I already use black listing for thing I don’t like, like “Scat”. Even if I saw a scat hentai will I ever click on it? No, it’s common sense to avoid the things that disgust you. Unless you been on this site for less then a week then I can see why you would say that, but for people who just fap to the picture like I do and don’t really care about the story or the fake gore shit that can be draw by a monkey. We don’t care, we know what real gore look like and are equally disgusted like a normal human being. The real danger are people who actually these atrocities. Yet, you are too stupid to differentiate fiction from non fiction. Even I can draw stick figures getting dismember and fap to them. "},{"id":2143775,"gallery_id":379453,"poster":{"id":1919544,"username":"LetMeFapInPeace","slug":"letmefapinpeace","avatar_url":"avatars/1919544.png?_=03f8e36fc32b33ec","is_superuser":false,"is_staff":false},"post_date":1636926317,"body":"delicious "},{"id":2142248,"gallery_id":379453,"poster":{"id":3290345,"username":"an intruder","slug":"an-intruder","avatar_url":"avatars/3290345.png?_=790137e50caef88a","is_superuser":false,"is_staff":false},"post_date":1636860457,"body":"Too short "},{"id":2141599,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1636826194,"body":"Also wtf did you expected the comments to be like? \"Oh man i love the way his arms got cut off\" \"bro look at that juicy brain\" no tf. Aren't we allowed to make fun of shits that are absolutely strange tf"},{"id":2141589,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1636825764,"body":"@No u, Naw the actual question is why would someone create this in the first place and wtf are you saying \"why do people continue to read this shit if they saw the thumbnail and read the tags\" BECAUSE we all have seen some fucked up shit and this is one of those that you can see and instantly know what the comment section gonna have to say bout this"},{"id":2140864,"gallery_id":379453,"poster":{"id":1041772,"username":"No U","slug":"no-u","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1636790376,"body":"The real question that need to be ask is why do people continue to read this shit if they saw the thumbnail and read the tags. This website need to restrict people with a 2 digit IQ. Sadly they haven’t found a cure for stupidity yet. I wouldn’t mind if these people are not allow to breed or at the very least euthanized to prevent  other people from suffering their stupidity."},{"id":2140135,"gallery_id":379453,"poster":{"id":4130629,"username":"Senpai_Yaoi","slug":"senpai_yaoi","avatar_url":"avatars/4130629.png?_=57f2d22e8e828d5f","is_superuser":false,"is_staff":false},"post_date":1636758705,"body":"Huh\nOh\nWhat\nWell\nOkay"},{"id":2136393,"gallery_id":379453,"poster":{"id":4755418,"username":"Ghoul-666","slug":"ghoul-666","avatar_url":"avatars/4755418.png?_=dab713c4aebac51a","is_superuser":false,"is_staff":false},"post_date":1636579304,"body":"Beautiful art"},{"id":2136389,"gallery_id":379453,"poster":{"id":118460,"username":"RICH & MARRIED RIOT FUJOSHI","slug":"rich-married-riot-fujoshi","avatar_url":"avatars/118460.png?_=cb9f1435a4158d42","is_superuser":false,"is_staff":false},"post_date":1636579110,"body":"BEST ARTIST EVER"},{"id":2135162,"gallery_id":379453,"poster":{"id":3747364,"username":"Interstella03","slug":"interstella03","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636530146,"body":"Ohhhhhh yeah I'm CU-"},{"id":2134080,"gallery_id":379453,"poster":{"id":3875368,"username":"Mugunee_","slug":"mugunee_","avatar_url":"avatars/3875368.png?_=b6c959aa5fbcac59","is_superuser":false,"is_staff":false},"post_date":1636485065,"body":"You only making my brain feels weird when i saw that needle impaling the shota's brain..."},{"id":2133749,"gallery_id":379453,"poster":{"id":4219003,"username":"Roxxy~♡","slug":"roxxy","avatar_url":"avatars/4219003.png?_=93615fdf9872d1e8","is_superuser":false,"is_staff":false},"post_date":1636471300,"body":"I NEED BLEACH"},{"id":2133513,"gallery_id":379453,"poster":{"id":2291654,"username":"WoahGodDamn","slug":"woahgoddamn","avatar_url":"avatars/2291654.png","is_superuser":false,"is_staff":false},"post_date":1636456420,"body":"I want to cry"},{"id":2133269,"gallery_id":379453,"poster":{"id":3931369,"username":"Ferhatch","slug":"ferhatch","avatar_url":"avatars/3931369.png?_=6e9bcd10869e6340","is_superuser":false,"is_staff":false},"post_date":1636445557,"body":"What in the..."},{"id":2133116,"gallery_id":379453,"poster":{"id":766442,"username":"Hijimare","slug":"hijimare","avatar_url":"avatars/766442.png?_=6bd0ebb22d054d73","is_superuser":false,"is_staff":false},"post_date":1636439814,"body":"There's a really nice guro like a piece of art or smt and there's guro that makes no fucking sense and this shit is the second"},{"id":2132944,"gallery_id":379453,"poster":{"id":4246446,"username":"xubus","slug":"xubus","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1636433424,"body":"whate the fuck was that fucking piss of shit?\n"},{"id":2132898,"gallery_id":379453,"poster":{"id":2961077,"username":"WraithStalks","slug":"wraithstalks","avatar_url":"avatars/2961077.png","is_superuser":false,"is_staff":false},"post_date":1636432579,"body":"And I thought I was into weird shit, guess there's always a bigger fish. "},{"id":2132823,"gallery_id":379453,"poster":{"id":3596541,"username":"R3PTIL3","slug":"r3ptil3","avatar_url":"avatars/3596541.png?_=1f3304f61c706042","is_superuser":false,"is_staff":false},"post_date":1636430493,"body":"Why this shit is allowed here?"},{"id":2132730,"gallery_id":379453,"poster":{"id":3271450,"username":"shadowMoon","slug":"shadowmoon","avatar_url":"avatars/3271450.png?_=79a2c2cc451abca6","is_superuser":false,"is_staff":false},"post_date":1636427797,"body":"cursed, the artist used pastel and lively colors for this guro shit. unnerving"},{"id":2132441,"gallery_id":379453,"poster":{"id":4508337,"username":"StrifeKink","slug":"strifekink","avatar_url":"avatars/4508337.png?_=e14a5fb59d9c7f6d","is_superuser":false,"is_staff":false},"post_date":1636418851,"body":"gross artist"},{"id":2132359,"gallery_id":379453,"poster":{"id":3278046,"username":"cush","slug":"cush","avatar_url":"avatars/3278046.png?_=794915eafd01dc2a","is_superuser":false,"is_staff":false},"post_date":1636415173,"body":"i wanna cry"},{"id":2132194,"gallery_id":379453,"poster":{"id":775775,"username":"Cockona","slug":"cockona","avatar_url":"avatars/775775.png?_=10a926ebc50f3060","is_superuser":false,"is_staff":false},"post_date":1636408636,"body":"Christ has left us "},{"id":2132132,"gallery_id":379453,"poster":{"id":837864,"username":"goldmasterk","slug":"goldmasterk","avatar_url":"avatars/837864.png?_=dfdc2c1fe0352786","is_superuser":false,"is_staff":false},"post_date":1636405141,"body":"It saddens me knowing there's no hell in afterlife for the people who draw these"},{"id":2132112,"gallery_id":379453,"poster":{"id":2340423,"username":"herrkommandant","slug":"herrkommandant","avatar_url":"avatars/2340423.png","is_superuser":false,"is_staff":false},"post_date":1636404283,"body":"gotta love that attitude"},{"id":2132028,"gallery_id":379453,"poster":{"id":3145650,"username":"єløhΐᴍ","slug":"ielohim","avatar_url":"avatars/3145650.png?_=11d4bd8037bcceac","is_superuser":false,"is_staff":false},"post_date":1636400528,"body":"Eww visual bullshit"},{"id":2131962,"gallery_id":379453,"poster":{"id":4793164,"username":"toutard18","slug":"toutard18","avatar_url":"avatars/4793164.png?_=14c768e5483bb8f4","is_superuser":false,"is_staff":false},"post_date":1636397549,"body":"ewwww guro"}]