[{"id":2256574,"gallery_id":381076,"poster":{"id":3397735,"username":"<3DarkSkinGyaruLover<3","slug":"3darkskingyarulover-3","avatar_url":"avatars/3397735.png?_=df9f83fffd12a0d1","is_superuser":false,"is_staff":false},"post_date":1641879341,"body":"Im lost about the MC does he still have feelings for FMC or he just wants to Fuck"},{"id":2256519,"gallery_id":381076,"poster":{"id":4132187,"username":"kiminonamewa","slug":"kiminonamewa","avatar_url":"avatars/4132187.png?_=91260348405699b1","is_superuser":false,"is_staff":false},"post_date":1641877340,"body":"This is so damn long series but I will wait until the complete version released then only decided whether to watch or not(not sure the MC will end up with blonde hair FMC at the end of story). Btw for those who already watch this series, can I know is this series worth to watch or not(I mean it's seem like MC & that blonde hair FMC just like the sex friends relationship but not really ended up together? Is that blonde hair girl still having the love for his husband?)"},{"id":2246053,"gallery_id":381076,"poster":{"id":2043683,"username":"earth27","slug":"earth27","avatar_url":"avatars/2043683.png?_=8c9f565a9a7da6fc","is_superuser":false,"is_staff":false},"post_date":1641454341,"body":"There are 2 panties at the end so I'm guessing it turned into yuri"},{"id":2234579,"gallery_id":381076,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1640990934,"body":"@TUFF I think it was a red herring tbh. I’m guessing they had sex all day, cause Erika showed up in the morning, and Sousuke finds Rion at night still nude. So she’d be exhausted regardless of win or loss. I think Rion won, but we’ll see."},{"id":2234270,"gallery_id":381076,"poster":{"id":4207403,"username":"TUFF","slug":"tuff","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640977618,"body":"@xevry do you think the ending of ch 23 was a red herring or a plot device to create a problem for Mc because she lost? Ik it’s just speculation and I doubt it will turn ntr "},{"id":2233916,"gallery_id":381076,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1640962627,"body":"Also side note, I'm a real sucker for Yuri moments in hentai's like these, and Chapter 24 being Yuri focused was one of the reasons why I started MTL'ing this series."},{"id":2233909,"gallery_id":381076,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1640961992,"body":"Piggybacking off @Tuff for @WoodyZ Chapter 24 also shows Glasses Girl (Erika) constrains her breasts with white bands, and actually has really big breasts. And the chapter ends with Rion stating a competition of who can make the other feel better. And if Rion loses, she'll be Erika's lesbian sex buddy/slave. "},{"id":2233659,"gallery_id":381076,"poster":{"id":4207403,"username":"TUFF","slug":"tuff","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640947744,"body":"I’ve seen ch 24, and idk it’s kinda hit or miss depending on what you like, but the girl with glasses is gay, and she feels like she owes the Mc because back when they were in high school she was unsure and wanted to do it with him to feel like everyone else. He said no when they were about to because she should be herself, and now that he’s entangled with a married woman she thinks FML should break it off with him so that it doesn’t complicate his life. Then she proceeds to force herself on female main lead, insert hentai dialogue scenario where she wants to make it so that female lead won’t be satisfied with male lead. End of the chapter blonde reverses the roles, and can assume there will be another chapter of yuri after, but who knows."},{"id":2226477,"gallery_id":381076,"poster":{"id":2429430,"username":"D.jewels","slug":"d-jewels","avatar_url":"avatars/2429430.png","is_superuser":false,"is_staff":false},"post_date":1640680801,"body":"Thanks @shadowfairy for the summary"},{"id":2226374,"gallery_id":381076,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1640678332,"body":"I wonder how this ends"},{"id":2225333,"gallery_id":381076,"poster":{"id":2697838,"username":"kamiaren","slug":"kamiaren","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640638352,"body":"My favorite is the red head. "},{"id":2224905,"gallery_id":381076,"poster":{"id":98017,"username":"meieru","slug":"meieru","avatar_url":"avatars/98017.png?_=58d43fdfd4e6a2f6","is_superuser":false,"is_staff":false},"post_date":1640626078,"body":"here's waiting for the complete translated version."},{"id":2224710,"gallery_id":381076,"poster":{"id":3372617,"username":"M9049","slug":"m9049","avatar_url":"avatars/3372617.png?_=657ddbb6c5947be1","is_superuser":false,"is_staff":false},"post_date":1640620643,"body":"The only disappointing thing in this hentai is that he didn't unload his loads inside that rion(blond fmc, first girl) and the red head. Cmon author i hope you do that part as well"},{"id":2224501,"gallery_id":381076,"poster":{"id":2019029,"username":"Fluffkin","slug":"fluffkin","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1640612752,"body":"It appears @shadowfairy was the hero we needed... Whether we deserved is judged by favourite list on a case by case basis."},{"id":2224323,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640606049,"body":"Extra tidbit forgot to mention: during train ride to from Watanabe house to Sou’s apt, Rion expresses jealousy over Erika & Sou’s past history as childhood friends. Erika also got tutored by Sou in games & sports. Sou insists that there was no love b/w them & that Rion was his first time. Rion is reassured by this fact, however he also thinks to himself: “…That one time with Erika… yeah, I’ll have to keep that a secret.”"},{"id":2224271,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640604157,"body":"Note: Ch. 24 is already out & available for purchase, but not uploaded illegally yet. Also some legends for girls: Rion - FMC, blond married woman. Chika - peach, short haired (later longer hair) pettanko (flat chest). Kaname - black haired busty woman (widow but still wears ring). Shion - Rion's sis, black haired school girl later turned blond haired w pink cardigan. Rinka - red haired woman, is often seen smoking. Ruri - chocolate co-worker. Kyoko - black haired boss, same workplace as Sou and Ruri."},{"id":2224267,"gallery_id":381076,"poster":{"id":2314408,"username":"uchihaitachi0324","slug":"uchihaitachi0324","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640604014,"body":"If she let someone else smash my interest will be going to zero"},{"id":2224261,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640603862,"body":"Story (cont.): Sou is at his part-time job, Ruri reminds him of his promise to take her on a date after she took his shift when he had to go see Shion's papa. Sou obliges & they go on a date (Kyoko the boss is also seen being sus of their relationship during the summer). Sou texts Rion he'll be late going back (which Rion receives). We see Erika & Rion are staring at each other in Sou's apt, Erika asks if that was from her hubbie or Sou, Rion says none of your business, Erika then goes back to asking why Rion was kissing Sou goodbye even tho she's married. In that meanwhile, Sou & Ruri are on a date, at the end of a film inside a net cafe, Ruri is basically date raping him while he's asleep (but Sou is actually awake). She's about to put his dick into her but Sou pretends to be irritated, she freaks out, stops, & runs away. Later masturbates it off. Sou gets home late but he finds Rion naked & passed out all sweaty w/ tissues around. End of Chapter 23."},{"id":2224238,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640603265,"body":"Story (cont.): Sou & this tutor Erika know each other, they're childhood friends & went to the same schools (she's two years above him). There's some tension b/w Rion & Erika. Erika has come bc she has been relieved of her tutoring position. Rion explains the situation to Erika. Erika is suspicious of Rion & why she seems so close to Sou. Well, they're family after all (Rion is Sou's cousin-in-law).  But Erika can't help but think of a possible affair situation. The tutoring situation seems to be cleared up for now so they all leave. Rion & Sou leave to help Sou w/ some apt stuff for two days. Rion cleans up Sou's apt & they take a bath. Rion has brought a special maid costume for this occassion & they have cosplay sex. Next morning, Sou goes off to school/work, Rion kisses him goodbye but is seen by Erika. "},{"id":2224231,"gallery_id":381076,"poster":{"id":3134510,"username":"PenguinOverlord006","slug":"penguinoverlord006","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640602860,"body":"Our saviour shadowfairy, can you please enlighten us as to what happens at the last page?"},{"id":2224223,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640602514,"body":"Story (cont.): Next day Shion shows up & w/ blond hair & a diff attire. Her fight w/ daddy over suitable tutor, grades, etc  has gotten her to dress up more like her sis (as a way to mock what her dad about being more like Rion). Sou suggests becoming her tutor. While Sou is bathing, Shion tries to seduce him but is halfway stopped by Rion. Sou then meets up w/ Shion/Rion's papa & vouches for Shion while asking to become her tutor. Papa agrees, he's heard good things from Rion & Shion, papa also admits he might've been in the wrong about Shion. All is well. Later that night both Rion & Shion reward him & they have a threesome. Rion also reveals all of Shion's sex toys from her bag. She couldn't be satisfied since Sou & has tried many toys to overcome that. Toys are used on each girl (especially on Rion) & threesome continues. Next day as Sou is about to leave, Shion's current tutor arrives."},{"id":2224175,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640601313,"body":"Story (cont.): Later Sou goes to at the Watanabe household (Rion's family, her maiden name), Mion wants to be w/ Sou, so Rion obliges & asks Sou if he can stay w/ them for some time (she & Mion are staying w/ her parents). Rion's mama is dotting over Sou w/ questions about his love life, also teases whether Rion has found another love (since she's gotten a lot prettier lately). Also seems like Shion has had another fight w/ her dad again (btw she stayed at Rion's household before for the same reason). At night Sou & Rion have a feelings talk. Rion wanted to confirm whether her feelings for Sou could change into that of just fam (nope), Sou confesses he's slept w/ multiple women since her. Rion teases him but she's not mad, since she told him before to get a gf & plus she is having an affair w/ him an. They go at it all night (Sou wears a condom so he can cum inside her as much as he wants). Rion says he loves him, Sou reciprocates. "},{"id":2224139,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640600348,"body":"Story (cont.): While Rion is treating Sou, Sou is angry for himself for not being able to protect Rion by himself. Rion comforts him by saying that she knew he would come for her & that he is her hero. Sou can't help himself but love Rion. She is reluctant at first but she's never been so wet before, & he makes her cum right away. This was the best climax she's ever had in her sex life, Rion also notes that he's gotten much better than before. She then realizes she still has feelings for Sou. She jumps him, they have sex. After that, they go at it one more time. During sex, Sou is confessing his feelings to Rion & what he likes about her. Rion falls for him even more. After, Chika comes in, suspects the two of em again. Later that night they celebrate Sou's bday. Chika even gives him a pair necklace for his bday, the girls all then try to seduce Sou. But Rion comes in & announces that she's truly fallen in love w/ Sou."},{"id":2224115,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640599627,"body":"Story (cont.): Turns out it was a surprise planned by her & Chika, Rion's surprise visit on Sou's bday. Later they all go to the beach. While Sou is playing w/ the kids (he's good w/ kids), Rion & Rinka have a talk about Sou, where Rion basically denies she has feelings for Sou as a man. Later while Rion is out getting drinks for everyone, she is attacked by a bunch of scumbag men. Rion is scared, helpless, they take off her swimsuit, but Sou comes in & knocks one out cold. He's about to go ham on the scumbags but one of em sneak attacks him. They gang up on him, Rion begs for them to stop, says she'll do anything. She's about to be forced to suck a dick until Rinka comes in & gag chokes dick guy. Rion & Sou escape while Rinka (former strongest yankee) kicks all of the men's asses."},{"id":2224099,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640598946,"body":"Story (cont.): Back in Japan, Sou & the girls (Rinka, Chika) w/ their kids (Rinka is also a single mom) go to the hot springs inn owned by a family of Sou's co-worker Ruri (introduced in the same date rape chapter w/ Kyoko). To Sou's surprise, Kaname (old next door widow) is also related to Ruri & works at the inn, she's Ruri's aunt. Sou spends time w/ the kids, hangs out w/ Chika & Rinka, they fall asleep. He then goes to a spring & is seduced by Kaname, Ruri is watching & they have a threesome after encouragement by Kaname (it was also Ruri's first time). He goes back to his room & then gets seduced by Chika & Rinka into having another threesome, it is like a friendly rivalry match b/w them. Sou is at his limit & passes out from all the sex he's had. He's dreaming of something that smells good to him, something nostalgic, somewhere he wants to be. He then wakes up to Rion, who's come for his bday! Along w/ Mion too."},{"id":2224075,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640598180,"body":"Story (cont.): Next day Rinka makes Sou breakfast (heart-shaped eggs) & it seems she doesn't remember that night. But then Chika barges in, asks why Sou hung up so suddenly last night, Rinka plays it off in a cutesy innocent manner unlike her normal self, implying she does remember as Sou figures it out. Chika is mad & lectures them. Later on is a story about Sou's part-time boss Kyoko falling for him, taking him to dinner, & basically raping him while he's asleep/drunk. Sou thinks it was all a dream (& also she left a note saying she just left after he fell asleep). Meanwhile in America, Rion dresses up & she & Tet go to a dinner party for his work, they were the best looking couple thnx to Rion ofc. After checking in on Mion, they have wild sex & Tet makes Rion cum many times. Afterward, Rion asks Tet for a favor, to which he agrees. We see a calendar w/ a day circled. "},{"id":2224052,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640596977,"body":"Story (cont.): Some months later, Sou (new haircut) now has a part-time job & is busy w/ his studies. One day he comes in to Chika in his apartment, unannounced, she's mad about Sou not contacting her for months. Sou says he's sorry but also thankful that she gave him the push to confess to Rion. They make up & later go to a festival. They have outdoor sex & even scare off another couple (unintentionally). Afterwards, one of Chika's old classmates, Rinka appears & about to beat Sou but Chika stops her. She's at the festival for work. Rinka saw Chika w/ a guy & tailed them (even extortioned that prev couple lol). Chika & Rinka used to be the strongest yankees in high school. After, the 3 drink together but Chika has to go home to pick up her kid, warns Sou that Rinka is a bad drunk (changes behavior completely). Unsurprisingly, Rinka becomes sweet/cute & seduces Sou to sex. Rinka even teases Sou while he's on phone w/ Chika (checking in). After some bath sex, Rinka falls asleep."},{"id":2224034,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640595992,"body":"Correction: Tetsuya is Sousuke's older cousin, not older brother."},{"id":2224014,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640595591,"body":"Story (cont.): Shion later asks Sou to help her w/ her studies, while doing so she fantasizes about having sex w/ him. She quickly leaves his room & goes back to masturbate. Sou is secretly watching (he wanted to return her pencil bag) & Rion later barges in.They end up having a threesome (Rion's suggestion) after some hesitancy from Shion (who likes Sou). Next day, Tet comes back & announces their departure to America. Sou is mad of the news, goes to Chika (again, Rion's divorced friend). They have a date & have sex. Chika asks him out. But Sou is unsure since he still loves Rion so Chika encourages him to chase after her. Sou then confesses to Rion & while Rion loves him, she can't accept his feelings. She still loves Tet & has decided to go to America w/ him. They have 'special' sex one last time, she does things w/ him that she would only do w/ Tet (paizuri), & even gives her first anal to Sou as proof of her love. They have a tearful farewell afterwards."},{"id":2223999,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640594834,"body":"Story (cont.): Sou goes home late after Chika sex but he's forgotten his key (Rion is out atm). Ends up being taken in by the woman next door, Kaname. Is treated to a meal by her, it makes her happy. Sou says her hubbie must be a lucky guy, but turns out Kaname is a widow whose hubbie died 5 years ago. Sou feels bad for her & ends up having sex w/ her. She's wild in bed. Sou is welcomed anytime. Sou goes home greeted by another woman Shion & Mion. Shion is Rion's little sis living w/ them for a while. Shion tells Sou that Rion is out w/ her hubbie (who just came back from his trip) having an important talk. Sou is jealous but they are married after all. He is right. Tet made some time for Rion before heading back to work, they have sex all night (but Rion momentarily thinks about Sou). Afterwards he tells her that they're moving to America. Meanwhile Shion takes an interest in Sou, the first guy she's talked to so much apart from her dad. Masturbates while fantasizing about him. "},{"id":2223981,"gallery_id":381076,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640593823,"body":"Story:     Sousuke is a university student who recently moved to Tokyo to live w/ his older brother's family, Tetsuya (bro), Rion (Tet's wife, Sou's sis-in-law), & Mion (Tet's kid, Sou's niece). Tet has to go on a business trip so he leaves Rion to take care of the household. As the days pass, Tet is still busy w/ work so he can't come back home, Rion is frustrated. Sou becomes more nice to her & Mion, one 'drunken' night he comforts her & they have sex. That was actually Sou's first time too. Later Sou wakes up to another woman, turns out to be one of Rion's 'mama' friends Chika, divorced w/ a kid. Notices Rion has been happy lately, she's usually sad when Tet (hubbie) is gone. Knowing something is up, suggests they go buy a bday gift for Rion together. They end up spending the day together like a date & Chika ends up liking Sou. They have sex throughout the night, she doesn't care what relationship Sou & Rion have (implying she knows). Chika lets him go even tho she really likes him."},{"id":2223844,"gallery_id":381076,"poster":{"id":968970,"username":"quant","slug":"quant","avatar_url":"avatars/968970.png","is_superuser":false,"is_staff":false},"post_date":1640588849,"body":"I don't get it but the art is good and lots of pages so yeah good stuff."},{"id":2223603,"gallery_id":381076,"poster":{"id":4330938,"username":"Kaminomikan","slug":"kaminomikan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640581075,"body":"he fails for not creampie them..."},{"id":2223528,"gallery_id":381076,"poster":{"id":3032436,"username":"agis55","slug":"agis55","avatar_url":"avatars/3032436.png?_=054e16177da8cde1","is_superuser":false,"is_staff":false},"post_date":1640578329,"body":"susah di sebut NTR, karna mc ajah play boy jir ewe ama banyak cewe, dan dugaan gw cewek kacamat cinta ama mc kita atau dia lesbian suka ama cewe gal ituh."},{"id":2223522,"gallery_id":381076,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1640578215,"body":"Nice       "},{"id":2223314,"gallery_id":381076,"poster":{"id":1400370,"username":"starfox1234","slug":"starfox1234","avatar_url":"avatars/1400370.png?_=8fe9415a33f35edc","is_superuser":false,"is_staff":false},"post_date":1640571566,"body":"Needs some English "},{"id":2196983,"gallery_id":381076,"poster":{"id":3423205,"username":"blooper99","slug":"blooper99","avatar_url":"avatars/3423205.png?_=1db4d1c6daf61498","is_superuser":false,"is_staff":false},"post_date":1639404575,"body":"Dudes in an open relationship so who cares if someone else fucks her"},{"id":2156510,"gallery_id":381076,"poster":{"id":3397735,"username":"<3DarkSkinGyaruLover<3","slug":"3darkskingyarulover-3","avatar_url":"avatars/3397735.png?_=df9f83fffd12a0d1","is_superuser":false,"is_staff":false},"post_date":1637562365,"body":"Im hella lost so she likes him or nah cuz aint she leave with her hubby or am i thinking of another work?(just skimmed somewhat)"},{"id":2155968,"gallery_id":381076,"poster":{"id":1781748,"username":"Dystopian Illusion","slug":"dystopian-illusion","avatar_url":"avatars/1781748.png?_=4defea392ee0d970","is_superuser":false,"is_staff":false},"post_date":1637536919,"body":"Must take a lot of effort to dish out about 600 colored pages of the same story, what an absolute chad."},{"id":2155850,"gallery_id":381076,"poster":{"id":1320483,"username":"andryzoun","slug":"andryzoun","avatar_url":"avatars/1320483.png?_=facd9476078aec88","is_superuser":false,"is_staff":false},"post_date":1637528879,"body":"Masterpiece  "},{"id":2155837,"gallery_id":381076,"poster":{"id":3802381,"username":"TheUnknownVoid","slug":"theunknownvoid","avatar_url":"avatars/3802381.png?_=c43ccc86eb69a683","is_superuser":false,"is_staff":false},"post_date":1637527884,"body":"Thats a lot of pages"},{"id":2155836,"gallery_id":381076,"poster":{"id":1781829,"username":"CoraZero","slug":"corazero","avatar_url":"avatars/1781829.png?_=5a0c6c38479ca329","is_superuser":false,"is_staff":false},"post_date":1637527754,"body":"It's boring some ntr is needed ;)"},{"id":2155832,"gallery_id":381076,"poster":{"id":4365989,"username":"Vindicta_01","slug":"vindicta_01","avatar_url":"avatars/4365989.png?_=111d13ac6981bf31","is_superuser":false,"is_staff":false},"post_date":1637527585,"body":"Curse my inability to learn languages faster"},{"id":2155758,"gallery_id":381076,"poster":{"id":1955155,"username":"YuriBestLove","slug":"yuribestlove","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1637522245,"body":"Mmm I love any yuri action between the sisters Rion and Shion das hot"},{"id":2155734,"gallery_id":381076,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1637521084,"body":"He got ntr'ed in the last page I bet?"},{"id":2155725,"gallery_id":381076,"poster":{"id":4831726,"username":"Daniffrn","slug":"daniffrn","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637520652,"body":"what happened on the last page?"}]