[{"id":2157607,"gallery_id":381084,"poster":{"id":441917,"username":"EdenMarino","slug":"edenmarino","avatar_url":"avatars/441917.png?_=1129d9cdfb0bbd55","is_superuser":false,"is_staff":false},"post_date":1637611570,"body":"Absolutely love this artstyle. I don't know why but it's so hot. @drinksanddame thanks for the plot overview, that was really dope."},{"id":2157144,"gallery_id":381084,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1637592621,"body":"@DrinksandDame: Thx again, ya actually made this work more accessible for us. I also agree with you about the father having questionable motives. This artstyle reminds me of South Park, or something like coming out of a Wii, which isn't bad but just comical, imo."},{"id":2156730,"gallery_id":381084,"poster":{"id":4863102,"username":"is13cmenough?","slug":"is13cmenough","avatar_url":"avatars/4863102.png?_=49c3cc458ffad667","is_superuser":false,"is_staff":false},"post_date":1637573052,"body":"@drinksanddame ty for the explanation, the plot of the story is a very common one, but the art of this fells nice, really hope there's a second part where we see if the dad turns into  a wing bro or he is actually a bastard"},{"id":2156669,"gallery_id":381084,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637570730,"body":"(4/4) There's a lot here and in the background scene FMC getting it on with her slutty lines and poses . But anyway, the big takeaway here is that apparently, his exchange student program only last for 2 weeks and he plans to confess to FMC when he comes back. THE END (Afterword) So yeah, it's NTR. Tbh, at first I couldnt quite tell if dad is really serious about this plan and it's not just because he's horny for her. But after that last reveal, Im more inclined to believe that he had ulterior motive all along. But frankly, it could still be the other way. This work did well making that a mystery. But anyway, that mystery made it an interesting read for me ngl despite how the artstyle inevitably gives me a different vibe due to its similarities to educational videos on youtube lol. "},{"id":2156664,"gallery_id":381084,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637570597,"body":"(3/4) bringing dad into tears. He knows that what he's doing is very questionable and even FMC here is also starting to doubt her intentions to stop her childhood friend from chasing his dreams. But they must continue and instead, make him happy through their own hands. And so, Dad had a proposal. Next scene, we see son doing science stuff when FMC walks in to show her her panties... oh and also her handmade teddybear. She got a reaction and he enjoyed the view, oh and the teddy bear too. Later that night, he fapped to her. As he was wondering if she also fap, we move to a scene where she and dad are having sex. Turns out this was his proposal. To make son happy means to make son happy through good sex. So she needs to train for that too. Apparently, they already fucked a lot right after he told her of his proposal. She was having doubts about this but was eventually convinced to keep this up and they rest is sex. Lastly, we get to see a bit of the son's thoughts.  --"},{"id":2156661,"gallery_id":381084,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637570422,"body":"(2/4) She needs to act normally and pretend to be unaware that her panty is in full view. She tried again but she can't get rid of her embarrassment. So she needs to get used to sexual stuff first by saying nsfw words. Not enough, she needs to hit the books, and by books I mean doujins. Dad brought what apparently is his son's favorite doujin for her to study. Next day, she gave it again a try but she can't just parrot the lines from the doujin. She needs to internalize and make it hers even if it's all just lies. So they did this horny yes or no question while she's flashing. Lots of text from here but it's basically their QnA. Anyway, after their rigorous training, she still gets embarrassed. Thing is, she apparently needs to test her skills out by tomorrow so they need to speed it up. Dad asks her to show her pssy cuz if you've already flashed your pssy, flashing your panties would be a no biggie, right? (lol) Anyway, she finally managed to get rid of her embarrassment --"},{"id":2156659,"gallery_id":381084,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637570270,"body":"Very strange artstyle but story-wise, it's alright. (1/4) So basically, girl has this childhood friend that she likes whose dad works as their school's principal. Dad here is well known as that person you can consult to about your problems and he's never wrong with the advices he gives. He's a very respectable man, except lately he's been sexually harassing our FMC here. So childhood friend/son is very invested in his research that he decides to go overseas as an exchange student. Our shocked FMC was then invited by Dad to talk about this in more detail. Lengthy talk here, but basically he's also against it and he wants FMC to make his son change his mind by seducing him. It's a stupid idea but eventually FMC hopped in to give it a try. Thing is, she doesnt know shit how to do that. So Dad will teach her the wey. He first asked her to show her panties, which she did, but dad was like \"No one just suddenly flash their panties in a pose like that!\"--"},{"id":2156416,"gallery_id":381084,"poster":{"id":1561236,"username":"NeatoRARE","slug":"neatorare","avatar_url":"avatars/1561236.png?_=73ad2459c2b9953f","is_superuser":false,"is_staff":false},"post_date":1637557491,"body":"Since when did Simple History start making hentai doujins!?!? :O"},{"id":2156408,"gallery_id":381084,"poster":{"id":4107506,"username":"hhtdd","slug":"hhtdd","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637557301,"body":"Is that a sex-education book?"}]