[{"id":2210931,"gallery_id":381285,"poster":{"id":1499418,"username":"vaccinated","slug":"vaccinated","avatar_url":"avatars/1499418.png?_=ba187796f0b8f367","is_superuser":false,"is_staff":false},"post_date":1640089229,"body":"looks promising ... would love to see an english translation"},{"id":2163687,"gallery_id":381285,"poster":{"id":4460116,"username":"Alsx","slug":"alsx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1637902933,"body":"need englis plis"},{"id":2160535,"gallery_id":381285,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1637742738,"body":"Later, they found out Marina also made a pact with demon, Foil. She sealed the evil god 40 years ago, after a bitter soul-taking business competition (actually the evil god falls to his own trap). Foil sealed the god again, and Yuzuka who became his shaman also got sealed. The nature of contract are different between demon and evil gods. One of the tentacle who managed to escape snapped Sumio awake, and they both sacrificed most of their life to rescue Yuzuka. After another contract, they came for revenge. Marina is a lesbian, but she got ridiculed by the person she loved, so she asks so nobody can make a fool of her again. Her father successfully became owner of prep school chain, bought a school, and she became like the queen there. In the end, Foil is tamed by Sumio who has merged with the evil god, who now asleep in his body. Yuzuka let go of her vengeance, and instead restored the soul Sumio paid to rescue her. Everything ends like nothing happened except for the two."},{"id":2160527,"gallery_id":381285,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1637742353,"body":"Another one with some plot. Sumio, the guy, got almost undetected presence. Yuzuka, the girl, wants to exact revenge on Marina because her family's business made her father's prep school went bankrupt, ending in her parents' divorce and losing their home. Yuzuka wants to make a pact with evil god, but she can only become vessel to contain the power, she need another person to actually use it. So, she threatened Sumio with photo of him taking photo of girl's panties. Both sacrificed their virginity, and made partnership with the not-cthulhu not-hokusai mini squid old one. The god wants virgin blood to recover his power. Sumio acts like he hates Yuzuka, but they still have sex everyday, and Yuzuka went in bad mood if he didn't do her hard ^^;"}]