[{"id":2281441,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642834826,"body":"@sometimesinoob I got sick with covid and I was in bed for a week and that delayed all my projects in both Spanish and English.... and the usb memory where I was working on the English translation had errors and I had to format it, so the progress was lost I had up to page 27, and only if some group wanted to do a joint with me, I could translate it faster, I have translated all the text up to page 63, if tomorrow I feel better I will try to start the translation into English again, which I still have my other manga translation projects into Spanish such as Kyosei tensei and zombie no afureta that I would also like to translate into English, translations that are even more dead than Suika San.... my Suika translations blog entry, I had to translate the other 2 chapters since the english translation had some errors, one of them where they possibly tell us what happened with tomoya https://hikikomoritranslations.blogspot.com/2021/12/suika-flor-dormida-trilogia-completa-al.html"},{"id":2278206,"gallery_id":382276,"poster":{"id":1045117,"username":"sometimesinoob","slug":"sometimesinoob","avatar_url":"avatars/1045117.png","is_superuser":false,"is_staff":false},"post_date":1642702630,"body":"any english translation released yet?"},{"id":2267656,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642310895,"body":"@minminazusa Kohei explains that the reason they didn't release the video is because they too had a lot to lose if they were revealed, Mayuri's story just goes to confirm how stubborn Yuki was in trying to figure everything out on her own, since if she from the At the beginning, he would have accepted Mayuri's help, he would have been free since their second meeting at Asakura's house... in short, Yuki sacrificed himself in vain since they never had the intention of publishing the video... although it may not seem like it , Asakura is very fearful, clumsy and above all he has no control of the situation...in fact Asakura doesn't have the Karaoke video..........I'm already making a video explaining everything, although I'm trying to to summarize because it lasts like 21 minutes... I know it's too much, but I explain everything until the reason why Tomoya possibly doesn't appear anymore, and that for a \"freedom\" in the English translation of a single word of Suika 1, nobody noticed"},{"id":2261696,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1642071343,"body":"Don't push them too far. And unlike all the girls whom he can blackmail with the recordings, men usually had less to lose from such kind of sex tapes, especially desperate young men. If he went overboard, they might think there's nothing more to lose and just say lets go to hell together, without thinking about the consequences."},{"id":2255876,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641842344,"body":"Asakura is an idiot, I would tell them the next day that everything was a lie and that thanks to that Yuki will finally be mine, so they will have to pay me every day while I have sex with Yuki so that I do not reveal the video and everything what you can do is listen while yuki and I have sex .... just wait for my review or the translation to understand why he is such an idiot and he does not decide to do that"},{"id":2255866,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641841945,"body":"@Shiro Ecchi I am still making a video review of suika, that is the reason why I have not made progress in the English translation (I released the Spanish version since December 28) but Asakura's argument was that Yuki got tired After of 10 years Tomoya ignored her feelings and she wanted to have sex and that is why she started dating Asakura since he was a \"good lover\" and they got bored of having sex every day, andmeanwhile giving ideas to solve it, Yuki confessed that he\"wish\"to be raped and that's why Asakura chose them ..... it's a bit silly but for haishura it was enough since he identified with being ignored by Yuki and believed in Asakura .... although on the other hand I think he never believed in Asakura, since there is a dialogue where it says \"Tomoya, you are an idiot, how could you let someone like him take her away from you and even me to get ahead of her\" and also in the end, they did not stay to wait for Yuki to wake up."},{"id":2249444,"gallery_id":382276,"poster":{"id":1769963,"username":"Shiro Ecchi","slug":"shiro-ecchi","avatar_url":"avatars/1769963.png?_=10f6b076542f3552","is_superuser":false,"is_staff":false},"post_date":1641576642,"body":"Even if her 3 “friends” also get convicted with rape, hella deserve it, why the fuck would you believe some random ass and then proceed to fuck your friend when she’s wholly unconscious"},{"id":2201658,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639643038,"body":"@ Jokke000918 has to read it translated to know that it is a masterpiece that comes out of the rules of the genre of the netorare ..... There was no Spanish translation of Suika Ni, so I had to translate it from Japanese, since I realized that the English translation had some errors and that is the cause the people gets lost in the messages sent by asakura and the call between Siotsu and Kyohei and why his was angry with asakura ... so if I start doing the translation into English it would be until next week if there is still no translation into English. I finished translating and correcting Suika San from Sunday, today I finished with Suika Ni and on Friday or Saturday I would start with Suika, to upload the 3 chapters to Spanish as a Christmas gift for my followers of my scalation, so be patient, really that it is a pity that almost nobody translates the works of this author"},{"id":2200491,"gallery_id":382276,"poster":{"id":992443,"username":"Jokke0009","slug":"jokke0009","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639577416,"body":"Rape for rapists. What else is new in hentai. Dissapointed in the artist. Can make much better stuff than this copy paste garbage. Pls uninstall yourselves incels ^^"},{"id":2191687,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639165377,"body":"that way I think if it could fit the timeline. I forgot that in their second meeting she was not penetrated, they only masturbated and gave her oral sex for an hour and a half more, since in their third meeting Kyohei complains that she was mean to him for not allowing him to penetrate her and that is why It seemed strange to him that in addition to having voluntarily met with him, he was more docile than in their last meeting. Between pages 98 and 99, 2 months pass so Mayuri and Kyohei became a couple in the 5th week or month and a week ... I think Mayuri remained quiet and did nothing in those two months because Yuki did not say anything to her (the karoke scene in volume 2) and probably what they talked about on page 99 was the rape of the otaku and how Asakura forced her to become his pet."},{"id":2191162,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1639135052,"body":"Mayuri meet Kyohei in Saturday (p51), although Yuki meet Asakura in uniform, so it could be different day. I checked the message again. Asakura told the guys about the deal sometime after Kyohei and Mayuri's 1st meeting (p68, flashback/black background), but he promised to stall Yuki for 1-2 weeks, so they can try to finish their girls by that time. That's why Kyohei planned on teasing Mayuri in 2nd week before finishing her in the 3rd. But, Yuki told her friends in the 2nd week's night after Mayuri go home, so much for Asakura's promise. p77 Mayuri still wearing the same clothes, and they don't go all-night like in the 1st week. Also her flashback on bed is to the 1st week (when he went all the way with her). About Chisa, could it be, the \"躾の時間ブッチしてきた\" line? Checking slang dictionary, I think he meant she tried to escape the training session because of that message, or it ruined the schedule. He warned Kyohei so he won't be surprised."},{"id":2190948,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639123840,"body":"I finished correcting, so just a quick review and a new page of credits and tomorrow I will upload them translated into Spanish ...... I started with a flu (although I probably already got COVID again) so I don´t feel with energy to start the english translation, sorry"},{"id":2190941,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639123648,"body":"On his second visit with Kyohei he tells him that it is not convenient for them to reveal or sell the videos and that the only one who has it is asakura, (that's why he only showed them to the otakus, I did not send them) and Kyohei reveals that everything yuki does is useless because her fate was already decided: she would be the pet of the 3 and that she and her friends were never in danger because the videos were revealed, that is why Mayuri's attitude is relaxed in her story while in Yuki's it is more disturbing. According to the boy who has Chisa says, she had already become his bitch, because she voluntarily went that week even though she no longer had to do it like Mayuri ... now she understands why Asakura was desperate, they in 2 weeks managed to get their girls They will be obsessed with them and he could not even in 3 months."},{"id":2190938,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639123513,"body":"Page 99 is the last one I can assure you 100 percent. Page 50 and 99 occur on the same day two months after page 98 and probably one day before page 47. That is why I said it is difficult to follow the line of time. I think the meetings are not the same day, I suppose that Asakura and Yuki met on Mondays and Kyohei and Mayuri on Tuesdays. On page 78 Mayuri doubts whether to go back to Kyohei saying \"it's going to drive me crazy like last week\" implying that the day she had to meet him was the next one, when she received Yuki's message and which indicates that he just saw Asakura: This must have motivated Mayuri to go to Kyohei's house to investigate. He feels so happy that she is there even though he is not obliged to do so that he tells her that Yuki will take her place and Chisa from her. This meeting on page 79 would become the 3rd and would be in the third week"},{"id":2190926,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1639123156,"body":"For Asakura's anger, I don't think it's because the other girls are still with the boys. The usual plan is they drug rape the girl, blackmail and break them into their pet. This time Kyohei suggested they each handle one girl and no sharing until the next sex party. Then, while Kyohei showed he had got his girl, Asakura still hasn't managed to break Yuki yet, she's still showing a fight in her. I think this is the main reason he's really angry, because things aren't going with the plan, and how he's the only one left behind is hurting his pride. "},{"id":2190843,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1639119271,"body":"The ending is not page 47? But that scene should happen after the other, isn't it? My understanding of p78 (week 2) is, the message for Chisa came in when he's in the middle of training her, so he read the message. Kyohei doesn't know because the message is sent after Mayuri went home. Her 3rd week visit, I assume is because she still think the best is to strike a deal with insider (Kyohei), and of course the sex. Back in vol 2's meeting, Asakura and Kyohei assumed it's Chisa who told Yuki. Also, Chisa is quite broken (means she went through all those trainings). If Chisa said the guys are not letting them free, then she would have still been locked up after the 2nd week, so how would she send the message?"},{"id":2189022,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639037157,"body":"On page 89 she rather jokes with Kyohei, in the meeting before this after revealing how they work he tells her that he can help her think about how to recover the video and they could \"enjoy\" that time and Mayuri tells him to die. When she arrives the next week , Kyohei is surprised to arrive as if everything was normal despite Yuki's message, which implies that both have accepted each other but not as a couple, as a sexual friends, since she asks him if he was serious about helping her and he He says yes but in exchange for sex, then she tells him that if he only cheats on her to have sex and does not help her to get the video, he will go with asakura, although obviously it is emotional blackmail from boyfriends although that did scare kyohei"},{"id":2189005,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639036520,"body":"I had already thought about making a video and making a timeline taking as reference the violation of Karaoke as week zero and that of the otakus as week 12 ..... page 99 occurs after the violation of the otakus and before the meeting of page 47 in week 13 because the end is that and not page 47 as one might think ...... but I dont´t want to spoil the surprise of discovering it when you read the English translation, if not this morning it will be tomorrow that it ends to correct so on Friday I hope to upload it in Spanish and I was seeing that it is easy to translate and adapt to English, however I do not know of a page in English to upload of hentai mangas, so if you could help me find one  in case this weekend It has not yet come out to English translations, I did it, although it would take about a week.... or i think so"},{"id":2188995,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639036015,"body":"Today I was busy and I could only get to the correction on page 79, but there I noticed why Asakura's anger was so great, and it is that although in theory the girls were free for a long time, they were still next to the boys, being the first to accept her boy Chise in their first or second meeting, since when the deadline of 2 weeks expires Yuki sends a message to both and as the \"owner\" of Chisa had his phone he saw the message and asked He spoke to Kyohei who asked him why he knew and said that she had already become his bitch for a long time ... or so I understood\n\nMayuri and Kyohei became a couple two weeks after that like this or a month and a half and it is strange that Mayuri had not done anything ... the timeline is a bit complex"},{"id":2187120,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638953923,"body":"I'm going to assume, that means: After 2 months (Mayuri accepting Kyohei, 2 months after the rape), came the meeting in volume 2. Or assume 3 months, adding more time for them to (hopefully) plan out things and talk with the Chisa's side. In the meeting, Kyohei provoke Asakura so he's losing patience and used drugs. He did the drug rape training for a while, so we assume it's 1 month before he finally let \"ugly guys\" rape Yuki to show her he can make her like prostitute to other guys as he likes. That would fit into a 4 months timeline."},{"id":2187111,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638953447,"body":"For the timeline, the whole event from the first karaoke rape, until Asakura let Yuki being raped by Tomoya's friend, should take 3 months and a week (vol 2 p3). In p50, Mayuri also mentioned it's 3 months after she first came to Kyohei. A week after the karaoke, Asakura send message to all the girls to meet them. So p51 should be the same time as when Yuki went to meet Asakura in the park at beginning of volume 2. p68 then would be the second week, Yuki told them she'll handle everything herself, and Mayuri visiting again for second time. p78 is the night after, Yuki sent the message about the deal with Asakura. p79 is Mayuri visiting for 3rd week, which is why Kyohei is surprised. Mayuri doesn't believe the deal, but Kyohei said else he won't get to taste Yuki. After that, they get closer. Question is what the \"2 months later\" in p99 relative to. I'm assuming it means 2 months after Mayuri accepted Kyohei, so that means 4 months after the rape."},{"id":2187079,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638952334,"body":"Men won't say the other guy's dick is bigger, it's an issue of self-worth. Even NTR guys usually just made the girl say it, they're not as evil as forcing the other guy to say theirs are smaller. Just like no kicking the balls in honourable fight between men :D Back to the story, in page 89, Mayuri said she talks about going straight to Asakura (since Kyohei aren't showing any real intention of helping), and Kyohei is panicking a bit. But later, he starts implying Asakura wouldn't be able to satisfy her like he can (such as how Asakura's dick is smaller, or he wouldn't last 10 minutes with Mayuri before being done). At that time, she also starts to admit to herself, she enjoys having sex with Kyohei. p92, he finally admit, he keep delaying to help her because he doesn't want their relationship to end, and she promised to be his woman if he help, because after all, she grew to love the sex she had with him."},{"id":2186854,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638944593,"body":"It took the Chinese to translate it, so I am not the only one who has problems doing it ..... although I hope that now if this Friday I upload it already translated into Spanish, in the end I no longer feel with energy to translate Suika Ni and I still have chapter 5 of zombie no afureta pending"},{"id":2186839,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638944237,"body":"@minminazusa exactly, after yuki, the biggest loser in this story is Asakura. According to kyohei, Asakura has a bigger dick than his, although I don't know if he told Mayuri to scare her and not go with him, since there is a scene where she was afraid of the size of kyohei and preferred to give him Blowjobs to be penetrated, that's why I don't know if he meant it or was a joke, although if it were serious it would be even more humiliating for him, since not even in that way he could bend Yuki. The only desperate thing about this story is not having a very clear timeline, in theory the scene where Kyohei humiliates Asakura would be two weeks before what happened in this volume, and maybe that scene has another hidden meaning ... you have to read the whole story of mayuri to find out why .... the story of mayuri is excellent, which I think has given the possibility of this manga having an animated adaptation, although we will have to wait about 2 or 3 years for that"},{"id":2186508,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638934309,"body":"If you refer to the scene after the meeting in volume 2. Asakura is being sore loser. He said that’s just because Mayuri is a slut. Kyohei kind of ridiculed him because he can’t break Yuki yet while he had Mayuri sucking him (implying Asakura got inferior dick). Well, in the end it’s not like Asakura wins. At the end of volume 2, Yuki told him even if it’s so pleasurable she lost her mind, in the end that’s just the drug and never his own skill. Even to the end, Yuki is still obeying him just because of the threat, not because she falls to the pleasure. "},{"id":2185961,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638903747,"body":"In fact there are many things that are not clear, for example I think I remember that while Asakura was sending a message to the others, Yuki sent a message to Mayuri so that they could see each other, but we don't know what they talked about, if it had been the abuse surely Mayuri would have been more aggressive with kyohei or she would not be a virgin girl with her first crush if she knew what was happening to Yuki, however I hope to finish tomorrow to correct Mayuri's story, I think I have fewer mistakes and I would start on Thursday to translate Suika Ni"},{"id":2185951,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638903526,"body":"In fact, that scene where Asakura is with karaoke and sees Kyohei and Mayuri was what made Asakura get more angry and jealous, since after taking a bath from the violation of yuki by Tomoya's friends, Asakura complains saying \"why is it happening to me? this to me \"(referring to the fact that Kyohei and Mayuri understood each other too well) since Yuki had not broken and still had a certain rebellious posture since instead of crying or asking him why he used Tomoya's friends, he just wanted him to ask her for clothes to go home (Asakura told Tomoya's friends to take Yuki's clothes and Asakura told her that he would only give her that towel even though he told her that they took it to him on their own)"},{"id":2185948,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638903349,"body":"@minminazusa i just started to correct Mayuri's story, (I go to page 55) so I still need to see and correct many things, although what I understood in Kyohei's conversation with the other boy is that Asakura planned to release \" Banki chan since he couldn't break her \"and I think he was referring to the girl they took with them to Karaoke to help them, because I looked in chapter 2 for the thing that he promised to free the other girls from and I didn't find it ... that's the reason why I wanted to translate the second chapter into Spanish to clarify my doubt in case it is omitted in the English translation."},{"id":2185286,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638868746,"body":"Looking back at volume 2 p21. That seems to be after Mayuri's story. At that point, Mayuri already falls for Kyohei. But there, Asakura mentioned it's probably Chisa who told Yuki they don't actually let the other girls go, and that Chisa has been quite broken (by the 3rd guy). In which case, I'm not sure at which point in volume 2 Asakura promised Yuki about them letting go of her friends if she would be obedient. "},{"id":2185256,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638867588,"body":"@rocksatori : For p88, the dialogue is different. Kyohei commented if Mayuri had been in co-ed school (Yuki and her friends attend all-girls school) she would have been taken by other men before Kyohei could make her his. In the page after, Mayuri also noticed he starts indirectly tells her \"Asakura can't satisfy you like me, so don't go to him\". Well, she probably can take it as how he's serious about wanting her for himself."},{"id":2185123,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638862229,"body":"@minminazusa do not talk about the girls they have detained, but we know that the reason why Asakura took 2 months for yuki to become \"their property\" is because Yuki and Mayuri's meetings were 1 time a week, only Chisa has been held for more than a week. This fact implies that they have several already domesticated girls to use between their encounters with their \"special girls\". The thing about the girls that Kyohei stole before \"making his own\" to Mayuri is on page 88, where she wears the bathing suit and he is sincere and he tells all the girls that she has stolen. There is no Spanish translation of Suika nor and I will have to translate it before releasing Suika san, if I did not have this problem, I would think about translating it into English, since it is the most difficult thing I have translated, both due to the amount of text and the complexity of the conversations and that sometimes some speech bubbles are confusing and it is not understood who each dialogue belongs to"},{"id":2183424,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638787804,"body":"@rocksatori : Which page did he told her about the other girls? And I made another mistake, it should be Chisa, not Chise >_<"},{"id":2183149,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638774077,"body":"@minminazusa yeah, as I had already mentioned, Mayuri's story is full of details that help us understand Yuki's story and her silly decisions, it may seem like a filler story but in the end it becomes the main story ..... there is also a moment where kyohei tells mayuri the number of girls that he stole"},{"id":2182806,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638758486,"body":"Oh, I didn't notice that's another girl in page 78. "},{"id":2181310,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638685746,"body":"@minminazusa yes, I already checked it is part and it is just as you say, (I had not finished making that conversation clear) even so they were angry because he broke their agreement, since in fact they have other girls blackmailed, you can see Kyohei training to one when he talks to the guy who's holding chise, who had a week without going to school or being online. so it wasn't that they had no way of having fun without mayuri and chise. Mayuri went once a week to the Kyohei apartment and the rest of the days he spent \"training\" girls .... I just finished translating it, which takes on a totally different meaning when we see the story of mayuri and kyohei (pure vanilla) I only need to make corrections and put onomatopoeias, possibly in 1 or 2 days I will have it ready (in Spanish) any other spoiler as the important reason why to tell the story of mayuri, I'm here"},{"id":2180949,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638671454,"body":"@rocksatori : Thanks. Checked the chat log. Yeah, Asakura said he made deal with Yuki they would let the other two girls away, without discussing with the other two guys. But the they can do whatever they like before time limit. Kyohei is the one suggesting they don't share the girls in the first session though, since he took a liking on Mayuri, so they'll postpone passing the girls around for next time. Asakura is okay, he got Yuki, the 清楚系 girl. The short guy... he got the short end of the stick. Chise feels like the bitchiest of the three. "},{"id":2179566,"gallery_id":382276,"poster":{"id":2883805,"username":"F̶̠͕͗̒͊l̶͈̊̌͠e̴͕̎̀â̶ͅͅk̶͍̱̽̌̂","slug":"f-l-e-a-k","avatar_url":"avatars/2883805.png?_=655cdbb47800fc4d","is_superuser":false,"is_staff":false},"post_date":1638610487,"body":"Oh god almighty! Why do I have to see this... This series is nothing but pain, regret and a lot of horny. "},{"id":2179338,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638601674,"body":"@minminazusa If Kyohei had not fallen in love with Mayuri, there would have been betrayal, since he was angry at the message that Asakura sent them by phone, since there he mentions that he would free another girl they had and who he could not break and that they could not touch Yuki for 2 weeks. In addition, it is implied that the group was not so close and that they had differences that left aside for the 3 to abuse a single girl, that was the reason for their anger since since they joined they had made the agreement of all they would abuse the the same time as their prey ..... However, Kyohei and Mayuri started playing boyfriends and he forgot that he was only going to use Mayuri as his meat pot .... The thing that saved Asakura was that each One got a girl, in fact I'm almost sure that the 3rd boy's sadism was precisely because he was angry about Yuki's monopolization by Asakura, even in the chat he tells Asakura to die ... that's how united they were"},{"id":2179297,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638600304,"body":"I have translated up to page 75 and I can only say that the end of Yuki's story is just as bad as the end of Karami zakari ...\n\nThe really and important thing (in my personal opinion) is the second story, Mayuri's as it gives us a different perspective on the story and makes us see how silly Yuki's decisions were.\n\nbut the most surprising thing is that Mayuri's story is a vanilla !!\n\nIt also suggests that there could be another extra story, (that of the missing girl)\n\nUnfortunately I translate into Spanish and I don't feel confident in translating into English, to share the discord of my scalations so that you can see the advances (and spoilers) of the translation."},{"id":2178649,"gallery_id":382276,"poster":{"id":4049,"username":"qohank","slug":"qohank","avatar_url":"avatars/4049.png?_=79837ed153a5ed25","is_superuser":false,"is_staff":false},"post_date":1638578001,"body":"Ah so that's how the 2nd girl become cum dumps.. That's means there's still one girl left and then orgy. "},{"id":2177079,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638499318,"body":"Well, yeah, the two guys got problem. Asakura seems to enjoy making girls as his submissive toy and pet. The short guy is likely a sadist. So far, it seems like Yuuki's more likely to have ending of her in despair and giving up on her fate rather than drowning in pleasure. While Chisa is probably gonna be mind broken. From previous experience, they would let go the girls when they got bored, but still keep their blackmail materials so that's more typical ntr story plot coming.\n\n@kidzhere : I didn't read the previous chapters yet, so I don't know how the name was translated there. ^^;"},{"id":2176824,"gallery_id":382276,"poster":{"id":4674539,"username":"EmeraldDick","slug":"emeralddick","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638486024,"body":"Parodies or originals whatever it is, I have loved tags like NTR, Blackmail, Rape and Slavery. But this girl Yuki makes me very sorry and sad. Now I want to see her to go back to her normal life with Tomoya."},{"id":2176345,"gallery_id":382276,"poster":{"id":4228921,"username":"thiclover","slug":"thiclover","avatar_url":"avatars/4228921.png?_=a32113e37102ad62","is_superuser":false,"is_staff":false},"post_date":1638461190,"body":"@minminazusa yeah, i just hope this series asakura get karma, and the ending will not chilce ntr ending"},{"id":2176182,"gallery_id":382276,"poster":{"id":4126859,"username":"kidzhere","slug":"kidzhere","avatar_url":"avatars/4126859.png?_=888f79b869fc8c55","is_superuser":false,"is_staff":false},"post_date":1638453474,"body":"After i've seen the earlier translated chapter the girl is named Mizuki while the kanji was read as Mizutani Yuuki which make me confused. and i hope the ending is not like the typical NTR stories where the girl succumb to the pleasure and being a b1tch in the end"},{"id":2175606,"gallery_id":382276,"poster":{"id":1299331,"username":"alonerone","slug":"alonerone","avatar_url":"avatars/1299331.png","is_superuser":false,"is_staff":false},"post_date":1638421844,"body":"Too bad it's gangbang which I hate"},{"id":2175229,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638401712,"body":"@thiclover : I don't expect betrayal. Their group seems to have hierarchy, and Asakura is on top (he's probably the brain, and the breadwinner, bringing girls). As seen in page 47, they eventually do have another sex party. In the last page, Yuki called Mayuri, probably about the sex party (Asakura also messaged Kyouhei). It probably pushed him over his hesitation. Well, the opening of chapter 2, Mayuri stated more than 3 months had passed since she first came to Kyouhei's place after getting message telling her to go there. I assume they're at least steady sex friends by then. The ending of the chapter, Kyouhei said it took Asakura 2 months to finally domesticate Yuki. We also didn't get the scene for Chisa (the twintail girl), which seems like she got thrown to a maniac with penchant of sex torture with all the toys. (to be open, my favourite girl of the three is Mayuri, and glad she had the relatively best ending among them, at least in the current stage of the story)"},{"id":2175113,"gallery_id":382276,"poster":{"id":2451907,"username":"waynex27","slug":"waynex27","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1638394213,"body":"Holy fuck , that was Great "},{"id":2174532,"gallery_id":382276,"poster":{"id":431251,"username":"sotenisaze","slug":"sotenisaze","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638368556,"body":"@minminazusa tnx cap. Volume 4 may be the final chap if the page count is the same as this one"},{"id":2174471,"gallery_id":382276,"poster":{"id":4228921,"username":"thiclover","slug":"thiclover","avatar_url":"avatars/4228921.png?_=a32113e37102ad62","is_superuser":false,"is_staff":false},"post_date":1638365571,"body":"@turn5misplay i agree with you"},{"id":2174469,"gallery_id":382276,"poster":{"id":4228921,"username":"thiclover","slug":"thiclover","avatar_url":"avatars/4228921.png?_=a32113e37102ad62","is_superuser":false,"is_staff":false},"post_date":1638365421,"body":"@minminazusa thx for explain, i hope ido will betray asakura for help mayuri and her friends, then asakura get caught"},{"id":2174463,"gallery_id":382276,"poster":{"id":2338114,"username":"turn5misplay","slug":"turn5misplay","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638365062,"body":"Tfw the side character's part was objectively better in every way."},{"id":2174264,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638353031,"body":"The second chapter is Mayuri's part. She came to Ido asking for the recording. Asakura asks his pals to hold the other girls while he breaks Yuki (and then they can gangbang the girls again). Well, from the second time, Ido expected Mayuri is the type who would get addicted to the sex, so he promised to help erasing the data, but keep delaying. Mayuri realised she's starting to get hooked to the sex too, and in the end she admitted it. It took two months for Asakura to finally break Yuki, and they can all have another sex party. But Ido himself also had got quite attached to Mayuri, enough that he's thinking twice because he doesn't want to share her with other boys. In the end, Yuki gives a call. Volume 4 should be the end. "},{"id":2174257,"gallery_id":382276,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638352839,"body":"Hasn't checked the previous chapters. The boys are Yuki's old friend, and they know she loves Tomoya for 10 years already. Asakura lied to the boys (her old friends) that Yuki is tired with trying to approach Tomoya, and is now dating him. Also, Yuki starts to get bored with their sex routine and revealed her secret fetish wanting to be gang raped. The boys, believing how the girl they idolised had changed, took their chance. Asakura then use it as a threat, because now her friends will also have their life ruined for rape if she won't submit to him. "},{"id":2174160,"gallery_id":382276,"poster":{"id":431251,"username":"sotenisaze","slug":"sotenisaze","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638349480,"body":"any cap? Did the girl gave in because of threat or because she liked it? Also is the last chap connected to it?"},{"id":2174129,"gallery_id":382276,"poster":{"id":3449750,"username":"Acestia","slug":"acestia","avatar_url":"avatars/3449750.png?_=a92a2f4822c7da25","is_superuser":false,"is_staff":false},"post_date":1638348083,"body":"Ngl. This series make me excited and ruined at the same time. I hate u matsukawa, but I love your art. :\")"},{"id":2174116,"gallery_id":382276,"poster":{"id":4228921,"username":"thiclover","slug":"thiclover","avatar_url":"avatars/4228921.png?_=a32113e37102ad62","is_superuser":false,"is_staff":false},"post_date":1638347552,"body":"Sorry for my bad gramar :(\nI just want to share my opinion about this series"},{"id":2174112,"gallery_id":382276,"poster":{"id":4228921,"username":"thiclover","slug":"thiclover","avatar_url":"avatars/4228921.png?_=a32113e37102ad62","is_superuser":false,"is_staff":false},"post_date":1638347426,"body":"I wish the blonde guy get caught by police for rape and doing drugs in the end of this series"},{"id":2174105,"gallery_id":382276,"poster":{"id":4228921,"username":"thiclover","slug":"thiclover","avatar_url":"avatars/4228921.png?_=a32113e37102ad62","is_superuser":false,"is_staff":false},"post_date":1638347272,"body":"Art 10/10 but why author create NTR, it just make me angry for the blonde guy,  just add some blackmail without NTR plot"},{"id":2174103,"gallery_id":382276,"poster":{"id":4228921,"username":"thiclover","slug":"thiclover","avatar_url":"avatars/4228921.png?_=a32113e37102ad62","is_superuser":false,"is_staff":false},"post_date":1638347083,"body":"Is it end or will continue?"},{"id":2174058,"gallery_id":382276,"poster":{"id":1873702,"username":"Miming","slug":"miming","avatar_url":"avatars/1873702.png","is_superuser":false,"is_staff":false},"post_date":1638344606,"body":"ya'll are fast.. not even giving the author a chance to make money out of it. Btw thanks for uploading ( ͡° ͜ʖ ͡°)"},{"id":2173995,"gallery_id":382276,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638341772,"body":"It will be a long wait for a western translation to come out, it is too much text to translate, at least it will be between a week to 15 days (at least for me) so the little that I translated quickly I did not finish convincing the change, it's ok thinking about the twisted mentality of the villain, but still not convincing since I think that the role of the girl's childhood friend, the one who agreed to rape her, was wasted, at least it would have made him take the protagonist's anal virginity. .... but nobody is perfect"},{"id":2173916,"gallery_id":382276,"poster":{"id":2883805,"username":"F̶̠͕͗̒͊l̶͈̊̌͠e̴͕̎̀â̶ͅͅk̶͍̱̽̌̂","slug":"f-l-e-a-k","avatar_url":"avatars/2883805.png?_=655cdbb47800fc4d","is_superuser":false,"is_staff":false},"post_date":1638336761,"body":"Holy smokes this is good af. I beg the translators to translate this even if it means me dying. "},{"id":2173897,"gallery_id":382276,"poster":{"id":1922353,"username":"Nightlord","slug":"nightlord","avatar_url":"avatars/1922353.png","is_superuser":false,"is_staff":false},"post_date":1638335455,"body":"The excitement of finally getting long awaited content is just indescribable."},{"id":2173894,"gallery_id":382276,"poster":{"id":1055751,"username":"wibanbandit","slug":"wibanbandit","avatar_url":"avatars/1055751.png?_=17b03b8c9d4b5c86","is_superuser":false,"is_staff":false},"post_date":1638335423,"body":"ahhhhhh iii caaaammeeeeee"},{"id":2173823,"gallery_id":382276,"poster":{"id":2412069,"username":"SevenSnow","slug":"sevensnow","avatar_url":"avatars/2412069.png","is_superuser":false,"is_staff":false},"post_date":1638332606,"body":"*SPOILLLERRRRR*\n\nI don't really want to ruin other's fun so I'll encode the spoiler to base64. Just decode it yourself if you want to know\n\nQ29uY2x1c2lvbjogVGhlIGdpcmwgZG9uJ3Qgd2FudCB0byBoYXZlIHNleCB0byBtYW55IG1hbiBzbyBzaGUgc3VycmVuZGVyZWQgaGVyc2VsZiB0byB0aGUgbWFuIHNvIHNoZSBkb24ndCBoYXZlIG1hbnkgc2V4IHBhcnRuZXIuIENNSUlXIHRobyBiY3ogSSBqdXN0IHNraW0gdGhlIG1hbmdh"},{"id":2173673,"gallery_id":382276,"poster":{"id":416871,"username":"shikabane","slug":"shikabane","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1638325012,"body":"finally! after 2 years. still want more tho"}]