[{"id":2184656,"gallery_id":382519,"poster":{"id":4578637,"username":"elaaa","slug":"elaaa","avatar_url":"avatars/4578637.png?_=455fc6b55a913728","is_superuser":false,"is_staff":false},"post_date":1638844814,"body":"why just 4 page sensei "},{"id":2177938,"gallery_id":382519,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1638542546,"body":"@softouch Most likely she was using the knife to threaten him into having more sex less she stab herself in the neck and remove herself from the girl, meaning the girl would die while she'd be un-effected! Basically she used her as a hostage of sorts. Hope to read it in english! I enjoy Date's stories.....or specifically those like this when it isn't a creepy male possessing the woman's body (Noticed I like the story when the antagonist doing the controlling and stuff like this is female, like the woman with the Demon Girl who mind broke and gender bended the men! And I hope he finished the one with the guy who had the mind manipulation powers!)"},{"id":2177555,"gallery_id":382519,"poster":{"id":4277004,"username":"softouch","slug":"softouch","avatar_url":"avatars/4277004.png?_=fdc98b5e77c65313","is_superuser":false,"is_staff":false},"post_date":1638523858,"body":"This is a story by date. So if my understanding of his style of story is correct, the 1st black hair psychopath could be transferred into that girl's body, whom mc likes. I say this based on both holding the same pen knife. But that last page, I seriously not sure whether she stabbed him, or herself, or uses it to force mc to continue having sex with her. So hopefully this is a preview of what date's new story is going to be. "},{"id":2177513,"gallery_id":382519,"poster":{"id":1459820,"username":"supremeval","slug":"supremeval","avatar_url":"avatars/1459820.png?_=d8e5a531671a2339","is_superuser":false,"is_staff":false},"post_date":1638521781,"body":"ik i cant understand this language and all.. but wtf just happened"}]