[{"id":2389533,"gallery_id":382591,"poster":{"id":4583392,"username":"shhhshs","slug":"shhhshs","avatar_url":"avatars/4583392.png?_=4a5e86f18a548aaf","is_superuser":false,"is_staff":false},"post_date":1647056725,"body":"aint going to settle in a gf like that if i can get one though"},{"id":2389259,"gallery_id":382591,"poster":{"id":1061869,"username":"chromosome","slug":"chromosome","avatar_url":"avatars/1061869.png","is_superuser":false,"is_staff":false},"post_date":1647041302,"body":"The sequel is out and the NTR timeline of this story is literally one variable away. Like, of the guy was a little more absorbed into the game, she'd 100% have that threesome with those monkeyfaces"},{"id":2388805,"gallery_id":382591,"poster":{"id":156449,"username":"tori","slug":"tori","avatar_url":"avatars/156449.png","is_superuser":false,"is_staff":false},"post_date":1647016463,"body":"Why in the world she's so unsettled lmao this sound stupid knowing this is only a doujin, but dude seriously need to find another girl who's saner in the head, she sees other dudes for a second and somehow want to fuck with them lmao like what in the world, shit too funny."},{"id":2265546,"gallery_id":382591,"poster":{"id":3637164,"username":"Esas","slug":"esas","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1642218232,"body":"glad it ended well. thanks for the summary, minminazusa! "},{"id":2179182,"gallery_id":382591,"poster":{"id":1299331,"username":"alonerone","slug":"alonerone","avatar_url":"avatars/1299331.png","is_superuser":false,"is_staff":false},"post_date":1638596335,"body":"Fucking slut. Sooner or later she's gonna  have a gangbang. Poor bastard"},{"id":2179109,"gallery_id":382591,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1638593886,"body":"Sequel of #350973. Wrote the summary there. Both went to onsen together where he got too absorbed with the retro arcade game. The two other guys travel together, but yeah, they also thought how nice it would be if they can travel with a cute girlfriend, so Mari cheer them up, telling them there would be a girl who understand them. Raizu is still pissed off because Mari showed her body so easily to stranger, so she promised to do anything he asks when they're back in the room. He asks to came inside (although she can still refuse if she doesn't want to). Mari gives a condition, if she got pregnant, she will give birth to the baby and he must take responsibility. He also finally asks her to be his girlfriend (while wiping his cum), because in the onsen, she mentioned how he never officially asks her out. After dinner, they got heated up, and she asks if he seriously want a baby with her. He said yes, and they do it for the whole night."},{"id":2179074,"gallery_id":382591,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1638592972,"body":"This is good     "},{"id":2178814,"gallery_id":382591,"poster":{"id":4277004,"username":"softouch","slug":"softouch","avatar_url":"avatars/4277004.png?_=fdc98b5e77c65313","is_superuser":false,"is_staff":false},"post_date":1638584487,"body":"Based on the author's track record, I thought this is going to be another NTR when she's with the 2 guys in the Onsen, like the other one he drew where fmc got NTR by another guy. Instead he gave mc the right reaction, which is to get angry with the girl and she followed him afterwards. In the end he gave this continuation story a vanilla ending. Who said vanilla hentai can't be hot? This is very hot in my opinion. If it's translated, it's going to be on popular page. "},{"id":2178738,"gallery_id":382591,"poster":{"id":4439116,"username":"♍VoidTraveler","slug":"voidtraveler","avatar_url":"avatars/4439116.png?_=46f7fc2a402accc2","is_superuser":false,"is_staff":false},"post_date":1638581523,"body":"Hm, fun and open-minded girl. She'd be suitable for sharing/swapping action."}]