[{"id":2198628,"gallery_id":382796,"poster":{"id":681667,"username":"jmspikey","slug":"jmspikey","avatar_url":"avatars/681667.png","is_superuser":false,"is_staff":false},"post_date":1639484460,"body":"Honestly can't even be mad at her the church fucked her up and then just dumped her back at her village even though I'm pretty sure that they are probably aware that she is mentally shattered and can't function without all the extreme sex they provided her."},{"id":2183988,"gallery_id":382796,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638813845,"body":"Shes mentally broken already not just being made into a slut but also losing her sense of reasoning since she genuinely seems confused as to why her husband and the girls are upset, doesnt seem to feel any real guilt either which is too bad. Definitely not gonna have a sweet ending but we all knew that already. (Only yamada gogo doujin that might have a good ending is that big tit office worker one he promised would be vanilla but he left that one at chapter 5 and still hasnt finished it, I hope he does soon)"},{"id":2182482,"gallery_id":382796,"poster":{"id":4277960,"username":"EronaMyMother","slug":"eronamymother","avatar_url":"avatars/4277960.png?_=6e730762b6cb1e5c","is_superuser":false,"is_staff":false},"post_date":1638740112,"body":"Yamada gogogo is G.O.A.T"},{"id":2182186,"gallery_id":382796,"poster":{"id":1119300,"username":"Porrareur","slug":"porrareur","avatar_url":"avatars/1119300.png?_=1af090765b5ecf48","is_superuser":false,"is_staff":false},"post_date":1638725156,"body":"Basically the husband is a cool dude and have lots of sex with his wife but she's a slut and like a slut she fuck random guys for more pleasure"},{"id":2182080,"gallery_id":382796,"poster":{"id":4665831,"username":"loanshark420","slug":"loanshark420","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638721342,"body":"Basically that ritual has messed her up, the husband sleeps with her a lot but she still can’t have a child or orgasm. So she starts having sex with the men of the village to “repay” them for taking care of her, and she can only get off when it’s with multiple men. Husband and other women of the village catch her and she tells them the above. She also mentions how good it felt at the church or temple. Husband runs away and the women left behind says that the girl has disturbed the order of the village has to get out. Next chapter is the final one.  "}]