[{"id":2190487,"gallery_id":382842,"poster":{"id":4619828,"username":"A-san","slug":"a-san","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639103299,"body":"Hmmm not surprised that all eyes are looking at Itaimai. I'll give it to the mangaka for constantly teasing us with \"will she?\" NTR elements though, But for me, Konomi Ja Nai Ge Do (yep, that incest manga with a chad &amp; tsundere older sis) is the best. It's funny to think that it started as \"shoujo\" or \"for girls\" H manga - read : it targeted at girls readers, for them to self-inserted as the sis and there's her super cool bro... you know the rules. But in the end, it works the opposite way around (or both) since the sis is too hot she attracted men readers too lol. Too bad it peaked at Ep2-3 and seems going nowhere after that, but still great enough. I'll PO and buy a hard copy in a heartbeat though. Just when? "},{"id":2184429,"gallery_id":382842,"poster":{"id":2936916,"username":"Rserpens","slug":"rserpens","avatar_url":"avatars/2936916.png?_=de74b206ff80163e","is_superuser":false,"is_staff":false},"post_date":1638836375,"body":"Every chapter of Itaiamai makes me wish it would just wrap up and finish while it's nice and arguably wholesome.  Massive shoutout to DrinksandDame for letting us know what's up."},{"id":2182762,"gallery_id":382842,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1638755706,"body":"Alright, Azuse, Katou An, and Ryoh-zoh's... let's go!"},{"id":2182687,"gallery_id":382842,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638751551,"body":" (3/3) But she rebutted that if she's the cutest in the world, it'll eventually be inevitable for more eyes to start looking at her. And so, we'll finally be going back to the sus company and see Karin's debut as an official model next chapter. TBC. (Afterword) I guess that wraps the school arc(?) for now. I feel like this work will definitely be a very long one like Rarefure cuz Masked and especially Kise weren't fleshed out that much for them to have any foreseeable relevance to where the story is going to next. Im sure someone can probably think of one or two, but atm there's not that much info to make any predictions I'll be confident with. It's still Chapter 7 and if this is going to be a very lengthy work, I'd say it's on a reasonable pace now that next chapter will finally bring us back to what for me is the main plot point of the story."},{"id":2182681,"gallery_id":382842,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638751156,"body":"(2/3) Later that night, sensei got his own action with Karin. The next day, they're back to working on the class's booth. Masked pointed out how coincidental it is that both Karin and Sensei will not be coming for the prep work on the weekend (due to Karin's debut shoot). Meanwhile, the boys asked Karin to be their Sadako for a bit to test their props. Idk if it was intentional or not, but they got themselves a great view from behind. Sensei noticed this and tried to pulled her out but what it led to was an even greater view for the boys. And then, we go to the blindfold sex. Precise bitemark around the nipples by sensei btw lol. Anyway, they're pretty much doing the usual punishment time so their sex talks need no summary. As we reach the end of their aggressive sex, Sensei gently took off the blindfold and calls Karin the cutest girl in the world... and climax. Afterwards, Karin gives him an afterservice while sensei reminds her again to be careful with the eyes around her. "},{"id":2182678,"gallery_id":382842,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1638751033,"body":"Itaiamai Ch8 Summary: (1/3) Story starts off with Sensei getting a morning visit from Karin. They also had their morning sex. She almost forgot to wear her panties back. Next scene, we see Sensei with his students working on their horror house as usual. Nothing really worth noting from their lengthy talks as it's just the usual teasing about his thing with Karin. Next scene, we see sensei back at his art room thinking about how scarily perceptive Masked can be. Also, since Sensei will accompany Karin again to her modelling work on the weekend, he feels that it'll be awkward meeting Houra again after he got to watch her AV. As usual, his imagination starts going places again fearing the worst for Karin. Sensei's thoughts were interrupted by the moaning noises made by the recurring couple having sex in the storage room. Since they seem to have no intentions of stopping, sensei just gave the dude a hand signal warning and that's it lol."}]