[{"id":2223925,"gallery_id":383263,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1640592142,"body":"Well... he hasn't been able to get hard for his wife, so not only she's not been getting sex for a while, she's also anxious about if he even still care about her. "},{"id":2213025,"gallery_id":383263,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640162559,"body":"bitch wife..."},{"id":2213012,"gallery_id":383263,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640162161,"body":"need eng first chp"},{"id":2191294,"gallery_id":383263,"poster":{"id":1400370,"username":"starfox1234","slug":"starfox1234","avatar_url":"avatars/1400370.png?_=8fe9415a33f35edc","is_superuser":false,"is_staff":false},"post_date":1639144277,"body":"Needs some English "},{"id":2191075,"gallery_id":383263,"poster":{"id":2946974,"username":"Bestie","slug":"bestie","avatar_url":"avatars/2946974.png?_=13515ba792b242a9","is_superuser":false,"is_staff":false},"post_date":1639129744,"body":"Did not Feel too NTRyy\nFor Top Stories, Last one is Mehhh.."},{"id":2190531,"gallery_id":383263,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1639104794,"body":"Chapter 4 is the unpleasant part. Yoshi confront Risa about her sleeping with client. This is because she never provide full sex service. Yoshi threatened to report her and get fired unless she would have sex with him. Yoshi then suggest to Tetsu, asking for a chance. He will visit Tetsu, not knowing the husband is going to hospital. There he will try to hit on Yuna, and if she refuse, then be it. Tetsu tried visiting Risa, but she had quit (she doesn't like having to continue job while having that kind of trouble like Yoshi). So, worriedly Tetsu went home and found his wife is having sex with his friend. He called Risa again, but she said things are over, and Tetsu should take more care of his wife. In the epilogue, Tetsu pretend not knowing his wife's affair. IMO, it could have been a better ending if Tetsu could have continued the affair with Risa. They both like each other, and at least he could've coped better with his wife's affair that way."},{"id":2190506,"gallery_id":383263,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1639104068,"body":"The first story is... too bad for Tetsu (the husband). He had erectile disfunction, so his friend Yoshihiro (who used to have crush on his wife before marriage) suggested going to \"hospital\" (more like brothel). There he met Risa, a popular girl in the house, and they end up having sex (by the rule, actually no penetration allowed). Surprisingly, he could have sex with her. Meanwhile, Yoshihiro took the chance to approach Yuna (the wife), who thinks her husband no longer have interest with her. Ch2, Yuna refused her husband, because she's worried he found Yoshi's semen leftover in her. At work, Yoshi suggest him to ask Risa, so Yoshi came again not for sex, but advice. Meanwhile, Tetsu invite Yuna out to love hotel, so Yuna lied saying she's staying at friend's. Risa, who likes Tetsu, suggest they go out for drink, but ends up in love hotel. In the morning, Yoshi saw Tetsu coming out with Risa and knew both are also having affair."},{"id":2190382,"gallery_id":383263,"poster":{"id":4656518,"username":"uelveelze","slug":"uelveelze","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639097563,"body":"For those who check comment's first, NTR warning (untagged)"}]