[{"id":2484017,"gallery_id":38357,"poster":{"id":3871690,"username":"[]TheImperialLoliconAlliance[]","slug":"theimperialloliconalliance","avatar_url":"avatars/3871690.png?_=7e650d84de11d722","is_superuser":false,"is_staff":false},"post_date":1651023405,"body":"@Mawku I don't see a bad thing about that. I also do not fap at hentai anymore....i mean, sometimes I do but its probably once a month. If you like and enjoy reading hentai for the plot then do it.  Also here's some doujins that has an amazing plot and lore made by Sabaku : 368327 361891 381901 304628"},{"id":2483549,"gallery_id":38357,"poster":{"id":4380538,"username":"Mawku","slug":"mawku","avatar_url":"avatars/4380538.png?_=23e831903a954fd8","is_superuser":false,"is_staff":false},"post_date":1650997193,"body":"I just can't fap anymore, when I read an hentai and the plot makes me emotional i just read it all and enjoy it as it is, art, i read more hentais than mangas, some of them have some really good plot, like what the heck lol"},{"id":2483231,"gallery_id":38357,"poster":{"id":765884,"username":"ηori","slug":"eori","avatar_url":"avatars/765884.png?_=2943b6b27399eb37","is_superuser":false,"is_staff":false},"post_date":1650985579,"body":"🤔\n\n\n\n\n\n\n\n\n\n"},{"id":2482911,"gallery_id":38357,"poster":{"id":3871690,"username":"[]TheImperialLoliconAlliance[]","slug":"theimperialloliconalliance","avatar_url":"avatars/3871690.png?_=7e650d84de11d722","is_superuser":false,"is_staff":false},"post_date":1650970049,"body":"@Emiru Ikuno I really cannot give you an absolute reason why I hate full color but There's just something I really do not like about it. Probably because back then I used to masturbate early in the morning and full color doujins just BURNS my fucking eyes everytime I read them. Another reason probably is that I got used to black and white that it feels when I read full color.  But I think the main reason why i hate it is because it makes the doujin more realistic. As someone who like reading loli hentai, I know that liking this type of genre can really have high consequences. So i try my best to just like \"doujin lolis\" and not \"real loli\".                                                     .TL:DR = Eye problems and fullcolor makes doujins more realistic"},{"id":2482308,"gallery_id":38357,"poster":{"id":2824147,"username":"Emiru Ikuno","slug":"emiru-ikuno","avatar_url":"avatars/2824147.png?_=d024fc5a08fab09c","is_superuser":false,"is_staff":false},"post_date":1650938726,"body":"Lmao. Let me ask this then, do you actually hate the Full Color tag? I always thought it was universally loved, and I cant think of a reason why someone would dislike it"},{"id":2482290,"gallery_id":38357,"poster":{"id":3871690,"username":"[]TheImperialLoliconAlliance[]","slug":"theimperialloliconalliance","avatar_url":"avatars/3871690.png?_=7e650d84de11d722","is_superuser":false,"is_staff":false},"post_date":1650937973,"body":"@M%N really concerned with your question but if you really want an answer I'll give it to you. Probably jumping to a high place is the best way to die without pain. Just make sure that you jump high enough that it can kill you instantly. You can also go head first to have a 100% chance of dying. Hanging is also an option but sometimes it will not kill you instantly and you'll still be suffocating for about 20 to 30 seconds. [ANYWAYS PLEASE DO NOT DO THIS]"},{"id":2482267,"gallery_id":38357,"poster":{"id":3871690,"username":"[]TheImperialLoliconAlliance[]","slug":"theimperialloliconalliance","avatar_url":"avatars/3871690.png?_=7e650d84de11d722","is_superuser":false,"is_staff":false},"post_date":1650937229,"body":"@Emiru Ikuno to be honest, I'm actually shit at math and regret putting it there. You can ask me anything except math stuff. :)"},{"id":2481380,"gallery_id":38357,"poster":{"id":2824147,"username":"Emiru Ikuno","slug":"emiru-ikuno","avatar_url":"avatars/2824147.png?_=d024fc5a08fab09c","is_superuser":false,"is_staff":false},"post_date":1650897131,"body":"Imagine asking math questions on a hentai forum. What type of math questions were you expecting to answer here? Can't type anything complicated in here after all"},{"id":2480960,"gallery_id":38357,"poster":{"id":3871690,"username":"[]TheImperialLoliconAlliance[]","slug":"theimperialloliconalliance","avatar_url":"avatars/3871690.png?_=7e650d84de11d722","is_superuser":false,"is_staff":false},"post_date":1650873332,"body":"Ok. If you're here, you either just press the random button or you came from my profile. Anyways, you can ask anything from me like doujin recommendations, math questions or even life advices. I'll probably reply to you within the day. If I don't reply to you I'll probably be dead :3"}]