[{"id":1750885,"gallery_id":38424,"poster":{"id":3618998,"username":"JayMizzy22","slug":"jaymizzy22","avatar_url":"avatars/3618998.png?_=52ff138a6c06aa4c","is_superuser":false,"is_staff":false},"post_date":1621490593,"body":"Just here to remind you horny downbad virgins that Gurren Lagann is peak fiction 🗣️ -says the horny downbad virgin"},{"id":666311,"gallery_id":38424,"poster":{"id":1716081,"username":"FireLips","slug":"firelips","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1535133968,"body":"Yep this is what happens so no need to wonder if Yoko die a virgin and they didn't kiss!  \nI wish the author drawing was more similar to the anime or better, especially the boobs size of Yoko, it should be bigger. it funny that Simon has a small dick since he is the definition of become a man. I always love simonxyoko, remind me of my experience , since he landed on her and she smiles back! Legally they could have sex in part 1, same age, even if Simon look like a 10 years old kid and Yoko had already an adult body! That why I love about be in couple when we are kid, if we are one of the lucky, some of the hot girls are already full develop! That was the case with me, at 13 I get suck on by my ex-crush, she was so thicc tho, I wish I had fuck her at 13! I was like Simon in size. P.S: To bad Yoko will die a virgin, at least i could think she fuck her little students or the old director of the school. Well I prefers that Simon fuck her secretly, it seems more legit and on Yoko moral. "},{"id":390363,"gallery_id":38424,"poster":{"id":1256846,"username":"EmuNemo","slug":"emunemo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1521576904,"body":"\"Yours is much cuter than my father's\"\n\n\nHey hey hey, that's fucked up on so many levels"},{"id":337823,"gallery_id":38424,"poster":{"id":1383040,"username":"DendyGamer","slug":"dendygamer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1513928408,"body":"Yoko with simon/ That what i want in anime!)"}]