[{"id":2301844,"gallery_id":384836,"poster":{"id":2542033,"username":"Shorupsy","slug":"shorupsy","avatar_url":"avatars/2542033.png?_=70fc96c6b739f67d","is_superuser":false,"is_staff":false},"post_date":1643613691,"body":"Still waiting for the girls. For now, this will do....."},{"id":2275510,"gallery_id":384836,"poster":{"id":2549384,"username":"Gamer no shit","slug":"gamer-no-shit","avatar_url":"avatars/2549384.png?_=b8164bb687cd3588","is_superuser":false,"is_staff":false},"post_date":1642607713,"body":"@Itzki soyoki fandoms that grew larger became something you don't wanted to, and I think it's best for you to stop looking at them and just focus on the bright side. The copy pasting and the comment of yours in every mairimashita iruma-kun doujin, you're gonna encourage those people to make more so if you're taking a yes that stopped coming back to Mairimashita Iruma-kun doujin 18+ manga, just don't think of destroying your mental being because of the interest. The curiosity and bad feelings to the mairimashita iruma-kun nhentai doujin will harm you good. My opinion to this doujin is good and bad for weird ships like Balam-sensei and Iruma so that's a no for me. As I advise just like I said, you're encouraging them. Ignore them as you live out your life, thank you if you did read this "},{"id":2222073,"gallery_id":384836,"poster":{"id":1751605,"username":"Black Santa","slug":"black-santa","avatar_url":"avatars/1751605.png?_=ac9b80d684364c53","is_superuser":false,"is_staff":false},"post_date":1640523176,"body":"We need more with sassy Iruma being gay"},{"id":2221109,"gallery_id":384836,"poster":{"id":2093953,"username":"El Fabricas","slug":"el-fabricas","avatar_url":"avatars/2093953.png","is_superuser":false,"is_staff":false},"post_date":1640479232,"body":"Bro...       "},{"id":2220686,"gallery_id":384836,"poster":{"id":2549384,"username":"Gamer no shit","slug":"gamer-no-shit","avatar_url":"avatars/2549384.png?_=b8164bb687cd3588","is_superuser":false,"is_staff":false},"post_date":1640456199,"body":"@Toichiro is gay how community works with interacting the people who has the same taste as yours but different simp characters. I won't tell you what kind of fandoms I had been in but my favorite fandom is Ayakashi Romance Reborn. If you step into ayakoi family house, you will be kicked out immediately if you start harassing the tumblr members of ayakoi family. And that same goes with me. Start saying bull crap out of nowhere will takes you no where with those words of yours"},{"id":2220677,"gallery_id":384836,"poster":{"id":2549384,"username":"Gamer no shit","slug":"gamer-no-shit","avatar_url":"avatars/2549384.png?_=b8164bb687cd3588","is_superuser":false,"is_staff":false},"post_date":1640455926,"body":"@Itzki soyoki funny how some of your comments in Mairimashita Iruma-kun in this manga is copy pasting and then there's this \"stop running this fandom\". First of all, no fandom has innocent reputation. They came as the fandom grew bigger and bigger, creating toxic people and troublesome 18+ artists. Second, if the anime has a warning about spoiling and restricted rules, the fandom will be silent just like Kalego wishes for. Third, I'm gonna say it around again, once the fandom of the anime grew larger, you can't do anything about it. The same goes with Obey Me otome game. Someone already made rule 34 of the seven demon brothers, and I of course disappointed and feel shocked. I leave the fandom and never thought I feel better after deleting the game and leaving the fandom at the same time. As a person who went a lot of toxic fandoms, you can't do anything about it. If you at least want to stop it, become an idiot to yourself. It is quite immature when such toxic fandom exist cause that's"},{"id":2220187,"gallery_id":384836,"poster":{"id":4584550,"username":"Arroz124","slug":"arroz124","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640435665,"body":"Melhoro meu natal kkkkk"},{"id":2219870,"gallery_id":384836,"poster":{"id":1939921,"username":"Itzki soyoki","slug":"itzki-soyoki","avatar_url":"avatars/1939921.png","is_superuser":false,"is_staff":false},"post_date":1640423635,"body":"STOP RUINING THIS FANDOM!!!!!"}]