[{"id":2236341,"gallery_id":385211,"poster":{"id":282547,"username":"dwels","slug":"dwels","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641063649,"body":"@Feuerteufel thanks for the summary! I don't mind the less insect sex thing I thought the story was actually kinda interesting. Plus I liked the original art which feels like it was a lot more polished than the stuff now but hey, beggars can't be choosers. Still hoping for translations for this and the other chapter. Honestly can't wait for the next one."},{"id":2228416,"gallery_id":385211,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1640740148,"body":"Also for everyone disappointed with the decrease in insect sex. First of all the woman needs to give birth to a baby before she can be fused with the insect organism. And due to the many girls on board we have therefore much sex. The topic of the series is also shifting from \"just having lewd fun with insects\" to \"how can we find a way to save humanity with interspecies breeding\". Thanks to her telepathic abilities the princess also shows her daughter some pics of her father aka the rape orgy from the first volume. Lastly the have in the last panel the return of the \"kami-sama\" aka princess to the sex cult. So my guess is that we will have in the next volume some new hot group teachings of the princess and the girls regarding the special anatomy of specific insects."},{"id":2228371,"gallery_id":385211,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1640738849,"body":"Due to the telepathy parts we have many flashbacks in the 6 volume, narrated by the girl, that makes many parts quite confusing. Also I meant telepathy not telekinesis. I should really watch Occult Academy again."},{"id":2228356,"gallery_id":385211,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1640738445,"body":"As much as I can understand with my terrible japanese skills, we have a timeskip of 5 years in volume 5 in which the princess leaves the valley on side of the Torumekians. After that her personality has become much colder (after some war horrors and co.) and her body is now heavily modified by the insect parts. And she also gained the power of telekinesis. In the current volume we get informations that she has become an important character in the new government and also tries to create with her modified bodies a new human offspring that is resistant against the toxic Sea of Corruption. Meanwhile  her first child joins a insect people sex cult in order became a hybrid like her mother. And the second child is now the new pilot of the valley that grow close with the refugees from Dorok."},{"id":2228277,"gallery_id":385211,"poster":{"id":4363440,"username":"MAM1702","slug":"mam1702","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640735387,"body":"Burial my friend you are awfully right, the attitude and behavior of the princess has changed and the insectc sex has decreased if it not dissapeared, I would love to know What the caracters are saying, but until a translation there is no way to know Whats happening "},{"id":2226968,"gallery_id":385211,"poster":{"id":2317662,"username":"RevyTwoHand","slug":"revytwohand","avatar_url":"avatars/2317662.png?_=2939e274cbd554b5","is_superuser":false,"is_staff":false},"post_date":1640697247,"body":"ummm... what?"},{"id":2225596,"gallery_id":385211,"poster":{"id":9083,"username":"berdanka","slug":"berdanka","avatar_url":"avatars/9083.png?_=a7b9280b13ffc0fd","is_superuser":false,"is_staff":false},"post_date":1640649840,"body":"My weirdest fap."},{"id":2225002,"gallery_id":385211,"poster":{"id":3323390,"username":"burial","slug":"burial","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640629233,"body":"Hey, to you out there who’s actually here for the story and not just say “ew disgusting delete this”, do you mind briefing about the events of part 5 and 6? I’m guessing a long time has passed, seeing how the princess’s body has developed, but also how her demeanor kinda shifted as well, and tbh she seems pretty cold, completely different from her curious and gentle self in the previous 4 parts. Also, why is there so much human sex now? Im mainly in this story for the insects, but maybe with context this will make more sense. Thank you for reading."},{"id":2224798,"gallery_id":385211,"poster":{"id":3693721,"username":"uta no two","slug":"uta-no-two","avatar_url":"avatars/3693721.png?_=22840faa73fc9d0b","is_superuser":false,"is_staff":false},"post_date":1640623036,"body":"Wtf even is that killed my boner and made me wish i hadn't seen this."},{"id":2224474,"gallery_id":385211,"poster":{"id":4439116,"username":"♍VoidTraveler","slug":"voidtraveler","avatar_url":"avatars/4439116.png?_=46f7fc2a402accc2","is_superuser":false,"is_staff":false},"post_date":1640611762,"body":"Nausicaa anime is actually pretty cool. I recommend watching."},{"id":2224413,"gallery_id":385211,"poster":{"id":4451089,"username":"pollux98","slug":"pollux98","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640610008,"body":"WTF is this? I tried to read a little, but I am confused."},{"id":2223956,"gallery_id":385211,"poster":{"id":4804800,"username":"txkvn","slug":"txkvn","avatar_url":"avatars/4804800.png?_=b11e60f42bd7c77d","is_superuser":false,"is_staff":false},"post_date":1640593074,"body":"Idk how people fap to this "},{"id":2223825,"gallery_id":385211,"poster":{"id":220424,"username":"Sigon","slug":"sigon","avatar_url":"avatars/220424.png?_=25b1cee660e22bcc","is_superuser":false,"is_staff":false},"post_date":1640588172,"body":"it's still disgusting"},{"id":2223467,"gallery_id":385211,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1640576377,"body":"@Firstkind, Ghibli was founded 1985 but Nausicaä was released in 1984 by Top Craft. Technicaly Nausicaä is therefore not a Ghibli production, furthermore draws this ero.manga-series massiv influences from the manga by Miyazaki that was only framentary part of the Ghilbi narrativ. Still I get why you don't want to have your  childhood memories sullied."},{"id":2223327,"gallery_id":385211,"poster":{"id":1627431,"username":"Firstkind","slug":"firstkind","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640571982,"body":"What can I say except delete this. There should be a rule that Ghibli is off limits."}]