[{"id":2245163,"gallery_id":385418,"poster":{"id":3538646,"username":"Im_a_degenerate_man_.","slug":"im_a_degenerate_man_","avatar_url":"avatars/3538646.png?_=22c3d7407199da2e","is_superuser":false,"is_staff":false},"post_date":1641415455,"body":"Moral :No one is perfect,everyone is special in their own way"},{"id":2237638,"gallery_id":385418,"poster":{"id":962036,"username":"ekiz","slug":"ekiz","avatar_url":"avatars/962036.png?_=fa4945b3b6249b4d","is_superuser":false,"is_staff":false},"post_date":1641111813,"body":"Asu Maquina... I just wanted to fap, but I ended up very intrigued with the story"},{"id":2230677,"gallery_id":385418,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1640831421,"body":"The story could work even without the sex. Maki and Eli are what people would call winner in life, they graduate as elite, got respectable job. Even when still at school, they're perfect. Yet, they're actually stressed. Maki works overnight to compose songs, and then promised to revise it by tomorrow when her friends felt it could be better (although they're also fine with it as is). When younger, she would even steal her classmate's test result so she can present perfect score for her parents. After crying in toilet, she found Eli smoking. After that, she started to stumble upon Eli more often, and Maki actually felt relieved rather than sympathy, knowing Eli also carries a burden. There are some worrying hints about Eli. She only came home to their house 2 in the morning. She asked Maki if her parents beat her if she can't score perfect. In the epilogue, she said to her younger self, you should know there are things you should and shouldn't hope for."},{"id":2230668,"gallery_id":385418,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1640830948,"body":"@rudecustomer : this one is quite old actually (2017 year release) so the translation is probably available in fansites or places like Reddit or Tumblr. <https://www.pixiv.net/artworks/63685921> <== there's also cute silent comic panels of Eli Maki cuddling in that link there. BTW, the author's Pixiv also got something like Tokyo Ghoul with Love Live characters in Chinese and English (4 chapters, look for the entries titled 鬼抓人)."},{"id":2230049,"gallery_id":385418,"poster":{"id":2486607,"username":"rudecustomer1","slug":"rudecustomer1","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1640803150,"body":"Translate pls, I cant understand for jack altho the story seems interesting and fascinating!"},{"id":2228441,"gallery_id":385418,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1640740947,"body":"Is there a part 2 of this? The author mentioned this one focus more on Maki's side (how she grew up trying to fulfill the expectation of people around her). Seems like there should be another one focusing on Eri's own problem."}]