[{"id":2272811,"gallery_id":385667,"poster":{"id":2177697,"username":"Dexix","slug":"dexix","avatar_url":"avatars/2177697.png?_=d48b85185cf64c62","is_superuser":false,"is_staff":false},"post_date":1642522530,"body":"To be honest, I have Mixed feelings about this Doujin. After reading some of the comments which some of the people analyze the entire Doujin I'm somewhat Disappointed and Satisfied at the same time. I'm disappointed because I was expecting that Kido as the MC would make a comeback but he didn't. Then again, Asahi and Mei got what they deserved. If there's a continuation of this, I'll be glad someone explain what actually happened after this Doujin."},{"id":2267696,"gallery_id":385667,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642312830,"body":"@CuriosityKilledtheCat Analyzing better the last conversation between Asahi and Kido, we realize that in addition to the feeling of inferiority, Kido possibly did not feel a sexual attraction for Asahi... despite being short, that conversation reveals many things about both of them... already I'll do other posts on my blog or I'll make a video, actually Asahi had a justified reason for talking to Kido that way, an advance I can give you is, he didn't choose the right words to persuade Asahi and on the contrary they made him She will think that she was right and will start to hate Kido...for those who haven't seen my summary....https://hikitranslations.blogspot.com/2022/01/boku-dake-ga-sekkusu-dekinai-ie-ha-mei.html"},{"id":2266183,"gallery_id":385667,"poster":{"id":3893500,"username":"xXUtHiNkUnOmEXx","slug":"xxuthinkunomexx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642243928,"body":"If you're wondering where's the MC is... \n\n\nyou can find him here...👇\n\nhttps://archiveofourown.org/works/33892285/chapters/84648871"},{"id":2264569,"gallery_id":385667,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1642176256,"body":"@xyst16 maybe to show that the girls ain't worth for the MC but of course he wouldn't know that. His inferiority complex made him never thought even the slightest bit that maybe it wasn't entirely the brothers' fault. Hell, if it wasn't for his complex, he might have a chance to get laid seeing how easy the two girls are. Which is why, hence the title, he's the only one who can't get laid in his house."},{"id":2261525,"gallery_id":385667,"poster":{"id":937754,"username":"AkiYuki","slug":"akiyuki","avatar_url":"avatars/937754.png?_=16024edcd9ecfee1","is_superuser":false,"is_staff":false},"post_date":1642063467,"body":"Still can't understand why this is NTR, like all of the 3 books, like none of them are in the relationship?? It is totally fine for those girls the date some one and do it with them?? I don't see the NTR here, the only factor of the NTR in this series is a sad MC "},{"id":2261242,"gallery_id":385667,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642054440,"body":"For those who ask if this will be the last chapter, I don't think that's the case, we already saw the case of Karami Zakari, they have continued to exploit the story, ..... I have a feeling that it could even make the new Mc stay with Asahi as well as with Mei ... looking more closely at Asahi, she is stupider than Mei, since despite being more ready to see when she is cheated on, she is easily fooled just by having sex ... that's why I had the idea that the new Mc could cheat on Asahi with Mei, and she tolerate cheating as long as she was safe having sex with him ...... mental stupidity that I think in the middle of the night .... anyway we need to know what happened to Mei and see how or why the brothers abandoned them ..... Kido ... that boy is already dead in this hidtoria, unless he returns to see how now Asahi and Mei are the new deposit of someone else's semen guy"},{"id":2259699,"gallery_id":385667,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641998220,"body":"So this is the final chapter? In the end the black hair was more slut that the short hair who is just a dumb girl, si this is some kind of punishment for what they did ti the previous mc? "},{"id":2259612,"gallery_id":385667,"poster":{"id":2029608,"username":"山本栞","slug":"shan-ben-kan","avatar_url":"avatars/2029608.png?_=4deafb84f056034c","is_superuser":false,"is_staff":false},"post_date":1641994777,"body":"I don't give a shit anymore about this doujin. \nJust because the art so good, so i fap to this. \nHonestly, the story so trash, garbage level. \nKinda hate bitch swinger. But yeah, she is hot. \nI love NTR, but this one so trashy. \nPlease, die for my sake, author. You are so good at drawing, but your story so trash. \n"},{"id":2249836,"gallery_id":385667,"poster":{"id":2605970,"username":"wonwon6","slug":"wonwon6","avatar_url":"avatars/2605970.png?_=4253aa583e1fa1f2","is_superuser":false,"is_staff":false},"post_date":1641595579,"body":"lmao what a fucking trash, i thought benimura gonna redeem himself with this chapter. but no he just made it worse lmaooo. once a cuck will always be cuck i guess"},{"id":2249712,"gallery_id":385667,"poster":{"id":4425373,"username":"authurkind","slug":"authurkind","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641589913,"body":"不得不说还是ntr带劲，换回纯爱顿时索然无味"},{"id":2249345,"gallery_id":385667,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1641573215,"body":"A fitting ending I guess? These two will slowly turned into the something similar like the MC's brothers. Not really surprised they broke up because all they did are just bullying MC and now that he's gone, well... They just lost their purpose."},{"id":2243086,"gallery_id":385667,"poster":{"id":4961167,"username":"keybeast_id","slug":"keybeast_id","avatar_url":"avatars/4961167.png?_=1ba5358507f56f96","is_superuser":false,"is_staff":false},"post_date":1641325938,"body":"Where the MC \"Yuuta Kido\"??? This is not I want. I need it ASAP!!!\n\n\nJust kidding. I think this is good story. The girls got what they deserved. But seriously, I need to know what happened to Kido now. I need story that focus on Kido. Just forget the girls."},{"id":2241842,"gallery_id":385667,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641281662,"body":"@one big shot, Mei's story happens before, although I have the impression that the last page of that story happens later, since the physiognomy of the character that is behind, looks more like the new Mc than the previous one, since this He has no freckles and he reacts immediately when Asahi tells him Mei's name when being in the student council he did not know that Asahi and Mei were friends ..... in my blog post I explained all that and how the crying Asahi's also must have been a lie just to have sex with the new Mc ..... The intention of Mei's story was to tell that she has always been a stupid naive girl who has been fooled and ends up having relationships with people that taking advantage of her and after having used her, they end up abandoning her, and since she rejected the only person who accepted her despite all her failures and with whom she could be happy that it was Kido the previous Mc"},{"id":2241818,"gallery_id":385667,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641280608,"body":"@Kurono99 Kido is the protagonist since everything begins and everything ends. If it had not been for him, his brothers would not have noticed these girls and they would not have had their chance with them ..... The fact that in Asahi's story it is implied that the brothers broke up with them, shows that without Kido, they lost the value they had. Probably if he had contact with kido again, they would be able to pretend to be his girlfriends as long as his brothers had sex with them again while cheating on him ... that's how important Kido is, the problem is that he has not known how to use that power he has over brothers and girls"},{"id":2241158,"gallery_id":385667,"poster":{"id":371225,"username":"Kurono99","slug":"kurono99","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641256173,"body":"What have all People with this KIdo Guy. He never seems to be really the MC. The Girls and the Brothers are more the MC and the other one from the first 2 parts are more like a Sidecharacter. "},{"id":2239989,"gallery_id":385667,"poster":{"id":2680933,"username":"one big shot","slug":"one-big-shot","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1641209041,"body":"I’m going with that this is an epilogue of the first 2 story going on that if this was a prequel both girls would be virgins and it shows they are not but maybe they weren’t anyways before hooking up with those 2 brothers. The big hint I’m getting is the black hair girl is not wearing glasses like she was in the first book and I’m assuming she was crying here is cause she was tossed aside. "},{"id":2239244,"gallery_id":385667,"poster":{"id":3352382,"username":"CulturedMen","slug":"culturedmen","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641177811,"body":"Eagerly awaiting translations. I can't understand the comments so I hope this will cleanse myself from the depressing story from 1st part"},{"id":2237744,"gallery_id":385667,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641115373,"body":"My comment was long to describe in a message here, so I made a summary in my translation blog ..... although it seems that the girls had a good ending, this chapter shows us that both had what they deserved by betraying Mc. .. The worst part was Mei for Naive and we could see how Asahi only thinks about satisfying herself having sex with anyone and how this turned her into a manipulative bitch, and she does not mind making Mei look even worse as long as she continues giving one image that she is still a virgin ... the best thing would be for this story to end here, I think no one expects the Mc to be redeemed, but a new chapter where Asahi was not exposed and humiliated I think would leave us all dissatisfied .. .... in the end the Mc had a very great power which he could not enjoy, since with his final decision he indirectly humiliated the girls and now they suffer the consequences ... https://hikikomoritranslations.blogspot.com/2022/01/boku-dake-ga-sekkusu-dekinai-ie-ha-mei.html"},{"id":2235711,"gallery_id":385667,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1641038112,"body":"Tbf on the second story, it makes sense to have it be as it is(in a sense). Old MC who transferred schools unfortunately got shit Gene RNG and shitty brothers who attacked his confidence that he had to move schools to get away with everyone especially because of BHFemc, but the new MC shows that if he just moved on to new girls and didn’t mind his brothers, he’d most likely be fine(especially proven since even after moving away he gets off on his neighbors super creepily iirc)"},{"id":2235554,"gallery_id":385667,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641030601,"body":"as he had only read the reddit thread he had not translated it but it is even worse .... although both have their deserved Asahi tells the new Mc that although he had fun with him and his older brother whom he consulted on various matters and that From that point on, they didn't mind excluding him from their group and ended up saying horrible things to him that made him change schools. (Attention She never says that she had a relationship with the brothers) Then she mentions that she was like \"floating\", which could mean that probably as soon as the MC left, the brothers must have pulled the girls..The new Mc consoles her and tells her that he had been in love with a sempai and when Asahi asked him what happened to her, the new MC told him that nothing happened, but that that was not going to be a reason to change schools. (Obviously, he told us everything they did to the other Mc to see if he could hold out like him) and Asahi replied: These words ease my heart ... "},{"id":2235456,"gallery_id":385667,"poster":{"id":1746433,"username":"Ninjah3r0","slug":"ninjah3r0","avatar_url":"avatars/1746433.png?_=e4eba65893f6aa34","is_superuser":false,"is_staff":false},"post_date":1641027035,"body":"short hair melengkapi semuanya "},{"id":2235435,"gallery_id":385667,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641026373,"body":"@ fbblover_69 it's not that we want the girls to be punished, it's that Asahi, the girl with black hair is punished. She was quite aware that Mc's perfect brother would notice someone as ordinary as her and until the end of the previous chapter she admits that much of what they do is wrong, the orgy, to do it at his house, which gives understand that she is aware of the kind of people her brothers are, but that she is really interested in sex and does not care about the feelings of the MC, since both girls are aware of the feelings they had towards them, that's why I hurt him that way by saying \"this is none of your business, you only live in the same house\" saying you only get in the way, even though we could get what we wanted for you ... mei is quite ignorant and innocent, but Asahi He is quite cruel and is just as guilty as the brothers, so if the brothers receive punishment, Asahi deserves it too"},{"id":2234955,"gallery_id":385667,"poster":{"id":4379904,"username":"Mahogany Wood","slug":"mahogany-wood","avatar_url":"avatars/4379904.png?_=c6fcfa060e46c881","is_superuser":false,"is_staff":false},"post_date":1641008549,"body":"Moral of the fable (it has three parts): women are like cats because they always land on their feet."},{"id":2234706,"gallery_id":385667,"poster":{"id":4269941,"username":"ManlyChicken","slug":"manlychicken","avatar_url":"avatars/4269941.png?_=fb8979f37cb89baa","is_superuser":false,"is_staff":false},"post_date":1640996979,"body":"Thank Almighty this is just a well-drawn art book (even if i'm not a fan of these kind of stories) instead of a tragedy i've to go through IRL."},{"id":2233765,"gallery_id":385667,"poster":{"id":4252708,"username":"fbblover_69","slug":"fbblover_69","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640953685,"body":"I don't get peoples obsession with punishing the girls. I mean i get that fucking the dudes brother in his vicinity is extremelly incosiderate, is not something that horrible that warrants the complete destruction of the girls. If anything I'd like to see the brothers getting punished, since they seem to really dislikethe MC and fucked the girls to spite him."},{"id":2233436,"gallery_id":385667,"poster":{"id":2398352,"username":"llik lla skcuc","slug":"llik-lla-skcuc","avatar_url":"avatars/2398352.png?_=21dc69ae8cd4c9cf","is_superuser":false,"is_staff":false},"post_date":1640937422,"body":"I think this is prequel. Considering how they are so chill with sex in original NTR. Of course, these guys got broke up to follow original work where MC's siblings get to do. That also explain why she reject MC in original (cause MC reminds her of this virgin facelass generic guy in this one). She like cool smart brother better after all."},{"id":2233411,"gallery_id":385667,"poster":{"id":4049,"username":"qohank","slug":"qohank","avatar_url":"avatars/4049.png?_=79837ed153a5ed25","is_superuser":false,"is_staff":false},"post_date":1640936478,"body":"Ia this alternative story?"},{"id":2233352,"gallery_id":385667,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640933193,"body":"I honestly did not understand what was the objective of making a prequel beyond trying to appear innovative to put it together with a sequel, when this story did not contribute anything ..... I understand that in the second one he wanted to make the new protagonist similar to the previous one by the author's own wishes to give a good to his protagonist in an indirect way without the author being judged for having become weak for giving a happy ending to his story ... it must be too difficult to be cataloged as an author of netorare in that sense, but I think I should be more honest and give an end, be it good or bad, instead of continuing to explode with spin offs that do not contribute anything to the main story and only cause confusion ... it is obvious the protagonist will never be happy and the Girls will not redeem themselves no matter how guilty they feel, they will cry a little and go to have sex with someone else and forget about the protagonist until they find someone new"},{"id":2232870,"gallery_id":385667,"poster":{"id":3562108,"username":"Juddeau","slug":"juddeau","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640916045,"body":"@sotenisaze Exactly, the author wants us to believe that both the old and the new MC went through the same situation (which is NOT the case by far) and that the new MC knew how to do things better because the latter did not transfer from school and because of that he fucked the girl without any kind of effort.\n\nHonestly, these are the things that annoy me, when the author thinks the reader is stupid."},{"id":2232772,"gallery_id":385667,"poster":{"id":431251,"username":"sotenisaze","slug":"sotenisaze","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640911212,"body":"The second story would be fantastic if there was a follow up involving the previous MC. It doesn't need to be a reconciliation but understanding each other then move on their different ways. The black-haired girl already has the initiative for she already knew the original MC's thoughts about her but ignored it. What I'm not convinced is how the author compared the two MC's with very different circumstances and just forcefully pushed the idea that the original MC is lame"},{"id":2232452,"gallery_id":385667,"poster":{"id":3562108,"username":"Juddeau","slug":"juddeau","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640894673,"body":"A very brief and too superficial spin off (hentai after all).\n\nThe first story is boring and cliche of a character that nobody cares about and the second is a poorly done redemption, where the only intention of the author is to emphasize the idea of ​​\" life goes on \"and continue to indirectly mock the MC of the original story (in a very cynical way, IMO) through a generic new MC without a face (literal)."},{"id":2231913,"gallery_id":385667,"poster":{"id":3223789,"username":"MysteryMen2","slug":"mysterymen2","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640878058,"body":"Kinda boring, previous was better. A sequel would be nice, set a year or few years later, where MC changes himself, where he's not the same sore loser that he's used to be"},{"id":2231911,"gallery_id":385667,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1640877987,"body":"There's no NTR here. The first story is about a girl who confessed her love but got rejected then an opportunistic guy strikes while the 2nd story is just a typical vanilla. First story got defloration while second story doesn't so the guy is a new lover of the girl."},{"id":2231863,"gallery_id":385667,"poster":{"id":4096406,"username":"TrendBreaker","slug":"trendbreaker","avatar_url":"avatars/4096406.png?_=999ad65575c489cc","is_superuser":false,"is_staff":false},"post_date":1640876263,"body":"Eh, Give the MC what I like to call the \"Ebenezer Scrooge Ending\". Break him socially so that he can never form personal bonds with anyone an lives a sole materialistic life and ends up witht he title of \"The Richest Virgin in the Cemetery\""},{"id":2231843,"gallery_id":385667,"poster":{"id":40471,"username":"boboxxx86","slug":"boboxxx86","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640875679,"body":"@TrendBreaker Wow i didn't know we have netorare subreddit...."},{"id":2231822,"gallery_id":385667,"poster":{"id":94345,"username":"SakuyaShirase","slug":"sakuyashirase","avatar_url":"avatars/94345.png","is_superuser":false,"is_staff":false},"post_date":1640874815,"body":"Blond girl is a prequel and the black haired girl is sequel to the NTR work. If you read the story it mainly exists to justify the girls actions and to take the piss on OG mc more lol."},{"id":2231803,"gallery_id":385667,"poster":{"id":40471,"username":"boboxxx86","slug":"boboxxx86","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640873982,"body":"oh hey...........MORE.............................!"},{"id":2231757,"gallery_id":385667,"poster":{"id":3403958,"username":"ghhssaj","slug":"ghhssaj","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1640871974,"body":"不愧是紅村，我拉黑單了"},{"id":2231745,"gallery_id":385667,"poster":{"id":1873702,"username":"Miming","slug":"miming","avatar_url":"avatars/1873702.png","is_superuser":false,"is_staff":false},"post_date":1640871581,"body":"Gudshit. Sex scenes kinda meh tho."},{"id":2231741,"gallery_id":385667,"poster":{"id":1514312,"username":"Rickwang","slug":"rickwang","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1640871346,"body":"啥玩意儿？另一条世界线？"},{"id":2231719,"gallery_id":385667,"poster":{"id":2266050,"username":"etohno","slug":"etohno","avatar_url":"avatars/2266050.png?_=81999eeef22f6350","is_superuser":false,"is_staff":false},"post_date":1640870507,"body":"is this the alternative story where he's not a beta?"},{"id":2231693,"gallery_id":385667,"poster":{"id":4096406,"username":"TrendBreaker","slug":"trendbreaker","avatar_url":"avatars/4096406.png?_=999ad65575c489cc","is_superuser":false,"is_staff":false},"post_date":1640869422,"body":"For anyone wanting a summary, there's a good one on the first reply on this tread.  https://www.reddit.com/r/netorare/comments/rrumug/boku_dake_ga_sex_dekinai_ie_im_the_only_one_that/"},{"id":2231691,"gallery_id":385667,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1640869199,"body":"I wish black hair bitch is the one who suffer"},{"id":2231687,"gallery_id":385667,"poster":{"id":4583946,"username":"Peradaban","slug":"peradaban","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640868865,"body":"is this another storyline?"},{"id":2231684,"gallery_id":385667,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640868739,"body":"The bs continues huh, comments will be spicy, Blonde girl FTW."},{"id":2231671,"gallery_id":385667,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1640868047,"body":"Wait, what is this? Sequel? Spin off?"},{"id":2231663,"gallery_id":385667,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1640867683,"body":"Aren't those are two bitches that has sex with siding?"},{"id":2231636,"gallery_id":385667,"poster":{"id":4863102,"username":"is13cmenough?","slug":"is13cmenough","avatar_url":"avatars/4863102.png?_=49c3cc458ffad667","is_superuser":false,"is_staff":false},"post_date":1640866556,"body":"oh no! i liked the blond girl in the previous one, why is she the one suffering in this one? i hate this continuation already."},{"id":2231628,"gallery_id":385667,"poster":{"id":2275702,"username":"wxyz.zxab","slug":"wxyz-zxab","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1640866411,"body":"It is just me or those guys's penis isn't more bigger than mc's? I feel like mc actually has a chance :("},{"id":2231526,"gallery_id":385667,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1640861041,"body":"Ah! I recognize those girls!"}]