[{"id":2659344,"gallery_id":386822,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658610151,"body":"The idea with this is that the girl starts out \"Self-sacrificing and pushing her BF away out of protectiveness when really she wants him to save her!\" but then in the end when she falls, she gaslights herself into believing he was useless and less then a man because if he was any of those things, he fuck her, fuck her better, or have realized everything and saved her by this point, basically telling herself it's not her fault \"he's useless!\" Rapist Blackmailer is counting on her stupidly isolating herself. While this and the sequel show he's being BLUNT about her doing stuff behind his back and lying! Winning her when she falls into despair when BF breaks up with her and she runs to them for solace and falling! If he's cruel when done with her, he may even reveal all this to crush her with just how stupid she was to fall for his tricks! Saw one where the guy did this, she lost her BF and fell to him after he revealed it, then tossed her to be Gangraped because he got his \"payback!\" "},{"id":2249242,"gallery_id":386822,"poster":{"id":4465408,"username":"萧特","slug":"xiao-te","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1641569456,"body":"哈哈哈这ntr剧情真的是烂大街了"},{"id":2247916,"gallery_id":386822,"poster":{"id":49509,"username":"Pleb","slug":"pleb","avatar_url":"avatars/49509.png","is_superuser":false,"is_staff":false},"post_date":1641525485,"body":"I think the NTR mangakas are competing to come up w/ the dumbest blackmail plotlines. "},{"id":2247026,"gallery_id":386822,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641489192,"body":"Stupid plot lol wtf, you have a picture of my boyfriend passed out drunk. Oh my i have to save him so ill let him fuck me lmao"},{"id":2246996,"gallery_id":386822,"poster":{"id":4526017,"username":"~Eros~","slug":"eros","avatar_url":"avatars/4526017.png?_=2648d8daa681f61c","is_superuser":false,"is_staff":false},"post_date":1641488467,"body":"Relatively pathetic "}]