[{"id":2351668,"gallery_id":386820,"poster":{"id":728148,"username":"dyfia","slug":"dyfia","avatar_url":"avatars/728148.png?_=8390ea3cc0674af5","is_superuser":false,"is_staff":false},"post_date":1645425245,"body":"Ill ship those two"},{"id":2258794,"gallery_id":386820,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1641964491,"body":"With pics/vid of her late out night in the city with some old man. It's ironic considering the bad future trnks comes from where he gets rekt by her and her brother. I'd have a hard time believing roshi wouldn't take advantage of the situation as well, plenty of chances to gather footage and do the same. Never liked the bullshit idea of that bald midget and her, she's way too high tier for him and the way they went about it was absolute nonsense, forced through bad writing. They say toriyama wanted to throw ol' kurilin a bone for getting shitted on by nearly every other female in the show? 18's is a museum of fossil bones replicas, way too over. Just look how ugly their kid is, she could've had eyes and a head instead of two black pencil marker dots for eyes on an egg for head, but noo, japs and their coveting obsession for fair yellow hair blue eyes females had to ensure bias writting miss landing her with the designated asian gonk that looks like a \"Shin Chan\" character. Fukin hell."},{"id":2247262,"gallery_id":386820,"poster":{"id":3611154,"username":"Captain Netorare","slug":"captain-netorare","avatar_url":"avatars/3611154.png?_=b2106edd97eeffb8","is_superuser":false,"is_staff":false},"post_date":1641497846,"body":"Great more 18!! but I just don't buy Gohan of all people doing this it should be Roshi."},{"id":2247044,"gallery_id":386820,"poster":{"id":160,"username":"ThatGuyOverTher3","slug":"thatguyoverther3","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641489640,"body":"What is he even blackmailing her with?"}]