[{"id":2428346,"gallery_id":386991,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1648669319,"body":"Also to add, I don't think Pink and Co. Died at the end of the last story (Unless capturing their souls and cloning was involved). Seeing how corrupt Blue is that she has the \"elf ears\" makes me think her killing Pink and Co last story was to trick what little good left in her that wasn't brainwashed or removed to die completely by thinking she killed her BFF (and the Accessories but I doubt she'd care much) causing her personality to COMPLETELY fade! As what's left is a sex slave slutty baby factory that see's Pink as nothing but her mistress other toy! But talk about \"fate worse then death for Pink\". Blue is gone forever, and the Co. are just toys. But their lucky compared to Pink! The villainess went beyond the beyond to assure \"hope becomes a scary concept for Pink\" that she'll never recover! One half suffering as her Onahole, while the other a slutty \"happiness in slavery/despair\" Sex doll eager to be used (which she's likely also being forced to endure alongside being a toy!)"},{"id":2428339,"gallery_id":386991,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1648668907,"body":"(Continuing from Last) if she never fell for the ploy because of her insecurities! She never would have been a useful tool in knocking down the domino stack that was her precious BFF Pink's life and of course losing the earth! With Pink, no magic was used to cause her to fall in despair. The Big Bad assured she had no way out other then to beg and fall into despair (even smacking her mascot partner away in fear her surrender and begging would be seen as genuine because he was begging her not to give up). But yeah the other two aren't really that important in the long run even to the villainess! Compared to \"Birth Factory Blue\" and \"Sex Doll Pink\" there just \"accessories\" (you know \"story accessories\") you could remove them and just have it be those two and barely anything was lost or gained!....still a waste to have them (That one where the entire Hero Team got corrupted had chapters devoted to each members fall and for the males Gender Bender!) All I want is a good ENG of this one!"},{"id":2428334,"gallery_id":386991,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1648668540,"body":"@yuzuna Honestly, I think this is it and was always meant to be a two parter! The first story focused more on Blue and Pink who were close friends while the other two were just add on's of no real importance other then one of them being responsible for Blue's \"short-sighted decision that resulted in this tragedy!\" (Her becoming so slutty, so brainwashed and so stupid that by the time she realized her mistake it was too late!) Looking at it, Pink was the main objective to crush then Blue was, she was a Stepping stone that still had some usage afterwards! The objective being to cause Pink to fall into unrecoverable despair! Her friend Blue is gone for good, she can't save her teammates and was forced to abandon them when she tried, and the humiliation alongside abandoning them. By the end she gave into despair like the Big Bad wanted! The sad part for Blue (before she luckly to cease to exist) is that she didn't have to live knowing this is all her fault! (Next Post)"},{"id":2393734,"gallery_id":386991,"poster":{"id":96184,"username":"yuzuna","slug":"yuzuna","avatar_url":"avatars/96184.png?_=bfa333fd893a79f5","is_superuser":false,"is_staff":false},"post_date":1647239356,"body":"is this part two? cant wait for other two. "},{"id":2264358,"gallery_id":386991,"poster":{"id":4572120,"username":"311498921","slug":"311498921","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642168941,"body":"要素过多，，，，，，"}]