[{"id":2251816,"gallery_id":387041,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1641676649,"body":"Where's the defloration tag?! "},{"id":2250849,"gallery_id":387041,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1641635460,"body":"I only wrote that cus comment below mine wrote something weird and I thought I was retarded and had to reread it."},{"id":2250769,"gallery_id":387041,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1641633041,"body":"you don't want to stop you knew he was coming back but didn't run away he says as he forced her down pretty much the whole time even trying to run away before he pulled her leg. The guys are brothers he was in cram school and she ran into him while going to his house cus she was going to confess to him He puts down his brother when they looking at photos something about how first love and how he caught him jerking it with his small epeen after seeing a kiss scene in a drama. Whole time he is taunting her how he's gonna come home soon well brother comes home catches them (can see his pants are down and she's covering up) and gets angry and older bro makes a remark how their feelings must have been mutual cus of how mad he is and says how she must want to continue cus he didn't run away when he was coming home or some stupid shit :L"},{"id":2250606,"gallery_id":387041,"poster":{"id":4115504,"username":"rickm27","slug":"rickm27","avatar_url":"avatars/4115504.png?_=d95af4d918c0f2ea","is_superuser":false,"is_staff":false},"post_date":1641626570,"body":"And now she won't have a place to live anymore because that guys gonna kick her out and the one who slept with her isn't gonna take her in lol"}]