[{"id":2271179,"gallery_id":387390,"poster":{"id":3423516,"username":"user_A_exist","slug":"user_a_exist","avatar_url":"avatars/3423516.png?_=abb022accdee2e90","is_superuser":false,"is_staff":false},"post_date":1642459790,"body":"Both are retarded, but wife is trash. Well, fair enough, bitch gave the consolidation money, but seems Guy still retarded, dude how much bitches should cheat on you till you realized that bitches ain't worth your time?"},{"id":2269520,"gallery_id":387390,"poster":{"id":4143252,"username":"Sen from Howards lol","slug":"sen-from-howards-lol","avatar_url":"avatars/4143252.png?_=931d1bbb8762455c","is_superuser":false,"is_staff":false},"post_date":1642389767,"body":"\"Woman most affected 10/10.\"\n -IGN"},{"id":2268959,"gallery_id":387390,"poster":{"id":4416172,"username":"cziq2011","slug":"cziq2011","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642363056,"body":"怎麼說呢，比隔壁結局描述的更好。更讓人心裡一驚然後一緊。心疼的感覺"},{"id":2266812,"gallery_id":387390,"poster":{"id":858960,"username":"S8N","slug":"s8n","avatar_url":"avatars/858960.png?_=ffea824ac8ee4692","is_superuser":false,"is_staff":false},"post_date":1642271744,"body":"Damn dawg. Realistic ending like this hits you the hardest than your usual destruction or cuck ending. Fuck me, I don't even care about the sex anymore, I care more about that ending. "},{"id":2264745,"gallery_id":387390,"poster":{"id":3221066,"username":"Inio Asano","slug":"inio-asano","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1642181912,"body":"Recommend me some more stuff like this, nhentians"},{"id":2263513,"gallery_id":387390,"poster":{"id":3221066,"username":"Inio Asano","slug":"inio-asano","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1642133165,"body":"Translation when? "},{"id":2263399,"gallery_id":387390,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1642129930,"body":"@JutsSweetLover Nah, the condom is still inside her and it's leaking out."},{"id":2263158,"gallery_id":387390,"poster":{"id":3766911,"username":"JutsSweetLover","slug":"jutssweetlover","avatar_url":"avatars/3766911.png?_=1bd14c4427b28f38","is_superuser":false,"is_staff":false},"post_date":1642123835,"body":"Coming back here did she get creampie'd by the old man? Lots of condom laying around wished she got knocked up, old man BBM is chad"},{"id":2263101,"gallery_id":387390,"poster":{"id":997241,"username":"trigunxkeal123","slug":"trigunxkeal123","avatar_url":"avatars/997241.png","is_superuser":false,"is_staff":false},"post_date":1642121685,"body":"wtf the art is so good but i had trouble fapping bc of the story. it's too realistic kinda depressing damn LOL "},{"id":2262996,"gallery_id":387390,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642115701,"body":"I need this animated this is ntr gold, pink pineapple pick this shit up!!!"},{"id":2260718,"gallery_id":387390,"poster":{"id":2348254,"username":"MattEz_","slug":"mattez_","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642037860,"body":"damn she got her insides open open, nice art"},{"id":2260704,"gallery_id":387390,"poster":{"id":4930323,"username":"TheBLACKDahlia","slug":"theblackdahlia","avatar_url":"avatars/4930323.png?_=120898c531bff33d","is_superuser":false,"is_staff":false},"post_date":1642037316,"body":"@badpriorities12: Absolute KUDOS to you for recommending Jitsu wa Watashi Sexless de Nayandemashita (Secretly I've Been Suffering About Being Sexless)! I thoroughly enjoyed it after reading this and your comment about it!"},{"id":2260694,"gallery_id":387390,"poster":{"id":4930323,"username":"TheBLACKDahlia","slug":"theblackdahlia","avatar_url":"avatars/4930323.png?_=120898c531bff33d","is_superuser":false,"is_staff":false},"post_date":1642036918,"body":"HOLY SHIT!!! This all started because he was infertile?!? NGL, this is probably the deepest NTR story I've EVER seen/read before!!! Ootsuka Mahiro is really making me want to go back and seek out more female artists/authors who draw a female take on the NTR genre!"},{"id":2260391,"gallery_id":387390,"poster":{"id":4464558,"username":"Stasis-wielder14","slug":"stasis-wielder14","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642025409,"body":"You ever just look at something and know that ntr is involved?"},{"id":2260320,"gallery_id":387390,"poster":{"id":4085310,"username":"Rexx19doom","slug":"rexx19doom","avatar_url":"avatars/4085310.png?_=160b6f905c5493b4","is_superuser":false,"is_staff":false},"post_date":1642021181,"body":"This is quite depressing, sexless marriage life that led to infidelity is kinda realistic"},{"id":2260105,"gallery_id":387390,"poster":{"id":287357,"username":"bluemorpho99","slug":"bluemorpho99","avatar_url":"avatars/287357.png","is_superuser":false,"is_staff":false},"post_date":1642012440,"body":"@shane001 mucho texto but yeah agree"},{"id":2259809,"gallery_id":387390,"poster":{"id":4964081,"username":"lordsochorX","slug":"lordsochorx","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1642003038,"body":"@shane001 Spot on. She is utter trash and deserve to die in ditch."},{"id":2259659,"gallery_id":387390,"poster":{"id":4842344,"username":"shane001","slug":"shane001","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641996770,"body":"Some people are also saying that she suffered. LOL. Nope. She never suffered. She was making all the decisions. The last being the painful one and cut her old life away and start fresh. She won. now she gets to go and live the life she wants and get fucked how she wants all while the guy is left with horrible memory and hurt pretty much she gets to start fresh way more easily than the husband since the husband has to deal with all the emotional damage plus his condition. My guy will most probably suffer from ptsd his whole life along with living with the baggage of being infertile. Unless he finds a good person like himself he is in hell for his life now. "},{"id":2259655,"gallery_id":387390,"poster":{"id":4842344,"username":"shane001","slug":"shane001","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641996641,"body":"Some people say that Husband was some part to blame or it's both of their fault. Nope. If she had made any efforts to the relationship whatsoever and husband was shit/toxic/abusive/other stuff  than there might be a little fault of the husband but, what did she do? She found that he masturbates and jumped directly to cheating. It's completely her fault the moment she cheats especially for a dumb reason like that. She made more effort toward cheating than her own relationship Husband received some devastating news so it broke him especially if wife really wanted kids. So its kinda understandable that he couldn't think logically and didn't know what to do it. At that point it was up to the wife to see something is wrong and he is acting weird and maybe talk to him/confront him. But as she herself said her first impulse was think of her self and her selfish desire. And even the person she cheated with in this last chapter she cheated on her own will because the guy was going her own way. "},{"id":2259238,"gallery_id":387390,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1641980561,"body":"Btw I'm here again and smh why do I feel like the guy she is calling is the 3re guy? I mean from my pov that is the guy who told her to confess now it would make more sense if he is the one she will call first after paying the damage she had. And for some reason I'm also pretty sure that she's still screwing with the 3rd dude"},{"id":2259157,"gallery_id":387390,"poster":{"id":4451370,"username":"TreasonalSeason","slug":"treasonalseason","avatar_url":"avatars/4451370.png?_=dbb4ad30077769c8","is_superuser":false,"is_staff":false},"post_date":1641977655,"body":"Good for her that she’s managed to start over. It’s all thanks to the third guy."},{"id":2258954,"gallery_id":387390,"poster":{"id":1092173,"username":"Psychojing","slug":"psychojing","avatar_url":"avatars/1092173.png","is_superuser":false,"is_staff":false},"post_date":1641970687,"body":"@BZo1480\nYeah, and then she clicked one button and deleted him from her life. The fact that the woman looks completely different is a testament to how much she moved on. She is no longer the woman he loved nor will she ever be again. He's still stuck in that same place in time, that's why he wants to get with her at the end after all she's done. HE will forever be plagued with insecurities of his infertility and the insecurities his wife's infidelity has brought him, FOREVER a broken man both inside and out. Long story short: He went from terrible husband to GIGA CUCK. SHE WINS. "},{"id":2258910,"gallery_id":387390,"poster":{"id":3368533,"username":"keju asin","slug":"keju-asin","avatar_url":"avatars/3368533.png?_=d2a3fa5272af7ca6","is_superuser":false,"is_staff":false},"post_date":1641968935,"body":"Humu~~~~~\n"},{"id":2258753,"gallery_id":387390,"poster":{"id":2562411,"username":"DIProdigy","slug":"diprodigy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641963313,"body":"@[MADMAN] the phone call can be just anybody, it just showed her talking so that when she finished she deletes ex husband from her contacts. I don't think she has lovers or sex friends at this point but the author showed her smiling in the call to show us she healed somewhat and see her true personality as a bright and positive person that we see in all the cover arts."},{"id":2258717,"gallery_id":387390,"poster":{"id":3106488,"username":"pussyslayer alpha version","slug":"pussyslayer-alpha-version","avatar_url":"avatars/3106488.png?_=28e9a7058bfadd53","is_superuser":false,"is_staff":false},"post_date":1641961811,"body":"Sadkek eat that thot"},{"id":2258609,"gallery_id":387390,"poster":{"id":4491499,"username":"save yourself","slug":"save-yourself","avatar_url":"avatars/4491499.png?_=cae733738150e06c","is_superuser":false,"is_staff":false},"post_date":1641957945,"body":"https://pastebin.com/viyhgJy0 \n\n@DrinksandDame's summary for those of us that needs subtitles to watch anime. Also love how there's an intense discussion happening here over a doujin haha. Would love to fap to this but I'm on day 6 of NoFap. "},{"id":2258587,"gallery_id":387390,"poster":{"id":4491499,"username":"save yourself","slug":"save-yourself","avatar_url":"avatars/4491499.png?_=cae733738150e06c","is_superuser":false,"is_staff":false},"post_date":1641957257,"body":"Can't wait for the translations but holy fuck that old man is packing. It was so satisfying watching him choke that bitch lmao. I got too emotionally invested over a stupid NTR haha. Wanted to see him get more violent but I'll take what I can get. "},{"id":2258409,"gallery_id":387390,"poster":{"id":1955282,"username":"windsrun","slug":"windsrun","avatar_url":"avatars/1955282.png?_=2f46c5605d2bb4f1","is_superuser":false,"is_staff":false},"post_date":1641950997,"body":"@[MadMan] you are right i needed to refresh myself on chapters 1&2. Now regarding this \"would've been a slap in the face for the wife\" that was the point, that he had moved on and hopefully found someone that will not cheat on him because she couldn't talk with him about their problems. And as i have said, even if she still loves him, her actions says something completely different. seeing as she slept with the 3rd guy even though she knew she shouldn't. Meaning she had no plans to fix the relationship and just wanted to end it all.  "},{"id":2258395,"gallery_id":387390,"poster":{"id":4572962,"username":"[MadMan]","slug":"madman","avatar_url":"avatars/4572962.png?_=2dcca2607e7f3269","is_superuser":false,"is_staff":false},"post_date":1641950680,"body":"@windsrun you need to read chapter 1 again that wasn't the first thing she thought about she tried to talk to him on multiple occasions but he purposefully made it difficult for her because of his insecurities over his infertility but it was also her fault because she admits she has trouble conveying her thoughts and feelings to him anyway. The wife definitely crossed the line though but at that point the relationship was already damaged. Beyond repair well that's anyone's guess, i suppose it would've all hinged on her accepting his infertility and the fact he hid it from her for so long while using it as a excuse to push her away."},{"id":2258327,"gallery_id":387390,"poster":{"id":3766911,"username":"JutsSweetLover","slug":"jutssweetlover","avatar_url":"avatars/3766911.png?_=1bd14c4427b28f38","is_superuser":false,"is_staff":false},"post_date":1641947650,"body":"Fuuuck this shit good, need english tl ASAP"},{"id":2258324,"gallery_id":387390,"poster":{"id":1955282,"username":"windsrun","slug":"windsrun","avatar_url":"avatars/1955282.png?_=2f46c5605d2bb4f1","is_superuser":false,"is_staff":false},"post_date":1641947444,"body":"@[MadMan] \n\"It could be argued that the husband had already damaged their relationship beyond repair\". I don’t think that was the case here, he was wrong for pushing her away and not telling her about his problem, but man, the 1st thing she thought of doing was to cheat, not talking to him, not buying toys, she just jumps to having an affair. This shows that she wasn’t trying to fix the problem at hand, instead all she wanted was to fulfill her lust. And remember, she did it 3 times. The 3rd being the worst because the old man helped her understand what she did was wrong and how to fix her relationship with her husband, instead of going home and taking it out, she fucked the old man all night long and blew him in his car before going back. \nShe didn’t care about her husband and how it might affect him if he found out what she had done. Them breaking up was the right thing to do, because if they had stayed together, she would have just found any other reason to cheat on him again."},{"id":2258291,"gallery_id":387390,"poster":{"id":1955282,"username":"windsrun","slug":"windsrun","avatar_url":"avatars/1955282.png?_=2f46c5605d2bb4f1","is_superuser":false,"is_staff":false},"post_date":1641946397,"body":"This was the best ending this manga could have gotten, both of them need to start a new and this time they need to know that they should communicate with their partner. If I could change 1 thing in this manga, it would be the conversation they had at the end.\n\nI would have made it that the husband told her that he has started to see a new person and has told his new girlfriend that he was infertile and she was ok with it, then he would ask his Ex-wife if she was free so that they can talk at a café in order to catch up with each other.\n"},{"id":2258285,"gallery_id":387390,"poster":{"id":4572962,"username":"[MadMan]","slug":"madman","avatar_url":"avatars/4572962.png?_=2dcca2607e7f3269","is_superuser":false,"is_staff":false},"post_date":1641946159,"body":"I take issue with her phone call at the end though, it's a pretty strong indication she is fuck buddies with the old man. I doubt he was just providing emotional support it is a netorare after all. "},{"id":2258276,"gallery_id":387390,"poster":{"id":4572962,"username":"[MadMan]","slug":"madman","avatar_url":"avatars/4572962.png?_=2dcca2607e7f3269","is_superuser":false,"is_staff":false},"post_date":1641945642,"body":"@DIProdigy It could be argued that the husband had already damaged their relationship beyond repair by not believing or trusting in her love for him and instead pushing her away for such a long time he also effectively made it harder for her to communicate with him. Just to be clear i am not siding with the wife but there is a case to be argued from both sides. That is what makes this story so good it's not cut and dry, yes it can and does follow some tropes and can be described as cliche but it's a clear step up in quality from the usual netorare. Well that may be a bit presumptuous on my part as i am not a fan of netorare but at least compared to what i have read this is a step up."},{"id":2258270,"gallery_id":387390,"poster":{"id":2750885,"username":"glad1985","slug":"glad1985","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641945396,"body":"This is probably the best written ntr/cheating story I've seen (in porn). Sex scenes are just a bonus. Ofc it bashes you over the head with \"the message\" and has some over-exagerations to make it work as porn, but the whole plotline is so well made. And I find the ending, showing that some mistakes are simply irreconcilable, even if both parties still care for one another, as a particularly strong point."},{"id":2258238,"gallery_id":387390,"poster":{"id":4365989,"username":"Vindicta_01","slug":"vindicta_01","avatar_url":"avatars/4365989.png?_=111d13ac6981bf31","is_superuser":false,"is_staff":false},"post_date":1641944067,"body":"\"chad 3rd man\" fucking amazing summary man @DrinksandDame, can't wait for the english translations"},{"id":2258124,"gallery_id":387390,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1641938300,"body":"@Psychojing Akiko very clearly still has feelings for Naoki, she just put up a front. The end shows she's still weighed down by the guilt of what she did."},{"id":2257882,"gallery_id":387390,"poster":{"id":3242600,"username":"Spectre26","slug":"spectre26","avatar_url":"avatars/3242600.png?_=42ee79d66390d6a2","is_superuser":false,"is_staff":false},"post_date":1641928120,"body":"Shoutouts to @DrinksandDame you the GOAT bro thanks for the summary! 🔥🔥🔥"},{"id":2257827,"gallery_id":387390,"poster":{"id":3144116,"username":"Killerbee8991","slug":"killerbee8991","avatar_url":"avatars/3144116.png","is_superuser":false,"is_staff":false},"post_date":1641926250,"body":"Idk what everyone else is seeing, but the dude seem fine at the end lol. The wife seem like the one whose hurt about situation the fact she wanted to call him at the end. "},{"id":2257648,"gallery_id":387390,"poster":{"id":2562411,"username":"DIProdigy","slug":"diprodigy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641920745,"body":"lol imagine not making love to your wife for years because of infertility. that should've hurt his pride as a man more than that fact. The ending was very disappointing IMO  it a leads to a typical \"if we had talked it out, we could have come up with a solution. now it's too late\". OF COURSE the wife is ultimately the one to blame and damaged their relationship beyond repair. it shows that they were not mentally ready for each other through their insecurities. (Lol the husband wanted to get back together at the end and she said rejected him, forever cucked.)"},{"id":2257623,"gallery_id":387390,"poster":{"id":3284920,"username":"Arvixz","slug":"arvixz","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641919884,"body":"Kasian MC nya gk mau nafkahin istri. Istrinya juga pengen enak. Dah gk di sentuh 4 th. Ya mending cerei drpada dosa selingkuh"},{"id":2257591,"gallery_id":387390,"poster":{"id":1092173,"username":"Psychojing","slug":"psychojing","avatar_url":"avatars/1092173.png","is_superuser":false,"is_staff":false},"post_date":1641918323,"body":"I bet he still keeps their old marriage photo and looks at it fondly lmao"},{"id":2257586,"gallery_id":387390,"poster":{"id":1326248,"username":"mayuko_","slug":"mayuko_","avatar_url":"avatars/1326248.png?_=d7876b77a69d7f23","is_superuser":false,"is_staff":false},"post_date":1641918173,"body":"I can feel the story it's so sad!\nI'll wait for translation.\n😢"},{"id":2257574,"gallery_id":387390,"poster":{"id":1092173,"username":"Psychojing","slug":"psychojing","avatar_url":"avatars/1092173.png","is_superuser":false,"is_staff":false},"post_date":1641917840,"body":"What a pathetic ending for that man. I can already tell he won't find what he's looking for in the end. His insecurities will plague him for the rest of his life.  That woman had fully moved on will live her best life from here on out. He still wanted to be with someone who cheated on him. He deserves all the unhappiness that has and will befall him from here on out. Pathetic infertile bastard...."},{"id":2257543,"gallery_id":387390,"poster":{"id":3032570,"username":"igotnostuffs","slug":"igotnostuffs","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641916709,"body":"Realistic outcome but the plot is still hentai-logic.  Pretty good though. "},{"id":2257436,"gallery_id":387390,"poster":{"id":4351366,"username":"mranom00","slug":"mranom00","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641913381,"body":"Finally!!!"},{"id":2257353,"gallery_id":387390,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641911359,"body":"@darkmen43 Im assuming you've read my summary along with the previous chapters but somehow, I just can't quite understand how you ended up with that as your impression of how the story was. [1] She didn't leave him cuz she found out he was infertile. She asked for a divorce because of how messed up their situation ended up in due their lack of honesty to each other  (He left her hanging for years and she ended up hurting him cuz of it). [2] She's paying him cash cuz the law works like that (Idk how divorce law works in Japan exactly, but I did a quick search and found that there is actually something like that). They are already divorced. Anyway, I hope you don't misunderstand my words here. Im not defending anyone who cheats, Im just simply correcting what you seemed to be misunderstanding from the story. I suggest for you to read my summary again."},{"id":2257318,"gallery_id":387390,"poster":{"id":1752267,"username":"hurer","slug":"hurer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641909883,"body":"Was a good read. I need a heavy dose of wholesome vanilla with a good story arc after this. Just to balance things out."},{"id":2257292,"gallery_id":387390,"poster":{"id":2778203,"username":"darkmen43","slug":"darkmen43","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641908661,"body":"If the person on the phone with her is the fat piece of shit, thats so evil, after finding out her husband is infertile, she left him straight up, she doesn't give a fuck, she even pays him money to get divorced, what an evil bitch."},{"id":2257287,"gallery_id":387390,"poster":{"id":4768025,"username":"coldroito","slug":"coldroito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641908611,"body":"this has a nice, mature ending, but I was still hoping for an impregnation ntr"},{"id":2257177,"gallery_id":387390,"poster":{"id":2260626,"username":"male tears","slug":"male-tears","avatar_url":"avatars/2260626.png","is_superuser":false,"is_staff":false},"post_date":1641903396,"body":"you know, i don't hate the story. I'm just so, so sick of it being a fat old creep, or some flashy blonde dude. Just make it another man, it's not difficult"},{"id":2257122,"gallery_id":387390,"poster":{"id":4863102,"username":"is13cmenough?","slug":"is13cmenough","avatar_url":"avatars/4863102.png?_=49c3cc458ffad667","is_superuser":false,"is_staff":false},"post_date":1641900939,"body":"what a ride, i loved this serie from the beginning to the end, why is it so hard to find a netorare like this? with a different ending from the usual but unique and impressive at same time, story 10/10, art 9/10, cant wait for the translation."},{"id":2257094,"gallery_id":387390,"poster":{"id":4132014,"username":"conqjw7","slug":"conqjw7","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641899595,"body":"Really appreciate @DrinksandDame for the summary.\nWow what a read, fitting ending as she probably found someone(on the phone) and cant seem to forget the infertile ex. Tbh the reason seems off but yeah talk to people guys... even some stranger on the internet. Them both get a reset somewhere else as two better individuals(i hope lol). Once again, cant think of a better ending and we'll meet again on a english tl.\nP/s: please oohira sensei dont make depressing stuff again pls i wanna jerk off"},{"id":2257042,"gallery_id":387390,"poster":{"id":4426245,"username":"smileylongcat","slug":"smileylongcat","avatar_url":"avatars/4426245.png?_=20330ab7effb4683","is_superuser":false,"is_staff":false},"post_date":1641897838,"body":"came for the dilf tag, but found something sad :')) Thank you author for making such doujin with gorgeous art and 'lifelike' story & thank you for the summaries ^^"},{"id":2257008,"gallery_id":387390,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1641896309,"body":"well reading the summary at the bottom honesty is key in a relationship both werent honest with one another. but theres no excuse for cheating . he gets money and she gets to have sex with whoever she wants if its the man again. win win."},{"id":2257000,"gallery_id":387390,"poster":{"id":4958890,"username":"killblack","slug":"killblack","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641896057,"body":"If in reality i will kill that man and another partner of that bitch. And give that bitch a punishment like doujin inozuma wife. "},{"id":2256998,"gallery_id":387390,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1641895924,"body":"also I wish the author would work on stand by me more with the couple or make another series but its more wholesome than is. I cant take anymore depressing series lol."},{"id":2256991,"gallery_id":387390,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1641895670,"body":"what an ending. a different end to NTR. i hope they both find what they are looking for."},{"id":2256988,"gallery_id":387390,"poster":{"id":2181037,"username":"otomono","slug":"otomono","avatar_url":"avatars/2181037.png","is_superuser":false,"is_staff":false},"post_date":1641895532,"body":"it's an open end if the summary is accurate.The girl still hinges on revenge and revolves around the euphoria surrounding it.\nMeanwhile the man is left high and dry and needs time to vent and deal with  his desire for her.\n\n"},{"id":2256976,"gallery_id":387390,"poster":{"id":4934109,"username":"Stckstck333","slug":"stckstck333","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641895093,"body":"Thanks for the summaries, I'm sort of glad the story had a peaceful not ntrish end, just wish it wasnt so sad. This author sometimes does alternate timelines so I wonder if we'll see anymore of these characters. We sure she deleted the contact? She did put her finger on the button then looked away and cried (Im glad shes sad at least). Either way her husband (ex) has her her info (especially since they parted amicably) so if he wants to talk they probably still can. I do hope shes not the old mans side piece now cause it would be disappointing for her to be able to drown her guilt with lust, thankfully theres nothing to directly imply that. Part of me wants to see the husband win and get her back, and part wants him to find someone better and for her to regret losing him even more. Always weird when an ntr girl thinks \"Im guilty so youre better off without me\" - if you still love the person your harmed and you regret your actions then let that person have the option to choose your love"},{"id":2256909,"gallery_id":387390,"poster":{"id":2213023,"username":"rogukan","slug":"rogukan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641892306,"body":"@DrinksandDame thanks for the summary."},{"id":2256897,"gallery_id":387390,"poster":{"id":1492547,"username":"pican3","slug":"pican3","avatar_url":"avatars/1492547.png?_=7663fd7e250088e9","is_superuser":false,"is_staff":false},"post_date":1641891754,"body":"@DrinksandDame thanks for the summary, Just looking at the images I knew that they had separated, but still I wanted to know the whole story and when I finished reading I was sad because the lack of communication led to that, sad because if they had spoken before they could have solved the problems but when they decided to talk it was too late :("},{"id":2256863,"gallery_id":387390,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641890245,"body":"Translation asap plz "},{"id":2256853,"gallery_id":387390,"poster":{"id":996591,"username":"heavenwing","slug":"heavenwing","avatar_url":"avatars/996591.png?_=4421b80dffe50180","is_superuser":false,"is_staff":false},"post_date":1641889770,"body":"Nice part 3"},{"id":2256836,"gallery_id":387390,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1641889084,"body":"But seriously this is probably one of the most realistic ntr I have read. Fail communication which lead to adultery even though it's clear that they love each other. If only this fmc choose toys instead of cheating this would be a good story. There's a short series like this called \"Secretly I've been suffering about being sexless\" she's about to cheat but instead of commiting adultery they communicate but yeah irl I'm fully fucking aware that people would cheat instead"},{"id":2256816,"gallery_id":387390,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1641888301,"body":"@Juddeau yes that's why communication is a must but from what u said \"If your partner does not give you sex (and that lowers your self-esteem), you are looking for someone who does\" it's a fact indeed but that only proves that relationship doesn't have communication and him/her fucking somebody won't change the fact that is whoring. And u also said it's not ntr but cheating when she's literally driven away by lust to get fuck by another man that alone is the meaning of ntr already though I wouldn't call this a bad ntr since they had a closure and did not hurt each other more"},{"id":2256795,"gallery_id":387390,"poster":{"id":4909155,"username":"Miss Take","slug":"miss-take","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1641887645,"body":"Very good. Can't stop fapping to the ending when they separate."},{"id":2256790,"gallery_id":387390,"poster":{"id":3562108,"username":"Juddeau","slug":"juddeau","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641887413,"body":"@badpriorities12 Obviously not, no relationship works if there is no communication (and more if it is about sex) and that is what the whole story is about, on the one hand the husband for thinking that he could hide his infertility by taking sex out of the equation and the wife for jumping to conclusions and just thinking about herself.\n\nNow, about her being a whore, well, I couldn't qualify her that way, if not all women (and men) would be whores. If your partner does not give you sex (and that lowers your self-esteem), you are looking for someone who does, it is a fact."},{"id":2256764,"gallery_id":387390,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1641886526,"body":"And seriously that not how relationship even works. Yeah mc dumb for not telling her but fmc choose to be a slut instead of asking him or do the first move instead. Remember Bois relationship is a 2 way highway and never a one way highway. Where in relationship not only 1 side will always do the first move but both"},{"id":2256747,"gallery_id":387390,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1641885958,"body":"Sorry but she's nothing but a straight bitch"},{"id":2256744,"gallery_id":387390,"poster":{"id":3562108,"username":"Juddeau","slug":"juddeau","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641885815,"body":"Well, even though it's not actually NTR per se, it's just cheating."},{"id":2256743,"gallery_id":387390,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1641885798,"body":"Okay, I can understand the sexless stuff because he's infertile, dumb as that sounds, but why did he constantly deny Akiko's desire to find a job? They both were terrible to each other, so divorce was honestly just a matter of time."},{"id":2256740,"gallery_id":387390,"poster":{"id":3562108,"username":"Juddeau","slug":"juddeau","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641885649,"body":"I could not say that it is a \"realistic\" story since the husband's justification seems ridiculous to me (no matter how infertile you are, you are not going to stop having sex with your wife unless you do not like her), however, to be an NTR, the story is well written with a clear and valid message (lack of communication) and the epilogue, although a bit ambiguous, was satisfactory and coherent."},{"id":2256726,"gallery_id":387390,"poster":{"id":2767347,"username":"Savior of Ntr","slug":"savior-of-ntr","avatar_url":"avatars/2767347.png?_=391550ee27fad07e","is_superuser":false,"is_staff":false},"post_date":1641885161,"body":"is there an end in the story or the author  will make a part 4. tbh the husband is pretty dumb. They dont communicate well so sooner or later theyll get divorce. "},{"id":2256710,"gallery_id":387390,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641884699,"body":"@wxyz.zxab i had that hope too but in the last page she delete his contact, that say that she move away so don't think the'll come back, i think she fall for the old bastard but have to wait the translation"},{"id":2256696,"gallery_id":387390,"poster":{"id":2275702,"username":"wxyz.zxab","slug":"wxyz-zxab","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1641883916,"body":"maybe unpopular opinion, but i think they still have a chance to build again their relationship from the start."},{"id":2256677,"gallery_id":387390,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641883320,"body":"I had a little hope that they will make up but it was already too late, he was on fault at start but he never actually cheat on her, but just like womans are she move from him fast a hard and sad lesson he will never forget"},{"id":2256655,"gallery_id":387390,"poster":{"id":1511470,"username":"turbulence","slug":"turbulence","avatar_url":"avatars/1511470.png?_=15de6df5b3331027","is_superuser":false,"is_staff":false},"post_date":1641882724,"body":"Finally, an ending that i longed for. This kind of story always end up bad, most of it. So i'm not gonna surprised when reading summary from @DrinksandDame. From my perspective, this is quite realistic adultery relationship. But hey, now both of them have new life start. \nBest wishes and hope the author always in great health."},{"id":2256645,"gallery_id":387390,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641882343,"body":"@GoogleMeBitch No problem. Oh btw, on that \"MC gladly took the money\" part, it's more like this... Akiko proposed the divorce to him so they both can start from 0 again. This alone doesn't mean they don't have any chance to get back together again so ex-husband was hopeful. Anyway, actually at first he showed that he didn't really want the money and tbh I think that maybe he just agreed with meeting up just so he could see her again. But yeah, in the end he lost her completely. Alternatively, one can interpret this as Akiko still at it with failing to properly communicate her feelings and intentions to him. I know they're divorced now but imo it would've been better if she bluntly told him that she's completely removing him away from her life. Tbh for a divorced couple, they were pretty friendly to each other there lol."},{"id":2256608,"gallery_id":387390,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641880386,"body":"bitch........"},{"id":2256599,"gallery_id":387390,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641880002,"body":"part4.... and need more sex scenes"},{"id":2256502,"gallery_id":387390,"poster":{"id":1635965,"username":"KingCuck","slug":"kingcuck","avatar_url":"avatars/1635965.png","is_superuser":false,"is_staff":false},"post_date":1641876823,"body":"On the end she is paying the last settlement money so they can start a new life after one year. She now live alone and working at new company. Getting more slim and changing her hairstyle. Apparently the reason why the husband doesn't want to have sex with her is because he found out 4 years ago that he is infertile and tried to hide this fact and hope that the wife will give up about having a baby.\n\nIn the end she was deleting his contact information. She had paid him the last of the compensation money from cheating on him so there was no reason for them to meet. he did try to ask her out, but she said she left in the middle of something. \n\nAlso about the old man.He is already married and already got the permission from his wife to ''play'' outside, the reason? His big dick is the reason why his wife allowed it, she cannot handle it alone."},{"id":2256489,"gallery_id":387390,"poster":{"id":1302816,"username":"ok42069","slug":"ok42069","avatar_url":"avatars/1302816.png?_=c0349cf8fa312b94","is_superuser":false,"is_staff":false},"post_date":1641876247,"body":"neato             "},{"id":2256486,"gallery_id":387390,"poster":{"id":4948715,"username":"Kkkreviver","slug":"kkkreviver","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641876199,"body":"On that note anyone got any recommendations to a well written story like this where the ending is actually good cause even tho this is open ended its clear that she most likely is working for the fat nigga and fucking him still"},{"id":2256480,"gallery_id":387390,"poster":{"id":4948715,"username":"Kkkreviver","slug":"kkkreviver","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641876051,"body":"Bruh the author should've just gave the mc some balls he could've easily ran after her and got her back cause she clearly still loves him these authors never commit to a good ntr ending I mean they were separated for a year and she still cries over him they should've tried to get together again."},{"id":2256458,"gallery_id":387390,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1641875360,"body":"She left him for the usual fat ugly with a foot long. The reason the husband stopped having sex with her was because he found out he was infertile and was scared because he knew how badly she wanted kids. They meet one year later at the end, she pays him the consolation money from the fat pig, the husband seems happy and gladly took the cash but she is still heartbroken."},{"id":2256455,"gallery_id":387390,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641875316,"body":"Summary for ya'll who can't wait for the English translation:  https://pastebin.com/viyhgJy0"}]