[{"id":2279508,"gallery_id":387413,"poster":{"id":1738770,"username":"</>","slug":"_","avatar_url":"avatars/1738770.png?_=c4518e1598ce40f4","is_superuser":false,"is_staff":false},"post_date":1642751490,"body":"the plot is good more like an ecchi manga"},{"id":2259391,"gallery_id":387413,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1641985851,"body":"It's not detailed, but seems like he lives with his single mother, and she's also sick. In page 3 she only told him to not forget withdrawing money (probably the social welfare fund) and he told her to not forget taking her medication. In page 8, when he asks why Rin is offering the ring to him, she said there are various reasons, but she can't explain it now (so there's probably another catch to the deal other than unable to return into male body), but what's important is if he will take the deal or not. "},{"id":2259207,"gallery_id":387413,"poster":{"id":2419964,"username":"rumbleduy","slug":"rumbleduy","avatar_url":"avatars/2419964.png?_=cdc06820a599f78d","is_superuser":false,"is_staff":false},"post_date":1641979198,"body":"@minminazusa Thanks for your detailed explaination. 😊"},{"id":2259141,"gallery_id":387413,"poster":{"id":2181731,"username":"enchantist","slug":"enchantist","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641976911,"body":"10/10 interesting ring gender change idea and good MC's gender change fetish expression. I felt jealous this MC. He've same jealous of girl's life and wanna be a girl as I do and take advantage feel both good from girl's body sex pleasure orgasm and make money in the same times also wearing school girl uniform is such a bonus I'd love to be in his shoes. I'd also wanna have 3 more rounds like he did if I were in his shoes."},{"id":2257392,"gallery_id":387413,"poster":{"id":2925422,"username":"Dons","slug":"dons","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1641912424,"body":"VER English uppp, Gender change need English up!!!"},{"id":2257377,"gallery_id":387413,"poster":{"id":3637164,"username":"Esas","slug":"esas","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1641912040,"body":"quite a plot, nice"},{"id":2257114,"gallery_id":387413,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1641900670,"body":"The ring works, and he became a woman. She's about to go with the original plan, going to prostitution to gather money. But the person she found in the hook-up service is surprisingly, the fiance of that teacher who denied him from university. So, a new plan, ruin her life. She seduced the guy, playing the kind of convenient girl guys would like, and they have sex. After that, the recording is leaked, and the teacher quit her job. Aoi also got another chance for the university recommendation. She thought, right now she felt like she can do anything, she can turn her life around, and leave this town. In the post box, she found another ring (Rin also got extra ring, so lets assume anyone who it changed, get one new ring to give the next person). The author's note says he had the plot planned for 3 volumes, so next will be in summer and winter Comiket. Wondering if it will continue with Aoi, or switch to new character."},{"id":2257107,"gallery_id":387413,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1641900216,"body":"@rumbleduy : It starts with Januma Aoi, the protagonist commenting on how life is easy as a woman when seeing TV program interviewing a sexy artist. He thought, if he was born as a woman, he would have whore himself to get money and get out of his home. Back in school, his teacher informed him that his recommendation to university has been cancelled for other student. The teacher argued, because his family live on social welfare, it's best for him to enter vocational school and quickly join the workforce. With his future taken away, he thought of suicide, but Asui Rin, the artist, found him and gave him an offer. 4 years ago, she too was a male, but she got a ring that changed her into a woman, not just physically but also all the history. Aoi had nothing more to lose anyway, and if it didn't work out, he can just continue with his suicide plan. "},{"id":2257105,"gallery_id":387413,"poster":{"id":3881039,"username":"varrl","slug":"varrl","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1641900166,"body":"Up gan .. ."},{"id":2257098,"gallery_id":387413,"poster":{"id":2008678,"username":"ilham1996","slug":"ilham1996","avatar_url":"avatars/2008678.png?_=5b3e91b21e3f0569","is_superuser":false,"is_staff":false},"post_date":1641899864,"body":"englishh upppp"},{"id":2257010,"gallery_id":387413,"poster":{"id":2419964,"username":"rumbleduy","slug":"rumbleduy","avatar_url":"avatars/2419964.png?_=cdc06820a599f78d","is_superuser":false,"is_staff":false},"post_date":1641896520,"body":"What's the plot?"},{"id":2256938,"gallery_id":387413,"poster":{"id":3477066,"username":"t0xic_anxxiety","slug":"t0xic_anxxiety","avatar_url":"avatars/3477066.png?_=53a0562995ab9a1e","is_superuser":false,"is_staff":false},"post_date":1641893259,"body":"noice!!!!!"}]