[{"id":2265489,"gallery_id":387565,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1642214851,"body":"Forgot the detail so I’ll try to read it again later. If I remember correctly, She’s his sister, but they got separated when their parents divorce, until they met again in high school. She found out he’s having sex with Iori, so to shut her up Suzuki hypnotised her. In volume 3 she found out about the hypno app while looking for something as leverage, and also realised what she wants is really just to be spoiled by her brother like back when they’re kids. Thus she suggest he let her hypnotise him. I think, Karen route for fluff, Haruka route for intrigues, Iori for hopefully vanilla romance. "},{"id":2265387,"gallery_id":387565,"poster":{"id":1933886,"username":"yogasan","slug":"yogasan","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642209713,"body":"@minminazusa,what is the plot for haruka?the tag is incest,is she Suzuki sibling?and in chapter 3 she counter hypnosis him?"},{"id":2259682,"gallery_id":387565,"poster":{"id":3637164,"username":"Esas","slug":"esas","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1641997705,"body":"thicc!      "},{"id":2258961,"gallery_id":387565,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1641970866,"body":"two different series going on at once that intertwine/ wtf &gt;.&lt;"},{"id":2258876,"gallery_id":387565,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1641967626,"body":"When he asked her again what kind of men she likes, a question she avoided before, she answered her type are men who lets her spoil them. Suzuki's problem persist though; he can't believe a girl would love him without being hypnotized, so whatever they say are just fake emotion. Karen is not just nice to him, but also everyone else, and she wants to be a counselor, so it makes sense for her to be caring, and he's not special. But in the end, she cheered for him, so at least she accept his existence (even if it's not love). | Yeah, Karen is really a good girl. She could have saved him, but he can't realize her feeling yet. By the way, volume 6 will be thick, and feature Iori and Karen in a threesome :D"},{"id":2258864,"gallery_id":387565,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1641967133,"body":"Ever since that day, Karen and Suzuki's relationship are friendly as always. Meanwhile, Iori is avoiding him (it's actually because she gets wet when seeing him). Few days ago, Karen offered a love consultation. She said, Iori might not actually hate Suzuki, she only apologize because she's surprised by the love confession. Karen then asks what he likes from Iori (and secretly comparing herself). After the accident, embarrassed Karen apologize and wants to leave, and that awaken Suzuki's trauma about Iori's rejection. He told hypnotized Karen, another part he likes from Iori is her erotic side, which Karen replied she won't lose. Karen also assured him, she won't hate him just because he gets hard after grabbing her boobs. "}]