[{"id":2327289,"gallery_id":387874,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1644632791,"body":"Seriously, Shoma is better off with this pig-tailed girl. Ah, author won't make that happen, sadge."},{"id":2312672,"gallery_id":387874,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1644054475,"body":"@freak960 They broke up back in chapter 16. Shoma's free and clear to date whoever he wants."},{"id":2303012,"gallery_id":387874,"poster":{"id":3992729,"username":"freak960","slug":"freak960","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1643658492,"body":"After this chapter it's I can almost guarantee that Shoma will cheat on Yuki with the pigtail girl, Yuki will find out and it will allow her to break up with him and finally be with coach. In an ntr scenario like this it's typical to see both parties cheat so that both can separate and be with who they cheated with, without either party being hated by readers since both are in the wrong."},{"id":2267244,"gallery_id":387874,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1642292894,"body":"@GoogleMeBitch Could be completely wrong, but I don't think Yuki will ever completely accept Coach as she(correctly) implies that Coach doesn't actually love her, like Shoma did, he's just obsessed with her. I'm just wondering when the twist that had been mentioned comes in because unless something really contrived happens to extend things, the story feels mostly done."},{"id":2267120,"gallery_id":387874,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1642286439,"body":"Up until now shoma has just been our standard pussy bf side character and his thoughts and actions are always contradictory so i don't expect anything from him. The fist clench could be further showing his resolve to finally move on or he's finally pissed and plans to do something about it. He has looked angry before only for it to be completely ignored in the next chapter so i doubt it's him to deliver a twist. @zombieadd, Stockholm syndrome sounds about right the coach has been manipulating/grooming yuki from the start, she fell ages ago but now all of a sudden she's trying to resist his mind break tactics. The cuckolding is a possibility but coach seems to want her all to himself. I think yuki will see shoma moving on and run back to coach and except him, but that's standard so maybe she finally snaps and destroys coach and herself in the process. That will break shoma too because he will blame himself again."},{"id":2266620,"gallery_id":387874,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1642264431,"body":"Well, after reading this summary, Idk man. Kinda feel like it's pretty much over or just freaks that can't move on (as it's usually a trope in hentai where individuals find it impossible to move on). Now the setup of having Yuki being depressed unless she's with Shoma to make her happy, to supply her the love WHILE having Coach on the side to satiate her sexual needs (cuckolding) seems like a possibility of the direction the story would take."},{"id":2265883,"gallery_id":387874,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1642231300,"body":"As always, all credit goes to defan752 from EH for the summary."},{"id":2265876,"gallery_id":387874,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1642231055,"body":"5/ Later, Shoma hears a group of guys trying to pick up one of the waitresses. It's Niimi, his junior. Shoma steps in and drives them off by offering to let them inside if they want to order. Annoyed, the dudes leave, and Shoma bids them goodbye, while silently calling them nasty pedos. He apologizes to Niimi for not noticing earlier, but she replies that she's fine, which reminds him of similar wording that Yuki said to him many chapters ago. Himeko jumps in and praises Shoma, but sends him off to help Shideike. Niimi calls after him and thanks him for protecting her. Shoma replies that he barely said anything back to the guys, but Niimi insists that he helped her. Later, as they work, they meet eyes and Niimi smiles at him. Shoma asks himself whether he really protected her. He thinks back to Yuki assuring him that she'll be fine on her own. Then he finally accepts that he was able to protect someone."},{"id":2265866,"gallery_id":387874,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1642230872,"body":"4/ At Shoma's house, his mom tells him he's been down in the dumps ever since camp, probably because he's lonely from Yuki being busy lately. Shoma hasn't told anyone they've broken up. He's grousing and unhappy, even unwilling to go to college, turning past events over in his mind and racking his brain about how he could have better protected or helped Yuki. Then, he gets a text from Shideike inviting him to the beach tomorrow. At the beach, it turns out that Shideike needed help with his part time restaurant job, instead of actually going on the beach. Shideike says he also wanted Shoma to get some good views of hot bodies at the beach because he knows Shoma's frustrated from not seeing Yuki as she's busy. He teasingly promises not to tell Yuki, but Shoma secretly notes that Shideike is the only one whom he doesn't want to tell about their breakup. "},{"id":2265864,"gallery_id":387874,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1642230689,"body":"3/ Coach strips Yuki naked and replies that there's no way Shoma could handle Yuki, and that she's already exceeded Shoma's ability. He penetrates her again. He says he will take responsibility for being the one who turned her into what she is now, and loves her for what she is. Yuki responds that she doesn't need his love - she's fine with just feeling good. Coach hits her deep (\"Like this?\"), and accuses her of loving this position. He points out that she even squirted. Yuki glares at him with reproach, implying (but not saying) that she would never love someone like him, but he only praises how cute she is and kisses and drills her harder. After they climax, Yuki swears to never forgive him, but Coach points out that she didn't say she dislikes him. They wake up next morning, Yuki realizing that they ended up sleeping together again. He hugs her, asking if she's still uncomfortable, and continue fucking. Yuki gets depressed at how horrible of a person she really is."},{"id":2265858,"gallery_id":387874,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1642230427,"body":"2/ She points out that Coach wasn't there for her when she was alone, but Shoma was. Shoma was the one who did things he didn't want to do to save her and watched over her the whole time even though she didn't want to be. Weeping, she tells Coach how Shoma always believed in her, said that she could go back to normal, and yet she betrayed and hurt him many times despite that. She admits that she still loves Shoma, but they can't be together anymore because he'll become like her. She blames Coach for turning her into what she is now, and demands that he at least realize his fault in this first. "},{"id":2265853,"gallery_id":387874,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1642230228,"body":"Summary: Unsure of what she just heard, Yuki asks if he means \"love\" in the romantic sense. Coach repeats what he said, then two more times. He says that he tried to stop their relationship many times but Yuki kept coming back to him. She doesn't deny it. In her head, she tells herself that she needs to keep being reminded how horrible of a person she is and how she doesn't deserve to love anyone. She's very confused and scared about her feelings. Coach says he'll wait until she isn't scared anymore and there's nothing to be confused about because he's serious about her. He professes his love again, but she is still uncomfortable and confused. Coach pulls out and climaxes. He calls her name, but Yuki is annoyed. She chastises Coach for his hypocrisy, stating that she doesn't believe in \"love\" from someone who breaks apart other's relationships."},{"id":2265362,"gallery_id":387874,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642208162,"body":"Yuki has magically a bit of feelings for Shoma ... Yeah, yeah right ... End your shit already."},{"id":2265218,"gallery_id":387874,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1642201804,"body":"Bah, this Yuki is well beyond redemption. Shoma doesn't matter anymore, he ain't MC, he's a hindrance to the netorare story. Man, we all know where this is going, like seriously, even with the promised 'twist ending', meh this is giving me some kind of Stockholm syndrome vibes."},{"id":2264349,"gallery_id":387874,"poster":{"id":1799747,"username":"YhiGhielgi","slug":"yhighielgi","avatar_url":"avatars/1799747.png","is_superuser":false,"is_staff":false},"post_date":1642168599,"body":"This is still going? "},{"id":2264222,"gallery_id":387874,"poster":{"id":658993,"username":"mr.steaksauce","slug":"mr-steaksauce","avatar_url":"avatars/658993.png?_=49ffb9a2c4d43f57","is_superuser":false,"is_staff":false},"post_date":1642162968,"body":"I wonder what is happening "}]