[{"id":2303205,"gallery_id":388992,"poster":{"id":4656518,"username":"uelveelze","slug":"uelveelze","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1643667130,"body":"easy explanation at the end is that she does it raw with her boyfriend so if she does get pregnant she can claim it was her bf's and hide the fact she cheated"},{"id":2288850,"gallery_id":388992,"poster":{"id":2849135,"username":"donutlie","slug":"donutlie","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1643130129,"body":"The gigantic fukin dick made me laugh and i lost my boner lmao"},{"id":2287278,"gallery_id":388992,"poster":{"id":193594,"username":"damonsykes","slug":"damonsykes","avatar_url":"avatars/193594.png","is_superuser":false,"is_staff":false},"post_date":1643074967,"body":"ntr is for trash idiots who will die alone and unloved, with their girlfriends stolen from them by better men"},{"id":2284755,"gallery_id":388992,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1642976321,"body":"@Blankroom oh damn that's horrible. Lmao, I guess the truth just dawned on her when she sees him all sweaty to meet her and ridden by guilt. Seriously, it's the usual \"trust a stranger rather than your partner\""},{"id":2283981,"gallery_id":388992,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1642946249,"body":"So yes she probably forgot about the promise since the other guy convinced him he's just doing whatever he wants (painting) and is selfish or whatever and she starts to believes it also the fact she's probably going to ruin both their chances at going by getting pregnant. Though boy is only trying his best to get to tokyo to be with her."},{"id":2283958,"gallery_id":388992,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1642945325,"body":"Two promised to go to uni in tokyo together him wanting to go through is painting and her studies. He's really busy cus he's trying his best to be with her (to fulfill promise) and she feels lonely because of it. Other guy swoops in and fucks her during a study session that her boyfriend cancelled on cus of an assignment (he being praised talks about the promise). She gets creampied and he said if she gets pregnant he'll take responsibility and that he's president of a comany or has connections so he won't be jobless. In the end though seems she likes her boyfriend more and is going to babytrap. she invites him to her house saying her parents won't be home til late it's her safe day and wants to do it raw. So either she's wants to hide the fact she cheated or wants to get pregnant with her bf cus they couldn't scrape out all of the other guys cum so I guess she's hoping she'd get pregnant with his kid instead either way she's fucked and not going to tokyo.Reminds me of fork in the road"},{"id":2283941,"gallery_id":388992,"poster":{"id":1152712,"username":"CumMasterMaggie","slug":"cummastermaggie","avatar_url":"avatars/1152712.png?_=81e1eaf54ff7fe35","is_superuser":false,"is_staff":false},"post_date":1642944566,"body":"That was a refreshing NTR I've just read, wow, truly magnificent NTR is truly a work of art even tho I don't understand the language it still speaks for itself, a masterpiece indeed and I can already hear/see the vanilla fags bitch about how bad it was cuz they gei and stoopid. 100000/10 best art and best plot (like the part where she hugged her bf while dripping cum down her sexy pussy) die vanilla fags"},{"id":2283845,"gallery_id":388992,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1642939968,"body":"@YhiGhielgi yes usual but was wondering what makes her do it? Caught from kissing? And then from the look of it why is the guy in her room or why is she on the guy room"},{"id":2283808,"gallery_id":388992,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642938106,"body":"What a slutty bitch, hugging up on her bf after getting creampied by this douche of a friend"},{"id":2283802,"gallery_id":388992,"poster":{"id":1799747,"username":"YhiGhielgi","slug":"yhighielgi","avatar_url":"avatars/1799747.png","is_superuser":false,"is_staff":false},"post_date":1642937928,"body":"@badpriorities12 think the same as usual? if you don't want me to talk you know what to do?"},{"id":2283749,"gallery_id":388992,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1642934896,"body":"So what's the story here?"}]