[{"id":2285499,"gallery_id":389092,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1643007876,"body":"Story (cont.): While Yui is doing her club activities, MC is having sex w/ FMC who's guiding him thru the sex: \"I stole your virginity, how do my insides feel?\" \"They feel really warm & soft...\" He cums inside right away just from moving a little. \"He's so cute... <3\" She won't get pregnant while breastfeeding, so it's okay to cum inside her. Her hubbie hasn't been home for a long time so she hasn't had sex in a while. Commence back sex. She's leaking milk again, MC drinks it while doing front sex. MC pumps her full of his cum. \"Thank you Ryou...\" Yui comes back late but MC already left bc apparently he had some things to do at home (actually he was sucked dry & exhausted from the sex). The cum is leaking out of FMC's panties, she sends a pick of herself showing her leaking breast milk & vagina leaking cum out to MC. She texts \"Next time let's do it on the bed <3.\""},{"id":2285492,"gallery_id":389092,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1643007714,"body":"Summary (cont.): FMC asks MC if he can suck the milk out of her breasts. Commence breast sucking foreplay. He drinks the milk out of each boob, also massages them. Gets hard, FMC starts jacking him off. Gets him off as he's sucking on her boobs. A lot of cum on her hands, she starts \"cleaning\" it up. FMC asks how far MC has progressed w/ Yui in their relationship. They're actually not together, FMC is surprised since they were masturbating to each other, MC asks how does she know, oops she got found out. Turns out MC asked Yui about his newfound pubescent awakening on his dick, get some advice, teach him, etc. MC probably likes Yui but she's always busy + age diff. FMC then decides to teach MC more, that girls like guys who are good at sex, so that he can confess to Yui. Meanwhile Yui is getting off at MC's dick pic in the locker room."},{"id":2285490,"gallery_id":389092,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1643007587,"body":"Summary: Girl Yui-chan brings home her friend the MC (Ryo-kun) whom she probably likes (Yui is a virgin who is interested in sex). They plan to study, but Yui tells FMC (Yui's mama, also mother to a recent baby, hubbie is away on an international business trip) to knock when she comes up. Turns out they do some experimentation prior to studying. FMC brings up snacks but catches them thru a slip in the door. FMC is amazed at the amount of cum MC puts out, gets wet over it. One day she breastfeeds baby but baby falls asleep, now her breast milk is leaking thru her tanktop. MC visits the house, Yui is gonna be late bc of club activities, sees FMC's breast milk tanktop, the leaking hurts her a little since baby didn't suck it out. Asks innocently if he can help her in any way he can. FMC decides to tease MC a little."},{"id":2285473,"gallery_id":389092,"poster":{"id":2277857,"username":"Fruit_Punch","slug":"fruit_punch","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1643006934,"body":"China translations these days are really fast."},{"id":2285109,"gallery_id":389092,"poster":{"id":4670426,"username":"HaveYou","slug":"haveyou","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1642993042,"body":"da real MILF of course behhhh love so much like jumi"}]