[{"id":2294820,"gallery_id":389431,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1643349413,"body":"Ah, more about the first story. When his friends found them, he is telling her, she shouldn't have had sex with him if she's not serious. Mitsu believed his feeling is just because of her eyes. He confessed about loving her, and asks her back about how she actually feels about him, a question she can't answer because of how many times she was hated by people around her. Well, she's already in love with him though. | By the way, this artist's short haired girls looks like Aiya's girls don't they? I think their expression when having sex are also similar."},{"id":2294799,"gallery_id":389431,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1643348576,"body":"Chapter 7 is after story. Both are dating in secret, and his friends are keeping quiet about who Touya's girlfriend is. Especially because there are also rumours of when he blurted about dating her. Touya also wants to go out together like couples do, so he got Mitsu to go on a date together, outside, without caring if they got found out. | Second story about childhood friend. The guy been keeping eye on the girl, but he choose different university to avoid rumours of him being stalker and though she's also annoyed of him. One day she came to stay, saying her her apartment caught fire. Well, they have sex and he also realize his own feeling. | Third story about the protagonist and his senior/friend who often enjoy watching AV in his room. | Sixth story, also about a girl who got trouble from being liked by boys. | Love this kind of set up between gloomy girl and cheerful boy, it's usually reversed in romcom. Also despite vanilla, they both got lost in desiring each other."},{"id":2294759,"gallery_id":389431,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1643347329,"body":"No trans yet? Ch.1, 2, 7 are same series. Mitsu, the girl, got something like Diarmuid's mole from Fate Zero. Although the story doesn't emphasize on magical aspect, men who saw her eyes fell in love to her. This had caused her trouble, like losing her friends because their boyfriend fell in love to her, or even getting assaulted by random men on street. She live with her grandma because her mother wants to marry again and is worried her new husband will fall for her own daughter. So, Mitsu starts avoiding people. Touya, had interest and starts approaching her. He's actually rather popular, but he said he won't date any other girl if Mitsu doesn't like it. After that confession they start having sex often, so much that Touya even thought he's sick. Hearing he said he likes her eyes, Mitsu finally told her story and push him away, but he persisted, and won't give up when Mitsu doesn't actually hates him. "},{"id":2293767,"gallery_id":389431,"poster":{"id":4998132,"username":"Wencel Aries","slug":"wencel-aries","avatar_url":"avatars/4998132.png?_=9a72439a0238b618","is_superuser":false,"is_staff":false},"post_date":1643305862,"body":"Sadly can't understand but it's Illustration is Great I enjoyed it"},{"id":2289868,"gallery_id":389431,"poster":{"id":3637164,"username":"Esas","slug":"esas","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1643169053,"body":"damn, very hot tankoubon. i love the expressions!"},{"id":2289706,"gallery_id":389431,"poster":{"id":954081,"username":"Joojo","slug":"joojo","avatar_url":"avatars/954081.png","is_superuser":false,"is_staff":false},"post_date":1643161725,"body":"Hmm... ( ͡° ͜ʖ ͡°)"}]