[{"id":2305719,"gallery_id":390226,"poster":{"id":1462222,"username":"Httastt","slug":"httastt","avatar_url":"avatars/1462222.png","is_superuser":false,"is_staff":false},"post_date":1643769579,"body":"@Guru 6 lol that'd be wired. It was a long time ago and he's got a wife and kids now so I think he's past it. also bazzax I did hook up with a few guys in the past but I wouldn't say I'm gay maybe bi at most I really don't have any interest in having a relationship with a man other then being friends... I do kinda like dicks though but that's it."},{"id":2304830,"gallery_id":390226,"poster":{"id":1013362,"username":"‏‏‎  ‏‏‎  ‏‏‎  ‏‏‎  ‏‏‎  ‏‏‎","slug":"_","avatar_url":"avatars/1013362.png?_=15e9d449f61a6015","is_superuser":false,"is_staff":false},"post_date":1643731981,"body":"When I was at a camp with my mom, I met a single mom with two kids, a girl and boy, the sis was 2 years older, and I was a year older than her. They had a sort of incestous game, which the sis had taught him. She lay down on the bunker bed with her legs spread and the brother pulled his pants down and mounted on her from the top. They made me do it too but was too shy and backed away after a sec. I stayed over for that night and she came over to the other side where I was sleeping and french kissed me like how MJ french kissed spiderman. We switched doing this throughout the night, so I went over and kissed her and she went over and kissed me. It was the best experience ever, that I remember so vividly like it was yesterday."},{"id":2304677,"gallery_id":390226,"poster":{"id":4503825,"username":"✨ɐʇıʞıɥɔ ıǝᴚ✨","slug":"atikiyo-i@r","avatar_url":"avatars/4503825.png?_=93415def2a4fe081","is_superuser":false,"is_staff":false},"post_date":1643726285,"body":"@Httastt like lolicon said this kind of stuff is pretty common for little kids, my little brother said various times to me that one of his classmates touch his dick and that he touch his dick too, I didn't say anything but he eventually told my mother and she lectured him that's wrong and he should never let anyone touch his dick but my brother has never been obedient so idk if he did it again"},{"id":2304472,"gallery_id":390226,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1643716757,"body":"@Httastt i think that kinda stuff is pretty common for little kids who don't understand what they're doing. "},{"id":2304407,"gallery_id":390226,"poster":{"id":1551422,"username":"Guru 6","slug":"guru-6","avatar_url":"avatars/1551422.png","is_superuser":false,"is_staff":false},"post_date":1643713677,"body":"@httastt he's probably as embarrassed as you are right now. You two will meet in this doujin chat 😂"},{"id":2304227,"gallery_id":390226,"poster":{"id":643816,"username":"bazzax","slug":"bazzax","avatar_url":"avatars/643816.png?_=dd96af137e4cf998","is_superuser":false,"is_staff":false},"post_date":1643705481,"body":"damn Gay cousin kid.'' Real kid second No cum,'' old Teens up sec cum., time again fap fucking, bad red penis sex addicts day abuse mad, Sick!"},{"id":2304025,"gallery_id":390226,"poster":{"id":1462222,"username":"Httastt","slug":"httastt","avatar_url":"avatars/1462222.png","is_superuser":false,"is_staff":false},"post_date":1643699823,"body":"Me and my cousin did stuff like this when we where young. we didn't really know what we where doing and we didn't cum or anything just played with each others dicks and sucked each other off.  I do have good memoirs of it, but I also regret it cuz we don't really talk anymore. Last time we talked was like 10 years ago and it was award. he was my beat friend in my younger years and now I can't even bring myself to talk to him.  "},{"id":2303939,"gallery_id":390226,"poster":{"id":4952824,"username":"shotaconsumer","slug":"shotaconsumer","avatar_url":"avatars/4952824.png?_=ab1fa239f1f2f772","is_superuser":false,"is_staff":false},"post_date":1643697065,"body":"omg thank you to whoever translated this U're a godsend 🙏"},{"id":2303597,"gallery_id":390226,"poster":{"id":4503825,"username":"✨ɐʇıʞıɥɔ ıǝᴚ✨","slug":"atikiyo-i@r","avatar_url":"avatars/4503825.png?_=93415def2a4fe081","is_superuser":false,"is_staff":false},"post_date":1643684122,"body":"OMG, this is one of my fav shinachiku's works Im so happy to see it translated; the shotas are so cute and the school uniforms just make it better ♡"}]