[{"id":2376084,"gallery_id":391491,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646522144,"body":"Dude after reading minminazusa synopsis, if this stupid girl winds up preggo with the owners kid, she has no hope at all. Sucks for the teacher he just wasted 5 years of his life and possibly becoming a fucking atm"},{"id":2327264,"gallery_id":391491,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1644632351,"body":"...ah, wanting to read but not. Hirari's previous stories are quite painful for me (the two manga artist wife stories). It feels like there are more content on the girl's feeling and how their not perfect but good enough life became ruined, rather than how the rapist shows being superior male to the husband. Want to see continuation of #340542 though. Starts from a rape, but at the end, the girl who seems to love the heroine is pissed off because her girl found a man."},{"id":2327257,"gallery_id":391491,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1644632208,"body":"Sakurako is, to bluntly say, stupid. Even in the lowest ranked school, she still scored last. She has friends, but they love her like cute pet. Meanwhile, her parents divorced and she's not exactly loved. After graduation, her teacher married her, not just because of worrying of her future, but he also likes her. After five years, she starts to get used to housework, except cooking. She also can't get any job (keep getting fired, although she did have talent in doing nail art and sometime works in her friend's salon). So, her husband starts worrying of their future, if they have child, can she raise them properly? One morning, he finally speaks it straight, her cooking is terrible. The new owner, heard them, and offered to teach her how to cook. She managed to make good food, but is also worried about hiding how she had sex, and if her husband will abandon her if he knew."},{"id":2324882,"gallery_id":391491,"poster":{"id":1299331,"username":"alonerone","slug":"alonerone","avatar_url":"avatars/1299331.png","is_superuser":false,"is_staff":false},"post_date":1644539814,"body":"Fcking bitch"},{"id":2324805,"gallery_id":391491,"poster":{"id":1911399,"username":"C. I. A","slug":"c-i-a","avatar_url":"avatars/1911399.png?_=4f6d8df6987dcb7b","is_superuser":false,"is_staff":false},"post_date":1644536623,"body":"Bruhh I though this vanilla at first, but I wrong"},{"id":2324249,"gallery_id":391491,"poster":{"id":4985798,"username":"Miki Satome","slug":"miki-satome","avatar_url":"avatars/4985798.png?_=d634bfadcfc0bf02","is_superuser":false,"is_staff":false},"post_date":1644512796,"body":"I don't wish to be horny, i just want to be happy"}]