[{"id":2328924,"gallery_id":391559,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1644693170,"body":"@arkenel By this I do not mean that infidelity does not exist in Japan, where the wife can cheat on her husband of her own free will. But the issue I am talking about is sexual slavery. The authorities will not be informed, but this does not indicate that she is living paradise in that life."},{"id":2328920,"gallery_id":391559,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1644692976,"body":"@arkenfel By the term <whore> I meant that the woman would feel pleasure and accept her new life being <happy> (as we often see in the NTR). There is blackmail, rape as well, sexual slavery as well, but a person who has been forced never finds happiness as the NTR shows."},{"id":2328362,"gallery_id":391559,"poster":{"id":3994246,"username":"arkenfel","slug":"arkenfel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644666939,"body":"@haitoku you are right i came to know this as well, Japan has  a cheating culture, the men openly cheat. In marriage but NTR is a fantasy for women because in reality, even if they or the husband cheat. They do not divorce, because of shame divorce is rare in Japan. I still hate this genre with a passion, the fact the woman pretend to love her husband while fuck other guys that shit rubs me the wrong way. "},{"id":2327188,"gallery_id":391559,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1644630520,"body":"You know I'm read some poll and find out women (in japan) most reader NTR genre.(read long time but forgot bookmark this poll) That why most story end like FMC get happy life. Like story married couple even her husband find out that she had sex with another guy he did not sue her and let's her walk out clean. Since target sell is women."},{"id":2326848,"gallery_id":391559,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644621429,"body":"bitch......"},{"id":2326756,"gallery_id":391559,"poster":{"id":3517389,"username":"SirRobin","slug":"sirrobin","avatar_url":"avatars/3517389.png?_=7c504e140545b9c5","is_superuser":false,"is_staff":false},"post_date":1644617423,"body":"Want cheating/netorare with revenge/justice? Try these. - https://nhentai.net/g/76017/ - https://nhentai.net/g/103903/ - https://nhentai.net/g/181681/ - https://nhentai.net/g/192711/ - https://nhentai.net/g/254437/ - https://nhentai.net/g/254443/ - https://nhentai.net/g/284898/ - https://nhentai.net/g/287888/ - https://nhentai.net/g/325479/ - An amazing list with links is up to part 7! - https://www.reddit.com/r/netorare/comments/rtxkug/compilation_of_revengemc_moves_onkarmajustice"},{"id":2326617,"gallery_id":391559,"poster":{"id":3994246,"username":"arkenfel","slug":"arkenfel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644610975,"body":"@SchrodingerZ That formula is boring it was fun for a while but, I can no longer get off on these stories. I am sick of the passive females they need to make then cry and scream, struggle that would get my blood pumping. it sounds fucked up but we all are ere for fucked up shit. it is not like i will do this shit in real life, it is just a kink. Seriously it should be like you are in a life and death struggle to get that non consensual  pussy. Not a fucking stroll in the park.     "},{"id":2326599,"gallery_id":391559,"poster":{"id":3994246,"username":"arkenfel","slug":"arkenfel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644610072,"body":"@SchrodingerZ my friend you are wrong let me explain, if the rapist blackmails her she will be a whore. You thought the whole blackmail thing was made up no it is very real and effective. A Japanese woman would rather die than let the blackmail information get out, they really do fear shame that much. Same shit in south Korea this school girl was raped for over by 30 different males students before anyone found out, they only got a slap on the wrists. You forget japan has a bully culture in the work place, so the the manger of a company will fuck your wife, make her into a whore and she cannot say anything. Fear of losing her job, and also fear of shame, some of these stories are just documentaries of japan      "},{"id":2326538,"gallery_id":391559,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1644607656,"body":"Well, we already know the formula of some NTR. Violation ---> Transform into a whore."},{"id":2326492,"gallery_id":391559,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1644606384,"body":"@arkenfel Partly realistic, my friend, as Japanese women will not become the whores of their rapists. There is a difference from Japanese female passivity and their re-creation of it in hentai, as all negative <human> post-rape symptoms are omitted from hentai. It´s more simply in hentai. "},{"id":2326472,"gallery_id":391559,"poster":{"id":4406887,"username":"papipapipu","slug":"papipapipu","avatar_url":"avatars/4406887.png?_=5ed8692ee44bfab8","is_superuser":false,"is_staff":false},"post_date":1644605633,"body":"From rape to slave, NTR"},{"id":2326331,"gallery_id":391559,"poster":{"id":3994246,"username":"arkenfel","slug":"arkenfel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644600220,"body":"I know i am ranting but it really bugs me the Japanese style of rape, my dick is limp when the story victim just accepts it. That is  boring true rape is where the victim makes you work for it, if there is no effort on the female my dick won't get hard. There has go to be be biting and a intense struggle as you are trying to get her panties off. holding her down in a way she cannot escape, while trying to guide your dick in her and, trying to stop her biting and punching you. And when you do enter her and start a nice easy going rhythm there has to be crying. Now all of this sounds fucked up but that is what real rape is, this shit is just a cartoon. They should do some real shit for once, because this stuff is just boring, I cannot fap to this i cannot lie to myself when deep down i know it is bullshit. \n\n     "},{"id":2326272,"gallery_id":391559,"poster":{"id":3994246,"username":"arkenfel","slug":"arkenfel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1644597504,"body":"This is realistic for Japan, women there accept rape they do not tell the police. The idea of the rapist taking evidence and blackmailer her is spot on, even down to the woman not fighting back during the rape is spot on. But for many of us in the west the story seems too much of a fantasy, in the west women would fight back they just don't lie there and accept it. That is what I do not like about these stories, I do not want the bitch to lie there, and worst of all i do not want her to enjoy it. As weak as Japanese  women are I do not even think they would enjoy the rape. I n the west there is no way you could rape a woman and she would not tell the police, and the idea that you would go back for round 2 hahah is daft. It would be good if they could do a really good rape story.    "},{"id":2325722,"gallery_id":391559,"poster":{"id":950429,"username":"asmodeuseuphoria","slug":"asmodeuseuphoria","avatar_url":"avatars/950429.png","is_superuser":false,"is_staff":false},"post_date":1644573753,"body":"Great read 8/10 need more!! "},{"id":2325626,"gallery_id":391559,"poster":{"id":1587832,"username":"ElZensei","slug":"elzensei","avatar_url":"avatars/1587832.png?_=e04a48f62ae09d24","is_superuser":false,"is_staff":false},"post_date":1644569482,"body":"So this finally got translated? There’s a “continuation” where the “wh0r3” for a wife keep fcking the boss but it’s not worthy xD"},{"id":2325620,"gallery_id":391559,"poster":{"id":4640333,"username":"Zenylicious","slug":"zenylicious","avatar_url":"avatars/4640333.png?_=c6c22493c4fb19b3","is_superuser":false,"is_staff":false},"post_date":1644569290,"body":"One word “Whore”"},{"id":2325555,"gallery_id":391559,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1644566010,"body":"this is how it ends? OO"},{"id":2325409,"gallery_id":391559,"poster":{"id":694552,"username":"ssnake42069","slug":"ssnake42069","avatar_url":"avatars/694552.png?_=edcbda227d193901","is_superuser":false,"is_staff":false},"post_date":1644559720,"body":"it is translated finally and in a non-confusing-order single post!"}]