[{"id":2423779,"gallery_id":392573,"poster":{"id":4339878,"username":"H3ntaiAdd1ct","slug":"h3ntaiadd1ct","avatar_url":"avatars/4339878.png?_=33b011bc7b8ecc00","is_superuser":false,"is_staff":false},"post_date":1648481361,"body":"Oh cool, a bassist for once in these manga. Although it is an NTR manga, I'd still take it. E P I C O"},{"id":2408436,"gallery_id":392573,"poster":{"id":4608405,"username":"Olivre","slug":"olivre","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647820967,"body":"anyway no matter how young you are or how mature you think you are, don't hurt others for the sake of your dream, especially the ones that care for you. otherwise your future is gonna be filled with pain, regret, and loneliness. also obligatory \"get better communicate skills with lover\" lol"},{"id":2408403,"gallery_id":392573,"poster":{"id":4608405,"username":"Olivre","slug":"olivre","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647819548,"body":"lol ay yo mans got hit by a car on his bike, and lost his phone just cause he voiced his concerns, cut him some slack.\npoor girl really did this voluntarily trying to play adult whilst abandoning her bf in the scummiest way possible, and chasing after her dreams when she's still so young and naïve. sadly for her and expectedly for her actions, this brief moment of pleasure and acting dejected whilst trying to get the attention of her lover won't do her any good, reality often hits back hard. there's still a chance for them to reconcile but ehhh idk"},{"id":2363920,"gallery_id":392573,"poster":{"id":40917,"username":"mandaras007","slug":"mandaras007","avatar_url":"avatars/40917.png?_=71b48f13563ae442","is_superuser":false,"is_staff":false},"post_date":1645966587,"body":"Fuck Gouta lol"},{"id":2354935,"gallery_id":392573,"poster":{"id":4893315,"username":"BIG DUMPi","slug":"big-dumpi","avatar_url":"avatars/4893315.png?_=4b6e4cd9fcc178af","is_superuser":false,"is_staff":false},"post_date":1645565485,"body":"meh                    \n"},{"id":2351836,"gallery_id":392573,"poster":{"id":4085310,"username":"Rexx19doom","slug":"rexx19doom","avatar_url":"avatars/4085310.png?_=160b6f905c5493b4","is_superuser":false,"is_staff":false},"post_date":1645432212,"body":"Idk every single time when i read mashiraga aki, my heart beating so damn fast"},{"id":2350031,"gallery_id":392573,"poster":{"id":2181037,"username":"otomono","slug":"otomono","avatar_url":"avatars/2181037.png","is_superuser":false,"is_staff":false},"post_date":1645367212,"body":"old piece..\nthere was a tl on another site"},{"id":2349958,"gallery_id":392573,"poster":{"id":3203889,"username":"Ababacoy","slug":"ababacoy","avatar_url":"avatars/3203889.png?_=e043a287f65ab83d","is_superuser":false,"is_staff":false},"post_date":1645364914,"body":"Masterpiece, wtf my damn dic got really hard just like it has a bone in it, But I can't cum, even though I rubing my dic, even though I stir my own prostate so hard, why lol... \n\nOh shhit, i forgot to unplug a stick in my urethra, oh fuck i cum Like a big torn hose burst out"},{"id":2349642,"gallery_id":392573,"poster":{"id":2425478,"username":"hdaisuki123","slug":"hdaisuki123","avatar_url":"avatars/2425478.png?_=a14d0e76bfe195e3","is_superuser":false,"is_staff":false},"post_date":1645355123,"body":"I didn't care much for the story, all i want is the \"Bad-guy-takes-advantage-of-the-girls-weakness trope.\" They art is OK at best, the panels are just kinda dull. Not fapable."},{"id":2348728,"gallery_id":392573,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1645324366,"body":"Oh Mashira-Dou, his/her work always has damn good art but fuck is it always too depressing to fap to, and I say this as a dirty NTR fan, Mashira's works tend to be a bit too \"real\" even for me, so I guess in a way it does its job of making me feel uncomfortable right?"},{"id":2348479,"gallery_id":392573,"poster":{"id":3199663,"username":"harmonygirl23","slug":"harmonygirl23","avatar_url":"avatars/3199663.png?_=4e07f0fc696e8488","is_superuser":false,"is_staff":false},"post_date":1645314237,"body":"trash, another mocking on love, relationship and someone hobby fron dirty authors, even if they donrt want to insult somebody - tras and harsh anyway)"},{"id":2348459,"gallery_id":392573,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1645313498,"body":"Sticking close was just one thing, one thing and he can't do that. Why'd he wait until she was far away? Dis be my reason to be reasonable and obsessive."},{"id":2348366,"gallery_id":392573,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645310925,"body":"After re reading this she is a total bitch, she was attracted to the old man this whole time cause they have a deep passion for music, Mc knew and voiced out his concern and she smacks him and used the fight to stay at his place. Old dude went for his after telling her in his own way how naive she is, fucking the dude saying this is the place she belongs, and to put the dagger in mc heart after all the shit he went thru to get there is pull a string to let him see her naked so he could know, thats some grimy shit she pulled"},{"id":2348351,"gallery_id":392573,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1645310580,"body":"Remember reading this the first skip slimmimg all the artists works. Man he sure was right to be jealous what a bitch. This artist sure loves the caught cliffhanger reveal his other works are good read em if u have time they mostly ntr tho."},{"id":2348082,"gallery_id":392573,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1645299253,"body":"reading the author's other works. Theres no  a  hint of vanilla or happy endings. Its always and ending in symbolism left up to the reader to decide. dang.  the only one thats seems close ended is the MC getting girl back after the guy ran to the country and got her pregnant and the MC asked if she wanted to live with him and her kid. but he sitll cant  hearingin his head how she was fucked over adn over. this author man. has a creative mind or was fucked irl to write stuff like this."},{"id":2348056,"gallery_id":392573,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1645298570,"body":"ya re-reading it again. it probably doesnt need a part 2 but the girl is a slut bitch. oh well."},{"id":2348024,"gallery_id":392573,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1645297049,"body":"wow is that reall how it ends?"},{"id":2347806,"gallery_id":392573,"poster":{"id":116222,"username":"halloween25","slug":"halloween25","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645290836,"body":"Got surprised from this. Hope they translate the other works as well. Thanks for this."},{"id":2347687,"gallery_id":392573,"poster":{"id":1562176,"username":"joedman593","slug":"joedman593","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645287255,"body":"pt 2 We have no idea how long the couple's last fight was but I guess it was long enough for the producer guy to give Boy and Girl the ultimatum \"yo take her home or I fuck her\". And the tragedy, the story let's us know that Boy on his way to take her back, fell and broke his phone, that's why Girl couldn't get a hold of him then she was consumed by producer Guy. The last page is the real kicker here and can be up for interpretation. My take is Girl is in turmoil. I believe she hears the conversation between Boy and Guy at the door, and why Boy was too late. Girl pluck the bass string to get Boy's attention, to exposed herself, hurt him, and imply \"you are too late\", \"you made me do this\". Real psycho move to drive the reality to the Boy."},{"id":2347657,"gallery_id":392573,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1645286588,"body":"Honestly she should still feel like a huge bitch out of guilt. She cheats on her still at time bf because of “hard times” and looks for convenient excuses. Convenience like that in a relationship will always lead to failure. Unfortunately, she’s a huge cunt so I can see her just completely shrugging the boy off even if he was relatively justified. It’s not like they couldn’t stay together even if she still pursued her dream, but she had no faith or loyalty"},{"id":2347626,"gallery_id":392573,"poster":{"id":1562176,"username":"joedman593","slug":"joedman593","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645285908,"body":"Man, relationships, am I right? The worst you could do is betray your partner while you're still together even when it's kinda iffy. The least you could do for both your sakes is to formally call it off.\n\nI think I kinda understand where the Boy is coming from when he proposed to quit the band stuff, everyone else is gone, gone to college, preparing themselves to be a part of society (be equipped for jobs for better security, financially, the such). Boy had a rational reason and if he left at that the later events might've not happen but he struck Girl's dream and voiced his insecurity to the producer Guy since he sees himself no match to him and the story implies the Girl frequently hangs around producer Guy.\n\ncont pt 2"},{"id":2347622,"gallery_id":392573,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645285781,"body":"This bitch is a straight groupie, the dude trying to tell her this music not what it seems and she dont care. She a lost cause fucking some dude with little connections to the music life, if thats the life she wants enjoy being passed around dumb bitch"},{"id":2347519,"gallery_id":392573,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1645282584,"body":"You're in a middle of a fight. You're letting her stayed together with a male. I bet he's not even angry when Kousei told him that \"he'll gobble her up\". Your bike fell and yet you still got strength or maybe money to go back home instead of continuing your journey. And if you know you'll be troubling Kousei, then GET YOUR FUCKING GIRLFRIEND. Eh, it's a happy end for her though. She's free and not bound by Gouta anymore. She's also right to think Gouta wasn't gonna save her anymore seeing how lightly he made the situation. Honestly, kinda interested in how will she continue though. Will she quit or take Kousei's offer?"},{"id":2347504,"gallery_id":392573,"poster":{"id":3562108,"username":"Juddeau","slug":"juddeau","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645282355,"body":"Indeed, this story doesn't need a second part, since there is a closure.\n\nThis girl decided to be a free bird and surround herself with people who share her way of life (living on music).\n\nThat is why in the last panel she is seen next to the guitars and in silence, because it's a metaphor to indicate to us as a reader that she preferred to stay with the music and not with the bf who constantly kept fighting since he doesn't share his ideals."},{"id":2347491,"gallery_id":392573,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645282046,"body":"Hard to say who was really ntr here"},{"id":2347457,"gallery_id":392573,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1645281062,"body":"Finally! No need for part 2. She’s a “free bird.” At least bf get her first and left early enough so i call this a good ending. "},{"id":2347419,"gallery_id":392573,"poster":{"id":1219081,"username":"Memetaqolaire","slug":"memetaqolaire","avatar_url":"avatars/1219081.png","is_superuser":false,"is_staff":false},"post_date":1645279462,"body":"yeah same."},{"id":2347417,"gallery_id":392573,"poster":{"id":2408988,"username":"Sgt. Morningwood","slug":"sgt-morningwood","avatar_url":"avatars/2408988.png?_=79dc690bab62f983","is_superuser":false,"is_staff":false},"post_date":1645279455,"body":"Need a part 2"}]