[{"id":2354797,"gallery_id":392553,"poster":{"id":3864084,"username":"Excelon","slug":"excelon","avatar_url":"avatars/3864084.png?_=421487b2c46f3111","is_superuser":false,"is_staff":false},"post_date":1645557904,"body":"Oh there is an after party for the contestants. You mean, Orgies, right? "},{"id":2352638,"gallery_id":392553,"poster":{"id":4621403,"username":"whdl_0411","slug":"whdl_0411","avatar_url":"avatars/4621403.png?_=8ae13735496b6df3","is_superuser":false,"is_staff":false},"post_date":1645465571,"body":"What the fuck are these essays holy shit "},{"id":2351535,"gallery_id":392553,"poster":{"id":4593743,"username":"Dark Arthur","slug":"dark-arthur","avatar_url":"avatars/4593743.png?_=a58ef0e6432222cb","is_superuser":false,"is_staff":false},"post_date":1645420180,"body":"Another stupid blackmail and shit. "},{"id":2351146,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645404797,"body":"So honestly I don't get offended whenever I get the why you're writing essays or vanillaFag insults because I do what the fuck I want when I want it. And those fans are not as edgy as they like to think they are and I'm sure to get a insulting reply because they can't help themselves but to write an insulting comment otherwise how will they show those evil pathetic small dick vanilla fans how big their dicks are... Being individuals getting off to NTR. I got no shame did those who enjoy it. My dislike is towards the imbeciles who say the same oldest was grade a masterpiece which has a cookie cutter as the genre has become. That's not their fault because they have no power or words that's more the Japanese native version of them's fault! They don't care to change because their customers don't care to change. And I don't know why they'd believe shaming essays somehow makes them mature when it makes them look like imbeciles for not making an input and pointing out the fucking obvious!"},{"id":2351140,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645404528,"body":"It's funny because the whole blackmail like this was inspired from a case of a student getting blackmailed in a somewhat similar fashion and solicited by a teacher! They always imply that all that is just the trigger and after constantly being raped with no Escape she eventually suffer rape equal love! And not in the real life case where the girl if I remember straight almost committed fucking suicide and the teacher wasn't as lucky as all these evil teachers coaches e c t in that the law and won't what usually happens to a pedophile of that caliber came down hard! But you got to remember never hold hope that there will be a reversal or Consequences for the villains of the story. Those are rare because apparently the die-hard cash whales hated if anything acts out of order and I'm referring to the ones in Japan has these artists don't give a fuck about International fans! They're just lucky they get it from sites like this they're real money makers are fellow natives"},{"id":2351128,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645404190,"body":"@Obji_071 In the case of this genre it's a case of forced stupidity to make the plot happen! Let's be real it wouldn't be able to call itself NTR without it! Basically assume that the time skip that happened in the constant raping between that time has caused her will and mind to start weakening. Mixed with the belief that if you enjoy the sex that means not rape! You have to put yourself in the Ye Olde time mindset that if a woman got raped that means she actually wanted it or secretly wanted it deep down inside! Really can't say that since honestly you still have idiots who believe that mindset anyway alongside the ones who believed that all men are eager and I having a hard-on means you're interested because you can guess these idiots failed biology! There's a lot of forcing I think that's the one thing I really dislike about NTR more specifically the one when the woman is being taken and everyone but the taker has to be made dumb to make it happen!"},{"id":2350968,"gallery_id":392553,"poster":{"id":4436793,"username":"Obj_071","slug":"obj_071","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645397294,"body":"im inexperienced in this but arent women in this types of works kinda too okay with blackmail and/or rape? or im just didnt had enough contact with opposite sex and that how they are? i mean boyfriend isnt quite brightest tool in the shed but he tries his best and being honest with her then why she so easily goes with all those stuff?.. im again overthinking plot of a porn."},{"id":2350305,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645374380,"body":"Only read the first three Vaapad! The rest was just me in a ranting fit. And to add the rest isn't me hating on your precious tag!"},{"id":2350238,"gallery_id":392553,"poster":{"id":3953455,"username":"Vaapad","slug":"vaapad","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645372670,"body":"Wtf are these essays"},{"id":2350161,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645370929,"body":"Only she couldn't go back to being nice and caring you know the type of harmless creature she was at the beginning because now she had a taste of entitlement. Innocent she became that loser you see the one who used to be a somebody but now that they're like everybody else they're desperately trying to get that 15 minutes back. And it's just laughable is not pathetic. You know like that guy used to have girls around his arms when he was a teen. And now he stalks strip club hoping any of the young workers there will take his proposition and you know usually required a bouncer to get his ass off the grounds! I know I made multiple long-ass post so forgive me and just considered the first three as what I was trying to put up the story I compared this one too. I'm going to try to find that story so I'll post it later on where I found it and the name. But the only thing NTR here is that she's no longer just his girlfriend! What was lost from her was her loyalty because she's \"Poly\" now"},{"id":2350147,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645370683,"body":"Which is the really realistic part of this as I have heard stories of guys who got together with average-looking girls. In the very moment they became desirable to multiple men because those guys they completely changed into bitches! The conclusion was that they were only nice and gentle because nice and gentle is for the weak in some people's minds and I cannot dismiss that. You know taking into account the nice guys quote quote who really aren't nice they're just acting nice because it's a ploy to get sex. But as I pointed out there's a difference they're actually nice people and then there are those type of nice people who are only nice to lower people's guard. One story even ended up with the girl being abusive to the guy who helped her out when she was at her lowest. Once he left she didn't care as she had other men. But it didn't last long she had meaningless relationships and by the time the wall came she ended up going right back to how she used to be"},{"id":2350140,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645370431,"body":"Found it interesting 2 compared to two of them. but this one is different though because the ending pretty much makes it clear that and she's going to be playing her boyfriend around while she sleeps not just with senpai but it looks like all the contestants are going to be doing a gangbang at their party! The implication I'm guessing from this is Dad when she was average she was loyal and good but the moment she became beautiful and realize that she was desired by all the boys she got convinced why stick with just her boyfriend when she can have all the guys she wants. And I'm guessing our happiness is because the boyfriend apologized for upsetting her she now feels even more entitled. You know do usual she can get her sex from everyone else. And boyfriend just exist so she knows she's considered precious. Not a piece of meat and the usual because he loves me I can for a moment not recognized I become a whore! Basically she metamorph into a fake that she likely envied in the past"},{"id":2350132,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645370176,"body":"One even offered to get her something even better make it obvious it's laundry day she won't really like but then as already stated she's their shared woman at this point. So who the fuck cares what she thinks LOL. The story pretty much ends with those She Left Behind still worried for her but eventually moving on with a painfully obvious that the two of them might eventually date as the ex-boyfriend offers to go to a new BBQ joint with the ex-friend. Making it implied that he might pursue her now and she now sees our opening because you know they're not dating anymore they're not friends and the idiot even offered the both of them to each other on a silver platter so why not. The ending shows the guys having all collectively paid for a love hotels they have a gangbang well she mentioned she hasn't had her. And her in her inner thoughts come to the conclusion of why did she lose weight again? Meaning now she's pregnant and she forgot why she even lost weight to begin with!"},{"id":2350125,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645369925,"body":"When her boyfriend brought up how much she changed she got upset and compare him to her now ex-friend as well and being judgemental. I'm assuming her mind said now was since she had told the boys she didn't need her boyfriend anymore. So she broke up with him shamed him for being a chubby chaser and even told him that unknown to him. Their mutual friend actually had a crush on him but never pursued because while they were dating. But since he's such a chubby chaser they might as well get together then! In her mind it was supposed to look like she was shaming them both for not wanting to be the best like she was so they can stay losers. The irony of all this is that she gets the fancy clothes she desire to wear dirty when she has sex with the guys and they obviously show they don't give a damn about how she feels since you know she's at this point a prostitute to them for free. Continued on next post"},{"id":2350116,"gallery_id":392553,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1645369704,"body":"Everyone's comparing this to metamorphosis! But really just reminds me of a hentai I read on a different site still looking for it. Basically the girl was a BBW and enjoyed eating she wasn't a whale that would actually have been her female friend LOL and she had a boyfriend all three of them loved eating out. But then she decided she wanted to wear fashionable clothes similar to the FMC in this story. Short story she gets gang raped by all the boys who are now paying attention to her at school. And starts to become entitled falling for the same trick this dumb girl fell for once she discovered her value. When her friend and boyfriend both mention that she's changed. She gets upset and starts to show how much she started to look down on them! For her female friend she tells her that maybe if she lost some weight like she did all the boys would obsess over her and she'd understand like she was some Guru or something. (Continues on next post) "},{"id":2349615,"gallery_id":392553,"poster":{"id":3645219,"username":"johny8","slug":"johny8","avatar_url":"avatars/3645219.png?_=8fe924b1ad259759","is_superuser":false,"is_staff":false},"post_date":1645353961,"body":"This us shallow\n"},{"id":2349502,"gallery_id":392553,"poster":{"id":933027,"username":"nemesis79","slug":"nemesis79","avatar_url":"avatars/933027.png?_=80e2e446bb2d30e0","is_superuser":false,"is_staff":false},"post_date":1645350420,"body":"Man, the title got me thinking of something completely different..."},{"id":2349179,"gallery_id":392553,"poster":{"id":2492878,"username":"weidenfeller","slug":"weidenfeller","avatar_url":"avatars/2492878.png?_=974e29a10785b192","is_superuser":false,"is_staff":false},"post_date":1645339053,"body":"Not bad    "},{"id":2348683,"gallery_id":392553,"poster":{"id":3045412,"username":"YesGeneral","slug":"yesgeneral","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645321652,"body":"Homunculus plot isn't too much vanilla too these days"},{"id":2348640,"gallery_id":392553,"poster":{"id":641961,"username":"Atang","slug":"atang","avatar_url":"avatars/641961.png?_=02c80c202ecd3ae8","is_superuser":false,"is_staff":false},"post_date":1645320099,"body":"kinda similar to homunculus, except the plot isn't vanilla"},{"id":2348247,"gallery_id":392553,"poster":{"id":3357691,"username":"Lurker774","slug":"lurker774","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645305418,"body":"Hide your girl SchrondingerZ as you will be first. All your science regarding women will fall down on you and you will realize how wrong you were"},{"id":2348189,"gallery_id":392553,"poster":{"id":4565323,"username":"SchrodingerZ","slug":"schrodingerz","avatar_url":"avatars/4565323.png?_=b26a826d99784cee","is_superuser":false,"is_staff":false},"post_date":1645303174,"body":"@Lurker774 oh no, no please! xD "},{"id":2348136,"gallery_id":392553,"poster":{"id":3357691,"username":"Lurker774","slug":"lurker774","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645300759,"body":"@freak960 I am in fact an \"Alpha male\" who only reads NTR and learns the lessons skills and techniques to seduce a girl and dream of one day acquiring all the women of the world"},{"id":2348032,"gallery_id":392553,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1645297238,"body":"NTR is so dumb but it is what it is"},{"id":2347986,"gallery_id":392553,"poster":{"id":3525872,"username":"TehTohsaka","slug":"tehtohsaka","avatar_url":"avatars/3525872.png?_=b6235c0176e9ed79","is_superuser":false,"is_staff":false},"post_date":1645295817,"body":"This is so dumb, wth "},{"id":2347823,"gallery_id":392553,"poster":{"id":3992729,"username":"freak960","slug":"freak960","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645291319,"body":"Lurker774 you can't be talking like that, acting like Ur some alpha male, and relating to that bastard sempai when Ur on this site reading ntr :/"},{"id":2347820,"gallery_id":392553,"poster":{"id":3992729,"username":"freak960","slug":"freak960","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645291181,"body":"The more fashionable she became the dumber she got. Is this some kind of symbolism? "},{"id":2347802,"gallery_id":392553,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645290699,"body":"bitch......."},{"id":2347799,"gallery_id":392553,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1645290546,"body":"Hope FMC end up like \"177013\""},{"id":2347692,"gallery_id":392553,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1645287407,"body":"Like the homunculus art, dislike the bitch. I’m rooting for a Metamorphosis like ending where she wants to be with the bf again but even tho he’s not dating anyone atm she’s not the girl he liked"},{"id":2347635,"gallery_id":392553,"poster":{"id":3357691,"username":"Lurker774","slug":"lurker774","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645286164,"body":"So hot going from blue balling her beta bf mid blowjob to feeling real pleasure by the big dick Chad dropping the glasses and dressing up for him"},{"id":2347618,"gallery_id":392553,"poster":{"id":2338114,"username":"turn5misplay","slug":"turn5misplay","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645285643,"body":"Art feels very Homunculus-y on this one "},{"id":2347615,"gallery_id":392553,"poster":{"id":374474,"username":"HorneeBoee","slug":"horneeboee","avatar_url":"avatars/374474.png?_=66cbc5527f8cfd80","is_superuser":false,"is_staff":false},"post_date":1645285560,"body":"she just stopped having sex with the bf all together after the blackmail?"},{"id":2347579,"gallery_id":392553,"poster":{"id":3657044,"username":"ZGundam64","slug":"zgundam64","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645284302,"body":"He should follow them and see what kind of slut she is and get photos and expose everyone."},{"id":2347571,"gallery_id":392553,"poster":{"id":3562108,"username":"Juddeau","slug":"juddeau","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645284075,"body":"I still don't understand why the authors continue to use the cliche of blackmailing with sex photos with their boyfriend to be able to do NTR-type sexual scenes.\n\nHowever, the idea seems good to me, a plain girl who discovered that she had sex appeal and preferred to be surrounded by vanity and superficiality."},{"id":2347500,"gallery_id":392553,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645282242,"body":"Doesn't stay with the blonde guy either. She won what she searched now she knows her attractive value, as the real mc of the story."},{"id":2347461,"gallery_id":392553,"poster":{"id":2181037,"username":"otomono","slug":"otomono","avatar_url":"avatars/2181037.png","is_superuser":false,"is_staff":false},"post_date":1645281172,"body":"bar the blackmail the pygmallion effect is narrated well.The kind of ntr which stays close to reality."},{"id":2347431,"gallery_id":392553,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1645279937,"body":"Yeah Chad found the opportunity & took it."},{"id":2347424,"gallery_id":392553,"poster":{"id":2275702,"username":"wxyz.zxab","slug":"wxyz-zxab","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1645279660,"body":"@Curiosity Killed the Cat I agree with you. I think that the mc here is actually dodging a bullet.\n@xyst1656 yeah, I would like to see how this story is going. But since this is an NTR story, I doubt the author wants to make a sequel where she got her karma."},{"id":2347348,"gallery_id":392553,"poster":{"id":4354264,"username":"Whore4men","slug":"whore4men","avatar_url":"avatars/4354264.png?_=4c3365bdecabc168","is_superuser":false,"is_staff":false},"post_date":1645276217,"body":"Her traditional look >> "},{"id":2347346,"gallery_id":392553,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645276151,"body":"@Curiosity Killed the Cat yeah it really look like saki and we all know how she ended, maybe this girl will have the same fate, I wouldn't mind if that happened"},{"id":2347338,"gallery_id":392553,"poster":{"id":3410506,"username":"XV71","slug":"xv71","avatar_url":"avatars/3410506.png?_=42d7cb99aecd5372","is_superuser":false,"is_staff":false},"post_date":1645275831,"body":"typical trashmail of a stupid hoe"},{"id":2347322,"gallery_id":392553,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1645274939,"body":"I rather see this as the man got a jackpot. I mean, the girl really forgot that her bf just wanted her beauty for himself, not because he hated her being one, lol. The title fits though since the girl will be more or less turned like Saki from Metamorphosis"},{"id":2347315,"gallery_id":392553,"poster":{"id":4747215,"username":"Man who sold the world","slug":"man-who-sold-the-world","avatar_url":"avatars/4747215.png?_=d6fb444dceecdf7a","is_superuser":false,"is_staff":false},"post_date":1645274715,"body":"Finally a fall that was cause by stupidity, and not dick size."}]