[{"id":2355190,"gallery_id":392897,"poster":{"id":954660,"username":"pontapon","slug":"pontapon","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645577410,"body":"the most peaceful hentai I've ever read"},{"id":2354594,"gallery_id":392897,"poster":{"id":192120,"username":"XNumbers","slug":"xnumbers","avatar_url":"avatars/192120.png?_=7098c2794764cd91","is_superuser":false,"is_staff":false},"post_date":1645547962,"body":"@hentusiast I've no real idea. It really feels random and the artist even said they drew it while having goosebumps. What ever that means. Best I can come up with is that the boy has some issues. He can't get angry for some reason and I'm not well informed enough to say that he has autism or something like that. Anyways the the girl lets him fuck due to seeing his small dick. She mentions how she's been having wet dreams which is that whole octopus/squid talk. (as you know, japan has a tentacle fetish due to censorship laws.) So she's horny. She also says her lady bits are quite small. So she thought he'd be perfect with his small dick since he also easy to push around and does what anyone tells him to do. No clue on what the gods behind the ears thing meant."},{"id":2354234,"gallery_id":392897,"poster":{"id":3276841,"username":"hentusiast","slug":"hentusiast","avatar_url":"avatars/3276841.png?_=869456bfa6168d6c","is_superuser":false,"is_staff":false},"post_date":1645532585,"body":"I feel like \"Micchan's Doodles\" is the key here.. that drawing on p117, what does that mean?"},{"id":2354220,"gallery_id":392897,"poster":{"id":3276841,"username":"hentusiast","slug":"hentusiast","avatar_url":"avatars/3276841.png?_=869456bfa6168d6c","is_superuser":false,"is_staff":false},"post_date":1645532201,"body":"Ok, what tf are they even talking about in the new story? Squids? Gods? So confused.. I need your help again @XNumbers!"},{"id":2352270,"gallery_id":392897,"poster":{"id":192120,"username":"XNumbers","slug":"xnumbers","avatar_url":"avatars/192120.png?_=7098c2794764cd91","is_superuser":false,"is_staff":false},"post_date":1645453022,"body":"@qpxo Only reason I give a lil push back is because he opened the door with his dick out. It's such a strange thing to do without purpose. He must have known she was there, right? That's why I think he stayed after and went to try and have a turn himself. Another lil detail as well is that he took her shoes with him. Why do that unless he was planning to meet her? "},{"id":2352232,"gallery_id":392897,"poster":{"id":1809928,"username":"Luneward","slug":"luneward","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645451489,"body":"This entire series is both very odd, yet also realistic and comes off as oddly boring.  I'd really like to see this art style with a more directed story."},{"id":2352229,"gallery_id":392897,"poster":{"id":289386,"username":"qpxo","slug":"qpxo","avatar_url":"avatars/289386.png?_=752d8f1cb8637baa","is_superuser":false,"is_staff":false},"post_date":1645451216,"body":"@XNumbers I think it’s a mix of both. She clearly has other guys cum in her but I actually think the MC just wanted to Jack off with her shoe nothing else. Why she would fuck him after noticing it was him, I’m not sure. I think him being the one cumming in her shoe reveals he’s attracted to her and she takes advantage of that by fucking him simply because it’s an easy way to get him to stop. The last thing she says to him does make it possible in my opinion that it was mostly just about not finding cum in her shoes anymore."},{"id":2352049,"gallery_id":392897,"poster":{"id":192120,"username":"XNumbers","slug":"xnumbers","avatar_url":"avatars/192120.png?_=7098c2794764cd91","is_superuser":false,"is_staff":false},"post_date":1645442567,"body":"@Calliopetra Eh on page 38 you can see transparent liquid leaking out her which could be her being wet but then on 39 & 40 it turns more solid. That's before the dude cums. I could be wrong but then why did he decide to stay in class for so long like he's waiting? (maybe to cum in her shoes again?) Why did he go to the shed with his dick out like he knew she was there and why didn't she mind seeing his dick out? Why was she so willing to have sex with him even though she knows what he does to her shoes? Why does she think she knows he wasn't there just to talk shelter from the rain on page 26? The story doesn't make sense if he just happened upon the girl out of pure chance and conveniently gets to have sex with her with no reason. Also the artist themselves decided to add cuck undertones with the glasses dude talking about her having rough sex. There's enough clues imo. Plus a future chapter the girl have sex with someone other then the MC so it's something the artist would write."},{"id":2351962,"gallery_id":392897,"poster":{"id":4134250,"username":"Calliopetra","slug":"calliopetra","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1645437510,"body":"Gotta disagree with the interpretation on the last page. The panel was clearly his horny imagination. And it′s not even cum in those two pages, she literally got wet. It was mentioned earlier the roof was leaking. \n\nSorry, but the whole paragraph just feels like a projection of a cuckold."}]