[{"id":2521994,"gallery_id":393238,"poster":{"id":4517540,"username":"esmeralda12","slug":"esmeralda12","avatar_url":"avatars/4517540.png?_=67db130d7c41d108","is_superuser":false,"is_staff":false},"post_date":1652440345,"body":"I need that ring 😔"},{"id":2465624,"gallery_id":393238,"poster":{"id":795958,"username":"G-BenderCrespy","slug":"g-bendercrespy","avatar_url":"avatars/795958.png?_=6449610aa268defc","is_superuser":false,"is_staff":false},"post_date":1650242934,"body":"Man the art gets my bussy all wet and ready to go! We’re can I get a ring like that and take every man by their knee with breast like that \n:3&lt;3—&lt;"},{"id":2452237,"gallery_id":393238,"poster":{"id":3587406,"username":"Inner Demon","slug":"inner-demon","avatar_url":"avatars/3587406.png?_=6357995da45ecfd0","is_superuser":false,"is_staff":false},"post_date":1649704568,"body":"Grab your popcorn guys not your rod."},{"id":2450804,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1649646959,"body":"also take my \"kiss our ass\" as a joke then Reyes"},{"id":2450794,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1649646616,"body":"@Reyas think of it metaphorical then! But you kind of stated what I meant when I said Woman were like Fighters friend! They have it easy \"early on\" because of favoritism...and it's worse as you mentioned. At the expense of men/wizards (Adding on, Wizards are ordered to waste their \"spells\" empowering the woman/fighter). A funny thing to note is his mother who I won't be surprised lived her life on easy street till her \"Flair\" ended and her squandering what she had when she was popular meant \"Welfare and poverty\" ended up her future! Poor Guy got little sympathy as though his mom's bad life choices were his responsibility (got to love the \"convivence\" of \"it's your parent, aren't you ashamed to force hard working people to care for them when YOU exist. Doesn't matter if they abused you, YOUR the bad one for existing because like Insurance, the thing they allowed to be voted in to help the poor should never be utilized by the poor"},{"id":2447116,"gallery_id":393238,"poster":{"id":4924511,"username":"BYZIC","slug":"byzic","avatar_url":"avatars/4924511.png?_=eb248f40a2d01dc5","is_superuser":false,"is_staff":false},"post_date":1649493527,"body":"wtf hell noo"},{"id":2422371,"gallery_id":393238,"poster":{"id":3380232,"username":"Reyas","slug":"reyas","avatar_url":"avatars/3380232.png?_=49fb02bd9376c1cd","is_superuser":false,"is_staff":false},"post_date":1648430735,"body":"@LordCelloEarth9 I see where you're coming from and you're not wrong. Men have to build up value whereas women have automatic, front-loaded high value.  That's true. My point though was regardless of that, women have it massively easier. Your example doesn't fully work because, if a woman builds herself up the way successful men do (Optimizing/self-actualization/etc.), she zips past them with ease because govts and people have extreme favoritism toward women at the direct expense of men.  I'm not complaining about this, it's fine. I'm just saying that's a fact no matter how you want to slice it."},{"id":2402428,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1647642138,"body":"@Reyas in a funny way Men Are wizards in women are Fighters! At the start men have it hard but once they hit that threshold shit starts to get easier. But women like Fighters they start out easy but once they hit that point that the men as Wizards are starting to see the fruits of their hardship. They're struggling to keep up! What I'm getting at is I'm using the whole fighter wizard Concept in video games where the warrior has easy early on but struggles that you reach the mid to end game! Namely women have it easy early on but their looks fade and well if they haven't established anything by that point then she's going to get hard. They live longer but they're brittle as hell and I would love to remind that having the ability to live forever isn't fun if you're going to spend it burning alive and feeling the pain in a volcano.. Or the Sun!"},{"id":2402424,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1647641889,"body":"There was an error when I said best behavior I meant bitch Behavior!"},{"id":2402420,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1647641686,"body":"My mistake with the names! And thanks for bringing up volume 2 can't wait! Yeah I agree when you think about it in the long run the protagonist did do her bitch of a teacher a favor! And from her description it does make sense that she would brag especially taking her behavior towards the protagonist! Likely had a superiority complex and with her getting close to Christmas age her best behavior probably increased. It's no different than that Superior who is an ass to you and you get your revenge before you leave out LOL.... Oh and Reyas kiss our shiny metal Collective ass :-) LOL!"},{"id":2400773,"gallery_id":393238,"poster":{"id":3380232,"username":"Reyas","slug":"reyas","avatar_url":"avatars/3380232.png?_=49fb02bd9376c1cd","is_superuser":false,"is_staff":false},"post_date":1647571967,"body":"Lmao, these comments are hilarious. Hey dumbasses, being a woman is life's easy mode. Being an ATTRACTIVE woman is easy mode with cheats on."},{"id":2384596,"gallery_id":393238,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1646819904,"body":"A bit confused, so wants to clarify. When you said Ebi (the doujin author), did you mean Aoi (the protagonist)? | Seeing the profile, there’s a slight mistake. The thing Satori dislike, 同性からのマウント, is not flirting. It’s more like other female flaunting superiority (like talking about being spoiled by fabulous boyfriend, or getting things everybody wants) while belittling other. For guys, it's like when your acquaintance starts talking about how he's richer, got better career, having sexy girlfriend, while pointing out you don't. Fucking annoying. The ex's profile got some red flags. He's marrying for his career (company only trust married person for position with higher responsibility); and \"mentally unstable woman\" can just be self-justification because he doesn't want to bother in understanding his partner. It's easier to just calls her hysterical. The marriage probably wouldn't last even if they did get to it. | Volume 2 in summer Comiket. "},{"id":2381331,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1646690081,"body":"I'm interested in part 2 cause I have to wonder why he was given the ring in the first place (Motivation of the one who gave it to him!) and what will happen next! (Maybe a short on Satori and the Ex-Fiancee to see what happened with them! Like Confirmation when Satori saw the video, she recognized Ebi on sight! Ex-Fiancee getting in trouble from having sex with a minor! ETC Not long, just a page or two; Same with the Mother, more on what she's as she is and what happens next for her) I made my thoughts long to have multiples! But had to say what was on my mind with this one (Feel Ebi should witness the more negative sides as \"she's\" enjoying her new pathway in life! But honestly felt what happened was Karma in Satori direction for her overstep! She wanted to be an inspiring teacher and failed..so pays the price! As stated she never had to quit, she chose to because she felt humiliated that her snobbery bit her in the ass and mr perfect wasn't perfect...her judgment skills REALLY SUCK)"},{"id":2381308,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1646689250,"body":"Ebi move was bitchy! But well, Satori really should have minded her own business and not pried any further then she should (Especially since knowing the culture, she was going to quit to marry her rich fiancee I mean EX fiancee! I can only see this last move of her's as wanting to have a perfect record for her to look back fondly of! Wanting her cake and eat it! Ebi helps his mother out, she's off welfare, another student \"without baggage\" gets a golden future! \"What a great teacher she was!\") instead she's like gone Hikkorimori now assuring spinsterhood is assured in her future! And best part as Ebi noted! She'll always know it was Ebi \"and she should have minded her own business! (as put before! Unless he committe a crime or was not keeping his grades up! She had no real business taking away the Rec! She likely would have done some \"lying\" to justify the switch over as saying \"student is too poor\" wouldn't go over well! Suicide would have dashed everything though just the same (Next)"},{"id":2381294,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1646688759,"body":"Others may or may not blame her as it would have been seen as him being mentally unstable! But others noted her judgement skills would come into question because why give it to him in the first place! (Anyone really looking would notice the only difference between the new choice and Ebi was Ebi has a poor background with a mom on welfare! That would have been something that would bite her in the ass....if she stayed that is) But yeah I could see her losing her marbles if Ebi committed suicide! Trying to tell herself she never meant for him to die, that she thought it was the best option for him (when her recommend oozed with entitlement! Seriously telling him the inner workings of Welfare was her trying to avoid telling him straight up \"maybe you should think about caring for your waste of a mother so others don't have to pick up the slack!\" because she was being a bitch, while trying to act to herself that she wasn't being a bitch!) (Next Post) "},{"id":2381288,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1646688436,"body":"Unlike everyone else. She recognized Ebi on sight and knew it was her getting revenge on her for taking the recommendation from her (she's likely still hypocritically painting herself as the victim who did \"nothing wrong\" because serious \"what teacher recommends a hard working student just give up trying to improve simply because of \"homelife!\" she should have been encouraging him even more! But as Ebi profile put it! She failed as a teacher because she cemented his hatred to women and had no good reason behind her action beyond looking down on his financial status AKA his mother on Welfare! Seeing how unstable she is as she didn't need to quit her job/career over some guy! It's clear if Ebi had committed suicide as he planned originally she would have quit out of disgrace, even if others never heard the conversation between the two, it still would have been noted that his suicde happened AFTER that conversation and when his Recommendation was taken! (Next Post)"},{"id":2381278,"gallery_id":393238,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1646688152,"body":"My guess with Satori (The teacher) from what I also guessed from her \"ex fiancée\" profile of dislikes (hates mentally disturbed women) is that the same thing still happen in this timeline (taking the recommendation from Female Ebi with the same \"your mom's on welfare that I pay into! Give up on bettering your life and get to working so you can take care of your mother and not let others do it with their hard work\" Mind you those who know the Japanese culture have stated her actions were rude and overstepping! So she was just being a self-righteous bitch looking down on her student) she saw the video like everyone else! (Next Post) "},{"id":2379669,"gallery_id":393238,"poster":{"id":1168948,"username":"Fookin Laser Sights","slug":"fookin-laser-sights","avatar_url":"avatars/1168948.png?_=51f64285b2765d14","is_superuser":false,"is_staff":false},"post_date":1646609909,"body":"Dick begone! Ballz begone! YOUR CUM WON’T LAST"},{"id":2371148,"gallery_id":393238,"poster":{"id":4968354,"username":"nerfdycia","slug":"nerfdycia","avatar_url":"avatars/4968354.png?_=081a443c68fae6d6","is_superuser":false,"is_staff":false},"post_date":1646297759,"body":"Ou no me dick is confused me dick is no become long xd"},{"id":2361222,"gallery_id":393238,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1645849927,"body":"Being attractive woman does have its advantage, and there are starter jobs where attractiveness can be a good weapon while building connection. She's going to university through recommendation, so her academic skill shouldn't be bad either. At least, this success does gave her more confidence that she can challenge anything. "},{"id":2361080,"gallery_id":393238,"poster":{"id":4671454,"username":"Fellow Daoist Gu","slug":"fellow-daoist-gu","avatar_url":"avatars/4671454.png?_=53316f89f23a93c5","is_superuser":false,"is_staff":false},"post_date":1645843111,"body":"How to ruin a cheaters life.\nLol"},{"id":2360716,"gallery_id":393238,"poster":{"id":3560296,"username":"NotMeJahe","slug":"notmejahe","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645821289,"body":"All fun and games till you're being raped"},{"id":2359894,"gallery_id":393238,"poster":{"id":2181731,"username":"enchantist","slug":"enchantist","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645784745,"body":"10/10 The art so and sex expression is so horny good and for coincidence this MC express what I want to say about jealous female easy life, wanna be a girl and make easy money from sell his body or even how he feel happy from female orgasm pleasure. I'd do the same if I got that ring like that MC. Even the plot jealous idol and hook sugar daddy plot also the same as I think. The only different is me or my MC's plot don't abandon his mom. Now I'm looking forward will he start from sell body and shift into richie idol like his senpai or not or he'll stay sex easy money with simp men forever."},{"id":2359796,"gallery_id":393238,"poster":{"id":1697907,"username":"Zetsu Machiavellism","slug":"zetsu-machiavellism","avatar_url":"avatars/1697907.png?_=730a96bee94bd64a","is_superuser":false,"is_staff":false},"post_date":1645779996,"body":"hopefully the second part release soon"},{"id":2359464,"gallery_id":393238,"poster":{"id":3580953,"username":"Damn that crazy over there","slug":"damn-that-crazy-over-there","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1645763848,"body":"@Chris Benoit the Family Man \nThot actually get more privileges and pay less taxes, so fuck it WW3 can destroy America and Japan "},{"id":2359456,"gallery_id":393238,"poster":{"id":3580953,"username":"Damn that crazy over there","slug":"damn-that-crazy-over-there","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1645763533,"body":"Getting higher education is one of the ways for stop being poor, so I can understand why he wanted to get into college. You can't stop being poor just by work at  a fast food store "},{"id":2359428,"gallery_id":393238,"poster":{"id":3311081,"username":"rAmenmyass69","slug":"ramenmyass69","avatar_url":"avatars/3311081.png?_=c2e18e54512377c9","is_superuser":false,"is_staff":false},"post_date":1645762275,"body":"Gender change (?)"},{"id":2358375,"gallery_id":393238,"poster":{"id":4427517,"username":"HololiveEN Manager","slug":"hololiveen-manager","avatar_url":"avatars/4427517.png?_=12f5dda85fff50ac","is_superuser":false,"is_staff":false},"post_date":1645719101,"body":"I've never see the day that I will find Gender bend NTR.. huh.. "},{"id":2358284,"gallery_id":393238,"poster":{"id":1510814,"username":"Chris Benoit the Family Man","slug":"chris-benoit-the-family-man","avatar_url":"avatars/1510814.png","is_superuser":false,"is_staff":false},"post_date":1645715919,"body":"Why would you want to become and woman and have less rights? "},{"id":2357865,"gallery_id":393238,"poster":{"id":3881434,"username":"pixelstar986","slug":"pixelstar986","avatar_url":"avatars/3881434.png?_=c627d53e098f5eed","is_superuser":false,"is_staff":false},"post_date":1645695475,"body":"\"Remember son... Dying is gae\" "},{"id":2357681,"gallery_id":393238,"poster":{"id":637244,"username":"SeiKeikaku","slug":"seikeikaku","avatar_url":"avatars/637244.png","is_superuser":false,"is_staff":false},"post_date":1645688586,"body":"Great art, interesting story. Even tho it's ch. 1, I can only expect it to end terribly when all is said and done but I actually want this guy to work for a better life, even if she's fucking her way to the top. I don't know, there hasn't been good genderbender stories lately... "},{"id":2357417,"gallery_id":393238,"poster":{"id":4860771,"username":"Arhitp","slug":"arhitp","avatar_url":"avatars/4860771.png?_=968fab4fd9740eca","is_superuser":false,"is_staff":false},"post_date":1645678898,"body":"Bro's a manece"},{"id":2357355,"gallery_id":393238,"poster":{"id":2576876,"username":"Sassaki_Eimi","slug":"sassaki_eimi","avatar_url":"avatars/2576876.png?_=1edee0aa7370f66e","is_superuser":false,"is_staff":false},"post_date":1645676638,"body":"Menace     "},{"id":2357252,"gallery_id":393238,"poster":{"id":3637164,"username":"Esas","slug":"esas","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1645672624,"body":"mega sus      "},{"id":2357094,"gallery_id":393238,"poster":{"id":2155254,"username":"Gutten ifra sapmi","slug":"gutten-ifra-sapmi","avatar_url":"avatars/2155254.png","is_superuser":false,"is_staff":false},"post_date":1645666763,"body":"page 5 kinda reminds me of the mandela catalouge "},{"id":2357033,"gallery_id":393238,"poster":{"id":1122987,"username":"uterus invader","slug":"uterus-invader","avatar_url":"avatars/1122987.png?_=421f46ef21a229d6","is_superuser":false,"is_staff":false},"post_date":1645664887,"body":"No shiiit getting money and having fun at the same time.... "},{"id":2356916,"gallery_id":393238,"poster":{"id":1331749,"username":"Sparkman213","slug":"sparkman213","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645659548,"body":"Easily one of my favorites!"},{"id":2356855,"gallery_id":393238,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1645655853,"body":"I mean, I can understand if you had a hard time getting a job but then seeing the thots easily gain money, but this dude just don't wanna work. Man, what a clever way to not give any sympathy to the MC and just focusing on what will happen next, lol"},{"id":2356660,"gallery_id":393238,"poster":{"id":4940236,"username":"cheems, the unforgiven","slug":"cheems-the-unforgiven","avatar_url":"avatars/4940236.png?_=efaab332389e7df0","is_superuser":false,"is_staff":false},"post_date":1645646893,"body":"but dying is gay so.. which is a better option"},{"id":2356465,"gallery_id":393238,"poster":{"id":2859916,"username":"ENVYRIX5","slug":"envyrix5","avatar_url":"avatars/2859916.png?_=0983f5c8c55aac5b","is_superuser":false,"is_staff":false},"post_date":1645638323,"body":"Damn, if he turn into a transgender he would actually kill himself "},{"id":2356314,"gallery_id":393238,"poster":{"id":4773230,"username":"just_a_mee","slug":"just_a_mee","avatar_url":"avatars/4773230.png?_=790c8920c3288fdc","is_superuser":false,"is_staff":false},"post_date":1645633699,"body":"If you read only the first 13 pages it's like the start of an ordinary revenge manga"},{"id":2356296,"gallery_id":393238,"poster":{"id":4888583,"username":"DegenerateWeebbb","slug":"degenerateweebbb","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645632814,"body":"This is Pretty interesting to a certain degree"},{"id":2356221,"gallery_id":393238,"poster":{"id":4403605,"username":"Gavino Manuel","slug":"gavino-manuel","avatar_url":"avatars/4403605.png?_=3ac114319c451d55","is_superuser":false,"is_staff":false},"post_date":1645630717,"body":"That is a lightnovel title"},{"id":2356171,"gallery_id":393238,"poster":{"id":3337748,"username":"SuCCulent","slug":"succulent","avatar_url":"avatars/3337748.png?_=c42a7c06bc97ce1a","is_superuser":false,"is_staff":false},"post_date":1645628816,"body":"Complete change of pace from that wholesome Gender Bender 392026 to this. Man, I wish I can genderbend without being part of the Alphabet Gang."},{"id":2356139,"gallery_id":393238,"poster":{"id":4747215,"username":"Man who sold the world","slug":"man-who-sold-the-world","avatar_url":"avatars/4747215.png?_=d6fb444dceecdf7a","is_superuser":false,"is_staff":false},"post_date":1645627328,"body":"That's a no lifer at it's maximum."},{"id":2356120,"gallery_id":393238,"poster":{"id":5042466,"username":"Ultimate Cap","slug":"ultimate-cap","avatar_url":"avatars/5042466.png?_=49e10f1c085128c1","is_superuser":false,"is_staff":false},"post_date":1645626377,"body":"Imagine changing your sex just to avoid getting a real job."}]