[{"id":2451428,"gallery_id":393760,"poster":{"id":3694686,"username":"just boycott life","slug":"just-boycott-life","avatar_url":"avatars/3694686.png?_=ba136b6c905fd81e","is_superuser":false,"is_staff":false},"post_date":1649667804,"body":"Lol bro chill wtf "},{"id":2448202,"gallery_id":393760,"poster":{"id":1475992,"username":"Ecchinosuke","slug":"ecchinosuke","avatar_url":"avatars/1475992.png","is_superuser":false,"is_staff":false},"post_date":1649539262,"body":"@pyrexo1 so you think that after this new guy finds out she's into casual orgy he would still accept her? He assumed she was a virgin because he misunderstood what she said about seeing a condom for the first time, also she also lies about knowing about blowjobs saying she was told by Mei. \nThe relationship is already starting with lies and manipulation and it won't end well for the new kid.\nI can agree that the first MC was wrong for forcing his beliefs onto the girls, but you must understand that Asahi right now is choosing to lie about her status in order to forget that she's a slut."},{"id":2447664,"gallery_id":393760,"poster":{"id":5158913,"username":"anyaforger","slug":"anyaforger","avatar_url":"avatars/5158913.png?_=ca9e4b78b54516d2","is_superuser":false,"is_staff":false},"post_date":1649518337,"body":"Anya can't follow what the hell is happening HAHAHAHAHAHAH"},{"id":2446821,"gallery_id":393760,"poster":{"id":590651,"username":"Dr Free","slug":"dr-free","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649479552,"body":"@Jack Heidelberg LMAO you didn't pay any attention. Look at himtaking her to bed, asking her if she's fine. He STILL thinks she's some delicate flower, that did some \"light\" stuff and this is her first time, \"deflowering\" her now.\nHis advice DOESN'T APPLY to what happened."},{"id":2445135,"gallery_id":393760,"poster":{"id":4291533,"username":"igorheadshot","slug":"igorheadshot","avatar_url":"avatars/4291533.png?_=a261fa5485ca351c","is_superuser":false,"is_staff":false},"post_date":1649400595,"body":"@Fix your website, lazy admin Yeah who never used someone just to get close to his brother, fuck his brothers in his house and after finding him a nuisance, kick him off completely, cast the first stone. Seriously, you're such a simp and ntr fetishist you just can't  bring yourself to admit it. But chill down, here in anonymity you can reveal your weird simp nature to the world, no one will know bro."},{"id":2444871,"gallery_id":393760,"poster":{"id":4359363,"username":"pyrexo1","slug":"pyrexo1","avatar_url":"avatars/4359363.png?_=d282bdb54505eb32","is_superuser":false,"is_staff":false},"post_date":1649388122,"body":"@Destroyer of shitty hentai I agree, I think he's assuming somethings about her that he's got wrong, but overtime if the relationship goes well, that's bound to come out. She was comfortable confiding some of her past in him, I'm sure she'd reveal more as time goes on. Or she won't. If she wants to keep her past in the past, that's fine. Her enjoying consensual swapping orgy sex is fine, it's her sex life and I don't think Kido should tell her what to do, he's not her boyfriend, so that's crossing a line. She even says it has nothing to do with him, and she's right (IMO). That's what I meant by purity, my mistake for not being clear. On the brothers...I just don't know what I think about them in relation to Kido, as they interact with Kido so little. Like, you could say they were wrong to hit on the girls, but the younger one asked immediately if they were dating Kido, they said no, so it's really fair game. Honestly, I'm just not sure if they were bullying Kido or not."},{"id":2444783,"gallery_id":393760,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1649384445,"body":"@pyrexo1 While I can poke a lot of holes in that moral and logic, but let get the fact that both of us can agree is that the new guy can accept her is that because of his wrong assuming of her and not the real her, also what about all of this \"purity\" on Kido? The problem is that she has sex with his siblings who bully him, sure he want her to change back into the way she was before, but let me remind you that the current her is the person who enjoys not just has sex while being student but a person who enjoy swapping orgy, it is not THAT strange for him to said that to her"},{"id":2443073,"gallery_id":393760,"poster":{"id":4359363,"username":"pyrexo1","slug":"pyrexo1","avatar_url":"avatars/4359363.png?_=d282bdb54505eb32","is_superuser":false,"is_staff":false},"post_date":1649304749,"body":"@Destroyer of shitty hentai  You are right that he thought she was a virgin on page 48, but she never said she was, he just assumed so, and that assumption/\"misleading\" is on him, not on her. I should point out, he didn't assume so in some misogynistic \"purity\" way - he assumed that she had no experience and that he would have to take the lead. Also...why would you expect her to *say* whether or not she's a virgin? Do you expect every girl you have sex to to say that? No of course not, that's none of your business. Finally, he is not a \"lucky\" Kido, Kido's issue was he couldn't move on from one girl and felt the need to tell her how to behave. This guy accepted being turned down (page 33) and is comfortable with her being a lewd girl. The doujin is teaches two things 1. Accept & move on if someone doesn't like you romantically 2. Accept that some women are lewd and that's fine. Kido couldn't do either so he failed, the new guy does both and gets a happy ending. \"Luck\" wasn't involved."},{"id":2442346,"gallery_id":393760,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1649271142,"body":"@pyrexo1\nAlso which part she ever told that new guy that she had sex before?\nClearly I'm sure it's definitely not page 35."},{"id":2442336,"gallery_id":393760,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1649270783,"body":"@pyrexo1 and @mcnx\nNot to mention that all of her words are pretty much seem like she is trying to \"misleading\" this new guy into think that she never have sex before.\nIn short new guy is just lucky (or unlucky) version of Kido"},{"id":2442312,"gallery_id":393760,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1649270115,"body":"@pyrexo1 and @mcnx\nThat time I am lazy and just summarize it.\nWell i will start to get into more detail now \nPage 48 The new guy think \"oh right, it's Honda san's first time too...I have to take the lead\"\nThis new guy is clearly thought it was her first time having sex\nPage 57-58 when that new guy ask her about how she knew how to doing blowjob she tell him Mei \"told\" her about this about this and that dude believe and blame others girl like that.\nNot to mention that couple with all conversations while they having sex, let face it, that new guy think she is a virgin!"},{"id":2442086,"gallery_id":393760,"poster":{"id":2275702,"username":"wxyz.zxab","slug":"wxyz-zxab","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1649260551,"body":"People who are blaming the previous MC for being a \"beta\" probably never see a bullied, mentally-broken person IRL. Yeah, sure, it is not really close to the real life and the MC got his own faults and all but it doesn't mean the girls and his brothers don't have their faults. In chapter 1 it was actually implied that the MC had always been bullied by his brothers, and you can see that his confidence was already down."},{"id":2440515,"gallery_id":393760,"poster":{"id":1378719,"username":"ohnodonttell","slug":"ohnodonttell","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649193620,"body":"@Fix your website, lazy admin this is a fictional story. You sound as upset as those who get worked up over NTR lol get over yourself and who cares? These characters don't exist, you don't have to simp for the 2D girls."},{"id":2438673,"gallery_id":393760,"poster":{"id":4359363,"username":"pyrexo1","slug":"pyrexo1","avatar_url":"avatars/4359363.png?_=d282bdb54505eb32","is_superuser":false,"is_staff":false},"post_date":1649123246,"body":"Destroyer of shitty hentai - as mcnx pointed out, she never claimed to be a virgin. Also, he doesn't think she's innocent. Check page 43: \"There's not a single man in the world who doesn't like a lewd girl!\"\nSo yeah, Asahi finally found a guy who accepts her."},{"id":2437999,"gallery_id":393760,"poster":{"id":2298430,"username":"mcnx","slug":"mcnx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649095358,"body":"Destroyerofshittyhentai you misinterpreted Asahi don't say \"this is my first time seeing a dick\" ,She said, \" this is the first time seeing a condom\""},{"id":2437227,"gallery_id":393760,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1649066054,"body":"pyrexo1\nNot to mention that Asahi openly deceive him here, \"this is my first time seeing dick\"? Yeah right"},{"id":2437223,"gallery_id":393760,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1649065809,"body":"pyrexo1\nAsahi finds a guy who likes her for the person she is?\nThat new guy think she still virgin and innocent you know?"},{"id":2435609,"gallery_id":393760,"poster":{"id":4359363,"username":"pyrexo1","slug":"pyrexo1","avatar_url":"avatars/4359363.png?_=d282bdb54505eb32","is_superuser":false,"is_staff":false},"post_date":1648996348,"body":"It's good that Asahi finds a guy who likes her for the person she is, unlike the MC from the previous work (his name was Kido) who wanted her to behave in a \"pure\" way that suited him, when she didn't even like him like that.\nThis new guy Asahi meets telling her that it was Kido's fault really puts a weight of her shoulders and brings her back to reality. \nThe poor girl is so kind, she was still feeling guilt for that weirdo Kido.\nI've never seen a NTR doujin be so feminist before. No wonder so many comments are angry she didn't get some sort of \"comeuppance\"."},{"id":2430169,"gallery_id":393760,"poster":{"id":73642,"username":"Fix your website, lazy admin","slug":"fix-your-website-lazy-admin","avatar_url":"avatars/73642.png?_=6294bf803e66a9e1","is_superuser":false,"is_staff":false},"post_date":1648751158,"body":"Asahi feels genuinely bad to her friend about something she had every right to do in the first place and finds herself a guy that actually likes her and somehow ends up being called a bitch by retarded basement dwellers on the internet. I seriously pity the women in your lives."},{"id":2416138,"gallery_id":393760,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1648176975,"body":"I see. So Aizawa loss her virginity in middle school when she got rejected by her first love and has been playing hooky with any good looking guys that piques her interest as we know when she has sex with CF younger brother while Honda losses her virginity as we all know by CF older brother but feigned ignorance and acted like a pure innocent virgin here despite having 2 cocks inside her before then got her 2nd lover."},{"id":2416132,"gallery_id":393760,"poster":{"id":2453199,"username":"JohnMichealGarcia","slug":"johnmichealgarcia","avatar_url":"avatars/2453199.png","is_superuser":false,"is_staff":false},"post_date":1648176844,"body":"For those who don't get it. Before the main storyline where our MC got NTR'd by his older and younger brothers this is the so called CHAPTER 0 where Aizawa losses her virginity while Honda acted like a virgin even though she's NOT as her first partner was CF older brother and CF younger brother as her second partner then she got her 2nd lover as she broke up with CF older brother when he graduated high school a year before this setting."},{"id":2414602,"gallery_id":393760,"poster":{"id":3306201,"username":"Jskee400","slug":"jskee400","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648093713,"body":"Honestly... If you're going to end your NTR series with a split before and after extra at least have the decency to say what happened to the MC. \"He moved\"... REALLY?! That is all you got for us... Shame.\n"},{"id":2409184,"gallery_id":393760,"poster":{"id":5141595,"username":"PicaYune","slug":"picayune","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647851956,"body":"well, if you remove the mc from the previous story and remove all the netorare thingy from your head, you've just got yourself a vanilla story with swinging tag.\njust imagine the mc was never there at the first place and skip all page containing that stupid mc and voila!"},{"id":2408116,"gallery_id":393760,"poster":{"id":4507909,"username":"cuteboylover","slug":"cuteboylover","avatar_url":"avatars/4507909.png?_=ddc7a33cbacaa4e4","is_superuser":false,"is_staff":false},"post_date":1647804553,"body":"i love mei"},{"id":2399049,"gallery_id":393760,"poster":{"id":1998672,"username":"surumeotoko","slug":"surumeotoko","avatar_url":"avatars/1998672.png?_=f80806124869b4f5","is_superuser":false,"is_staff":false},"post_date":1647498531,"body":"In conclusion asahi is a perfect  bitch with inocence face lol"},{"id":2396751,"gallery_id":393760,"poster":{"id":1675417,"username":"ilikecutedj","slug":"ilikecutedj","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647391642,"body":"Wait, what happened between Asahi and the glasses guy? The cringe bad boy in the first story is like an incel's idea of what a Chad is like. Although there really are some stupid women out there who spread their legs to this kind of scum. And the MC is a boring self-insert, a type of character I hate.  I don't like this, the brothers are hotter. I'll just pretend this isn't canon.\n"},{"id":2394509,"gallery_id":393760,"poster":{"id":2680933,"username":"one big shot","slug":"one-big-shot","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1647279300,"body":"What a pointless entry for this story."},{"id":2392053,"gallery_id":393760,"poster":{"id":3409589,"username":"Jack Heidelberg","slug":"jack-heidelberg","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647171647,"body":"Aside from these girls becoming hoes and y'all arguing which dick is bigger, much respect for the second guy. Literally the only thing I hate from the last chapter is how pathetic the younger brother is in the last chapters. Like dude, stop crying about it, fucking find another girl. There's bigger fucking fish, let your brother have your friend. Don't cry over and move away just because your friend became your brother's girlfriend. What did you do all this time? I don't see you hitting her. This second guy gets it. Just move on and literally nothing will happen. I feel like even if Honda became a full time whore, he'll just find another girl. Man's got a free pussy before having a genuine relationship."},{"id":2390653,"gallery_id":393760,"poster":{"id":5079343,"username":"ritsukakun","slug":"ritsukakun","avatar_url":"avatars/5079343.png?_=03376c7fd8ae292d","is_superuser":false,"is_staff":false},"post_date":1647112639,"body":"Now i hate Asahi Honda , seriously "},{"id":2387658,"gallery_id":393760,"poster":{"id":2165628,"username":"Roshan_","slug":"roshan_","avatar_url":"avatars/2165628.png?_=c0577f81aa467169","is_superuser":false,"is_staff":false},"post_date":1646959161,"body":"bruh, an optimistic mindset indeed"},{"id":2386304,"gallery_id":393760,"poster":{"id":4765015,"username":"Yaya11","slug":"yaya11","avatar_url":"avatars/4765015.png?_=cb46c02007834eae","is_superuser":false,"is_staff":false},"post_date":1646893095,"body":"I love how Mei looks sadly she ended up becoming a hoe"},{"id":2386115,"gallery_id":393760,"poster":{"id":3045412,"username":"GigaHorni","slug":"gigahorni","avatar_url":"avatars/3045412.png?_=21eb32ebe98b95d8","is_superuser":false,"is_staff":false},"post_date":1646885729,"body":"Wait what? How did Honda become virgin again? "},{"id":2384787,"gallery_id":393760,"poster":{"id":4787624,"username":"darkness928","slug":"darkness928","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646829641,"body":"Bud also simping for a woman is a bad but having a fking porn addiction that fk up ur brain is kinda at the same level \n"},{"id":2384780,"gallery_id":393760,"poster":{"id":4787624,"username":"darkness928","slug":"darkness928","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646829398,"body":"\nBeta spotted? and also u just admitted u fapped to a fking hentai picture that kinda pathetic if u ask me not to mention u think u some kind of fking superior being also that society thingy I talk about is not bs it just ur too stupid to understand it lmao how about u did a little research where those alpha and beta come from before you bullshitting yourself thinking You actually know wtf ur talking about mate ? Simping is bad but fapping to a fking picture are kinda the same because both can’t get the lady oh wait at first aren’t there only alpha and beta then after a while they put sigma in it even tho it is just a meme people like u actually take it seriously lmaooooo you know soo little about the world first off all you don’t need to work ur asses off if u are born in a wealthy family you can call them beta or whatever bullshit u can bring but they still get the girl and u don’t also they could easily get rid of any “alpha” male who work themselves to the top since they hav money"},{"id":2384727,"gallery_id":393760,"poster":{"id":2645227,"username":"NotSimp","slug":"notsimp","avatar_url":"avatars/2645227.png?_=873a9387e74dbb94","is_superuser":false,"is_staff":false},"post_date":1646826995,"body":"Beta spotted below. I rather fap all day everyday than go simping to get some pussy. He also brought up the system society bs. If anything there are some betas even the people on top, and there are alphas and sigmas on bottom. Some people are just lucky to be born wealthy and shit, but beta af. Alphas and sigmas work their way up no matter how below in life they are on. "},{"id":2382356,"gallery_id":393760,"poster":{"id":4787624,"username":"darkness928","slug":"darkness928","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646740132,"body":"It funny how most of the people here talking about alpha and beta with their pseudo science(proven false many times) that based on a research about wolves living in a zoo which should how beta and stupid they are it also funny how the people who usually bring this type of simple social hierarchy usually always imagine they’re on top of the hierarchy  just like how these idiots who talk about beta and alpha saying stuff about other people but they themselves wasting times literally fapping or reading to a fking Japanese porn while talk shit to other people thinking they’re some sort of superior being or sth”while reading hentai lmao” also for the guy name not a simp apparently the system of society only work because of what u soo called beta because the people on top need to relied on beta to protect their wimpy asses and work hard for society to work if everyone is let just say “rich” without those who wanted money since everyone is already rich society will collapse within a day "},{"id":2382186,"gallery_id":393760,"poster":{"id":2645227,"username":"NotSimp","slug":"notsimp","avatar_url":"avatars/2645227.png?_=873a9387e74dbb94","is_superuser":false,"is_staff":false},"post_date":1646730531,"body":"Damn I wish for beta males to disappear more than hoes to disappear, cos someday Imma get myself some hoes. And if all males are alphas or sigmas, we're gonna have a better world. "},{"id":2381761,"gallery_id":393760,"poster":{"id":590651,"username":"Dr Free","slug":"dr-free","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646711255,"body":"@homdoka and everything onwards refutes it. Dude just thinks he liked it, and the girl liked someone else. He thought MC just felt rejecte, not that got her brains fucked out of her in a swinging experience with the two brothers lmao.\nHe even thinkis this ws her first. He basically consoled her without knowing the full story, and you can tell, by her face, that she accepted it as \"oh, so it's acceptable to be this trashy\"\nDude's a literal captain save a 304, picking up the brothers' leftovers, thinking he won the lottery, and not letting her process what she did wrong and how to fix it. That's actually normal. Since there's always a man willing to take her, a woman wouldn't even need to think \"Maybe I'm int he wrong. Maybe the relationship could've gone differently\" and learn from her mistakes.\nIn the end, she'll never respect this guy, be misserable and/or cheat on him sooner or later."},{"id":2381068,"gallery_id":393760,"poster":{"id":2886033,"username":"Gelbanana","slug":"gelbanana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646677868,"body":"So... This act as a prequel to this? \nhttps://nhentai.net/g/333496/"},{"id":2380603,"gallery_id":393760,"poster":{"id":576054,"username":"nishizawa","slug":"nishizawa","avatar_url":"avatars/576054.png?_=200326e9d5a364ea","is_superuser":false,"is_staff":false},"post_date":1646660177,"body":"1st part is prequel, 2nd part is sequel, that blonde slut already broken from the start, that long haired still broken after the MC transfered, i think she doesn't feel sorry at all. typical real girl, those bullshit she said just to attract guy"},{"id":2376990,"gallery_id":393760,"poster":{"id":4563314,"username":"vyummy","slug":"vyummy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646568474,"body":"wait is this the prequel or sequel"},{"id":2376859,"gallery_id":393760,"poster":{"id":4402180,"username":"Lovecraft's UighurMan","slug":"lovecraft-s-uighurman","avatar_url":"avatars/4402180.png?_=a7ee948df2eaadb3","is_superuser":false,"is_staff":false},"post_date":1646559662,"body":"God hate whores and so do I. "},{"id":2376827,"gallery_id":393760,"poster":{"id":1652256,"username":"Jeanne d'Arc","slug":"jeanne-d-arc","avatar_url":"avatars/1652256.png","is_superuser":false,"is_staff":false},"post_date":1646558467,"body":"Guys here a simple tips. If you ever encounter stuff like this. Just remember, Cyanide is pretty cheap. Slip it into the brothers drink or anyone that fuck you up and watch them slowly die. After that, bring the girls and rape them infront of those dead bodies."},{"id":2376697,"gallery_id":393760,"poster":{"id":565657,"username":"Kuroh143(Anastasia Nikolaevna)","slug":"kuroh143-anastasia-nikolaevna","avatar_url":"avatars/565657.png","is_superuser":false,"is_staff":false},"post_date":1646551803,"body":"dats it? they just made the first guy/mc suffered then throws him away after? no fcking revenge or guilty consequence/toruture for these two bitches who made his life miserable??????!!!!!!!!"},{"id":2376264,"gallery_id":393760,"poster":{"id":2703910,"username":"gokuzkai","slug":"gokuzkai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646531102,"body":"Wow I usually don't mind ntr but this series makes me want to shoot the author. You know what i'm gonna find him and make sure he writes a happy ending for my boi the first mc."},{"id":2376226,"gallery_id":393760,"poster":{"id":2618742,"username":"EscanorLeBeau","slug":"escanorlebeau","avatar_url":"avatars/2618742.png","is_superuser":false,"is_staff":false},"post_date":1646528742,"body":"cluster fuck series. so, the girls are just going around with different guys? the girls are just friends with benefits with the senpai, so theres no actual ntr?"},{"id":2374620,"gallery_id":393760,"poster":{"id":4671454,"username":"Fellow Daoist Gu","slug":"fellow-daoist-gu","avatar_url":"avatars/4671454.png?_=53316f89f23a93c5","is_superuser":false,"is_staff":false},"post_date":1646452300,"body":"Why is this even NTR ?\nGirl got rejected so fucked with another guy.\n\nLooser guy got a gf and happily fucked.\nWhere is ntr ?"},{"id":2374601,"gallery_id":393760,"poster":{"id":4480917,"username":"LOLwhatyouexpect","slug":"lolwhatyouexpect","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1646451430,"body":"The author is trying way too hard to humiliate the mc that its hilarious. "},{"id":2374516,"gallery_id":393760,"poster":{"id":4095882,"username":"KALIAN SEMUA KONTOL","slug":"kalian-semua-kontol","avatar_url":"avatars/4095882.png?_=825bc463812f391f","is_superuser":false,"is_staff":false},"post_date":1646446942,"body":"I hope asahi and mei somehow met the prev MC and the prev MC become Chad or some shit\n"},{"id":2373025,"gallery_id":393760,"poster":{"id":3350578,"username":"homdoka","slug":"homdoka","avatar_url":"avatars/3350578.png?_=239281a285366460","is_superuser":false,"is_staff":false},"post_date":1646375144,"body":"Page 37 shows how the previous MC was just a fucking spiteful loser 10/10"},{"id":2371750,"gallery_id":393760,"poster":{"id":4549190,"username":"David10101","slug":"david10101","avatar_url":"avatars/4549190.png?_=a05880a2adff17d6","is_superuser":false,"is_staff":false},"post_date":1646321393,"body":"So unrealistic but yeh"},{"id":2371698,"gallery_id":393760,"poster":{"id":2177697,"username":"Dexix","slug":"dexix","avatar_url":"avatars/2177697.png?_=d48b85185cf64c62","is_superuser":false,"is_staff":false},"post_date":1646319759,"body":"Man fuck both Honda and Asahi, bring back my man Kido. I'll stay by his side until the end."},{"id":2371606,"gallery_id":393760,"poster":{"id":1636058,"username":"okita_tbc","slug":"okita_tbc","avatar_url":"avatars/1636058.png?_=bebad57dd966ea6a","is_superuser":false,"is_staff":false},"post_date":1646316444,"body":"Fuck they're all bitch it's the final conclusion"},{"id":2371003,"gallery_id":393760,"poster":{"id":3381423,"username":"Gekizoku","slug":"gekizoku","avatar_url":"avatars/3381423.png?_=85a79fc8c8450549","is_superuser":false,"is_staff":false},"post_date":1646292115,"body":"I need more"},{"id":2368453,"gallery_id":393760,"poster":{"id":2446464,"username":"Udon","slug":"udon","avatar_url":"avatars/2446464.png?_=587cb4b437b4b08b","is_superuser":false,"is_staff":false},"post_date":1646169222,"body":"Well rip for the previous mc, only mention, i guess he is still depressed hope the new mc doesnt become the new victim of dat girl"},{"id":2368259,"gallery_id":393760,"poster":{"id":2681344,"username":"weeb_virtuoso","slug":"weeb_virtuoso","avatar_url":"avatars/2681344.png?_=357201844897582d","is_superuser":false,"is_staff":false},"post_date":1646161873,"body":"If this series continues, we might get a chance to see previous MCs comeback as a Chad(?)"},{"id":2368105,"gallery_id":393760,"poster":{"id":876776,"username":"kamitokaryusai","slug":"kamitokaryusai","avatar_url":"avatars/876776.png","is_superuser":false,"is_staff":false},"post_date":1646156004,"body":"Yep, Black hair girl is clearly not enjoying it as much as the new boyfriend. It's just a matter of time before she moves on to a new guy. \n\nSad to see what happened with the blonde girl though. She was taken advantage of in a emotional moment and then branded as a slit by the general community "},{"id":2367997,"gallery_id":393760,"poster":{"id":4619828,"username":"A-san","slug":"a-san","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646151881,"body":"@Destroyer of shitty hentai : If you think the new MC is the victim then we all are \"Asahi's\" victims. Like I said, if you're ever into grownup relationships then you'll experience some BS like \"Eh, but I don't know such things like...\" sooner or later haha."},{"id":2367553,"gallery_id":393760,"poster":{"id":4159968,"username":"Layer Cake","slug":"layer-cake","avatar_url":"avatars/4159968.png?_=d435465a76f0ca4b","is_superuser":false,"is_staff":false},"post_date":1646127322,"body":"Great art, everything else? Not so much. We get a taste of mei when she was pure, compared to how we see her afterwards...its night and day. Then we see character redemption for the glasses bitch...where she got zero repercussions. Unlucky, too bad we got no further closure with the previous mc."},{"id":2366667,"gallery_id":393760,"poster":{"id":1373112,"username":"sennoden","slug":"sennoden","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646089702,"body":"I hate this, personal salvation for the woman who took advantage of someone then had sex with his brothers right in front of him, and almost nothing about the previous MC"},{"id":2366448,"gallery_id":393760,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1646077556,"body":"It's weird, this series gets me a bit infuriated with the characters' personalities. Like, they are all garbage human beings, including the previous MC. Only thing holding me off from flipping is the art cuz I really like it."},{"id":2365975,"gallery_id":393760,"poster":{"id":3199663,"username":"harmonygirl23","slug":"harmonygirl23","avatar_url":"avatars/3199663.png?_=4e07f0fc696e8488","is_superuser":false,"is_staff":false},"post_date":1646058446,"body":"@4rpon yeah i too think what she done pretty stupid and acted like easygoing girl who  hooked on fine face and big dick, yes she loved that guy, just cause of how he looks, his body  and what he charismatick \"cool\" boy, and he just played with her and she dont get it, but now i hope she not doing such mistakes and be faithful)"},{"id":2365966,"gallery_id":393760,"poster":{"id":3199663,"username":"harmonygirl23","slug":"harmonygirl23","avatar_url":"avatars/3199663.png?_=4e07f0fc696e8488","is_superuser":false,"is_staff":false},"post_date":1646057966,"body":"first guy here is for sure just a player, find her broken after being rejected and make her sexually addicted to his dick, i hope second guy with girl from first part will be going well and some dickhead \"alpha\" dont ruin this"},{"id":2365582,"gallery_id":393760,"poster":{"id":985618,"username":"Gambino","slug":"gambino","avatar_url":"avatars/985618.png","is_superuser":false,"is_staff":false},"post_date":1646037237,"body":"As usual, the real problems in NTR are the women."},{"id":2365549,"gallery_id":393760,"poster":{"id":2383965,"username":"kl4w","slug":"kl4w","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646035841,"body":"The Previous MC was greatly insecure, he was always compared to both his older brother and younger brother. He was the failure, the missing link so it was hard for him to find solace at home. When the events in the previous chapters happened he was shaken and had nobody to turn to. He was alone and isolated. His brothers who should have been there for him were the cause of his problems and he had no friend. \nThe new MC doesn't seem to have that kind of background so he could easily say that the previous MC was a Wuss but i d'ont think he could have better had they switched place. It's like raiding a multiplayer boss game alone and without preparation: you are doomed to fail.\nPersonnaly, i hope the author will write a sequel about the previous MC finding happiness because with the brothers he had he doesn't need enemies."},{"id":2365540,"gallery_id":393760,"poster":{"id":2128419,"username":"4rpon","slug":"4rpon","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646035561,"body":"Damn I feel bad for the new mc, he doesn't really know shit about Asahi"},{"id":2365428,"gallery_id":393760,"poster":{"id":3209161,"username":"NoSoupRice","slug":"nosouprice","avatar_url":"avatars/3209161.png","is_superuser":false,"is_staff":false},"post_date":1646031187,"body":"pretty cool extension to the original story"},{"id":2364944,"gallery_id":393760,"poster":{"id":4049,"username":"qohank","slug":"qohank","avatar_url":"avatars/4049.png?_=79837ed153a5ed25","is_superuser":false,"is_staff":false},"post_date":1646011668,"body":"So Mei is already a slut before and asahi got dumped by the student Council president? "},{"id":2364818,"gallery_id":393760,"poster":{"id":3276841,"username":"hentusiast","slug":"hentusiast","avatar_url":"avatars/3276841.png?_=869456bfa6168d6c","is_superuser":false,"is_staff":false},"post_date":1646006795,"body":"@knightsabre2k older brother just moved on with his life, nobody dumped anyone, they were just having fun together. Tho I dunno how her new bf thought she was inexperienced when she literally went full vacuum on his dick."},{"id":2364743,"gallery_id":393760,"poster":{"id":240313,"username":"knightsabre2k","slug":"knightsabre2k","avatar_url":"avatars/240313.png","is_superuser":false,"is_staff":false},"post_date":1646003217,"body":"err... what happened to the older brother Asahi was fucking? I'm pretty sure she got dumped but it's just a little surprising that he was never mentioned & the previous MC was. There's just such a huge disconnect from the ending of the last part and the beginning of the afterstory..."},{"id":2364699,"gallery_id":393760,"poster":{"id":3436051,"username":"Pervertlover2020","slug":"pervertlover2020","avatar_url":"avatars/3436051.png?_=d7428415c2e27985","is_superuser":false,"is_staff":false},"post_date":1646000792,"body":"The guy after Asahi it bit realist but I wonder what would happen if find out what really happen he not like the pre Mc who get upset over the girl he like fuck a guy well his case if was random guy he might of handle it but his own brother fuck the girl he like that would make anyone bit unsettling, the bro would have know the Mc like her and still went after them. It will make cool chap if the next one is where they run into the pre Mc or Mc bro that the new Mc know the type they are becuz when I read the first chap to end I felt sad for the Mc becz he was just trying bond with the girl he just like new Mc goes through all this joining the club ect to get close her, Mc did same and look how that turn out"},{"id":2364684,"gallery_id":393760,"poster":{"id":3300942,"username":"SaikiK","slug":"saikik","avatar_url":"avatars/3300942.png?_=5b3940345b3bbf58","is_superuser":false,"is_staff":false},"post_date":1645999650,"body":"Lol both girls are hoes just in different ways. Even if Asahi felt bad she could've just reached out to old MC to make amends. Kinda funny this new MC just got inserted out of nowhere into both girls' story but I'm guessing it was an attempt to be vanilla by the author and show that old MC could've done better. However it was a whole different situation imo for both MCs. Only favoriting this to remember this shit story. Now gonna go nut to good NTR"},{"id":2364485,"gallery_id":393760,"poster":{"id":287357,"username":"bluemorpho99","slug":"bluemorpho99","avatar_url":"avatars/287357.png","is_superuser":false,"is_staff":false},"post_date":1645990466,"body":"yeah girls are bitch in this, but i want the previous mc's brothers got karma because they did it before just to mock the prev mc!? bruh dont get me wrong....i hate mc being an idealistic coward but i want his brothers reputation whatsoever got fucked up in some ways...."},{"id":2364476,"gallery_id":393760,"poster":{"id":5043529,"username":"castrix0","slug":"castrix0","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645989944,"body":"The sequel may implies that the previous MC maybe already moved on and the event that happened before just a story in his life"},{"id":2364459,"gallery_id":393760,"poster":{"id":4495884,"username":"lytkhs","slug":"lytkhs","avatar_url":"avatars/4495884.png?_=e0da428d1f22b1ab","is_superuser":false,"is_staff":false},"post_date":1645989428,"body":"Hey can someone recommend me something similar to this but the MC has a good ending"},{"id":2364424,"gallery_id":393760,"poster":{"id":292032,"username":"maxterminator","slug":"maxterminator","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645988077,"body":"Great story Arc!👏👏👏👏👏"},{"id":2364423,"gallery_id":393760,"poster":{"id":3439768,"username":"Curiosity Killed the Cat","slug":"curiosity-killed-the-cat","avatar_url":"avatars/3439768.png?_=87994e8693e8071a","is_superuser":false,"is_staff":false},"post_date":1645988044,"body":"Oh... So the reason why Mei is innocently easy because she's, well easy... As for Asahi, yep, what a development, lol. Now she's seeking comfort. I guess the brothers dump possibly both of them. Man, the brothers really did it just to mock the MC, huh? Kinda scary that if you think about it, if we never know what Asahi did, we'll easily pass it as a vanilla series. Also this chapter still mocks the MC for not being able to get laid since it was this easy to do so. The worst part is, her interaction with the new bf washed away her guilt and turned it into \"yeah, it's his fault and decision to transfer\" jesus christ that's fucking horrible. You would think that at least she will be burdened by guilt but nope, she's fine like nothing ever happened"},{"id":2364283,"gallery_id":393760,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1645982124,"body":"Lmao A-San only a simp would look at Asahi and say good for her. While it’s true prev MC somewhat forced his thoughts on her, they were in no way in an extremely toxic fashion, while the brothers immediately passed her on to each other without even warming her up to the idea and treated both girls like semi shit"},{"id":2364141,"gallery_id":393760,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645976713,"body":"Dam had to comment again on this bs, why she had to lie in the first place?, man i hope the author makes a another one with senpai taking advantage of asahi by letting the student council upperclassmen gangbang her and when he graduated he ghost her and rumors spread the she a slut and thats why she acting all innocent, that will be nice"},{"id":2364139,"gallery_id":393760,"poster":{"id":2275623,"username":"Destroyer of shitty hentai","slug":"destroyer-of-shitty-hentai","avatar_url":"avatars/2275623.png?_=a19964f266a4376a","is_superuser":false,"is_staff":false},"post_date":1645976665,"body":"A-san \nIt will be interesting if you are one of her victim"},{"id":2364131,"gallery_id":393760,"poster":{"id":4619828,"username":"A-san","slug":"a-san","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645976231,"body":"This one is a prequel and a sequel at the same time. Mei is a non-virgin gyaru who had relationships with many boys and Asahi is very cunning as she's probably using the previous MC to get the prez. Why is this series was counted as NTR is beyond me as this shows both girls have NO feelings whatsoever to the previous MC in the first place. And good for Asahi. She gets laid and got rid of a freak who think what's best for her and trying to forced his way on her. Anyway, IMO Asahi is very realistic as most grownup girls nowadays are just like her haha. \"Eh, I don't know...\" my arse."},{"id":2364076,"gallery_id":393760,"poster":{"id":4371740,"username":"ghostdick","slug":"ghostdick","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1645973563,"body":"hi i wrote a short fic about this series in wattpad on my take of the first mc's after story\nhttps://www.wattpad(com)/1124872989-eromanga-fanmade-endings-333496-369395"},{"id":2364074,"gallery_id":393760,"poster":{"id":485357,"username":"up234","slug":"up234","avatar_url":"avatars/485357.png?_=703e4af9433b0161","is_superuser":false,"is_staff":false},"post_date":1645973557,"body":"aw happy endings are great"},{"id":2364032,"gallery_id":393760,"poster":{"id":4291533,"username":"igorheadshot","slug":"igorheadshot","avatar_url":"avatars/4291533.png?_=a261fa5485ca351c","is_superuser":false,"is_staff":false},"post_date":1645970988,"body":"Think with me guys, this chapter for me only served to think that the first mc didn't have a bad end at all, even though he's alone now at least he freed himself of the toxic brothers and the toxic whores. \"Better alone than bad accompanied\". While the blonde will probably become a public toilet the other simp will definitively be a nice cuckold in the future with this \"beatiful virgin pure\" girlfriend he got."},{"id":2363952,"gallery_id":393760,"poster":{"id":598905,"username":"roronoa007","slug":"roronoa007","avatar_url":"avatars/598905.png","is_superuser":false,"is_staff":false},"post_date":1645967830,"body":"what a bitch. she lied that she was a virgin"},{"id":2363910,"gallery_id":393760,"poster":{"id":3624054,"username":"gumtoy","slug":"gumtoy","avatar_url":"avatars/3624054.png?_=ad3ee98e07cc2a9d","is_superuser":false,"is_staff":false},"post_date":1645966393,"body":"I'm confused, are the two girls here the same characters on the other one? "},{"id":2363881,"gallery_id":393760,"poster":{"id":4005124,"username":"Professor Monke","slug":"professor-monke","avatar_url":"avatars/4005124.png?_=1f306761978213e1","is_superuser":false,"is_staff":false},"post_date":1645964763,"body":"my dick is confused :("},{"id":2363809,"gallery_id":393760,"poster":{"id":11439,"username":"yasoopwest","slug":"yasoopwest","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645961091,"body":"I am sorry if i use bad english, but this story is a S. H. I . T. "},{"id":2363792,"gallery_id":393760,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645960430,"body":"Ok i read thru this time, yea this girl a fuckin bitch. She played the guy making him think she a virgin. Shit she did not even like the sex by the face she made, what a fucking skank. She making the rds to find a dick that up to par with senpai's since he ditch her stupid ass"},{"id":2363777,"gallery_id":393760,"poster":{"id":4176519,"username":"ryushiki","slug":"ryushiki","avatar_url":"avatars/4176519.png?_=48e1549a4d640cbf","is_superuser":false,"is_staff":false},"post_date":1645959825,"body":"I’d much rather see the poor dude cucked by his brothers finally get a happy end than a fake redemption arc for Honda the whore who’s not even telling the truth about what happened."},{"id":2363759,"gallery_id":393760,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645959095,"body":"Wow did not expect this and glasses girl felt bad after all but she got over it lol"},{"id":2363754,"gallery_id":393760,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1645958998,"body":"well, i just wanted to say. in my point of view, these bitches don't deserves happiness. in any way."},{"id":2363742,"gallery_id":393760,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1645958594,"body":"what the fuck is this? where is justice for that guy. well they didn't had any relationship. still she knows that she hurt him and more, she know that those brothers only wanted to fuck them. and now this simp desperately want some pussy so. he comforts her telling it's okay. Russia just drop a bomb on them hoe's. not poor Ukraine."},{"id":2363628,"gallery_id":393760,"poster":{"id":2033391,"username":"strakhbr","slug":"strakhbr","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645954726,"body":"Asahi is the type of girl that'll be forever a bitch"},{"id":2363627,"gallery_id":393760,"poster":{"id":2075139,"username":"Xson","slug":"xson","avatar_url":"avatars/2075139.png","is_superuser":false,"is_staff":false},"post_date":1645954724,"body":"i hope there will be continuation of this story from ntr consequencess"},{"id":2363624,"gallery_id":393760,"poster":{"id":2075139,"username":"Xson","slug":"xson","avatar_url":"avatars/2075139.png","is_superuser":false,"is_staff":false},"post_date":1645954546,"body":"In mc's perspective those girls should mean less than dirt to him, you can always move on from strangers, but his brothers are the worst kind of trash ever, after what they did to him he should no longer consider them as brothers."},{"id":2363620,"gallery_id":393760,"poster":{"id":2492878,"username":"weidenfeller","slug":"weidenfeller","avatar_url":"avatars/2492878.png?_=974e29a10785b192","is_superuser":false,"is_staff":false},"post_date":1645954398,"body":"So we got a prequel and epilogue in one manga? Nice"},{"id":2363526,"gallery_id":393760,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1645951747,"body":"Tbh I still kinda feel bad for Mei but Asahi’s still a huge cunt for not realizing or caring that the middle brother has a horrible life and she kinda tipped the edge. Tho newboy is somewhat correct that the middle brother should try and move on, the truth is that sort of mental state isn’t so easy to maintain when you have no support or pillars"},{"id":2363425,"gallery_id":393760,"poster":{"id":2855651,"username":"buttface69","slug":"buttface69","avatar_url":"avatars/2855651.png?_=05a005ecee10d8ec","is_superuser":false,"is_staff":false},"post_date":1645948884,"body":"I dont get it? Is this a continuation?."},{"id":2363306,"gallery_id":393760,"poster":{"id":2266050,"username":"etohno","slug":"etohno","avatar_url":"avatars/2266050.png?_=81999eeef22f6350","is_superuser":false,"is_staff":false},"post_date":1645945810,"body":"this \"after\" is making me happy. at least it's I expect they to be"},{"id":2363284,"gallery_id":393760,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645945171,"body":"\"Pure\" bitches are the most pain in the ass to deal with, better avoiding them at all costs. Anyway, sad for Mei, she wasn't as bad as she was too on the previous chapters, casual sex partner at best, who can blame her to take what is in front of her, slut or not, she's young."},{"id":2363204,"gallery_id":393760,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1645942143,"body":"In the end there is no justice for the midle brother who suffering and trasfer to another house and another school. Poor guy..."},{"id":2363161,"gallery_id":393760,"poster":{"id":3668138,"username":"SwimmingSaucer","slug":"swimmingsaucer","avatar_url":"avatars/3668138.png?_=088ea28414845f25","is_superuser":false,"is_staff":false},"post_date":1645940155,"body":"For those that are confused, the Mei part is a prequel and the Honda part is a sequel."},{"id":2363150,"gallery_id":393760,"poster":{"id":4904714,"username":"youneverknow117","slug":"youneverknow117","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645939959,"body":"https://docs.google.com/document/d/1fPCJkX-StwIueFqL47BB_xhFYBWvgQqWmVe0QUlIZSU/edit This is the link to my book, remember y’all you gotta request me to read. Secondly this is just a draft but if I get enough attention I’ll post it on Wattpad or something. "},{"id":2363141,"gallery_id":393760,"poster":{"id":3397735,"username":"<3DarkSkinGyaruLover<3","slug":"3darkskingyarulover-3","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1645939694,"body":"Is this a continuation or something cuz in the prior work “i dont get pussy in my own home” mei is hella horny while asahi has some reservations but based on later part asahi becomes a how and Mei is a nymph but the douche bragged and showcased her as a easy belt stat"},{"id":2363033,"gallery_id":393760,"poster":{"id":4477832,"username":"BigJB69","slug":"bigjb69","avatar_url":"avatars/4477832.png?_=499d11f31fcab039","is_superuser":false,"is_staff":false},"post_date":1645934882,"body":"Asahi is one manipulative bitch kek. She is clearly playing with the \"pure girl\" thing with him. Once she find someone, she will jump into that dick in no time"},{"id":2363025,"gallery_id":393760,"poster":{"id":3778862,"username":"rengarkekw","slug":"rengarkekw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645934379,"body":"@youneverknow117 tell us where to read it bro y can't just mention it and leave without a link"},{"id":2363010,"gallery_id":393760,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645933978,"body":"@randompusssda i agree with you she deserve worst but in the end she's the \"pure\" girl while Mei is the \"slut\""},{"id":2363002,"gallery_id":393760,"poster":{"id":4935385,"username":"localsneed38","slug":"localsneed38","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645933664,"body":"@youneverknow117 uhh you can't just mention that and not drop your link. The aoc fanfic below is pretty good but I wanted more fallout with the glasses girl."},{"id":2362995,"gallery_id":393760,"poster":{"id":4504164,"username":"Unravel503","slug":"unravel503","avatar_url":"avatars/4504164.png?_=ba48be55496d36eb","is_superuser":false,"is_staff":false},"post_date":1645933293,"body":"Sometimes when I read this kinda doujin, I thought, \"Hold urself together. Its all just a human fantasy on paper.\" But my heart always said, \"Everything you just saw, came from the deepest part of every human. You didn't even know if this might actually happen already, somewhere. And that person trying so hard to free from this hell circle.\""},{"id":2362984,"gallery_id":393760,"poster":{"id":4904714,"username":"youneverknow117","slug":"youneverknow117","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645933077,"body":"Honestly while I hate this story, I gotta thank it for giving me the idea to write my story “My Neighbor in Black” granted it’s not the same ntr timeline it did help get an idea of what happened after someone is ntr’d. So thank your Benimaru Karu"},{"id":2362981,"gallery_id":393760,"poster":{"id":3294887,"username":"bitc560","slug":"bitc560","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645932916,"body":"Mei got rumor she is slut but she didn't do that. Mei is pure. The boy who is she confess got rejected due to boys bad mouthing her until the boy she love misunderstanding that mei is slut. To the hell their for badmouth mei\n\nAsahi got dumped cause she is swirl by the playboy before. In the end she becomes slut cause of previous fake boyfriend\n\nBoth asahi and mei pure. But in the end the bad boy is destroy their dignity. Well, that's how world it works"},{"id":2362979,"gallery_id":393760,"poster":{"id":94345,"username":"SakuyaShirase","slug":"sakuyashirase","avatar_url":"avatars/94345.png","is_superuser":false,"is_staff":false},"post_date":1645932880,"body":"Bruh, Asahi character is realistic tbh. I lying bitch just to seem like the victim. If she told everything that happened the dude would have a way diferente opinion lmao "},{"id":2362967,"gallery_id":393760,"poster":{"id":3778862,"username":"rengarkekw","slug":"rengarkekw","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645932418,"body":"Heh the Mc gained more than he lost in the end"},{"id":2362964,"gallery_id":393760,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645932331,"body":"So in the end Mei was just a dump girl who get deceived easily and asahi is the real bitch here, probabily she will ntr the new boyfriend too in time"},{"id":2362897,"gallery_id":393760,"poster":{"id":3893500,"username":"xXUtHiNkUnOmEXx","slug":"xxuthinkunomexx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645929352,"body":"Curious about the MC? You can find him here... 👇\n\nhttps://archiveofourown.org/works/33892285/chapters/84648871"},{"id":2362776,"gallery_id":393760,"poster":{"id":3668138,"username":"SwimmingSaucer","slug":"swimmingsaucer","avatar_url":"avatars/3668138.png?_=088ea28414845f25","is_superuser":false,"is_staff":false},"post_date":1645924193,"body":"I love seeing more of these two."}]