[{"id":2364747,"gallery_id":393790,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1646003437,"body":"@palalo: Still unsure about Kana. The first time he did it without the hypnosis option, she did panic because she’s having sex with another guy, but in the end she quite enjoys it herself. Likewise in this episode too, she told Aki she is happy about being called. But it’s not like she totally throw away her fiancé, at least the story doesn’t mention how it affect their relationship. At least, in the end of part 1, he asks her when is her marriage, and in this one he congratulated her like a friend. Also, all the girls are “aware” of the call girl thing. He even got a chat group suddenly made with all the girls in it. That’s where Aki asks him to call her at the end of part 1 (because she’ll take the job instead of Kana who is preparing to get married). "},{"id":2364504,"gallery_id":393790,"poster":{"id":4779391,"username":"Marzasevira","slug":"marzasevira","avatar_url":"avatars/4779391.png?_=01d3fe6d18de117a","is_superuser":false,"is_staff":false},"post_date":1645990933,"body":"I hope this get a translated, this is soo good"},{"id":2364403,"gallery_id":393790,"poster":{"id":1882081,"username":"palalo","slug":"palalo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1645987243,"body":"@minminazusa ohh, nice to know. So thats whats going on"},{"id":2363507,"gallery_id":393790,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1645951322,"body":"A surprise in the end there. Back at school, Katou once found out Akiyo is about to send love letter to her senior in swimming club. He secretly steal the love letter, ruining her confession. He also said, it's fun to ruin someone else's plan. But in the end, Kana asks if he likes Aki, because she saw him steal the letter. He remembered hearing that senior said he just want to have sex with Aki, have her introduce Kana, then break up. Yeah, it's fun to ruin someone else's plan, especially of an asshole. The girls also only heard later about that senior's bad reputation and he even dropped out of school, so in a way, Kana is thankful for him. Aki also broke up with her boyfriend in office, but sounds like nothing to do with sex (like, he just casually goes \"how about we came to my place for our next date? it's too much trouble to go out anyway, and my place could do with some cleaning up\")"}]