[{"id":2389173,"gallery_id":393710,"poster":{"id":5124556,"username":"johnnnddkdxkddk","slug":"johnnnddkdxkddk","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647036606,"body":"I cannot jerk off to metroid anymore, knowing yandev jerked off to it while making his game. He might be jerking off to this as of now I'm writing this."},{"id":2383925,"gallery_id":393710,"poster":{"id":998109,"username":"redeagles1","slug":"redeagles1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646785977,"body":"Zero mission came and since then we have had bunch of shit regarding her portrayal, first they gave her the spandex blue suit that has stayed ever since and which propelled her porn and hentai by making that appearance more famous since its inclusion in the smash games, not only by sexifying her even more but also by being a better playable character than her regular counterpart, and in her games we've got: in zero mission she loses the armor  and it's uncapable of using it for no reason, then is showed to be a completely useless dumb blonde until she can get a new armor, in other M she is portrayed as a whiny, weak, useless bitch and her armor breaks down at every minor problem, in the very beginning even being hentaied by glasses federation scientist which allowed them to clone Metroids again, while they couldn't remove the armor neither in Fusion nor Prime 3, having to work around those times to help her, in Dread the explanations for some armor changes also are very stretched."},{"id":2383892,"gallery_id":393710,"poster":{"id":998109,"username":"redeagles1","slug":"redeagles1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646784213,"body":"Well there have been a lots of inconsistencies in the depiction of a lot of things over the years, in the first ones up to super metroid it was a \"the suit is tied to her life force so if the energy is depleted, is not that the suit just brokes and fails but that she dies\", in fusion it was \"since the parasite infected her she was supposed to be fused with her suit, so the doctors quirurgically removed parts of the suit and administered the vaccine giving her the new appearance\", but if she died inside it was showed that she was still a hot blonde, whe she fuses with SA-X at the end she recovered everything at that point and in the endings still looked like a Barbie. In the Prime games the tech about her suit was greatly explained including that her physiology is already a lot different from other humans because of what the chozo did to her since the beginning, making her capable of withstanding enviroments that would kill normal humans in an instant even without the suit."},{"id":2368180,"gallery_id":393710,"poster":{"id":1042679,"username":"willie29","slug":"willie29","avatar_url":"avatars/1042679.png","is_superuser":false,"is_staff":false},"post_date":1646158479,"body":"that suit is fused with her body at that point so that can't happen"},{"id":2363077,"gallery_id":393710,"poster":{"id":2110275,"username":"KIMOCHI","slug":"kimochi","avatar_url":"avatars/2110275.png","is_superuser":false,"is_staff":false},"post_date":1645936851,"body":"Idk man....."}]