[{"id":2384141,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646799488,"body":"@GoogleMeBitch Completely agree on Coach, though I'd say Yuki being the \"Judas\" would end up being a bad end for him because he'd definitely be going to jail for a good bit if word got out about them."},{"id":2382627,"gallery_id":394479,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1646753059,"body":"@BZo1480 yeah it was a cheap bait and switch in order to drum up interest for these chapters, fujiko obviously never had any intention to move the plot forward. The yuki is judas comparison was stupid because coach deserves a bad end and nothing can redeem him."},{"id":2379479,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646601767,"body":"@GoogleMeBitch Honestly, that's been my issue with everything, too. Can't have Yuki being all defiant in one chapter and then she's just like \"Do whatever you want\" the next. Guessing Niimi catches Yuki and Coach fucking at some point and she decides to confront Yuki about it, which could possibly lead to Yuki being the Judas that Fujiko alluded to via coming clean about their relationship to either the team or the school. Or not. Something obviously needs to happen to move shit forward, tho."},{"id":2379355,"gallery_id":394479,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1646595427,"body":"Seriously can this plot move any slower. The author was trying to convince us that yuki had some fight left in her but ofc that was going nowhere Zzzz. It's basically the same shit they constantly pull with shoma... he's angry one minute then it's forgotten the next. "},{"id":2376404,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646537982,"body":"As always, all credit for the summary goes to defan752 from EH."},{"id":2376403,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646537800,"body":"6/ Two hours ago, Shoma and Niimi are walking through a clothing store, which Coach and Yuki happen to also be in. Coach briefly glimpses them. Yuki is trying on a new dress for Coach, and says that \"it\" fits perfectly. Coach asks to see and reminds her that she is his \"thing\". Yuki parts her legs and reveals a vibrator in her pussy, which is what what she meant by \"fit perfectly\". Coach tries to push it fully inside, remarking that it's too big. She objects, but he says he's just trying to make sure it fits. After she climaxes, Coach gets up and takes her to pay for the shoes they bought. As they walk through the mall, Yuki notices that Coach is sneaking more and more touches of her a little at a time. He asks if she likes it, which she halfheartedly denies. He locks fingers with her, remarking how sweaty her hand is, as she endures the vibrator inside her."},{"id":2376395,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646537617,"body":"5/ She wonders why Yuki would do something like what she was doing when Shoma loves her that much. All of a sudden, Niimi catches herself brown-nosing again and stops herself, but Shoma chuckles and says that she really is good at compliments. Her mind made up, Niimi begins to tell Shoma what she saw, but just as she can say it, she is interrupted by a train announcement for Shoma's line. He asks her if she has something important to tell him, but she says no and to take care on the way back home. As he is leaving though, Niimi says that she will text him. Later, Shoma texts Niimi and requests that she keep the fact that he and Yuki are fighting to herself, which she agrees. She blushes at the prospect of Shoma trusting her with a secret. "},{"id":2376388,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646537432,"body":"4/ Embarrassed, Shoma says Niimi is good at giving compliments and he really feels like her senior when talking to her. Confused, Niimi replies Shoma is amazing, which earns her a flick on the forehead for giving a brown-noser. She apologizes, blushing. Throughout their day, Niimi keeps thinking back to how she needs to tell Shoma about Yuki, no matter what. She brings up Yuki. Shoma hesitates, then replies that they've been fighting, so they're giving each other some distance for now. Without going into details, Shoma blames himself for letting Yuki down, for putting her through so much pain, and for trying and failing to make up for it and being insensitive instead. He apologizes to Niimi for grumbling to himself and asks she forget it. Niimi points out that Shoma still loves Yuki that much, and points out that someone who is aware of someone else's pain can't be insensitive. She says that she's really happy that Shoma would help her as much as he has."},{"id":2376383,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646537249,"body":"3/ She pulls out her phone and prepares to text Shoma, but he calls her first. He needs to go shopping for club supplies and asks if she wants to go along. Niimi reminds herself that she needs to tell Shoma about what she saw. Shoma apologizes for taking her so far away because only the specialty store sells what he needs, but Niimi says she also needed cleats for her running shoes anyway. While they're in the store, Shoma talks about needing different lengths of cleats for different weather and different training conditions and asks Niimi what she needs. She only knows of the standard length cleats for their en-tout-cas track and didn't know there were others. Shoma responds that he gets tired easily with the standard length and needs shorter ones. Niimi is easily impressed: she says that she didn't even think of that and that she's learning a lot."},{"id":2376377,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646537061,"body":"2/ She concedes that she can be his \"thing\", but she can't respond to his feelings. Coach reminds her not to go back on her promise of becoming his \"thing\". As they kiss, Yuki thinks that the moment she really wants to go back to is further back than the start of the harassment, to when he was still a good mentor to her as her track coach and nothing else. At this moment, outside the car, someone is watching them both. It is Niimi. She sprints back home, stunned and frightened. She realizes that it hadn't been her imagination, and wonders why in the world her Coach and Maihama-senpai are doing that. Her mind races through various incidents, such as the anonymous whistleblower who posted online about Coach and Yuki's relationship, and she comes to the horrible realization that it all makes sense."},{"id":2376372,"gallery_id":394479,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646536874,"body":"Summary: In a flashback, Yuki recalls the first time Shoma offered to teach her how to run when they were kids. Back in the present, Coach shakes her awake in his car because they've arrived at her home. He remarks on how she probably can't sleep soundly next to a guy she can't forgive. Yuki points out that the reason she wasn't able to sleep last night was that he hadn't let her. She asks Coach if he meant it when he said he loved her. He hesitates, and responds, half. Yuki concludes that the alcohol had greatly influenced his words and actions. Coach says he knew that it would embarrass and upset her, so he wonders out loud why he had said it to her. At this, Yuki responds that at the beginning of all this, when Coach was bullying her, he hadn't seemed like his current self at all. He agrees. She says that she wants to turn back time to that moment."},{"id":2376080,"gallery_id":394479,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1646522011,"body":"Look at page 26! What a sloppy mess..."}]