[{"id":2379155,"gallery_id":394478,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1646588905,"body":"After reading the last chapter i thought the plot was moving at a snail's pace but it's actually worse than that it's going in fucking circles and the author is constantly pulling character 180s out of their ass. I'm starting to hope it gets cancelled because of how tedious it has become. @zombieadd yeah next chapter she will be all over coaches cock instead of doing the hunt and we will see little to none story progression yet again. 🙃Maybe just maybe we will have a big revelation that mindbreak and lust has turned to love😉"},{"id":2379024,"gallery_id":394478,"poster":{"id":3776613,"username":"ParGeo","slug":"pargeo","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646583572,"body":"The guy is dumb. There is nothing to say here. How can he say that she is his \"friend\"? She is a traitor. Renegade. He knows she's with a coach. Why would he want to get close to her?\nIt would be hilarious if she gets pregnant by a coach and ruins her career as an athlete. I'm waiting for everything to go downhill."},{"id":2378460,"gallery_id":394478,"poster":{"id":1748795,"username":"Frankllyn","slug":"frankllyn","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646577383,"body":"Will I ever see an NTR that isn't the same old shit?\nI just wanted to see the traitor succeed or get revenge, and the traitor fall from grace."},{"id":2376505,"gallery_id":394478,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1646542241,"body":"Ooh, thx so much for the summary @BZo1480 and defan752. So now, not only is she being Coach's \"thing\" (cum dumpster, meat onahole, w/e you wanna name her), but she goes along with it and playing double. LOL I betch at that festival there's gonna be more 'hidden sex', which is gonna make her more excited blah blah blah that kind of scene. And she's ready to take lotsa creampies from Coach, yum yum ... bleh."},{"id":2376438,"gallery_id":394478,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646539313,"body":"As always, credit for the summary goes to defan752 from EH."},{"id":2376428,"gallery_id":394478,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646538863,"body":"5/ Coach says he knows that it's an important \"thing\", and will handle her gently. He enters her. She tries to take him out, but he brings her down again and tells her it's not a good idea to run away. Yuki tells him that his gentleness is tough to handle, but he asks her if it feels better down there this way. She says nothing, but he knows her answer. As he has gentle sex with her, he tells her not to apologize or have a guilty conscience when she's feeling this good. Eventually, she starts to break and tells him to stop, or something will snap inside her. She tightens around Coach and he does her harder. He finishes, and Yuki feels something warm expanding in her abdomen. She feels that it hurts and tickles at the same time. Coach points out out that at least she's stopped crying, which is good."},{"id":2376422,"gallery_id":394478,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646538680,"body":"4/ Yuki puts on her fluffy outfit; Coach asks how she can wear such flimsy and unreliable clothes. She responds that it's loungewear. Coach says it looks great on her. She wants to take it off before it gets dirty, but Coach says it's fine and to keep it on until she stops crying. He then asks her where it hurts, and touches her all over her body, tracing her painful parts, like he's plugging holes. It feels weird to her. She notes that her switch can turn on and off, but it's a little scary, and that she feels good, but also guilty. She tells Coach that he doesn't want him to be gentle, and he says that she's definitely different than usual today. He says that if he's too rough, her fragile clothes might tear. She disagrees and tells him to use her like his \"thing\", like always. He says he *is* doing her like always, how he wants to do her. He notes that her pussy is more sensitive and tries to finger her, but Yuki stops him and says that her clothes are important. "},{"id":2376420,"gallery_id":394478,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646538494,"body":"3/ Unable to take it anymore, he spins around and tells her that there will be a scavenger hunt at the next sports festival. He asks her to pair up with him if he's picked, and to stay in the cheerleading section where he'll come to find her. She says she'll go if she has no other responsibilities. Shoma remarks that it'd be a huge pain to send out the track team at a time like this when he needs her help. But then, just as they're talking, Yuki gets a text, and suddenly says that she has to go. But Shoma thinks that their interaction had ended better than he thought it would, and he's happy with it. "},{"id":2376416,"gallery_id":394478,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646538312,"body":"2/On the way home, Shoma and Yuki seemingly reconcile. Yuki thanks him again for the party and Shoma says it was no big deal. She apologizes to Shoma for allowing other people to believe that they are still dating. Shoma says it's fine and probably easier this way. Yuki responds that that's good, but suddenly tears up. Shoma thinks that he said the wrong thing yet again. He wishes that every time they spoke, time could stop for an hour, because that might enough for him to come up with a tasteful reply, but even if you added up all of the time on their way home, it was still less than an hour, and that's been the distance between him and Yuki for all of their daily lives. He tells her not to worry about it, and that he was just doing his own thing. He tells her that everyone else thinks of Yuki as a friend. She asks what he thinks of her. He ponders it for a moment, and replies, that she is his most important *friend* he's got. She thanks him. "},{"id":2376409,"gallery_id":394478,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1646538118,"body":"Summary: A montage shows the daily lives of the students as Coach and Yuki's sexual life also continues to develop. Throughout this, Shoma and Niimi grow closer as Coach and Yuki grow more intimate. Shoma wonders why talking to Niimi makes him feel nostalgic, while Yuki reflects on the fact that she and Shoma did not exchange a single word over summer break. One day, everyone throws Yuki a surprise party as a general thank you for all her hard work and her birthday. She asks who told them about her birthday; Himeko says it was Shoma. They give her a fluffy jacket and shorts as a present, and a matching wristband that everyone else is wearing. This, too, was Shoma's idea. Yuki thanks him, making it the first time they've spoken in months. She watches as Shoma serves Niimi peach juice, but Niimi insists on helping Shoma too. Yuki remarks that she thought Shoma hated peach juice, but Shoma implies that he's changed his mind now. Niimi feels uneasy near Yuki."},{"id":2376371,"gallery_id":394478,"poster":{"id":3657044,"username":"ZGundam64","slug":"zgundam64","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646536866,"body":"Didn't a classmate find out what was going on in Chapter 19?"},{"id":2376101,"gallery_id":394478,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1646522504,"body":"Uh @BuckShotnut74 iirc, they already broke up. It is now up to Yuki to whether or not keep this kind of rel with Coach cuz we all see she is sinking into lust while at the same time feeling depressed cuz she can't break away from Coach, like a slave to lust. I'd love to see some kind of TL/summary later so I can get a better picture of the current situation."},{"id":2376060,"gallery_id":394478,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1646521158,"body":"At this point im getting pissed, the bitch in heat for sensei. She runs to him for anything between her and her so  called bf, and the sensei just using her as a outlet from his past trauma. Just end this already, its not getting any better just the same old bs"}]