[{"id":2410309,"gallery_id":395193,"poster":{"id":1296835,"username":"Kotxoxori Minami","slug":"kotxoxori-minami","avatar_url":"avatars/1296835.png?_=6f2751324e147064","is_superuser":false,"is_staff":false},"post_date":1647904828,"body":"Probably the worst hentai I've ever seen and this is coming from a person who jerked to 177013 with no problem at all. I hate this doujin and what a waste of good art, not becuase it's rape or ugly bastards (even tho I hate both but..) infact there are many good rape, ugly bastard and even NTR doujins are better than this garbage. What an absolute boner killer... the fact that Kanon was crying the entire doujin and litreally vomited, cried herself again till she fainted and she didn't show any sign of pleasure nor enjoyment what so ever. Just fucking no, I'm feeling a light 0 (light because the art is good which is a waste)"},{"id":2388462,"gallery_id":395193,"poster":{"id":206905,"username":"EvilSanders","slug":"evilsanders","avatar_url":"avatars/206905.png?_=49c3a6934b5662ff","is_superuser":false,"is_staff":false},"post_date":1647000572,"body":"This is... Amazing!\n\nFrom Shy Girl to Expressive girl but later, she becomes shy girl with some memories."},{"id":2387768,"gallery_id":395193,"poster":{"id":1127570,"username":"Homosexual fire of the north","slug":"homosexual-fire-of-the-north","avatar_url":"avatars/1127570.png","is_superuser":false,"is_staff":false},"post_date":1646963361,"body":"This is not a very gamer moment i must say"},{"id":2387750,"gallery_id":395193,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1646962924,"body":"Cover is a bait if you didn't check out the tags and find out that it is not matching with that happy face."},{"id":2387705,"gallery_id":395193,"poster":{"id":3342803,"username":"Tennoji_Rina","slug":"tennoji_rina","avatar_url":"avatars/3342803.png?_=86d3118e49aec110","is_superuser":false,"is_staff":false},"post_date":1646961274,"body":"I don’t know who you are. I don’t know what you want. If you're looking for ransom, I can tell you I don't have money, but what I do have are a very particular set of skills. Skills I have acquired over a very long career. Skills that make me a nightmare for people like you. If you delete this doujin of my daughter, that will be the end of it. I will not look for you, I will not pursue you. But if you don't, I will look for you, I will find you, and I will kill you."}]