[{"id":2396500,"gallery_id":395759,"poster":{"id":2727867,"username":"Pridestalker","slug":"pridestalker","avatar_url":"avatars/2727867.png?_=256da63dd11d65f3","is_superuser":false,"is_staff":false},"post_date":1647375616,"body":"my condolences to the poor guys asshole"},{"id":2395018,"gallery_id":395759,"poster":{"id":2695519,"username":"futackerman","slug":"futackerman","avatar_url":"avatars/2695519.png?_=5cac8de2541b718f","is_superuser":false,"is_staff":false},"post_date":1647302452,"body":"This is part 3 (final) of the story \"Diary Of An Easy Futanari Girl ~Girls-Only Breeding Meeting\".\nI'm looking forward to translating this one too, but I think it's best to wait until I get access to all the parts.\nBy the way, there is no ep 4 in this gallery, only Eps 2,3 and 5.\nEps 1,4 and 6 are missing (and bonus pages)."},{"id":2395013,"gallery_id":395759,"poster":{"id":4930555,"username":"Beluwuga","slug":"beluwuga","avatar_url":"avatars/4930555.png?_=43fdbe3eba658c5c","is_superuser":false,"is_staff":false},"post_date":1647302254,"body":"Pal is going down the same shitty route like munchin/muchin"},{"id":2394922,"gallery_id":395759,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647297734,"body":"Well in short story about a futanari that in short rapes and impregnates any girl she see's with a boyfriend. There is also a rumour at school about her so a lot of girls line up to get fucked by her and even if they don't again she pretty much rapes everyone. The other girl is a friend she made at school and they fuck a lot but then the both of them get asked out. The friend say's they should stop having sex since she's now in a relationship while futa say's they should still do it from time to time. She then pushes down the guy asking her out and contemplates that a guys ass is nice but not flexible like a girls vagina so they probably will never recover after being raped by her but who cares they'll just be disposable one time uses then. Then it ends with the friend and her boyfriend being lovey dovey but seeing as she now has a boyfriend she will most likely get raped and impregnated by the futa."}]