[{"id":2404496,"gallery_id":396336,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1647726953,"body":"@xyst16 Well this is kind of like the first time in a while where the bad thing happens to bad people with \"good people\" benefiting over other assholes (but knowing how he is it's very likely they've gone insane, but their more sympathic LOL)"},{"id":2404426,"gallery_id":396336,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1647723676,"body":"Well that's Hal doujin for you a sick plot twist in the end, if wasn't like that wouldn't be one from Hal"},{"id":2404383,"gallery_id":396336,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1647721569,"body":"I'm going to go out on a limb and assume that they made a Pact to survive together. Loverboy became the group shared man so everything is consensual. Likely what happened was staying together they were able to collect supplies you know act like fucking normal, while everyone in the sex cult pretty much fuck themselves that they didn't focus on their needs and may have gotten sick or they were poisoned knowing how hal works. Initially I was confused about the blond dying man till I realized it was the piece of shit teacher. But look like they made certain glasses girl was the only Survivor. Looking at the black hair guy well it's easy to Guess that they all unified in surviving but wanted to make certain no one who knew them would come looking for them which makes sense with how the teacher acted in the first chapter so he was just getting his Just Desserts! Lover boy is a lucky guy he got himself a consensual Harem just by not turning into a douchebag! The others had their fun and died"},{"id":2404295,"gallery_id":396336,"poster":{"id":3390991,"username":"scooptiwoop","slug":"scooptiwoop","avatar_url":"avatars/3390991.png?_=5a5608d0f4bb4344","is_superuser":false,"is_staff":false},"post_date":1647718377,"body":"what the heck happened at the end"}]