[{"id":2416987,"gallery_id":396819,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1648214451,"body":"Yes. When younger, other boys call her gorilla and the likes because she's stronger than boys. Minato told her she's cute too (and that she's a girl). She starts getting aware and wants to be more girly after he gave her the ribbon. Meanwhile, Minato seems to have liked her from before that. She always helped him from bullies, but as a boy he doesn't want to always be the one who need to be rescued. That's why he became interested in those fraud items that claims can make you stronger. The hypno pendant is one of it. "},{"id":2415460,"gallery_id":396819,"poster":{"id":1013174,"username":"x2we","slug":"x2we","avatar_url":"avatars/1013174.png?_=84ed8c89c7d1bb5b","is_superuser":false,"is_staff":false},"post_date":1648139135,"body":"Yeah it just like what minminazusa said. I literally spend half of my day translate all of it using DeepL to get some idea.\nIn addition, it seem like she love him for really long time, way back when he give her ribbon at p31."},{"id":2415454,"gallery_id":396819,"poster":{"id":3224250,"username":"Darkën","slug":"darken","avatar_url":"avatars/3224250.png","is_superuser":false,"is_staff":false},"post_date":1648138900,"body":"Damn, this NEEDS a translation"},{"id":2415313,"gallery_id":396819,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1648132302,"body":"By the way, the girl, Yuzuki is not hypnotized, she just pretend but then it's too late to stop. It's at the end of part 2, Minato starts to realize he wants her to say she loves him for real, not just from being hypnotized. At p66, when he caught her masturbating, he thought she still hasn't snapped out of it and apologize to her. That's when Yuzuki realized, Minato thought everything they've done are because of hypnotism and also, he feels guilty so he will never do it again. At the same time, that means the relationship they have built on her lie will end here. So she finally admitted she had been faking it, and she also loves him."},{"id":2414670,"gallery_id":396819,"poster":{"id":1013174,"username":"x2we","slug":"x2we","avatar_url":"avatars/1013174.png?_=84ed8c89c7d1bb5b","is_superuser":false,"is_staff":false},"post_date":1648096994,"body":"I might die but I still want translation"},{"id":2414401,"gallery_id":396819,"poster":{"id":821427,"username":"seaechiowai","slug":"seaechiowai","avatar_url":"avatars/821427.png?_=7e2f318a33a7e6a1","is_superuser":false,"is_staff":false},"post_date":1648086765,"body":"It's nice to see the guy apologize for hypnotizing and raping the girl for once. "}]