[{"id":2433657,"gallery_id":396971,"poster":{"id":4051657,"username":"I'm alive not dead v2","slug":"i-m-alive-not-dead-v2","avatar_url":"avatars/4051657.png?_=db66c8b687f5c10c","is_superuser":false,"is_staff":false},"post_date":1648907012,"body":"Man why didn't she suffered more? Would have been better"},{"id":2419593,"gallery_id":396971,"poster":{"id":4827745,"username":"abaz80","slug":"abaz80","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648321339,"body":"I've seen a husband or a boyfriend stays with the the girl who got raped, but this blond guy not only married her he also helps her confront all those shits. Amazing, I'm out of word."},{"id":2418570,"gallery_id":396971,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1648280655,"body":"I am confused. and I guess no one is going to TL this fully."},{"id":2418229,"gallery_id":396971,"poster":{"id":3058534,"username":"ninjacookie","slug":"ninjacookie","avatar_url":"avatars/3058534.png?_=953c86017ebad93b","is_superuser":false,"is_staff":false},"post_date":1648267654,"body":"well shit, her ex is the who planned this all, all along"},{"id":2417207,"gallery_id":396971,"poster":{"id":4877298,"username":"Omontopno","slug":"omontopno","avatar_url":"avatars/4877298.png?_=b2898bbcaf59fac6","is_superuser":false,"is_staff":false},"post_date":1648221923,"body":"Shit needs a preemo decensor translation a full compilation. The dudes a legit piece of shit honestly. "},{"id":2417194,"gallery_id":396971,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648221414,"body":"Dam even tho ppl say its a plot twist, that orgy was nasty asf. She was tossed around by 8+ Dudes, came in every hole several times to the point its just leaking out like a broken faucet, shit she was puking semen. After all that he wife her up lmao wow. You gotta be a special kind of guy to do that after witnessing that"},{"id":2417096,"gallery_id":396971,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1648218534,"body":"Sum from \"sad panda\" (you know) : Happy end for Rika. Finding that Shun did all this because he got tired of her as a wife and wanted to degrade her as a woman (because he found her admirable) really changes the way I look at the previous chapters, especially the car sex scene in chapter 3. As Saku says, no matter what happened to her, she still just wanted a happy married life. Even when she degrades herself in the story, you can tell she still loved Shun and wanted that life back before Saku proposed. I'm glad she got her happy end with Saku.\n\nAfter Saku 'saved' her (her words) and they had a child together, Rika became a marriage counselor. At the end, one of her cases is Shun and his new soon-to-be-ex. Rika thinks to herself if she can surpass this, then she has truly moved on. The ex learns about what Shun has been up to and shows RIka all the video that she found on a hidden phone; it's a bunch of old videos of RIka. Rika decides to leave, realizing she isn't ready to face all th"},{"id":2417042,"gallery_id":396971,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648216608,"body":"That's a plot twist never expected that, that's how a ntr story should be made, hope other artist learn from this"},{"id":2417029,"gallery_id":396971,"poster":{"id":1378854,"username":"diu613","slug":"diu613","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648216159,"body":"based on my limited japanese, there is a twist in the end. Not sure if The husband cheated before rika goes bitch mode or after, anyway the husband is the mask guy all along who strangles her during the orgy party... And two years later, when rika marries the blond dude and have a normal life again, she becomes a consulter for marriages and stuff (?). The wife suspects her husband has been cheating, and her evidence being the mask , and a moblie with lots of orgy av type videos. And obviously the person who is in the video is rika herself. And she begins connect the dot and finds out that her own husband is the one who changed her to become a slut or something ?"}]