[{"id":2431933,"gallery_id":397082,"poster":{"id":2574067,"username":"uselesstrash87","slug":"uselesstrash87","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1648829568,"body":"For those of you who don't understand chinese, this isn't NTR actually this is very wholesome. Because Marushin always create NTR i understand that everyone is miss understanding that this is an NTR work, but it isn't. The girl likes the nerd and its a mutual feeling. The girl lies that she's not a virgin and had a ex boyfriend. After the sex she explains that it was a lie. Guys calm down lmao. "},{"id":2428564,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648680745,"body":"Yeah definitely be very picky with your partners. \nIt's a really important choice that you will likely be stuck with. \nDon't want to enter a 5/10 relationship and then be taken when the 8/10 comes around .\nJust be on the look out and know what you want to have. It's not easy but worth it. I would propably only \"fix\" something about my GF if it was something actually harmful. Like maybe stop mixing cocaine into your meth. Jokes aside there really isn't anything i want to fix about her.\nAnd if some kind of problem arises we just communicate it. Communication is so OP. We have been together for almost 2 years now and haven't fought at all. Not even once. We just talk about issues and solve them. Tho we didn't even have any real issues to begin with. Just talk about what you want and why you want it. "},{"id":2428516,"gallery_id":397082,"poster":{"id":3138390,"username":"honjonia","slug":"honjonia","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648678564,"body":"一堆人生氣應該是因為這老師都畫NTR題材，但這本明明不能算是NTR卻還是冠上了NTR的標題，覺得被騙了吧"},{"id":2428319,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648667738,"body":"Trust for me is something deeply fundamental. It already was before I fucked up, but after that, it cemented itself even more for me. I know there's a lot of people who can forgive cheating (when the partner really regretted it), but i'd probably wouldn't be able to if someone ever did it to me. And like you said, people aren't dogs: you can't act like you own them, fixer syndrome is something real and even if you don't like certain behaviours from your partner, it's not your place to ''fix'' them. People in a relationship should be on equal footing morally like that, and trying to overwhelm them like they are just a toddler in need of teaching just shows how immature you end up being."},{"id":2428314,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648667379,"body":"@ScrubKing that story you told about the girl desperate for relationships is something I saw before too (and I fear it's very common). I never thought of myself as someone who needed to be in a relationship, but since my last girl, I decided that I wouldn't enter a relationship with someone just for the sake of it. Maybe it's asking too much, but i'd rather be in a relationship with someone whom I can like as well as admire for their way of living, just like I did with my last GF (not the one with the disorder, I had another girlfriend after her). I don't believe relationships are things you should just stack you know? If you like sex, just do it casually, make it clear to the partner that you're not jumping the gun just cause of a one night stand. You should value yourself, your time, your feelings and be with someone who you believe can both get better because of you and that can better yourself. At least that's my point of view. "},{"id":2425212,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648538848,"body":"Though currently they are still together. \nAlthough I doubt it's super happy. \nBut who knows. Maybe things genuinely improved between them "},{"id":2425197,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648538457,"body":"Wtf Janus did i really just reach the character limit on nhentai? This has never happened to me before. \nAnyways she reasonably lowered her Standards and just took a whatever-dude she could fix . I was genuinely concerned for her at that point and told her that whenever she talks about him she is just complaining and/or talking about habits that she will fix about him and stuff she still has to teach him. Like wtf. This isn't a dog. Anyways it works out ,kinda,not really. Some time later I hear that he cheated on her for very similar reasons as you did. She has some kind of medical condition and can't fuck (dodged that bullet a long time ago. I'm fckn neo from matrix. Btw Keanu is so hot#nohomo#questionmark) and thus cheater on her. And apperantly she is fucking him anyways . Even though it's painful and mentally scaring due to her condition. Like wtf dude. Sex isn't everything. Blowjobs are an option. There is more to love.dont scar yourself emotionally trying to glue this together "},{"id":2425181,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648537972,"body":"Unfortunate to hear.\nThere are sometimes situations where I regret doing something but i understand that people might not forgive me. I just accept that. \nAlso kinda reminds me of a girl I knew. She wasnt the best pick by a long shot. It's not like she was a nasty person but she was kind of desperate to have a relationship. I thankfully dodged that bullet because I noticed that this wouldn't be something I could do in the long run and just remained a friend. She was just getting a relationship for herself. ( I guess in a sense most people seek out relationships because they don't want to be single. That's pretty normal. But she was on another level). The entire point of a relationship was essentially to be for her ,and she was pretty demanding. Whenever a relationship wouldn't work she would get a new one asap( gotta respect the grind). It got to a point where her mom told her that she would force her to take a break if the next one didn't work. So she just very reasonably lowered her "},{"id":2424688,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648521415,"body":"@ScrubKing I was younger and dumber, to be honest. My girlfriend was nursing an utherine disorder that had began causing pain, so sex was a no no, and we were fighting a lot. I ended up meeting the girl whom I had my first time and had bonded before (not a date, we meet by accident), and things happened. Probably one of the biggest mistakes I made, purely for the feelings I got (which were nothing compared to what I caused her). And I agree with you, I too think cheating is the result of broken partnership rather than the cause most of the times - if I get pissed at a hentai, more than dumb hot bitches, it would be more about the partner having no guts or self-steem to retaliate or simply end the relationship. In the end that experience I had got me enough that I not just know about the consequences of doing something like that, but also what i'll feel afterwards, so at least I got something from it. I guess that's why I'm more into wholesome stories though :v "},{"id":2423606,"gallery_id":397082,"poster":{"id":4544272,"username":"nihao1213","slug":"nihao1213","avatar_url":"avatars/4544272.png?_=2ad87a28c3ddbe9a","is_superuser":false,"is_staff":false},"post_date":1648474020,"body":"我超，外国人也能看懂中文吗，底下为什么全是英文评论！！"},{"id":2423203,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648453352,"body":"@Janus. Yo imagine having a wholesome bonding life story exchange on this Plattform. \nThat's rough.i couldn't cheat on my partner tbh. But people make mistakes. \nIn Hentai it just doesn't really have consequences. \nThough I don't think that you are the one \"doing that\" to another person. \nIf it's a monogamous relationship their partner should uphold their loyalty. \nI see cheating more as the result of a broken partnership rather then the cause for it. \nI would lie if i said I wouldn't like to have a harem but in a monogamous relationship i could never get with another girl. I just couldn't do it. \nSimilarly to how I wouldn't share my GF i understand that she wouldn't want to share me. And i think it's important that we can trust each other to know that there is no chance anyone could cheat. ( Although of course most relationships think that way. Even the broken ones ) .\n\nFor context what made you cheat ? \nJust youthful foolishness or had it deeper underlying problems . "},{"id":2422226,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648424783,"body":"@ScrubKing Funnily enough, I went through the same thing, tho it was way back in Highschool. The girl was in an open relationship with the guy, but in the end the two simply didn't had the same mojo from the beginning of the relationship - but the good memories made them stick even if both of them were already enjoying other people more. The thing is, I cheated before, and in the proccess I ended up destroying my ex's self-esteem for way too many months. We broke up simply because she was way too sad and I was feeling way to guilty to even try to get her up. The feeling you get for cheating their trust is way too fucked up, and i'm not about to go and do the same thing to another person once again. I don't see it as people identifying, and more as them being empathic: if a friend of mine gets cheated on like in a NTR, i'm going to get pissed for him. "},{"id":2422206,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648423535,"body":"@Janus . I mean if it's an easy hit it's an easy hit . I don't care about the loser . He might as well not exist. I once knew a chick with an \"open relationship\" . She wasn't a slut or anything. Genuinely smart and funny . But when I saw him i knew what \"open relationship\" essentially just meant that she was just leagues out of his reach but was with him anyways. So he was a good boy and she got a bit more. Ok honestly this sounds way worse then it actually was. What I'm getting at is that i didn't feel sorry for him. He knew about it and just let it happen. \nI mean if you don't like it then that's up to you. It's nice to fool around but having a stable nice relationship is definitely better. I wouldn't go back . Even tho it was easy,fun and genuinely great company. \nBut hentai is just hentai. I just find it funny how angry Joke boy here gets over his need to identify with every cuck he comes across "},{"id":2421817,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648407051,"body":"@ScrubKing of course you wouldn't. I'm different tho, I feel bad for the guy so I run with the policy to hit the road if a girl who's taken make a move on me. I'm not into sex for the bullshit dog :v\n"},{"id":2421201,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648385710,"body":"@janus how is that supposed to make any sense ? I don't see a problem with taking someone's girl. But interesting to see who's perspective you immediately jump to . "},{"id":2420999,"gallery_id":397082,"poster":{"id":5062185,"username":"CXI","slug":"cxi","avatar_url":"avatars/5062185.png?_=0be90d68b5344839","is_superuser":false,"is_staff":false},"post_date":1648374965,"body":"纯爱拯救世界\ntruelove save world"},{"id":2420960,"gallery_id":397082,"poster":{"id":3480273,"username":"HentaiKingTestamentBasara","slug":"hentaikingtestamentbasara","avatar_url":"avatars/3480273.png?_=42ff753c31961fe6","is_superuser":false,"is_staff":false},"post_date":1648373139,"body":"“I like it when sex isn’t forceful and traumatizing” “lmao, kindness? Fucking cuck” SMH"},{"id":2420268,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648350245,"body":"@taenacity Well, you wouldn't believe me if I told I did, would you? To be fair with you, I am on a dry spell since the beginning of the year tho, so I can give you that XD"},{"id":2420240,"gallery_id":397082,"poster":{"id":5168848,"username":"taenacity","slug":"taenacity","avatar_url":"avatars/5168848.png?_=16d01916865de95c","is_superuser":false,"is_staff":false},"post_date":1648349336,"body":"@Janus22 I don't think you'll ever experience that yourself in your life. Off yourself, it'll be a relief to your parents too."},{"id":2420228,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648349003,"body":"@taenacity Yeah, I like consensual sex between people who care about each other. How did you found out? "},{"id":2420220,"gallery_id":397082,"poster":{"id":5168848,"username":"taenacity","slug":"taenacity","avatar_url":"avatars/5168848.png?_=16d01916865de95c","is_superuser":false,"is_staff":false},"post_date":1648348851,"body":"@Janus22 Another vanilla snowflake chink, color me surprised. Hopefully the coof takes care of your family."},{"id":2420090,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648343986,"body":"@ScrubKing don't know man. You seem to like a lot of this cuck stuff lmao"},{"id":2419894,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648335848,"body":"@Janus. The vanillafag is the cuck. That's why he is so angry and hateful all the time lmao "},{"id":2419570,"gallery_id":397082,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1648320498,"body":"Somehow the doujin doesn't even have NTR and the cuck squad is already bashing vanillafags. Crazy world"},{"id":2419549,"gallery_id":397082,"poster":{"id":4059903,"username":"Xinoelat","slug":"xinoelat","avatar_url":"avatars/4059903.png?_=50e67eb3eac5afde","is_superuser":false,"is_staff":false},"post_date":1648319437,"body":"Would probably make more sense if I knew what it said but what part of this is NTR? Or is that just the magazine this came from..."},{"id":2419510,"gallery_id":397082,"poster":{"id":5168848,"username":"taenacity","slug":"taenacity","avatar_url":"avatars/5168848.png?_=16d01916865de95c","is_superuser":false,"is_staff":false},"post_date":1648317984,"body":"I wish these bugmen would upload the raws, they never share do they? @Jokke0009 No surprise a vanilla snowflake like you is Chinese."},{"id":2419232,"gallery_id":397082,"poster":{"id":1883159,"username":"ScrubKingOfficalBitchBoiSlayer","slug":"scrubkingofficalbitchboislayer","avatar_url":"avatars/1883159.png?_=15d969969b803511","is_superuser":false,"is_staff":false},"post_date":1648308945,"body":"Does anyone know who hurt this kid ? \nJoke is such an angry cuck at such a young age . \nPropably got a girl \"stolen\" even though he was to afraid to ask her out in the first place and ever since he can't help but relate to any cuck he sees. "},{"id":2419037,"gallery_id":397082,"poster":{"id":992443,"username":"Jokke0009","slug":"jokke0009","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648299946,"body":"Die already worthless artist. We don't need to same copy paste content over and over and over..."}]