[{"id":2520370,"gallery_id":397410,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652381496,"body":"Also since I'm writing so much anyway, if anyone wanna check out one that is really messed up in my mind, then check out Netoraserare /  123813 though there are about twice as much content already translated in seperate chapters, all in all it's 567 pages... read on if you wanna know what's it is about, major spoilers ahead. The premise is about a wife and a husband that have been trying for children for a very long time but nothing is working at the same time their parents are heavily pressuring them into having children and can't understand why they haven't gotten any yet. The husband starts thinking thats it's all his fault and that he is sterile, so he starts to think someone else has to get her pregnant and fantasizes of her sleeping with other men. Then he starts asking his wife to sleep with other men and time moves on. "},{"id":2520363,"gallery_id":397410,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652381258,"body":"Then comes the twist! major spoiler! The wife was taking birthcontrol pills all along to make sure she would never get pregnant. Why? Because she loves her husband the most but as she loves him the most she wants to see him being in despair, cause for some reason it's a major turn on for her to see the one she loves being hurt/damaged. For some reason she has a fetish of mind breaking her husband. So everything that has happened up to this point was the plot of the wife pretty much and then it ends with her asking if he can really love such a broken person and the husband goes let's grow old together and make a baby! Then it seemingly has a happy ending but then the next few pages shows the husband getting home to work only finding his wife sleeping with some other guy. THE END."},{"id":2520345,"gallery_id":397410,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652380607,"body":"@Nishizawa To be fair in 384291 ther are two parts, first part is well the wife is stolen pretty much. The 2nd one has two childhoodfriends who through out it all both love each other the most, from how I read it, but the guy is a coward so even when the gal pretty much confesses he say's no. Then she get's a bf and then the whole thing just goes from there with the bf trying his hardest to make her his, mostly with sex since it's a hentai, while they still love each other. Then for some reason the guy is pretty much about to confess to her but then the girl thinks she's dirty or something and it ends with the guy getting a gf as well while the girl goes something like. Oh that's for the best I'm not worthy of him anymore....This one did remind me of 379195 however, though it has a seemingly more \"happy\" ending, while 392632 is also similar to some degree at least the ending."},{"id":2520301,"gallery_id":397410,"poster":{"id":53547,"username":"tobajas","slug":"tobajas","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652379311,"body":"@Minminazu Yeah there is already a good translation for everything outside of the after chapter. For ppl wondering the after chapter is pretty much the follow up of what the last page of the story is. That the gal + bf are still happily together but now she sleeps around a lot. In the after chapter it actually seems like their fairly \"happy\". With the bf getting super aroused with watching the videos of her sleeping around, she also loves how the bf is at sex after watching a video together, she's also thinking of how good his size is for anal and that he now is able to cum a ton compared to before. Then it ends with her asking what kind of stuff she should do next for him then the last though bubble is something like ahh I wonder how far we can fall...."},{"id":2450554,"gallery_id":397410,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1649638564,"body":"@The Mischievous Gentleman yo that's so dark.😂"},{"id":2443400,"gallery_id":397410,"poster":{"id":4069858,"username":"The Mischievous Gentleman","slug":"the-mischievous-gentleman","avatar_url":"avatars/4069858.png?_=1862f47404851cef","is_superuser":false,"is_staff":false},"post_date":1649314077,"body":"Approved by Will Smith 😆😂🤣"},{"id":2427582,"gallery_id":397410,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1648631276,"body":"Other than p166 onwards, all the individual chapters are translated already, and even decensored. "},{"id":2426966,"gallery_id":397410,"poster":{"id":2759051,"username":"WolfDesu","slug":"wolfdesu","avatar_url":"avatars/2759051.png?_=8188ad82ab490600","is_superuser":false,"is_staff":false},"post_date":1648604771,"body":"Hope someone get fully translating this and tonari onee-san"},{"id":2426854,"gallery_id":397410,"poster":{"id":5128188,"username":"Another Boring Person","slug":"another-boring-person","avatar_url":"avatars/5128188.png?_=1a3fc990af24c8df","is_superuser":false,"is_staff":false},"post_date":1648600301,"body":"@bitc560, personally, no. However, given the general trend in these things, I can guess that this story is just boring with its netorare."},{"id":2426743,"gallery_id":397410,"poster":{"id":3293260,"username":"Pandesal No.2","slug":"pandesal-no-2","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1648595808,"body":"That was hot "},{"id":2426228,"gallery_id":397410,"poster":{"id":3294887,"username":"bitc560","slug":"bitc560","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648575308,"body":"what netorase ? what bitch? didnt you all read the whole chapter that taniguchi turn her into slut. Its not her fault in the first place. She force to rape and blackmailing her until she broken . Did you read or you just throw a tantrum into her\n"},{"id":2426202,"gallery_id":397410,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1648574441,"body":"This series is more into netorase than ntr, but well there's only one tag all along, so netorase and netori fall in the same spot"},{"id":2426089,"gallery_id":397410,"poster":{"id":263256,"username":"Dejavuu","slug":"dejavuu","avatar_url":"avatars/263256.png","is_superuser":false,"is_staff":false},"post_date":1648571313,"body":"Lol this bitch reminds me of will Smith wife Jeda. Lol. Entanglement."},{"id":2425880,"gallery_id":397410,"poster":{"id":576054,"username":"nishizawa","slug":"nishizawa","avatar_url":"avatars/576054.png?_=200326e9d5a364ea","is_superuser":false,"is_staff":false},"post_date":1648566028,"body":"don't count this as NTR if the guy still got love from her and fck her in the end of story,  NTR always have a bad end and the writer give permanent emotional damage to the MC, \nfor example this 373578 or this 384291"},{"id":2425833,"gallery_id":397410,"poster":{"id":3802381,"username":"TheUnknownVoid","slug":"theunknownvoid","avatar_url":"avatars/3802381.png?_=0b07743727952abd","is_superuser":false,"is_staff":false},"post_date":1648564774,"body":"Shes had 65 gangbangs at the end of the epilogue"},{"id":2425728,"gallery_id":397410,"poster":{"id":4517110,"username":"ChoiceScarfHydreigon","slug":"choicescarfhydreigon","avatar_url":"avatars/4517110.png?_=e9e1c3245802032d","is_superuser":false,"is_staff":false},"post_date":1648561858,"body":"This is incredibly predictable, but I suppose it's not that bad, love the art so that's a good saving grace. "},{"id":2425630,"gallery_id":397410,"poster":{"id":1738770,"username":"&lt;/&gt;","slug":"_","avatar_url":"avatars/1738770.png?_=d234c4e190a6562d","is_superuser":false,"is_staff":false},"post_date":1648559002,"body":"nothing new just typical netorare ending just like the others"},{"id":2425514,"gallery_id":397410,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1648553106,"body":"Epilogue MC still happy with FMC huh?"},{"id":2425478,"gallery_id":397410,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1648551084,"body":"One of the better type of ending for these kind of story. The other guy did trained her until she asks him to cum inside. But she also matured on her own, accepting her sexual desire and charm. From there, she starts to curiously explore more ways to get pleasure (actually starts experimenting playing with her back door on her own before that guy asks her for it). She even makes her own choice when having relationship with more men, especially after she graduated high school. Her boyfriend accept it. That other guy also don't stop her or treat her like she's his own property, they draw the line at being sex friends. | Don't like trophy wife ending, so I prefer this kind where the girl is free to do what she wants, or where the ntr guy actually took responsibility and love her back."},{"id":2425449,"gallery_id":397410,"poster":{"id":3412308,"username":"HEAT MAN","slug":"heat-man","avatar_url":"avatars/3412308.png?_=e863f9f03e2c332f","is_superuser":false,"is_staff":false},"post_date":1648549477,"body":"could be worse"},{"id":2425442,"gallery_id":397410,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1648549086,"body":"Additional pages, nice...."},{"id":2425379,"gallery_id":397410,"poster":{"id":4096406,"username":"TrendBreaker","slug":"trendbreaker","avatar_url":"avatars/4096406.png?_=999ad65575c489cc","is_superuser":false,"is_staff":false},"post_date":1648546260,"body":"So in the end, BF conveniently has the sacred \"Voyeur boner from seeing his GF being fuck by other guys\" and is only through this that he gets his most intense erection. But unlike most other NTRs where he usually has to fap alone or in a degrading manor, the FMC goes out of her way to burn said BF's voyeur boner with her own body in the form of sex. Well i guess in terms of this hentai keeping to the standard NTR/cuckold formula this story established, this is probably the best outcome for the BF to have. So I guess I'm cool with this final ending in a way."},{"id":2425361,"gallery_id":397410,"poster":{"id":2373779,"username":"ss4chris","slug":"ss4chris","avatar_url":"avatars/2373779.png","is_superuser":false,"is_staff":false},"post_date":1648545590,"body":"https://nhentai.net/g/388974/\n \nwhen is htis going to be TLd. we dont need this shit"}]