[{"id":2447676,"gallery_id":398268,"poster":{"id":2029892,"username":"tristezero","slug":"tristezero","avatar_url":"avatars/2029892.png?_=caf6548d28ef5e6d","is_superuser":false,"is_staff":false},"post_date":1649518663,"body":"好！我只能说该啊。她想要的只是个只爱她的人啊。"},{"id":2444221,"gallery_id":398268,"poster":{"id":2981593,"username":"asdsdw","slug":"asdsdw","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1649354109,"body":"FUCK hell no no  noooooo"},{"id":2440383,"gallery_id":398268,"poster":{"id":2495195,"username":"Mamachiwa","slug":"mamachiwa","avatar_url":"avatars/2495195.png?_=0418c948f8b01475","is_superuser":false,"is_staff":false},"post_date":1649186323,"body":"You have legal wife but you still want a bitch? "},{"id":2440256,"gallery_id":398268,"poster":{"id":2756241,"username":"hello adventure","slug":"hello-adventure","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1649181258,"body":"he deserve it"},{"id":2440209,"gallery_id":398268,"poster":{"id":40917,"username":"mandaras007","slug":"mandaras007","avatar_url":"avatars/40917.png?_=71b48f13563ae442","is_superuser":false,"is_staff":false},"post_date":1649179680,"body":"Shouldn't have suck all dem dick if you want love"},{"id":2439886,"gallery_id":398268,"poster":{"id":4591659,"username":"geeeerm","slug":"geeeerm","avatar_url":"avatars/4591659.png?_=36e849e0cbb7192f","is_superuser":false,"is_staff":false},"post_date":1649170982,"body":"I've been following this manga from the start and it's really one of my favorites. The art is truly phenomenal. I doubt this is going to be updated, and it really is a shame. Although I agree that it feels real, it's still a sad ending. I feel like reflections of reality are important and impactful, but then again I really just want a happy ending to a manga I really like. :("},{"id":2439450,"gallery_id":398268,"poster":{"id":4277004,"username":"softouch","slug":"softouch","avatar_url":"avatars/4277004.png?_=fdc98b5e77c65313","is_superuser":false,"is_staff":false},"post_date":1649152620,"body":"That's what I like about this story. It feels real. The feelings of an AV actress wanting real love. I think if mc really tries, he can win her back. Because she is in love with him. But that's depending on how much he really loves her. It's not going to be easy this time. It's going to be a hard battle to win her back. But he still has a chance if the girl still loves him. But unless the author wants to continue, if not, them being separated is the canon ending for now."},{"id":2439164,"gallery_id":398268,"poster":{"id":2360097,"username":"I hast come","slug":"i-hast-come","avatar_url":"avatars/2360097.png?_=1b27924d795e9e78","is_superuser":false,"is_staff":false},"post_date":1649141092,"body":"Damn shit got really sad"},{"id":2439061,"gallery_id":398268,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649136946,"body":"Summary (cont.): MC goes back to FMC, tells her about his break-up. Gf knew from the beginning that MC had the hots for FMC, so she asked her ex-bf for advice. Ex-bf told her to ditch MC & to get back w/ him. MC now asks FMC out, calling her Yura again. FMC has a devilish smile before crying & asking MC to call her Yuri (her real name). They have sex, all the while MC realizing how much of an idiot he was during those times: flashback to various times when he fucked up in his answers, e.g. when she asked him if he could go out w/ an AV actress, he should've said no I don't want you to have sex w/ others, when she asked him if he could forgive his ex-gf for cheating on him, he should've said no either he can't forgive her. When she asked him does he want Yuri or Yura, he should've said Yuri. After they have sex, she leaves. MC asks when will they see each other again, FMC says they won't ever again. She can't go out w/ him. MC asks why. FMC says because she's Yura Kanae. End."},{"id":2439051,"gallery_id":398268,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649136544,"body":"Summary (cont.): Later FMC asks MC if he can date an AC actress. He thinks he can. But he still calls her Yura (her AV name, again prob out of reflex). FMC tells MC about her insecurities of how her friends may be talking shit behind her back. Later on, during sex, he films her w/ his phone, saying he wants this to keep, still calling her Yura. Later, FMC tells her that his gf Rio is coming back & that she prob had sex w/ her ex. She asks him what's he gonna do. Can he forgive his gf? He doesn't know. She's kinda annoyed. He's also kinda annoyed by her rn. He tries to make up, but he calls her Yura again. Her face is not shown, but she takes off her clothes & they have wild sex again. Later on they play Shiritori w/ ero words. FMC uses \"I love you\" to him, he plays dumb & asks if that's an ero-word. She goes home. Gf comes back, MC confronts her about ex-bf, but she also knows he had sex w/ FMC. They break up."},{"id":2439039,"gallery_id":398268,"poster":{"id":3426084,"username":"shadowfairy","slug":"shadowfairy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649135885,"body":"Summary: MC (Hajime) does a lil bit of prying before meeting his gf's friend, the FMC (Yuri) who's an AV actress (Yura Kanae). The night FMC stays over, she seduces MC w/  a BJ. Next day, FMC tries to get it on w/ his gf but can't, he's only thinking of FMC. GF goes to visit home but she's picked up by some guy, FMC tells MC that's her ex-bf & that they're prob gonna do it. So MC & FMC do it together as well. FMC asks who MC wants before they do it, Yuri (her real name) or Yura (her AV name). MC says Yura. They continue to have sex in the following days, & MC continues to call her Yura (most likely as a reflex & not deliberately, since he only thinks of the one in the videos). FMC one day has to go to work, comes back to find sulking MC, they have sex while she describes what she did at work. "},{"id":2439001,"gallery_id":398268,"poster":{"id":3397735,"username":"<3DarkSkinGyaruLover<3","slug":"3darkskingyarulover-3","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1649133772,"body":"Summary:The FMC genuinely loves MC but MC just wants to fuck the AV version of FMC throughout the Story the MC fell in love with her but she caught on early of his initial intentions and as the story progressed they drifted apart (her love somewhat dwindled as she knew he saw her as a AV than as who she was) "},{"id":2438967,"gallery_id":398268,"poster":{"id":3503528,"username":"Ary369","slug":"ary369","avatar_url":"avatars/3503528.png?_=99e71ea342c6801b","is_superuser":false,"is_staff":false},"post_date":1649132819,"body":"Finally...       "},{"id":2438622,"gallery_id":398268,"poster":{"id":2327098,"username":"diothememegod","slug":"diothememegod","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649121899,"body":"Pretty sad ending it's best to read this not translated. \n\n"},{"id":2438555,"gallery_id":398268,"poster":{"id":4277004,"username":"softouch","slug":"softouch","avatar_url":"avatars/4277004.png?_=fdc98b5e77c65313","is_superuser":false,"is_staff":false},"post_date":1649119395,"body":"Judging from the whole story arc, she fell in love with mc and wanted to be with him. But she's not sure how he is thinking about her. Thus she gave him those questions to test him. I believed that she will quit AV if he gave her all the right answers. But since his initial intentions were to have sex with her only, even though he did fell in love later, it was already too late for him. Since he did everything wrong, she decided that he would not want to be with the real her, and just wanted to have sex the AV actress. I wondered if given a chance, will he tell her the real truth about what he wants. He already regrets everything he said in the last chapter and wanted the real her. All in all, if this is the ending, it's a sad ending for both."},{"id":2438488,"gallery_id":398268,"poster":{"id":1599080,"username":"poopman99","slug":"poopman99","avatar_url":"avatars/1599080.png?_=46ae999558638b80","is_superuser":false,"is_staff":false},"post_date":1649116518,"body":"the pain of not knowing chinese, fml"},{"id":2438472,"gallery_id":398268,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1649115573,"body":"Thanks for the comments below too. I'm agreeing with you guys as well."},{"id":2438447,"gallery_id":398268,"poster":{"id":4019338,"username":"Aoee","slug":"aoee","avatar_url":"avatars/4019338.png?_=71690a5142a4f98f","is_superuser":false,"is_staff":false},"post_date":1649113600,"body":"Thanks for the comment below"},{"id":2438428,"gallery_id":398268,"poster":{"id":4827745,"username":"abaz80","slug":"abaz80","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649112552,"body":"The girl basically wanted the mc love her as who she is and date her, beside that she continues her work. That's the part I can't get. The mc didn't answer her questions honestly, so she left at the end, telling him she as an AV actress. I think it is a good ending because who wants to date an AV actress? Someone embraces her during the day and at night she goes to hug the mc? Like wassup?"},{"id":2438289,"gallery_id":398268,"poster":{"id":3139531,"username":"chaulevin","slug":"chaulevin","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649106484,"body":"basically, the MC had answered every question wrong from her, something like when she asked does he want to go out with an AV actress, he should've said no because if he loved the girl he wouldn't want her to continue working as one, she wanted him to like her as her normal self. and at last both girls left him because of how indecisive the MC was"},{"id":2438252,"gallery_id":398268,"poster":{"id":4191775,"username":"stylez479","slug":"stylez479","avatar_url":"avatars/4191775.png?_=474f991ddf993ced","is_superuser":false,"is_staff":false},"post_date":1649104878,"body":"damn so the last panel she reveals her real name so MC will know she is AV actress?\n"},{"id":2438214,"gallery_id":398268,"poster":{"id":3410506,"username":"XV71","slug":"xv71","avatar_url":"avatars/3410506.png?_=42d7cb99aecd5372","is_superuser":false,"is_staff":false},"post_date":1649103428,"body":"the end? not to be continued rip lol"},{"id":2438171,"gallery_id":398268,"poster":{"id":981074,"username":"mbergmann","slug":"mbergmann","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649101796,"body":"Quick google lens translate: In the end she says she wont see him anymore. "},{"id":2438169,"gallery_id":398268,"poster":{"id":4673486,"username":"badpriorities12","slug":"badpriorities12","avatar_url":"avatars/4673486.png?_=212f388496c25510","is_superuser":false,"is_staff":false},"post_date":1649101734,"body":"I just did a random google translation in last part so mc didn't know that fmc is a pornstar? And the fmc confess it that's why she rejected him? Or any clear translation please lol"},{"id":2438138,"gallery_id":398268,"poster":{"id":5097267,"username":"frankrse","slug":"frankrse","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649100633,"body":"So, what happened "},{"id":2438133,"gallery_id":398268,"poster":{"id":2992527,"username":"ProbalyANerd","slug":"probalyanerd","avatar_url":"avatars/2992527.png?_=757733dd463b66e1","is_superuser":false,"is_staff":false},"post_date":1649100523,"body":"I don’t know Chinese. And I’m pretty sure at this rate not a single soul is going to translate this. So I’ll be back in 2-3 years after I learned Japanese and Chinese to know if this is wholesome or not. Welp here come nothing, wish me luck learning a language lmao."}]