[{"id":2448858,"gallery_id":398609,"poster":{"id":1968176,"username":"izayoifeng","slug":"izayoifeng","avatar_url":"avatars/1968176.png","is_superuser":false,"is_staff":false},"post_date":1649573122,"body":"ntr的理由越来越随便了"},{"id":2444423,"gallery_id":398609,"poster":{"id":3358941,"username":"Truck-kun0","slug":"truck-kun0","avatar_url":"avatars/3358941.png?_=6adc7d2ab2fee11f","is_superuser":false,"is_staff":false},"post_date":1649365866,"body":"People really be declaring war over porn"},{"id":2444384,"gallery_id":398609,"poster":{"id":4410505,"username":"Connor RX800","slug":"connor-rx800","avatar_url":"avatars/4410505.png?_=969aeef268e4d88d","is_superuser":false,"is_staff":false},"post_date":1649363677,"body":"Bro I don’t think it’s that serious I agree there will be people like you described dudes probably just forgot to add the tags happens all the time people aren’t machines"},{"id":2444383,"gallery_id":398609,"poster":{"id":966155,"username":"RetardedMidget","slug":"retardedmidget","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649363658,"body":"Nhentai is just an aggregator website dude, they don't tag anything themselves. If you wanna complain about tagging go to the source where people upload shit, like exhentai. Also wth is Vanilla NTR? Do you mean netori? If you get so easily triggered by some tags and want proper tagging, go to websites like pururin or whatever."},{"id":2444194,"gallery_id":398609,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1649352778,"body":"...So this is how it works. Release it at the start with it's proper tags, THEN reupload it later without the tags that will obviously be blacklisted by some so it slips through and you can force a NTR into being seen, hoping it provokes a response and eventual Comment war between haters of Vanilla NTR and \"So-Called Defenders\" of NTR (Seriously your \"10/10, it was so delicious\" cringy reviews are painfully obvious! You found many of them boring and only good for the art, so you've likely copy and pasted your reviews off a word document or whatever to save yourself the time of having to type it up! Some of ya even quickly Post before anyone pretty much SIGNALLING your looking for a fight! To actual Vanilla NTR fans, this is what your Genre has become because you let theses idiots get out of control! Specifically the idiots purposely mis-tagging!). So have your fun with your usual stuff...or whatever! I'm mostly ranting at the mis-use of tag's (or lack of! This isn't Laziness anymore!)"}]