[{"id":2517148,"gallery_id":398931,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1652263777,"body":"@uta-kun: Cast list: Lily (villainess, isekai protagonist) / Martin (Lily's childhood friend, commoner, works as doctor, the boy she actually loves) / Maser (1st prince, Lily's fiance, psycho #1) / Zine (2nd prince, actually loves Lily but tsundere) / Klaus (priest, got the easiest ending among the capture targets) / Alice (heroine, psycho #2) / Victor (knights commander, Alice's slave). "},{"id":2514406,"gallery_id":398931,"poster":{"id":5146702,"username":"uta-kun","slug":"uta-kun","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652162673,"body":"Who is Klaus?"},{"id":2453230,"gallery_id":398931,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1649746451,"body":"@Sips-tea : Both are psycho. In the previous episode, Maser said Lily is the person who saw his true nature. That's not true, Alice (the heroine), and someone else in the past (the clown mask) also saw through him, but they're fellow psychopaths. Lily is a sane person who saw his true nature and can say he is wrong. Because he is a \"perfect prince\" character, everyone seems to be unable to perceive he did wrong (like killing people). He and Alice is having a working business relationship for a while before, with Alice (who has made the knight into her slave) raiding dungeons to sell rare items to the prince. That includes the tentacle grimoire he used to punish Klaus, the priest for daring to touch his fiance. If Alice hasn't saved him (she wants him as party member), Klaus wouldn't get out with just losing one arm. "},{"id":2449480,"gallery_id":398931,"poster":{"id":3709190,"username":"Sips-tea","slug":"sips-tea","avatar_url":"avatars/3709190.png?_=61e363dc0cd88c8f","is_superuser":false,"is_staff":false},"post_date":1649600471,"body":"Well thats cliche? OgHeroine is evil or something? And Yandere prince is actually good? "}]