[{"id":2453230,"gallery_id":398931,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1649746451,"body":"@Sips-tea : Both are psycho. In the previous episode, Maser said Lily is the person who saw his true nature. That's not true, Alice (the heroine), and someone else in the past (the clown mask) also saw through him, but they're fellow psychopaths. Lily is a sane person who saw his true nature and can say he is wrong. Because he is a \"perfect prince\" character, everyone seems to be unable to perceive he did wrong (like killing people). He and Alice is having a working business relationship for a while before, with Alice (who has made the knight into her slave) raiding dungeons to sell rare items to the prince. That includes the tentacle grimoire he used to punish Klaus, the priest for daring to touch his fiance. If Alice hasn't saved him (she wants him as party member), Klaus wouldn't get out with just losing one arm. "},{"id":2453226,"gallery_id":398931,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1649746322,"body":"About Lily, they found out Maser's magic filled cum can make her orgasm uncontrollably, so he had been training her to even beg. But even with that, Lily still won't surrender her heart. The deadline is until graduation and their formal marriage. Maser still use magic to keep her from being pregnant, but after they're married, he will make her pregnant. | Sein, the tsundere black prince, actually hoped for her brother to break the engagement, but that won't ever going to happen now. He did pointed out Lily is not doing well being imprisoned, so she's given permission to attend the school, but that only result in her making contact with other man (she tried to protect Alice). Klaus, the priest, gave Lily a letter from Martin, who was sent as medic to rescue survivor from the village Maser burned before. "},{"id":2449480,"gallery_id":398931,"poster":{"id":3709190,"username":"Sips-tea","slug":"sips-tea","avatar_url":"avatars/3709190.png?_=61e363dc0cd88c8f","is_superuser":false,"is_staff":false},"post_date":1649600471,"body":"Well thats cliche? OgHeroine is evil or something? And Yandere prince is actually good? "}]