[{"id":2470137,"gallery_id":399051,"poster":{"id":1824974,"username":"LewdBoiSteve","slug":"lewdboisteve","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1650416274,"body":"Fuck the credit, fuck the honor, fuck doing what you think is a favor to other people you respect. The scantilator of this title should go ahead and reupload the prequel. Idori is going to slash and burn anything they can, and being a nice guy to other scene members isn't going to keep the work in circulation. That means Idori wins.\n\nThe most important part is that the media stays in circulation. Stop hoarding hentai scans/translations in their source (raw) quality. The downstream grifters are going to butcher the resolution and slap dozens of watermarks on the work anyway. So this sort of attitude really only hurts the people that are the most fanatic about their collections. And again, it means that Idori, Fakku and that /troglodyte/ Takahashi."},{"id":2455772,"gallery_id":399051,"poster":{"id":4403299,"username":"Rafa18","slug":"rafa18","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649862116,"body":"Please upload the first one"},{"id":2455220,"gallery_id":399051,"poster":{"id":3328522,"username":"SandBox288","slug":"sandbox288","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649833743,"body":"thanks for your great work ImiWakanai! best of luck with your N4 :)"},{"id":2452765,"gallery_id":399051,"poster":{"id":1544918,"username":"gorre","slug":"gorre","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1649728406,"body":"The fact a woman is behind this manga is wild to me"},{"id":2452362,"gallery_id":399051,"poster":{"id":3657044,"username":"ZGundam64","slug":"zgundam64","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1649709947,"body":"At least she is free now? Right?"},{"id":2452004,"gallery_id":399051,"poster":{"id":1142253,"username":"qmode1","slug":"qmode1","avatar_url":"avatars/1142253.png?_=ef57e4b0eb2dc2ff","is_superuser":false,"is_staff":false},"post_date":1649695334,"body":"Thanks for the effort of translating. Good luck on your classes. Hoping for more translation from you <3"},{"id":2451863,"gallery_id":399051,"poster":{"id":4728532,"username":"ImiWakanai","slug":"imiwakanai","avatar_url":"avatars/4728532.png?_=7670781ecf702148","is_superuser":false,"is_staff":false},"post_date":1649689010,"body":"I posted this on e-hentai\n\nHi Guys! Was the one who worked on the last crimson book(The Hinata one at the library). Finished translating and typesetting this around a month ago with the help of machine translation, so the translations might not be on par with others. Still taking classes to get my N4. Wasn't gonna upload this because I wanted to wait for Kizlan's version since he's a top-tier translator but it seems like he probably won't work on crimson anytime soon. He already did Kaguya Humiliation but was forced to take it down and even if I have the file, I won't uploaded it, in respect to him. \n\nSince this was my 2nd book, I fiddled more with the fonts and typesetting. Maybe a bit of redrawing, only on pattern-like backgrounds with the clone tool. I think this one turned out a lot better than last time.\n\nI might work on the recent Sayuki soon but I'm not gonna rush it. I really love the Kaguya series so I'll probably translate them whenever they come out. "}]