[{"id":2477800,"gallery_id":400427,"poster":{"id":4356039,"username":"MuXuanYin","slug":"muxuanyin","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1650742095,"body":"hahahahahaha lol mlao rofl  seriously  the COP  left them have sex in a public vehicle?   hahahahaha 1-the molester guy will be to prision yes or yes he cant even appeal to any defense since the girl is underage, 2- the girl will be punished for having  sex in broad day life and in a public vehicle  3- her parents will be also be responsables for such girl and charged with a monetary punishment   4- the girls school life its over , 5- her social life over  so  her only way of life will be a prostitute  and a single mother  THE END."},{"id":2477783,"gallery_id":400427,"poster":{"id":4787916,"username":"Janus22","slug":"janus22","avatar_url":"avatars/4787916.png?_=833bf37c984f760b","is_superuser":false,"is_staff":false},"post_date":1650741253,"body":"Would you look at that? In the end the ''NTR'' was more in the case of Sayuri than the Male Lead. That being said, I don't think this really needed 6 parts to conclude. It just got extremely convoluted. Like people commented before, she didn't changed routes nor did anything to remotely change her situation. Of course, there's still hentai logic all over this (girl liking rape, whole train prepared to help the guy molest, the guy finding the girl wherever she goes, and the funniest of all, the police in the end being ''oh, you like him? Than its okay, continue with the public sex!'' \nSayuri's life is essentially over even in hentai logic. She's underage, they are having public sex (both things that gets the old man in prison), she got pregnant and lost her BF to her friend. It's melancholic as fuck, but its very different from the usual cuck stuff "},{"id":2477759,"gallery_id":400427,"poster":{"id":2420169,"username":"Retarded tsun elf","slug":"retarded-tsun-elf","avatar_url":"avatars/2420169.png","is_superuser":false,"is_staff":false},"post_date":1650739859,"body":"Back at it again with a new banger"},{"id":2477595,"gallery_id":400427,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650733362,"body":"@xyst16 I think she had the mental breakdown the moment they fucked in the hotel! And then once the inevitable happened (her breakup, Kanako was a nice bitch with the \"I'm so sorry\" false apology LOL. Just the blank look on Sayuri face during that made it clear it wasn't computing yet in her mind!) The oldman likely got more brave by this point, which is when they finally got caught (it's kind of silly a WHOLE TRAIN CAR is full of accomplishes for a chikan! Just look at that doujin with the dumb chick detective to see why, as they all got caught because a woman in the OTHER nearby car SAW the gangrape and reported it! I think the NTR writers are starting to abuse NTR logic what with the playboy's BLUNTLY fucking where they get caught by others who \"Decide to mind their own business\" rather then report cause \"that makes sense!\" NTR Logic is just \"Deus Ex Machina\" in the worst way! Not a fan of it being used bluntly in even the WORST written stories!"},{"id":2477585,"gallery_id":400427,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650732976,"body":"@haitoku makes sense LOL! By what you put down, it makes this story look like a Prologue to the \"plots\" you put down (instead of the \"as you know\" those plots use). Now place your bets on how long before you start hearing the \"usual fan fare\" (\"Oh look at the Vanillafags writing down essays, what losers\" \"Ahh Yeah I had a good nut to this, why can't Vanillacuck just not come down to the comment section...even when the way I hate comments on my NTR I shouldn't even check the Comments myself, but I need a good trolling today\" Seriously actual NTR fans should know it's these's guys and the \"Opposition for Vanilla\" who make you and all of us look bad!) I'm betting the \"next comment\" with a side bet of \"the comment after the next one\" if they think their being smart by waiting for more to avoid being transparent losers!"},{"id":2477561,"gallery_id":400427,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1650732117,"body":"@xyst16 For \"Vanilla Plot\" after this FMC will find her right man and he take care her and her child very nice even that chad come again he will protect her and they are get happy life. For \"NTR Plot\" after FMC find man that chad came back and blackmail her again and you know the rest what will happen."},{"id":2477540,"gallery_id":400427,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1650731352,"body":"@LordCellofEarth9 I agree that her life as a normal person is over, after the end and the guy get arrested a hell of storm coming for her,  hardly she'll end up with a good man and if she does maybe another ntr might happen, probably she'll have a mental breakdown because of the rapist she no longer will have anyone, and i think that when the mc know what's really happen he'll despise her, it clearly seem that's he felt guilt for what he did but he go to her friend because he's taking responsibility for doing with her, but when he connect the dots he'll realize why she was acting weird and fell for her friend even more, the friend is the winner even though she was raped she didn't turn into a nympho and saw the change to take the man for herself, the fmc is a victim but because what she did in the end no one will see her like that but a slut that betray her lover and family, sooner or later she'll come to her senses but her life will be already in pieces "},{"id":2477516,"gallery_id":400427,"poster":{"id":2101111,"username":"HiddenStorm","slug":"hiddenstorm","avatar_url":"avatars/2101111.png?_=8dc5d138bb536ada","is_superuser":false,"is_staff":false},"post_date":1650730520,"body":"A decent ending, I would've loved to see her gangbanged again tho"},{"id":2477499,"gallery_id":400427,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650730035,"body":"@tillallaregone & haitoku Oh no I'm not expecting full on realism in a doujin! That's just me taking a shot at the \"It's so realistic\" comments from some NTR fans (the ones who say that are the ones that annoy me the most! Basically your comment is what I direct at them all the time LOL). And yeah \"haitoku\" I almost forgot Crazy9 has a bad habit of abusing NTR logic (which might as well be \"Diablo Ex Machina\" with just how similar to Deus Ex Machina doing that is!) by his logic, NTR Chad won't get arrested and he & Sayuri have a happy ending and get married while he still goes out and rapes girls! (I'm surprised Takashi got a happy ending with Kanako and Kanako only bitch moment was screwing Sayuri over...even though she screwed herself LONG before that anyway! All she did was free him from an \"indecisive idiot!\") I just had to point out how fucking out there it was for him to have been at the hotspring they went to unless he was stalking her! (It's like he \"WANTED\" to get caught) "},{"id":2477494,"gallery_id":400427,"poster":{"id":3423516,"username":"user_A_exist","slug":"user_a_exist","avatar_url":"avatars/3423516.png?_=abb022accdee2e90","is_superuser":false,"is_staff":false},"post_date":1650729970,"body":"Well deserved ending"},{"id":2477465,"gallery_id":400427,"poster":{"id":2568700,"username":"haitoku","slug":"haitoku","avatar_url":"avatars/2568700.png?_=2920bd64245210b8","is_superuser":false,"is_staff":false},"post_date":1650729048,"body":"@LordCellofEarth9 Just fucking NTR logic chad NTR can appear to anywhere anytime where FMC go even in women toilet (seriously). And police don't give a damn thing since they are not effect in story just caught chad NTR but FMC already turn into slut. "},{"id":2477455,"gallery_id":400427,"poster":{"id":4113945,"username":"tillallaregone","slug":"tillallaregone","avatar_url":"avatars/4113945.png?_=bfdb46764c6bea41","is_superuser":false,"is_staff":false},"post_date":1650728768,"body":"@LordCellofEarth9 While I agree with what you have to say, if you expect realism in a doujin, I'm not sure what to tell you buddy. Plot convenience I guess."},{"id":2477438,"gallery_id":400427,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650728274,"body":"But one thing I will commit on is just how unrealistic the writer REALLY made this story! The Oldman was able to ALWAYS know where she was to rape her? Him appearing in the hotspring was really unbelievable and I can only conclude he was a brave rapist because she never reported him or changed routes. You'd think he'd not risk getting caught, but hey it fits what I mentioned with cops in bad NTR! They only appear when the plot demands it no matter how insane it was the rapist wasn't caught for how brazen they were!) I take her defending him at the end as her deciding to \"die on the hill she chose\" (she knew right when the two had sex, that it was over, being told their together later cemented it, but I figure it was less painful at that point and going down with him means she at least has him. Which will not end well either for her!)"},{"id":2477386,"gallery_id":400427,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650726880,"body":"@Pakito This isn't really a happy ending for Sayuri! Since the writer ended the story! The aftermath is the oldman still gets arrested for the public sex thing and oh yeah she's a high schooler while he's obviously an adult! So statutory rape is an added charge! And as you pointed out, her family will find out after this, so that \"Slap\" is still incoming! And now she has his kid...with Daddy behind bars (he could snitch on his friends from the previous chapter for a plea) so it's really a happy ending for Kanako and the BF since Sayuri has no means of revealing Kanako rape! Her life is truly over that I'm sure that happy kiss with the rapist will be an embarrassing moment for her in the future since it bookmarked the end of her future (Single Motherhood with people knowing she chose her rapist and the risk of disownment and the father in jail is going to destroy this \"happy ending\" for her! Youthful optimum will only take her so far before reality crashes down)"},{"id":2477370,"gallery_id":400427,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1650726142,"body":"If there’s something different in the start line for her friend, she had someone else for her to hate rather than blaming herself."},{"id":2477322,"gallery_id":400427,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1650724571,"body":"Good ending i guess ... I'd want to see her getting slap by her family and she won't even care."},{"id":2477279,"gallery_id":400427,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1650722780,"body":"Glad it ended happy for the other girl she wasn't stupid and didn't become a nympho like other one."},{"id":2477260,"gallery_id":400427,"poster":{"id":4818282,"username":"OhMyLifeIsNotDaijobu","slug":"ohmylifeisnotdaijobu","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1650721987,"body":"I like this she get impregnation"}]