[{"id":2480926,"gallery_id":400579,"poster":{"id":1610581,"username":"Lil'Lolicon-san","slug":"lil-lolicon-san","avatar_url":"avatars/1610581.png?_=f33c1e938922c8e5","is_superuser":false,"is_staff":false},"post_date":1650871680,"body":"But the NTR and even more helplessness by the same Girls \"that don't need any Men\" and now their \"Savior\" got Pegged even harder so that \"only by the fucking Magic of Plot Armours and Author's direct strings\" they saved the day made me feel good, and even they pulled out the \"Upgraded Equipments from the latter Arc\" into the Current Arc that in no way fit the already established timeline of the OG Story, even the Live Action (They pulled the last Season of the OG Equiments into the First Arc of the Story, with the Pegged Mask in Tuxedo) and still somehow made it so fucking useless. They combine almost over 150 Episodes of Progression and Fillers into 1 and a half Session of around 100 Eps, that's some \"Budget\" cut corners if I've ever seen one. Still, worth it for anyone that wanted \"something new, but not too new; unfamiliar, but not too unfamiliar\", and Kids, go watch/read the Original, it's better than this Feminazis Manifestation in form of Anime and Manga."},{"id":2480915,"gallery_id":400579,"poster":{"id":1610581,"username":"Lil'Lolicon-san","slug":"lil-lolicon-san","avatar_url":"avatars/1610581.png?_=f33c1e938922c8e5","is_superuser":false,"is_staff":false},"post_date":1650871080,"body":"-Iconic Male Antagonists and friend of the Protagonist? Fuck them too, cus they are Losers, they can't have friend no more. Somehow making the already 2D things now just even more 2D, just called it 1D then. To be fair there were things that have done right after I've seen the Original and Live Action countless time, but they were still too small comparing to the whole picture. Ranting over, I'm just fucking in disbelief after what \"CLAMP\" have shown us after ~>20 years by the \"Clear Card\" Arc in continuation of the OG CardCaptor Sakura series, an S Grade cameback and Sailor Moon Author just regurgitate out... This (Crystal Reboot)."},{"id":2480913,"gallery_id":400579,"poster":{"id":1610581,"username":"Lil'Lolicon-san","slug":"lil-lolicon-san","avatar_url":"avatars/1610581.png?_=f33c1e938922c8e5","is_superuser":false,"is_staff":false},"post_date":1650870916,"body":"UwU fuck Crystal \"Reboot\" Arc, suck ass plot from the \"Live Action\", shit Art style (I don't mind the anorexia characters design 'cus I'm from the \"Boomer\" generation (Budget reasons), some Classic Stories have shit Art but the Plot were in the Highly praised writing imo, but the fucking overused stock Blender models and backgrounds in loop) somehow by the same damn Studio that have done the Classic Original. Quick cash grab and \"refresh\" \"to fit the current day society narrative\" = fucking Feminazis. Right from the lyric of the OP: \"We don't need any men because we are not some helpless Girls\". The \"Feminist\" Author just Reboot the damn series to Peg \"Tuxedo Mask\" even harder than the Original and the \"Live Action\" (Oh yeah he is not the 17 years old in Collage anymore because fuck men, they cannot be better than woman like the Original have done, and somehow by the same age but now he's in High School cus \"society narrative\" of Age Gap).-"}]