[{"id":2500174,"gallery_id":400693,"poster":{"id":4761875,"username":"Blisket","slug":"blisket","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651634817,"body":"JESUS CHRIST THIS COMIC IS HUUUGEEEE"},{"id":2489027,"gallery_id":400693,"poster":{"id":4245300,"username":"Laksek ODA","slug":"laksek-oda","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651242202,"body":"Best ahegao"},{"id":2485367,"gallery_id":400693,"poster":{"id":2686729,"username":"LewdLewds","slug":"lewdlewds","avatar_url":"avatars/2686729.png?_=417126e79f6793b0","is_superuser":false,"is_staff":false},"post_date":1651084817,"body":"This new chapter kinda sucked. No futas and some shitty cuckold. Would be more passable if Lord Zawarudo was a futa instead"},{"id":2482604,"gallery_id":400693,"poster":{"id":3093375,"username":"Alien3.0C","slug":"alien3-0c","avatar_url":"avatars/3093375.png?_=ce3cf82778d109df","is_superuser":false,"is_staff":false},"post_date":1650951794,"body":"I dug too deep"},{"id":2482576,"gallery_id":400693,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650950769,"body":"This is the type of ending that is funny where the bad guys lost worse then if the heroes had won and had their \"proper happy ending\"...instead of this one where One is stone cold dead now that he's no longer needed for his seat and securing the \"Fallen Heroine's new position as Queen and now Queen Regent of Demonkind through their super baby\" and the other got \"reverse NTR\" (and seeing her king shat all over her effort by not even making her a concubine but the fallen heroines play thing while he watched and cruelly enjoyed, should have noted doing those things only cemented to the heroine screwing you over first was the smart thing to do now that she wasn't goody goody anymore to NOT do that!) Demon Girl got it easy, since she's now too insane to care...and no one will know the \"Truth\" to contest Fallen Heroine!"},{"id":2482574,"gallery_id":400693,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650950551,"body":"After all, even if she became perverted and enjoyed sex, must have been annoying and demeaning having to pretend to be \"the demon lord's slutty slave\" to get him to fuck her! And him letting her humiliate her \"captor\" just showed how ungrateful he can be along with giving her said captor's\" former post\" all because she was \"a better choice for a super baby!\" she damn well wasn't waiting for him to \"Find someone better\" since she is proof they can corrupt and turn magical girls! She can find herself \"Replaced\" and suffer the same fate she did to her captor, wouldn't be surprised she destroyed any proof of this to assure it's not repeated, no need for \"competition\" or her future child/Puppet repeating his father's plan and creating competition in a \"Daughter in Law\" She may even spare humanity if only to make it easier to avoid this problem...meaning their attempt to invade humanity resulted in them being RULED by one, even if made a demon like them!"},{"id":2482569,"gallery_id":400693,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650950232,"body":"Seriously always found it funny how the bad guys in these's corruption stories turn the heroine into a slutty evil bitch, but it stops at her no longer being sugar and spice and addicted to them. When there should be a chance she is STILL more powerful then they are and what's stopping her from just killing them and taking over! I think I remember another corruption story on here where the girl turned evil and even though her love interest was killed. She turned him into a tentacle then took over the bad guys cause they turned her evil yeah, but she was too strong to be easily controlled. Brainwashing is just BEGGING for it to go undone and decided \"she can rule alone\" like this case where she just needs to bear the future Demon Lord...and then she has no need to for the current one as she becomes her child's \"Regent\" Demon Girl lived only because she wanted to \"Thank/Punish her\" for giving her the chance to become \"bigger\" then if she remained a Heroine"},{"id":2482566,"gallery_id":400693,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1650949964,"body":"Last Story that was the new update with the corrupted Magical Girl! Unless said otherwise! I'm going with she had sex and was submissive to Zilva till she got pregnant then killed him! She became Evil yeah, but both the Demoness who captured her for corruption and Zilva the Demon Lord both rued the day they corrupted her to turn her against the humans! She became \"Evilier then thou!\" Would be funny if she turned Zilva into a homunculus and he was the one broken down at the end! Poor Succubus never knew she got to fuck her King....but hey at least she can live even if humiliated compared to the King who died and their now ruled by the Heroine turned evil!"}]