[{"id":2509269,"gallery_id":401069,"poster":{"id":1146323,"username":"Bouya","slug":"bouya","avatar_url":"avatars/1146323.png","is_superuser":false,"is_staff":false},"post_date":1651941397,"body":"No armpit licking this time. 😓 disappointing "},{"id":2499430,"gallery_id":401069,"poster":{"id":921039,"username":"EdeaF","slug":"edeaf","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651604334,"body":"The succubus missed a perfectly good chance for some cunnilingus action with that sleeping girl. This hentai is starting to get a bit repetitive with its scene. The sex play is always just fingering, a little dick smelling, and then on to the penetration.\n\nAdd more foreplay to spice things up. More cunnilingus would do the trick. Some Armpit Licking is nice. I also noticed there's no Breast Sucking play, which is a shame since it would add nicely to the whole rape, molestation theme. Again, all of this would add more spice to the girl on girl sex scene."},{"id":2491250,"gallery_id":401069,"poster":{"id":4820604,"username":"joel777","slug":"joel777","avatar_url":"avatars/4820604.png?_=80b0f666e5c27f6d","is_superuser":false,"is_staff":false},"post_date":1651344413,"body":"I don't wana be that guy but in hentai your not really suppose to win until the series ends  but its hentai so yeah least now I know there continueing this series cause I thought 6 was the end."},{"id":2489659,"gallery_id":401069,"poster":{"id":2844273,"username":"OneFilthyWeeb","slug":"onefilthyweeb","avatar_url":"avatars/2844273.png","is_superuser":false,"is_staff":false},"post_date":1651273631,"body":"I mean this is nice and all, but it is literally the same thing for the seventh time with barely any changes. Succubi are still stomping everyone"},{"id":2489653,"gallery_id":401069,"poster":{"id":4250281,"username":"Kōdi-Cody","slug":"kodi-cody","avatar_url":"avatars/4250281.png?_=dc66831c78bc1982","is_superuser":false,"is_staff":false},"post_date":1651273031,"body":" Well I'm guessing the of Queen of Mazurell is nothing but a pedo having all those kids lined up lol She's a corrupt ruler. I'm guessing she well get her just deserts in the later parts.\n- I really Like how Road drawn the map and the city of Mazurell I could not have the patience to draw all that.\n- The People of Mazurell are really horny people compared to the people of Lille Hill.\n- This was a nice call back to chapter 3, oh the nostalgia lol (page 74)\n- Of course the sister succubus is the first between the 3 to get first dibs, she can't just help herself 🤣 (page 80)\n- Twin tail Succubus Just straight up ignored the guy lol 😂 (page 92 )\n\nOverall part 7 was a good chapter, It was a great introduction to the city of Mazurell it's better than chapter 5 and 6, my only problem is there were not any powerful people for the succubi to dine on all these characters were just throw always, Can't judge on this fully until i get this chapter translated Looking forward to chapter 8."},{"id":2489559,"gallery_id":401069,"poster":{"id":1326248,"username":"mayuko_","slug":"mayuko_","avatar_url":"avatars/1326248.png?_=d7876b77a69d7f23","is_superuser":false,"is_staff":false},"post_date":1651267882,"body":"Pls tags futanari!"},{"id":2489427,"gallery_id":401069,"poster":{"id":4830764,"username":"Kamelbestma","slug":"kamelbestma","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651259809,"body":"It's too underrated"}]