[{"id":2492781,"gallery_id":401265,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1651415489,"body":"Honestly, the relationship actually felt friendlier than the usual NTR story plot. They're open about it from the beginning, and the manager shows he doesn't need a constant \"I'm more alpha than your boyfriend\" reminder crap. Like in the epilogue, they're also upset about the ntr drama. "},{"id":2492774,"gallery_id":401265,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1651415158,"body":"After more thorough read. Well, going to leave the tagging to the ntr police. Saeko, the girl, is already in sex friend relationship with the store manager since she's in high school. She had interest in SM play from her father's porn book she read. When Suzuki wants to date her, she asks to meet the manager, her \"master\". Well, the master said it's just an play, but he proposed sharing. Suzuki with her in noon, and he got her for the night, after all Suzuki wouldn't be able to satisfy Saeko. After 2 weeks, Suzuki had enough and tried to have sex with her, which failed. She then told how she met the manager. Suzuki asks to watch their sex. Because Suzuki insist on having Saeko for himself, the manager asks Saeko to choose. He actually likes their current relationship, but his family also insist him on getting married, so he's proposing her. Saeko insist she loves Suzuki to the end. Next day, it's actually just another scenario, but the couple are getting colder to the manager. "},{"id":2492694,"gallery_id":401265,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1651411235,"body":"Tf is wrong with the uploader. Add ntr tag if this is ntr"},{"id":2492387,"gallery_id":401265,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651396983,"body":"bi*** good art......"}]