[{"id":2500471,"gallery_id":401659,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1651645235,"body":"He likely slept with many other girls (well, he works in host club, and is popular there). Natsumi asked him in the bath if he also treat all the other girls like this, which he avoids. Previous episode p7 he mentioned about remembering when he just got married when seeing Natsumi wearing her sister's sweater. And in p17, Natsumi asks him to not just treat her as replacement for someone else. So, it might also be his escape from his marriage life, from the wife he can't talk to anymore. "},{"id":2500345,"gallery_id":401659,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1651640750,"body":"This sequel brings different perspective on the husband though. Well, a lot of details are still open to interpretation. The husband quit university and get a job to support his girlfriend. They married and she is now a busy reporter. But their relationship aren't going well. He's stuck in his current job as bartender in host club and can't get other job even if he tried. Fuyumi (the wife) often don't come home, and probably look down upon her husband's current state. Natsumi (the younger sister) confessed her feeling and asks the husband to not treat her just as replacement for someone else. In the end, Fuyumi prepared a new house to chase out her sister, which Natsumi refuse (after all, cat's out about her banging her sister's husband). They get into a fight, with Natsumi asking if Fuyumi even still love or try to understand her husband or not. She did move out, but seems like the husband also starts living alone (no confirmation if they're divorced). "},{"id":2499863,"gallery_id":401659,"poster":{"id":4279052,"username":"dropsler","slug":"dropsler","avatar_url":"avatars/4279052.png?_=4d37b21cf4365e6b","is_superuser":false,"is_staff":false},"post_date":1651624553,"body":"Cheating on wife sister &gt; she like it &gt; she preg this guy fucking god "}]