[{"id":2504674,"gallery_id":401659,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1651749460,"body":"The part in episode 1, when he seduced Natsumi for her first sex sounds like he done it often though. Acts like a host. But he did mentioned Natsumi wearing the sweater reminds him of when he had just married. Natsumi also asks him not to only see her as replacement of anyone else because she's serious. So, maybe him sleeping with women is escape from the dead relationship with his wife. I hope he would be able to be more serious with a new lover and treat her well. "},{"id":2504673,"gallery_id":401659,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1651749235,"body":"With many parts still open to interpretation, this episode brings more view about their family situation. The husband quit university and look for job to support Fuyumi, who is now his wife and a career woman. He's popular in his workplace, but relationship with his wife is not so good (although not like they hate each other, probably more like stuck with the status). Natsumi asked him if he ever tried looking for other job, but he's kind of stuck, and he feels like he already unable to find any other way to live. It's probably a reason why his wife kind of look down on him, with him being bartender in host club, while she's a busy reporter. Fuyumi later prepared a new place for Natsumi, but the younger sister wants to stay, she even confessed she loves her brother in law more than her sister who no longer loves her husband (and cat's out about the affair anyway). In the end she moves out, but the husband also starts living alone (no confirmation if he's divorced)."},{"id":2499863,"gallery_id":401659,"poster":{"id":4279052,"username":"dropsler","slug":"dropsler","avatar_url":"avatars/4279052.png?_=4d37b21cf4365e6b","is_superuser":false,"is_staff":false},"post_date":1651624553,"body":"Cheating on wife sister &gt; she like it &gt; she preg this guy fucking god "}]