[{"id":2506415,"gallery_id":401771,"poster":{"id":1120527,"username":"firexq","slug":"firexq","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651826781,"body":"I skimmed it. The plot is that the sister asks her brother if he wants to \"Konma Ponchi\" with her (nonsense word). He goes along with it, pretending to understand. She keeps using nonsense words which seem to be euphemisms for sex. (For example \"paki\" for kiss, \"taru\" for getting aroused, \"bitta\" for an erect penis, etc). However, at different stages she performs parts of a ritual, spinning around, praying, and giving an eliptical reference a god being angry if she doesn't eg swallow it all.\n\nAt the end, she finishes the ritual and says \"Now it won't come out anymore\". I don't think this refers to the brother's dick based on the post-text. The meaning of this seems purposefully vague, but the bio implies it has something to do with the sister. Now that the ritual is finished \"the maturation process\" is over, and she is scheduled to \"separate\" soon. I expect there'll be a sequel where we see the dark implications of all this."},{"id":2503303,"gallery_id":401771,"poster":{"id":1330382,"username":"azk___","slug":"azk___","avatar_url":"avatars/1330382.png","is_superuser":false,"is_staff":false},"post_date":1651687819,"body":"She's saying tons of gibberish made up (by the author) words that are popular among JCs"},{"id":2502999,"gallery_id":401771,"poster":{"id":4294280,"username":"Kinderficker","slug":"kinderficker","avatar_url":"avatars/4294280.png?_=aa332d06f304aa47","is_superuser":false,"is_staff":false},"post_date":1651679116,"body":"I'm fluent in Japanese but I didn't understand shit what his sister was saying  lol According to the afterword she's a very godly person tho anyway I need a 'translation' of this"},{"id":2502912,"gallery_id":401771,"poster":{"id":886076,"username":"livelesser","slug":"livelesser","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651675837,"body":"Can someone explain me what she misunderstood or what she is going on about?\nI'm can only read Japanese at beginner level, I understand that her brother didn't know what \"ponchi\" is and go along with it."},{"id":2502904,"gallery_id":401771,"poster":{"id":4279804,"username":"LowTierGod","slug":"lowtiergod","avatar_url":"avatars/4279804.png?_=2a73940f3fb8e776","is_superuser":false,"is_staff":false},"post_date":1651675629,"body":"HOLY          "}]