[{"id":2503081,"gallery_id":401742,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1651681267,"body":"There's also the other outcome that he got step up and the couple were really insane people! With the husband \"sex-changing\" all the idiots like him who fall for wife's \"vulnerable easily cowed wife\" trick! I'm guessing sex-change operation, where they then sell the fool off overseas! Picking types like him because \"how many folks will actually miss garbage like that!\" Guessing the assumption is a guy who has the balls to go for a married woman without care is a guy who is popular with the ladies as a fuck buddy, but he's so called guy friends will laugh and mock him saying they hated him anyway if he \"went missing\" or something and move on! With his ladies moving on as well! Easily forgettable and replaceable! I don't know I think I've heard of \"Killer couples\" like this who's MO was targeting any man that went for the wife! And even those who went for the husband! We live in a twisted world where it's likely a good idea to be mindful of what step you take! Never know "},{"id":2503070,"gallery_id":401742,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1651680950,"body":"Ahh yes, One of my favorite Anti-NTR where the \"Chad Blackmailer\" not only gets caught, but get's put in his place (what happens when the \"so called cuck husband\" doesn't go \"oh my wife\" and masturbate like a fool! He gets even), Even funnier is because the wife was \"saved\" earlier before the \"logic took hold\" she was stiill in \"resentful still loyal to her husband\" mode! Meaning once she knew her husband \"understood and forgave her\" and she was \"free to toy with her rapist as she sees fit!\" Well, asshole got a taste of \"being someone elses toy!\" before the husband showed \"a logical result of trying to take other people's things!\" I mean there was a time, still is by the way one would \"lose their arm/the offending hand when caught!\" And that ending, yeah Fuckboi's going to wish he just got a whore instead LOL. At least the couple were nice enough to let him have sex as a man one more night before \"taking it away from him forever!\" though LOL"},{"id":2502827,"gallery_id":401742,"poster":{"id":4277960,"username":"EronaMyMother","slug":"eronamymother","avatar_url":"avatars/4277960.png?_=6e730762b6cb1e5c","is_superuser":false,"is_staff":false},"post_date":1651672427,"body":"Legend that was something different "},{"id":2502687,"gallery_id":401742,"poster":{"id":1524781,"username":"39931","slug":"39931","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651665999,"body":"哇哈哈哈，爆殺黃毛！"}]