[{"id":2507826,"gallery_id":402071,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651885982,"body":"Itaiamai Summary here: https://pastebin.com/fWSyF3d2   While I do understand the feeling ya'll get that all we have is just a kiss and nothing indicative of where the story will actually go despite waiting for 2 months (the author just released full volumes of Rarefure during that time and it really sold well btw), we can all just read something else while waiting, right? So personally, it's not that big of a disappointment for me. As long as there're more chapters to come, I can deal with the cliffhangers. "},{"id":2507799,"gallery_id":402071,"poster":{"id":92240,"username":"grandmaster11","slug":"grandmaster11","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651884831,"body":"dude... 2 months for this? ffs. hopefully we get the next chapter in vol. 84."},{"id":2507764,"gallery_id":402071,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651883977,"body":"Bruh I've waited 2 months for yet another cliff hanger lol. 2 months for a kiss haha"},{"id":2507706,"gallery_id":402071,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1651882112,"body":"Going to go ahead and guess that a teacher catches him doing that since they're all talking about being more strict with that stuff and kise? gets in trouble(suspended?) and it gets around what happened to the faculty and MC misunderstands and somehow it goes into him fucking that one student or the female teacher. IDK feels like there's red herrings here and there. I doubt it'll go straight to fucking unless kise drags her away and rapes her. I hope if it does go NTR he fucks that slut and maybe FMCs friends and female teacher. Like I said in 9 this guys NTR isn't usually the typical kind there's usually some other things going on around it. Also yeah @nhcasual go outside you're reading this for free don't complain you little bitch"},{"id":2507598,"gallery_id":402071,"poster":{"id":4810312,"username":"RambleTop","slug":"rambletop","avatar_url":"avatars/4810312.png?_=683c3c91cc94033a","is_superuser":false,"is_staff":false},"post_date":1651878179,"body":"This is the calm before the storm. This is where it starts."},{"id":2507564,"gallery_id":402071,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1651876565,"body":"@zombieadd Oh wow this is ironic as I actually did literally go \"touch some grass\" after my silly nerd tantrum, I went to cut my lawn with a machete to unwind(3rd world country can't afford automatic lawn cutter) you gave me a good laugh thank you, anyway yes this Itaiamai is a lame filler "},{"id":2507524,"gallery_id":402071,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1651874919,"body":"@nhcasual: lol... Take a breath or touch some grass as some interweebs call it or go read shoujo mangas since you seem pretty familiar with that kind of shit, really thou... Anyway, more chapters of my favorite series from: Azuse, Shiina, Fumitsuki Sou. About Itaiamai: this chap is much of a filler of empty baits and sexnanigans, and then cliffhanger-kun shows up with Kise kissing Amuro, a bold move and that's all."},{"id":2507474,"gallery_id":402071,"poster":{"id":4104682,"username":"大隻佬","slug":"da-zhi-lao","avatar_url":"avatars/4104682.png?_=4798c8947d16862c","is_superuser":false,"is_staff":false},"post_date":1651871964,"body":"koori的那篇故事，好像不知不覺變成劇情走向了?而且這次還變成大奶女神黑化"},{"id":2507465,"gallery_id":402071,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1651871667,"body":"That's it? We waited 2 months for baby lvl ntr kiss? I can see that in damn shoujo manga for fucks sake, make up your mind if its gonna be ntr or not already Mr.Ryoh, you gonna milk this shit for 30+ chaps like Rarefure?"},{"id":2507446,"gallery_id":402071,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651870809,"body":"Ryoh-Zoh can't hold in it anymore huh !"}]