[{"id":2547793,"gallery_id":402348,"poster":{"id":4724654,"username":"Fried Melons","slug":"fried-melons","avatar_url":"avatars/4724654.png?_=7a35c6b0b9d85a04","is_superuser":false,"is_staff":false},"post_date":1653431494,"body":"@LordCellofEarth9 NTR is a thing, I don't like it at all, but still accept, that some people like it and I can also accept, that people make mistakes. It wasn't very clear that this is NTR until you actually looked at the images anyway. You think people have time to read Hentais like you all day and tag them? Simply blacklist NTR and expect to be some doujins, which aren't tagged correctly. Hell I saw some god tier Doujins, which where tagged with \"female only\", \"english\" and \"masturbation\". Go take your Dick in your hand fap and continue with your life like a normal person."},{"id":2512962,"gallery_id":402348,"poster":{"id":2314092,"username":"Pandallam","slug":"pandallam","avatar_url":"avatars/2314092.png?_=d426a9f07b46d7d7","is_superuser":false,"is_staff":false},"post_date":1652099874,"body":"Holy shit a paragraph on a doujin and for what? Go outside motherfucker 🤓"},{"id":2512249,"gallery_id":402348,"poster":{"id":4300510,"username":"Art Enjoyer","slug":"art-enjoyer","avatar_url":"avatars/4300510.png?_=1850edca503e3a9f","is_superuser":false,"is_staff":false},"post_date":1652072064,"body":"Lmao someone needs to touch some grass"},{"id":2511731,"gallery_id":402348,"poster":{"id":5126538,"username":"Wxlty","slug":"wxlty","avatar_url":"avatars/5126538.png?_=73bc7896a20e9939","is_superuser":false,"is_staff":false},"post_date":1652051205,"body":"v Dude calm down its just tags"},{"id":2511302,"gallery_id":402348,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1652031693,"body":"So now we're playing this game now hmm! Fuck the person in charge of tags! It's clear they WANT NTR vs Vanilla flame wars to happen on the comment section which is why they're subverting the tags like this (someone wants Genshin Hentai, but doesn't want NTR! Guess I'll force them to have to blacklist Genshin now! And that's IF they don't decide to just put no tags but language to force that down!) To the tagger of this site, please stop this behavior and do your fucking job! Or I hope they replace your ass quickly. And to certain idiots, you can't say \"why don't you blacklist it\" when stuff like this happens and congrats you just revealed yourself as an asshole troll, enjoy your prize (my steel tipped boot, covered in soup and shit in your dirty mouth as I kick it over and over!)"}]