[{"id":2523037,"gallery_id":402543,"poster":{"id":3700031,"username":"calliope_mori","slug":"calliope_mori","avatar_url":"avatars/3700031.png?_=033cd6d58d443c2a","is_superuser":false,"is_staff":false},"post_date":1652482501,"body":"Thank you, funny cow pfp in the comments "},{"id":2521000,"gallery_id":402543,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1652403875,"body":"I leave what happened to Chaldea to your imagination, but Mash is in a pod saddened she is stuck inside within Chaldea but with even more restrictions and misses her senpai. for 2 years she stays there. until she got out. The other masters are getting killed one after another when rayshifting in Singularities or Lostbelts. The recently Masterless servants that were released were somewhat glad about it. How they died? Use imagination bois"},{"id":2520985,"gallery_id":402543,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1652403323,"body":"(This Fills any unexplained plot holes) - The ones who saved Gudao was a united front from the Mage association and some noble families. mostly Animusphere since Gudao told them he laments the fact he couldn't protect Olga being the one In charge of the singularity and such.\n\nWhy Mash is a burnt up walking corpse? - Goetia used a death laser on her, Beast 4 restored her life span, and Da vinci explains that her blood vessels and the like are fixed and her mana not functioning(that's all, didn't mention about state of body) , her body is now in a stasis of not dying since Galahad is still in her using the remaining and received mana to maintain her appearance.\n\nMash shouldn't get hurt if she gets mana. - The other Masters messed around with other female servants too much giving her a little dose only.\n\nEpilogue? Gudao lives in peace with his family, Da vinci hangs out with him and at one point decided to enlarge his pp and libido to have some fun along his wife who is actually willing."},{"id":2520962,"gallery_id":402543,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1652402471,"body":"Gudao explains although he was willing at first, Then he explains when (not servants) Assassins showed up with Chaldean equipment after his life , he says \"I want nothing to do with people that wants to hurt me\". The Good-willed servants understood and in accordance to their ex-master they began to return to the throne of heroes to prevent anymore damage, \n\nRemaining servants had to whore it to satisfy the Chaldeans and get unsatisfying sex daily, They treated it like work ever since the mana they received was abysmal which in turn dulled their senses so they ain't feeling it bunch.\n\nMash gets the short end of the stick although Da vinci and some geniuses did reason with Gudao, They couldn't go against his rebuttal after the attempted assassinations and his suggestion of using Chaldeans hi-tech medical systems to fix it. The genius (Da vinci) of Chaldea left, and was now maintained by Edison who now keeps an eye for Mash who is inside a restoration pod, She's awake, and is saddened"},{"id":2519944,"gallery_id":402543,"poster":{"id":3319326,"username":"geroyman","slug":"geroyman","avatar_url":"avatars/3319326.png","is_superuser":false,"is_staff":false},"post_date":1652368141,"body":"Bruh ya make Mash life Dark as fuck and yeh now that i really think about it Gudao is reallly important my boi deserves the best. He been saving the whole danm world for like so many times and got noth in return that seems like a joke to me"},{"id":2519678,"gallery_id":402543,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1652359375,"body":"And into detail, Y'know how Beast4 sacrificed itself so Mash gets her lifespan back, that was only the lifespan. After Gudao left She started to get blisters and Burns and Da vinci explained \"Although you did get your lifespan back, Galahad has been acting as your life support to maintain your current appearance, After not getting enough mana, Galahad will be unable to keep your form\" Da vinci explains if this goes on, she'd look like a walking burnt-up corpse. Being Demi-servant and all.\n\nChaldea informs the mage's association about the problem, but denies them contact with Gudao because \"There are no more singularities, Servants should return to the throne of heroes\" and \"There are 49 surviving masters, They are more than enough\"  \n\nGudao gets a wife and ahappy life whereas Chaldea superiors decided to track him, Good Servants gathered and contacted him first along the stolen servants pleading him to go back, he says no.\n\n- There's more i can fill the plot with but pls wait"},{"id":2519613,"gallery_id":402543,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1652357510,"body":"Let's say, Gudao, unable to take it anymore, decided to retire. Sent a letter to the Mage's Association and the Animusphere's regarding his retirement, Both groups accept it and Chaldea is authorized to let him go on the terms he gives up Authority on being a Master. \n\nHe accepts, before being given by Mash a \"farewell gift dvd\". Gudao is headed to the Mage's Asso., to get interviewed about the prev events and the conversation leads up to him asking if he can land a minor job without being surveilled. The mages lie, since they're figuring out what made him capable of fixing the singularities and his absurd authority of 300 servants.\n\n 3 days passed and Chaldea figured something was wrong, Majority of the servants are unable to maintain Physical form, Stolen servants with their own masters are incapable of being sensitive to sex, Masters are beginning to suffer from Mana exertion. The geniuses of Chaldea gathered and came to a conclusion that a normal Master usually only has one servant"},{"id":2519469,"gallery_id":402543,"poster":{"id":3319326,"username":"geroyman","slug":"geroyman","avatar_url":"avatars/3319326.png","is_superuser":false,"is_staff":false},"post_date":1652352598,"body":"Yeh like the man used somekind of Drugs that increase his Pp or increase those female servents sex drive and in the end everyone find out about it and regretted what they did to our boi Gudao"},{"id":2519152,"gallery_id":402543,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1652340427,"body":"The setting should be during or after fixing the Pseudo-singularity since Shuten appeared at the prev works and Canonically thinking it makes sense since most servants introduced themselves at the Goetia singularity. And Gudao should have a time frame of summoning the 300 servants  with Shuten being one of them."},{"id":2519117,"gallery_id":402543,"poster":{"id":2881632,"username":"Revenant6537","slug":"revenant6537","avatar_url":"avatars/2881632.png?_=6be9955004b7c87b","is_superuser":false,"is_staff":false},"post_date":1652339716,"body":"Would anyone like me to make up a revenge story based off on this? It'll be words but i guarantee Gudao moves on whereas Chaldea regrets it."},{"id":2518722,"gallery_id":402543,"poster":{"id":1671320,"username":"bnbnb","slug":"bnbnb","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652328402,"body":"good art but this story is just confusing"},{"id":2517343,"gallery_id":402543,"poster":{"id":662854,"username":"Goodest Christian Boi","slug":"goodest-christian-boi","avatar_url":"avatars/662854.png?_=eff8aeaa731d6adf","is_superuser":false,"is_staff":false},"post_date":1652271582,"body":"This one hella phat"},{"id":2516500,"gallery_id":402543,"poster":{"id":2193199,"username":"ImTired","slug":"imtired","avatar_url":"avatars/2193199.png?_=480a3803a7cc9d44","is_superuser":false,"is_staff":false},"post_date":1652240183,"body":"At least Jeanne uses her hypnosis to make Serenity betray master, and it's not just her ntr-ing him like everyone else. I am not excusing how it ends, because it ruins the theme and the storyline. It's like subverting expectations in the worst way possible. Trying to do something different but falling back into the same old routine. "},{"id":2516328,"gallery_id":402543,"poster":{"id":1311739,"username":"mr nel","slug":"mr-nel","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652231786,"body":"@luckenzio true i thought this was just a generic ntr but with serenity"},{"id":2516250,"gallery_id":402543,"poster":{"id":2834332,"username":"Luckenzio","slug":"luckenzio","avatar_url":"avatars/2834332.png?_=ce517f4b589f6ad0","is_superuser":false,"is_staff":false},"post_date":1652228342,"body":"What a fucking waste. Its just a rehash of what already happened with the other characters; not only repetitive but it also makes the relationship with Serenity less spicy and just reduces her to the same state as everyone else.\n\nLegitimately the most boring route this story could have taken."},{"id":2515898,"gallery_id":402543,"poster":{"id":3300811,"username":"Demavend","slug":"demavend","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652222441,"body":" What a freaking mess."},{"id":2515643,"gallery_id":402543,"poster":{"id":1965078,"username":"i love NTR","slug":"i-love-ntr","avatar_url":"avatars/1965078.png","is_superuser":false,"is_staff":false},"post_date":1652211949,"body":"finally the translation"},{"id":2515540,"gallery_id":402543,"poster":{"id":4572506,"username":"FateOverlord#1","slug":"fateoverlord-1","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652208023,"body":"... I...don't get it.\n\nIf you're gonna do a netorare story, why are you focusing so much on the guy getting cucked and not the guy doing it? I understand that sense of domination from having strong, beautiful women submit and I could...maybe understand getting it but this? This is just...confusing.\n\nAnd why is this series making up so much of the few Serenity doujins?"},{"id":2515341,"gallery_id":402543,"poster":{"id":3518320,"username":"Cleo Pepper","slug":"cleo-pepper","avatar_url":"avatars/3518320.png?_=abf8473dd612a0ab","is_superuser":false,"is_staff":false},"post_date":1652200245,"body":"Why do they love NTRing this guy so much"},{"id":2515251,"gallery_id":402543,"poster":{"id":3199663,"username":"harmonygirl23","slug":"harmonygirl23","avatar_url":"avatars/3199663.png?_=4e07f0fc696e8488","is_superuser":false,"is_staff":false},"post_date":1652197405,"body":"another boring messed up nasty shit with whore girls"},{"id":2514669,"gallery_id":402543,"poster":{"id":1175414,"username":"Lord_Smug","slug":"lord_smug","avatar_url":"avatars/1175414.png","is_superuser":false,"is_staff":false},"post_date":1652174955,"body":"Man I hate myself I already knew this was a sequel to the others and know it'd make me depressed but I still read through it because I read the previous ones "},{"id":2514655,"gallery_id":402543,"poster":{"id":5230837,"username":"6SilverWing9","slug":"6silverwing9","avatar_url":"avatars/5230837.png?_=b5981cea1da42611","is_superuser":false,"is_staff":false},"post_date":1652174235,"body":"Jeez i dont understand why these artists waste their art on ntr"},{"id":2514590,"gallery_id":402543,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1652170286,"body":"@lemmings serenity is crazy and got fuji cucked so she can have him to himself but she would go for anyone that can touch her cus poison don't bother reading it isn't interesting and was not worth the wait art is kinda meh compared to his OC works idk why his fgo and granblue ones seem kinda plain except maybe the first jalter ch"},{"id":2514551,"gallery_id":402543,"poster":{"id":35030,"username":"foxdash","slug":"foxdash","avatar_url":"avatars/35030.png","is_superuser":false,"is_staff":false},"post_date":1652168294,"body":"ok, so... none of that makes sense. but hey, tell me just one netorare that makes sense! this plot is just garbage!well, the fucking is... nice, apart from the ugly bastard, this chunk of fat ruin the girls image!"},{"id":2514545,"gallery_id":402543,"poster":{"id":1388793,"username":"Lemmings","slug":"lemmings","avatar_url":"avatars/1388793.png?_=3b702e3e6eb0bb51","is_superuser":false,"is_staff":false},"post_date":1652168140,"body":"Eyo, can someone explain the whole series to me, cuz aint no way im reading all that cucking"},{"id":2514543,"gallery_id":402543,"poster":{"id":2029608,"username":"山本栞","slug":"shan-ben-kan","avatar_url":"avatars/2029608.png?_=86d5b267d7a33d2a","is_superuser":false,"is_staff":false},"post_date":1652168096,"body":"I think this is gonna be my dinner. \nCant wait to go home. \n"},{"id":2514488,"gallery_id":402543,"poster":{"id":4564064,"username":"gaylord no.17","slug":"gaylord-no-17","avatar_url":"avatars/4564064.png?_=e00dc904c26b88e2","is_superuser":false,"is_staff":false},"post_date":1652165699,"body":"Weird a waste of art work"}]