[{"id":2520760,"gallery_id":402542,"poster":{"id":4285145,"username":"Nobody134","slug":"nobody134","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652395264,"body":"Learn the difference between whining and critisism Netorare06. "},{"id":2520521,"gallery_id":402542,"poster":{"id":5013457,"username":"Nhentaialt","slug":"nhentaialt","avatar_url":"avatars/5013457.png?_=a9623ea33f9fc15e","is_superuser":false,"is_staff":false},"post_date":1652386445,"body":"There's absolutely nothing about Rex that screams self insert he has an obvious personality that defines him on his own. Love or hate him he is not a blank slate so ateast mock him for the right reasons. And let's be real the only people into non canon pairings are those who feel cucked the Mc didn't get with them and think they can do better."},{"id":2520224,"gallery_id":402542,"poster":{"id":797633,"username":"Netorare06","slug":"netorare06","avatar_url":"avatars/797633.png?_=2a96afbc2305b988","is_superuser":false,"is_staff":false},"post_date":1652376468,"body":"Collective ass fisting for both of you since you are are the same species of looser. I don't hate him, don't like him: I just don't give a shit about your Kirito number158426, you won't see me wasting my time and energy under any doujin of him because he doesn't interest me. HOWEVER both of you come whining here because the one fucking the girl isn't your typical shota with zero personality to self insert. This is the definition of insecure and you both know it ;)"},{"id":2519087,"gallery_id":402542,"poster":{"id":4285145,"username":"Nobody134","slug":"nobody134","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652338697,"body":"Maybe because I for one actually care about Pyra and Mythra Netorare06. But according to your username I suppose you wouldn't understand something like that since you only care about pretty women getting fucked by guys they don't love. Suppose your tiny little brain can't comprehend that some people on this rock read these doujins because they care about the character you dumb fuck."},{"id":2518590,"gallery_id":402542,"poster":{"id":5013457,"username":"Nhentaialt","slug":"nhentaialt","avatar_url":"avatars/5013457.png?_=a9623ea33f9fc15e","is_superuser":false,"is_staff":false},"post_date":1652325190,"body":"Sorry Netorare06 but there's nothing interesting about a generic hentai anon that people desperately try to project themselves onto because the ending of XC2 made them feel cucked that Rex took their waifus so they want him to feel cucked in return. How is Rex even a self insert he's too defined as a character. Hate him or like I don't think you're supposed to project on him or Shulk. They're not Pokemon trainers."},{"id":2516519,"gallery_id":402542,"poster":{"id":797633,"username":"Netorare06","slug":"netorare06","avatar_url":"avatars/797633.png?_=2a96afbc2305b988","is_superuser":false,"is_staff":false},"post_date":1652240731,"body":"Damn, Nobody134, looking at your past comments, you really are out of the real world. Now, I will reveal to you something that may change your miserable life, you are not the protagonist of Xenoblade! I know the feeling but whether the guy fucking the Xenoblade girls is the pathetic shota that serve as self insert for even more pathetic invidual such as you or someone else, in that case a muscular and more interesting character change nothing."},{"id":2516343,"gallery_id":402542,"poster":{"id":4285145,"username":"Nobody134","slug":"nobody134","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652232385,"body":"Ugh... haven't seen crap like this in a while... Not only is it trash NTR... But it's also extremely out of character... Pyra would never do want this. "}]