[{"id":2530388,"gallery_id":403307,"poster":{"id":3218288,"username":"M%N","slug":"m-n","avatar_url":"avatars/3218288.png?_=caefd2e7d1ded745","is_superuser":false,"is_staff":false},"post_date":1652741059,"body":"user:3466489 i feel the same"},{"id":2530348,"gallery_id":403307,"poster":{"id":4819747,"username":"obamastacostand","slug":"obamastacostand","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652738729,"body":"@FapLord0 you belong in an asylum"},{"id":2530222,"gallery_id":403307,"poster":{"id":3466489,"username":"FapLord0","slug":"faplord0","avatar_url":"avatars/3466489.png?_=75df23c9a79541da","is_superuser":false,"is_staff":false},"post_date":1652731952,"body":"I'm melting by the quality of this masterpiece, oftenly I wish I wasn't born and I was aborted when I was in my mom's womb, but sometimes when I see things like this even if it's temporary I become happy, that's a masterpiece that every femdomer shall definitely see"},{"id":2530168,"gallery_id":403307,"poster":{"id":2941719,"username":"deletusfeetus45","slug":"deletusfeetus45","avatar_url":"avatars/2941719.png","is_superuser":false,"is_staff":false},"post_date":1652729661,"body":"This is a shocking amount of vore"},{"id":2530130,"gallery_id":403307,"poster":{"id":3278046,"username":"cush","slug":"cush","avatar_url":"avatars/3278046.png?_=794915eafd01dc2a","is_superuser":false,"is_staff":false},"post_date":1652728008,"body":"the lore and vore is not my thing but good art. already read this all but nice that its all put together here "},{"id":2530044,"gallery_id":403307,"poster":{"id":3466489,"username":"FapLord0","slug":"faplord0","avatar_url":"avatars/3466489.png?_=75df23c9a79541da","is_superuser":false,"is_staff":false},"post_date":1652725504,"body":"The only thing I complain about this doujinshi is that there are not enough succubi, there are only a few ones, personally I would like to be raped by thousands of succubi if possible until I die even by millions if it's possible and I wish they would do everything to me! Let them fuck me and vore me while 4 of them enter me from behind with their futanari dick (if being raped by the government and life in general doesn't make me gay, that won't either) 2 of them fuck me from the front qnd one of them suck my dick while the other millions wait for their turn, they can put a leash on me, cast a spell, do anything imaginable, and be as hardcore as possible! I have been fucked so much by life that that would feel even light to me"},{"id":2530024,"gallery_id":403307,"poster":{"id":3466489,"username":"FapLord0","slug":"faplord0","avatar_url":"avatars/3466489.png?_=75df23c9a79541da","is_superuser":false,"is_staff":false},"post_date":1652724942,"body":"I wish I was their sex slave until I die all my life, no food, no shelter, only love and eternal pleasure, what I regret is that it is these few little brats who were raped by them, not me, what do they have that I don't? They even put a collar on him! A collar?! Can you imagine? A collar! A damn beautiful collar that is the officialisation of being enslaved by them!\nInstead, what I'm doing now is going to school, paying taxes in the future and dying, unfortunately I will never in my life be raped and killed by such beautiful succubuses.\nI was raped by my parents (many things aside, even only the fact that I was born is enough), raped by the government, raped by the people, and not raped by succubuses, that makes me gae.\n"},{"id":2530016,"gallery_id":403307,"poster":{"id":1854959,"username":"emperor104","slug":"emperor104","avatar_url":"avatars/1854959.png","is_superuser":false,"is_staff":false},"post_date":1652724602,"body":"Wait a minute...THIS IS ONLY VOLUME ONE???"},{"id":2530011,"gallery_id":403307,"poster":{"id":3466489,"username":"FapLord0","slug":"faplord0","avatar_url":"avatars/3466489.png?_=75df23c9a79541da","is_superuser":false,"is_staff":false},"post_date":1652724392,"body":"Those with toxic masculinity would probably refuse to take their tails to their ass, but come on?! Really? Maybe not physically but mentally being raped from your ass by somethings everyday without even receiving a pleasure, doesn't make you gay, and being anally raped by hot beautiful and cute succubi onee-sama makes you gay? I'm 100% heterosexual as fuck and I, as a true heterosexual, accept being anally and hardcorely raped by them in my ass until I die! In fact, more hardcore they would be, more better they would be, at the beginning they  are a little bit too gentle but as long as story advances they become more and more hardcore, that's the true example of a character development which could be subjugated with optimistic nihilism"},{"id":2529999,"gallery_id":403307,"poster":{"id":3466489,"username":"FapLord0","slug":"faplord0","avatar_url":"avatars/3466489.png?_=75df23c9a79541da","is_superuser":false,"is_staff":false},"post_date":1652724012,"body":"If god really existed, it would be these cuty cuty one-samas, they are indeed more helpful than this lazy mazy god, after seeing that I concluded that succubi are better than god! I don't mind about taking their tails to my ass, at this point they can literally do everything to me! Whatever they do, it will give me pleasure anyway, a pleasure that is my gate toward the peaceful death, people like Adolf Hitler kill people by giving them zero pleasure while these cutiiii cutiiiiiii (FUCK WHY THEY ARE SO DAMN CUTE I LOVE THEM I THINK I FELL IN LOVE WITH THEM) succubi onee-samas kill people by giving them pleasure! You see gentlemen? Reality is trash and 2D is obviously better than 3D, those who say the opposite shall go to the doctor because they are obviously mentally ill!"},{"id":2529980,"gallery_id":403307,"poster":{"id":3466489,"username":"FapLord0","slug":"faplord0","avatar_url":"avatars/3466489.png?_=75df23c9a79541da","is_superuser":false,"is_staff":false},"post_date":1652723472,"body":"Angels that everybody deserves, our way of quitting this trashy world where we are oftenly nothing else than a wage slave who try to escape from their problems by consuming things, so many people raped so many people in the history... Genghis Khan, and that's literally, raped millions of women, Adolf Hitler raped millions of jew, Stalin raped millions of russians, and plenty other historic personalities whom I don't even know raped plenty other people, just tell me... We are everyday being raped by things, maybe our parents, maybe the government, maybe a random jackass that decided to start war in another side of the world just for the sake of his personal pleasure, at this case, as people who are always being raped by somethings, less or more and in one way or another, why would you even refuse to be raped by these onee-samas at least one damn time? And at least, they give you REAL pleasure"},{"id":2529975,"gallery_id":403307,"poster":{"id":3466489,"username":"FapLord0","slug":"faplord0","avatar_url":"avatars/3466489.png?_=75df23c9a79541da","is_superuser":false,"is_staff":false},"post_date":1652723229,"body":"These cuty cuty oneeeeee-chwaaaaaaaaaaans would surely treat me well, they are surely more useful than this worthless god though, what does god do against all the bad things that happened and keep happening in the world like war, genocide, domestic violence? Nothing, what these cuty cuty oneeeeeeeeeeee-chwaaaaaaaaaaaaaaaaaaaaans (&lt;3 &lt;3 &lt;3 &lt;3 &lt;3 &lt;3 &lt;3 &lt;3 &lt;3 &lt;3 &lt;3 &lt;3) do? They bring us to the nirvana whose maybe nobody beside us could truly ever reach, personally I wish I was never born and at this point I wouldn't mind at all dying in the hand of these cuty cuty onee-samaaa one-chwaaaaaaaaaaaaaaaaaaaaaaaaans, I mean despite everything they fuck us less hardcore than the government and this so called worthless god that is said to exist, and contrarily to them, they give us real pleasure! Just imagine, would you like to be raped by Putin or by these cuty cuty (&lt;3 fuck I love them so much) one-chwans? Personally even if I was gay I wouldn't choose Putin, these so called succubi are in fact"},{"id":2529967,"gallery_id":403307,"poster":{"id":3209082,"username":"Fortnite battlepass","slug":"fortnite-battlepass","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652722823,"body":"UOOOOOOOH YUMMY ONEE SAN SUCCUBUS MILKERS MONKE NEURON ACTIVATION SEQUENCE NUT PLEASING"},{"id":2529962,"gallery_id":403307,"poster":{"id":3466489,"username":"FapLord0","slug":"faplord0","avatar_url":"avatars/3466489.png?_=75df23c9a79541da","is_superuser":false,"is_staff":false},"post_date":1652722634,"body":"I would like so much to be milked dry by these succubi onee-sans, I would maybe die but it's still worth it and it's a total win-win situation, I die by having an extreme amount of pleasure without a pain or that is outweighted by the pleasure all by exiting this trashy world and going back to the eternal chill non-existence? Great, if only I was these boys... If only I was them, that's the dream, that's the dream that every mentally sane boy must reach, that's the purpose of us coming into this world... Going back to the eternal chill void all by being hardcorely raped by cuty cuty onee-chwans, I would just take a step, and let them do the rest &lt;3 They are so cuty cuty, so beautiful, I can't believe they are named \"succubi\" while they are obviously better than angels! What angels do? Nothing, or god's work. What does succubi do? Helping someone to go out from this worthless life all by raping them and making them reach the nirvana"},{"id":2529886,"gallery_id":403307,"poster":{"id":3359540,"username":"purpurpickle","slug":"purpurpickle","avatar_url":"avatars/3359540.png?_=6087a87f0cb199d2","is_superuser":false,"is_staff":false},"post_date":1652719737,"body":"Wtf it has l o r e"},{"id":2529884,"gallery_id":403307,"poster":{"id":2124372,"username":"Milky Way","slug":"milky-way","avatar_url":"avatars/2124372.png?_=d71c1fdd623ef0d8","is_superuser":false,"is_staff":false},"post_date":1652719535,"body":"Hmm vore...."},{"id":2529817,"gallery_id":403307,"poster":{"id":5271200,"username":"Cirno\"Udongein\"Cirno","slug":"cirno-udongein-cirno","avatar_url":"avatars/5271200.png?_=5ff03ab7c4035db7","is_superuser":false,"is_staff":false},"post_date":1652717043,"body":"Title reminds me of that rin&amp;len songs "},{"id":2529790,"gallery_id":403307,"poster":{"id":3959512,"username":"Myers gaming","slug":"myers-gaming","avatar_url":"avatars/3959512.png?_=9e6b03ed24372bec","is_superuser":false,"is_staff":false},"post_date":1652716161,"body":"that is the *complete edition* nice"},{"id":2529669,"gallery_id":403307,"poster":{"id":4447563,"username":"Marquis de Sade","slug":"marquis-de-sade","avatar_url":"avatars/4447563.png?_=dfea5947c56c497e","is_superuser":false,"is_staff":false},"post_date":1652711438,"body":"so there is a \"tailjob\" tag...."}]