[{"id":2536770,"gallery_id":403325,"poster":{"id":5112995,"username":"Kimberly34","slug":"kimberly34","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652982116,"body":"6143332 Want to see me licking my girlfriend's pussy on webcam, go to ( www.bakusai.xyz  )\n"},{"id":2532615,"gallery_id":403325,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1652832474,"body":"The island got practice using parasitic worm they revere as embodiment of their god. The worm cause women to feel intense craving and pleasure, as well as making them more attractive and maintaining their youth. In the island, there are families with Oki (沖, sea) in their family name, those have higher status. Okishiro Kanna, the MC, is a priestess. She was raised with that duty and her bloodline has stronger resistance to the worm so they don't quickly went insane. Her friend Akira offered her to live together when they went out of the island after graduation. Akira actually loves a boy who don't see her as a girl, so she got tricked to ingest the worm and lose her mind. Next is Chikako, the teacher who tried to investigate into the ritual. The guy in the end is from Okihata, family tasked to handle disposal of mindbroken women. He said he wants a revenge for Kanna's mother, but later Kanna founds out he wants to sell the worm, as well as Kanna and the other two women as specimens. "},{"id":2530511,"gallery_id":403325,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1652747070,"body":"About the Hiruko, in myth, he's supposed to be the first and failed child of Izanagi and Izanami (the father and mother god of Shinto). When marrying, they got the procedure wrong, where the woman propose the man (it enforce that the 'right' way is for man to take initiative and woman as receiver) so their child is born as a boneless thing (Hiruko literally means 'leech child'). They drifted the child away to the sea before doing the marriage in the right way and give birth to other gods. Hiruko later return to myths as Ebisu, the lucky god of fisheries. Also, the fictional island's name in this story, Okiko, literally means 'sea child island', but with different writing can also means 'island to leave child'. The islanders consider their home as where the god was abandoned."}]