[{"id":2558155,"gallery_id":403572,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653858749,"body":"Yeah the underlings COULD still go for that couple as easy targets. But who's to say the boss would be too happy with the underlings! If Gyaru was \"doing what she likes in Glasses Territory\" with THEM following her orders! Then he'd be pretty unhappy with them as he would with her! Telling on her AFTER the fact means their on thin ice for not report SOONER (She may have some connections enough to utilize them, but not enough for the amount of abuse she was taking liberties with), so they may have to be more \"quiet\" in how they operate (not doing something as brazen as they did for example in part 1) less the boss punish them! (His attention was on the Gyaru after all and how to punish her at the moment! No need to provoke his ire enough to punish them, giving them an \"allowance\" of \"one time exception\" with the next fuck up being a mix of what he would have done prior AND at that point!) Either way Bad People are doing bad things and aren't punished all the same!"},{"id":2558144,"gallery_id":403572,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653858403,"body":"@minminazusa That's only IF the boss decides that's enough! The gangsters could also be told to stay away as it would bring way more attention then they'd want (it was already bad enough they were pretty public with grabbing them like they did) I can't see their boss letting them continue messing with that couple because the blackmail was more to protect against getting reported (But Hentai Logic dictates that they can use it to get what they want....instead of the victim taking the chance to report them if their backed into a corner as what would happen in real life with blackmail, in this usage it's defensive protection and if used to extort, might bring retaliation in a \"going down with me\" manner). Gyaru also looks broken, so who's to say the Boss doesn't just \"prostitute\" her and her friends to make up for her \"slight\" as well. He's not a good guy which is why I put forward the couple might be safe in that their too noticeable by others! But Gyaru is trash and expected to be so!"},{"id":2557128,"gallery_id":403572,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1653809042,"body":"She could have minimized the risk if she's finish just by giving that couple their \"lesson\" once and walks off. The gangsters might look for her later, but she's not too involved with them, and might gets away with slaps and paying the boss as it's not repeated offense. More likely the underlings would just play with the easy fish (the victim couple) but that's totally their business now. As for the friends, seeing page 10 and 11, they're probably more like followers, and there are hierarchy between them. So, yeah, there's not much reason to stay if it's obviously will just bring them disaster."},{"id":2556930,"gallery_id":403572,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653800730,"body":"@minminazusa That was my second guess! That's just funny as hell though, she should have left the couple alone. But just had to do a terrible thing for the EVULZ and provoked someone she shouldn't! The blackmail is likely there for them, though they seem more focused on her, so it's likely they'll be left alone! But for her, it's going to be HELL now that she's provoked someone bigger then her! Reminds me of the perverted crooked cop from Paranoia Agent! He kept acting smug to a Yakuza Boss, believing his position as a cop protected him, only for the boss's subordinate to put him in his place and brought him back to reality on just how bad he can be destroyed if he doesn't pay them a debt (owed for his constant squeezing of the guy's boss plus interest). And again I doubt her shitty friends will hang around her anymore, getting dragged into it and of course very much traumatized as they were shown their no different then their victims! Sheep who got arrogant and had to be smacked!"},{"id":2556685,"gallery_id":403572,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1653791636,"body":"@Mephestopheles: So, I'm not sure what's Akane (the gyaru) background is. The guy with glasses is like boss of the thugs. The thugs who Akane refused sex, reported to their boss someone has been doing as she like in their territory. Seeing the situation, Akane is brought in for two crimes. First, she is whoring out Miyu (the GF) but never paid respect to the boss, Second, she's been using someone else's lackey, also without permission. The boss wants to teach her a lesson, and make an example for anyone who would try to do stupid thing like that. "},{"id":2556386,"gallery_id":403572,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653779469,"body":"@HiddenStorm Yeah I agree, that was likely from what she did to the couple before raping the BF and having the GF Gang Raped. First have those close to her do so, at first their against it and doing it under threat, but I'm sure deep down they were already going to cut her off after this and blaming her for why their doing this to her now. It's her fault this is happening! To her though, she's going to be in a rough spot afterwards! The couple are free from the blackmail I'm guessing, and while Traumatized, have each other to lean on. While she has no one and WILL have no one as I said, I don't see her female friends staying associated with her after the shit they got \"dragged into!\" (But I'm guessing the scene with them early showed they knew what she did and laughed at the couples misery! So they knew who they hanged around with) and now the RAPISTS have some control over her. So the question to her is \"Was what she did to the couple worth it in the end!\""},{"id":2556377,"gallery_id":403572,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653779186,"body":"@Mephestopheles He might be related to one or both members of that couple she fucked with and decided to get revenge for them! Or she might have crossed a line that this is a \"bad man delivering Karma on a bad person\" type of thing! @xyst16 yeah she traumatized the black haired girl, but that couple can eventually recover and her social life is still protected now that the blackmail she used to protect herself is rendered MOOT! (Seeing how some of the assholes she had contact with joined in HER gang rape, likely hood was the other guy paid them and they always hated her. Or this was escape from retribution from him! Either way that blackmail from the couple is very much GONE! Though hers exist! I'm sure her shitty female friends are done with her after her actions \"dragged them\" into the rape despite the fact they were fully aware of how she is and what she does and laughed at her actions! Not so great when your \"on the bad side of it!\" The couple have each other, Bitch has no one)"},{"id":2537809,"gallery_id":403572,"poster":{"id":2159343,"username":"ipodnano","slug":"ipodnano","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1653022165,"body":"this is what I exactly want to see, dark skin girl got trained/punished by sex toys. Perfect."},{"id":2535626,"gallery_id":403572,"poster":{"id":2101111,"username":"HiddenStorm","slug":"hiddenstorm","avatar_url":"avatars/2101111.png?_=8dc5d138bb536ada","is_superuser":false,"is_staff":false},"post_date":1652941952,"body":"Having those two girls fuck her was like the icing on the cake"},{"id":2535114,"gallery_id":403572,"poster":{"id":3016628,"username":"Mephestopheles","slug":"mephestopheles","avatar_url":"avatars/3016628.png?_=580e6c4a377b9cac","is_superuser":false,"is_staff":false},"post_date":1652925980,"body":"I read the last chapter, but what exactly happened in this one? Who is that guy with the glasses and why'd he do al this? "},{"id":2535058,"gallery_id":403572,"poster":{"id":641961,"username":"Atang","slug":"atang","avatar_url":"avatars/641961.png?_=450a0c44c6bab036","is_superuser":false,"is_staff":false},"post_date":1652924647,"body":"bitch got no u'd"},{"id":2534790,"gallery_id":403572,"poster":{"id":728491,"username":"xyst16","slug":"xyst16","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1652914537,"body":"The bitch got her punishment but she already destroyed the life of the previous girl(black hair girl), so is a bitter sweet revenge"},{"id":2534780,"gallery_id":403572,"poster":{"id":3423516,"username":"user_A_exist","slug":"user_a_exist","avatar_url":"avatars/3423516.png?_=abb022accdee2e90","is_superuser":false,"is_staff":false},"post_date":1652914312,"body":"Well well, she played with fire thinking money &amp; neat puss could solve everything..."},{"id":2534731,"gallery_id":403572,"poster":{"id":1720355,"username":"henta1lover","slug":"henta1lover","avatar_url":"avatars/1720355.png?_=631704b7993246cc","is_superuser":false,"is_staff":false},"post_date":1652912135,"body":"I wanted for the guy from the last chapter to get his revenge on this bitch but I guess I'll settle on seeing her like this"}]