[{"id":2546528,"gallery_id":403761,"poster":{"id":2013630,"username":"ascallon","slug":"ascallon","avatar_url":"avatars/2013630.png","is_superuser":false,"is_staff":false},"post_date":1653375592,"body":"I'm convinced ankoman just has some base character sheets and he just puts on different clothes and publishes it as a new doujin\n"},{"id":2541821,"gallery_id":403761,"poster":{"id":4986456,"username":"U.P.R.Y.","slug":"u-p-r-y","avatar_url":"avatars/4986456.png?_=865ef9b1db51128f","is_superuser":false,"is_staff":false},"post_date":1653186759,"body":"I agree w/ you"},{"id":2540006,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653115050,"body":"Distillation, or classical distillation, is the process of separating the components or substances from a liquid mixture by using selective boiling and condensation. Dry distillation is the heating of solid materials to produce gaseous products (which may condense into liquids or solids). Dry distillation may involve chemical changes such as destructive distillation or cracking and is not discussed under this article. Distillation may result in essentially complete separation (nearly pure components), or it may be a partial separation that increases the concentration of selected components in the mixture. In either case, the process exploits differences in the relative volatility of the mixture's components. In industrial applications, distillation is a unit operation of practically universal importance, but it is a physical separation process, not a chemical reaction."},{"id":2539840,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653109457,"body":"Discrimination is the act of making unjustified distinctions between people based on the groups, classes, or other categories to which they belong or are perceived to belong.[1] People may be discriminated on the basis of race, gender, age, religion, disability, or sexual orientation, as well as other categories.[2] Discrimination especially occurs when individuals or groups are unfairly treated in a way which is worse than other people are treated, on the basis of their actual or perceived membership in certain groups or social categories.[2][3] It involves restricting members of one group from opportunities or privileges that are available to members of another group.[4]"},{"id":2539832,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653109290,"body":"An invasion is a military offensive in which large numbers of combatants of one geopolitical entity aggressively enter territory owned by another such entity, generally with the objective of either conquering; liberating or re-establishing control or authority over a territory; forcing the partition of a country; altering the established government or gaining concessions from said government; or a combination thereof. An invasion can be the cause of a war, be a part of a larger strategy to end a war, or it can constitute an entire war in itself. Due to the large scale of the operations associated with invasions, they are usually strategic in planning and execution."},{"id":2539829,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653109155,"body":"Annexation (Latin ad, to, and nexus, joining), in international law, is the forcible acquisition of one state's territory by another state, usually following military occupation of the territory.[1] It is generally held to be an illegal act.[2] Annexation is a unilateral act where territory is seized and held by one state,[3] is distinct from conquest[a][6][7] and differs from cession, in which territory is given or sold through treaty.\n\nAnnexation can be legitimized if generally recognized by other states and international bodies.[3][8][1]\n\nThe illegality of annexation means that states carrying out such acts usually avoid using the word annexation in describing their actions;[9][10] in each of the unresolved annexations by Israel, Morocco and Russia, the states have avoided characterizing their actions as such.[10][11]"},{"id":2539823,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653108892,"body":"Freedom is understood as either having the ability to act or change without constraint or to possess the power and resources to fulfill one's purposes. Freedom is often associated with liberty and autonomy in the sense of \"giving oneself their own laws\", and with having rights and the civil liberties with which to exercise them without undue interference by the state. Frequently discussed kinds of political freedom include freedom of assembly, freedom of association, freedom of choice, and freedom of speech."},{"id":2539815,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653108591,"body":"The ammonium ion is generated when ammonia, a weak base, reacts with Brønsted acids (proton donors):\n\nH+\n + NH\n3 → NH+\n4\nThe ammonium ion is mildly acidic, reacting with Brønsted bases to return to the uncharged ammonia molecule:\n\nNH+\n4 + B−\n → HB + NH\n3\nThus, treatment of concentrated solutions of ammonium salts with strong base gives ammonia. When ammonia is dissolved in water, a tiny amount of it converts to ammonium ions:\n\nH\n2O + NH\n3 ⇌ OH−\n + NH+\n4\nThe degree to which ammonia forms the ammonium ion depends on the pH of the solution. If the pH is low, the equilibrium shifts to the right: more ammonia molecules are converted into ammonium ions. If the pH is high (the concentration of hydrogen ions is low and hydroxide ions is high), the equilibrium shifts to the left: the hydroxide ion abstracts a proton from the ammonium ion, generating ammonia."},{"id":2539810,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653108453,"body":"Uranium-238 (238U or U-238) is the most common isotope of uranium found in nature, with a relative abundance of 99%. Unlike uranium-235, it is non-fissile, which means it cannot sustain a chain reaction in a thermal-neutron reactor. However, it is fissionable by fast neutrons, and is fertile, meaning it can be transmuted to fissile plutonium-239. 238U cannot support a chain reaction because inelastic scattering reduces neutron energy below the range where fast fission of one or more next-generation nuclei is probable. Doppler broadening of 238U's neutron absorption resonances, increasing absorption as fuel temperature increases, is also an essential negative feedback mechanism for reactor control."},{"id":2539806,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653108287,"body":"Neurotoxins are toxins that are destructive to nerve tissue (causing neurotoxicity).[3] Neurotoxins are an extensive class of exogenous chemical neurological insults[4] that can adversely affect function in both developing and mature nervous tissue.[5] The term can also be used to classify endogenous compounds, which, when abnormally contacted, can prove neurologically toxic.[4] Though neurotoxins are often neurologically destructive, their ability to specifically target neural components is important in the study of nervous systems."},{"id":2539803,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653108108,"body":"The Tomahawk (/ˈtɒməhɔːk/) Land Attack Missile (TLAM) is a long-range, all-weather, jet-powered, subsonic cruise missile that is primarily used by the United States Navy and Royal Navy in ship- and submarine-based land-attack operations.\n\nUnder contract from the U.S. Navy, the Tomahawk was designed at the APL/JHU in a project led by James Walker near Laurel, Maryland, and was first manufactured by General Dynamics in the 1970s. It was intended to fill the role of a medium- to long-range, low-altitude missile that could be launched from a naval surface warfare platform, and featured a modular design accommodating a wide variety of warhead, guidance, and range capabilities."},{"id":2539791,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653107627,"body":"Storm Shadow is an Anglo-French low-observable air-launched cruise missile, developed since 1994 by Matra and British Aerospace, and now manufactured by MBDA. Storm Shadow is the British name for the weapon; in French service it is called SCALP EG (Système de Croisière Autonome à Longue Portée – Emploi Général, meaning General Purpose Long Range Cruise Missile). The missile is based on the earlier MBDA Apache anti-runway missile, and differs in that it carries a warhead rather than submunitions."},{"id":2539784,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653107403,"body":"The R-36 (Russian: Р-36) is a family of intercontinental ballistic missiles (ICBMs) and space launch vehicles (Tsyklon) designed by the Soviet Union during the Cold War. The original R-36 was deployed under the GRAU index 8K67 and was given the NATO reporting name SS-9 Scarp. It was able to carry three warheads and was the first Soviet MRV (multiple re-entry vehicle) missile.[1] The later version, the R-36M was produced under the GRAU designations 15A14 and 15A18 and was given the NATO reporting name SS-18 Satan."},{"id":2539782,"gallery_id":403761,"poster":{"id":4138998,"username":"SomeHornyPersonnel","slug":"somehornypersonnel","avatar_url":"avatars/4138998.png?_=85bd09da4f47a733","is_superuser":false,"is_staff":false},"post_date":1653107277,"body":"for fuck sake"},{"id":2539772,"gallery_id":403761,"poster":{"id":4986456,"username":"U.P.R.Y.","slug":"u-p-r-y","avatar_url":"avatars/4986456.png?_=865ef9b1db51128f","is_superuser":false,"is_staff":false},"post_date":1653106840,"body":"The pose in page 3 is literally the same pose Koyanskaya does in another ankoman doujin"},{"id":2539758,"gallery_id":403761,"poster":{"id":4980604,"username":"atorus","slug":"atorus","avatar_url":"avatars/4980604.png?_=bae3d0fac7dd6fa2","is_superuser":false,"is_staff":false},"post_date":1653106216,"body":"Well its ankoman sooo yeah"},{"id":2539678,"gallery_id":403761,"poster":{"id":3378767,"username":"blubstubs","slug":"blubstubs","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1653102701,"body":"Does anybody else get kinda bored on Ankoman's work? Like he's been doing a pallette swaps of the same 4 page NTR for like 2 years now. You could make an Ankoman randomizer and it would be the same sequence   again and again"},{"id":2539638,"gallery_id":403761,"poster":{"id":4049,"username":"qohank","slug":"qohank","avatar_url":"avatars/4049.png?_=79837ed153a5ed25","is_superuser":false,"is_staff":false},"post_date":1653100620,"body":"This one is inevitable... "},{"id":2539574,"gallery_id":403761,"poster":{"id":4540949,"username":"DIO, Gone to Heaven","slug":"dio-gone-to-heaven","avatar_url":"avatars/4540949.png?_=f2d9278314bcb891","is_superuser":false,"is_staff":false},"post_date":1653097665,"body":"GOD ANKOMAN"},{"id":2539489,"gallery_id":403761,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1653093563,"body":"Stupid plot. "},{"id":2539482,"gallery_id":403761,"poster":{"id":4158961,"username":"Bigge cheese ☑️","slug":"bigge-cheese","avatar_url":"avatars/4158961.png?_=0e4135677f6e3ae3","is_superuser":false,"is_staff":false},"post_date":1653093195,"body":"typical ankoman\n"},{"id":2539398,"gallery_id":403761,"poster":{"id":3730928,"username":"swaggon99","slug":"swaggon99","avatar_url":"avatars/3730928.png?_=6ced945812ae24d9","is_superuser":false,"is_staff":false},"post_date":1653088376,"body":"Ankoman greatness!!!"},{"id":2539344,"gallery_id":403761,"poster":{"id":1728525,"username":"Filthy Dweeb","slug":"filthy-dweeb","avatar_url":"avatars/1728525.png?_=b91671b32b5aba08","is_superuser":false,"is_staff":false},"post_date":1653085950,"body":"It's look who it is"},{"id":2539263,"gallery_id":403761,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1653081882,"body":"Not the first, someone uploaded the chinese version of this doujin already"},{"id":2539162,"gallery_id":403761,"poster":{"id":4525997,"username":"honzu","slug":"honzu","avatar_url":"avatars/4525997.png?_=72d1bee79637478a","is_superuser":false,"is_staff":false},"post_date":1653076683,"body":"The truth cannot be ntr since they are not a couple in themselves, and they may have done so before they met. "},{"id":2539156,"gallery_id":403761,"poster":{"id":4525997,"username":"honzu","slug":"honzu","avatar_url":"avatars/4525997.png?_=72d1bee79637478a","is_superuser":false,"is_staff":false},"post_date":1653076558,"body":"Thank you for being the first to do this. haha"},{"id":2539085,"gallery_id":403761,"poster":{"id":4422938,"username":"Chris_downbad","slug":"chris_downbad","avatar_url":"avatars/4422938.png?_=1732115aae005cd1","is_superuser":false,"is_staff":false},"post_date":1653074135,"body":"LOVE YOU ANKOMAN‼️‼️‼️‼️🥰🥰🥰🛐🛐🛐💯💯💯🔥🔥🔥🙏🏽🙏🏽😫😫😫❤️❤️❤️"},{"id":2538793,"gallery_id":403761,"poster":{"id":195867,"username":"Elitez","slug":"elitez","avatar_url":"avatars/195867.png?_=1bd3ad8eb5ab22ee","is_superuser":false,"is_staff":false},"post_date":1653063648,"body":"typical ankoman"},{"id":2538765,"gallery_id":403761,"poster":{"id":2812512,"username":"LoliconScholar","slug":"loliconscholar","avatar_url":"avatars/2812512.png?_=18f333a0baa604de","is_superuser":false,"is_staff":false},"post_date":1653062705,"body":"first     "}]