[{"id":2628971,"gallery_id":404230,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1657185222,"body":"Better then seeing her with fucking kurilin/krillin which comes off as unnatural as possible, there have been plenty of BS pairings in jap media, but out of all of them, her and that lil freaky cartoonishly faced (which is hereditary, see their mutt daughter) midget takes the shit cake. There is miscegenation, then there is fucking toriyama or toei or shueisha, whichever the fuck was behind that idea. I understand they wanted to throw him a bone for sticking around since the vanilla DB days and getting shitted on like almost everything else in that show that isn't a bloody saiyan, throwing a museum of valued ancient bones at was too much over the top, they should've just gotten one of those weirdo characters from his dr.dump show, plenty of freaks there. That was 100% a bullshit shock value move that it didn't add anything other then \"look at this, it's now a thing, we wrote it,  doesn't it make all you short asian men happy and encouraged?\"\nTL;DR = Fuck her dr.gero."},{"id":2628948,"gallery_id":404230,"poster":{"id":3345097,"username":"Typical japanese MainCharacter","slug":"typical-japanese-maincharacter","avatar_url":"avatars/3345097.png?_=2be920ed164cafb3","is_superuser":false,"is_staff":false},"post_date":1657184620,"body":"@capt. ntr you would when you hold a grudge against some overpowered monkey from space (he got that in common with the \"shofu\" from DBZ GT, remember? That race the saiyans wiped out and took their tech? That one who calls himself \"baby\"? Gero is basically an Earth version of him, got fucked over by saiyans + possessing the technological know how to get back at them = must carry out revenge, if only, out of principle. At the end of Z &amp; GT, goku acknowledges that he has fucked with too many over the course of his career and that always finds its way back to Earth being in danger, so he decides to go and stay gone... 'till toriyama, toei and shueisha needs more money) who foiled your or your organization's plans and you know that with enough time and preparation, you may be able to repay the favor with interests. Matter of fact, he did, at least in some timeline, it took a time traveler to foil that. His cyber enhanced pretty killer twins plan worked in future trunks timeline just fine."},{"id":2615595,"gallery_id":404230,"poster":{"id":2179205,"username":"battokyaimaru","slug":"battokyaimaru","avatar_url":"avatars/2179205.png?_=bed6aa096c15f200","is_superuser":false,"is_staff":false},"post_date":1656557747,"body":"i love these eye on eye"},{"id":2551593,"gallery_id":404230,"poster":{"id":3611154,"username":"Captain Netorare","slug":"captain-netorare","avatar_url":"avatars/3611154.png?_=b2106edd97eeffb8","is_superuser":false,"is_staff":false},"post_date":1653600548,"body":"Tbh why you would give a fuck about some revenge when you get to fuck 18?, anyways the red patrol leader was a joke if Gero knew his goal he would kill him.\nIf I was Gero I would enjoy my immortality and fuck 18 on daily basis."},{"id":2547181,"gallery_id":404230,"poster":{"id":1935969,"username":"Clueless guy","slug":"clueless-guy","avatar_url":"avatars/1935969.png?_=62826a525589977a","is_superuser":false,"is_staff":false},"post_date":1653406525,"body":"Anyone know any doujin that just like this one? "},{"id":2547062,"gallery_id":404230,"poster":{"id":643816,"username":"bazzax","slug":"bazzax","avatar_url":"avatars/643816.png?_=d106c544508444aa","is_superuser":false,"is_staff":false},"post_date":1653402063,"body":"soon kill Dr Gero, :)"},{"id":2546175,"gallery_id":404230,"poster":{"id":3398412,"username":"derrrrpppp","slug":"derrrrpppp","avatar_url":"avatars/3398412.png?_=56490d11337d62ac","is_superuser":false,"is_staff":false},"post_date":1653361650,"body":"Rimming? Foot licking? All thats missing is piss drinking and coprophagia, great work."}]