[{"id":2556912,"gallery_id":404503,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653800180,"body":"@minminazusa Worse thing about that would be it turns out those were \"just the failure heirs\" the ones who lost their minds to madness or were unable to be used for the old man's goals! While it seems the BF may be the closes he's gotten to his goal, hence the attempt to keep him from leaving (as others who said he should have left his GF! I don't think it would have stopped his jailer's \"mother\" from interfering with his escape attempt). The reason I think their failures is the insane looks in their eyes! I'm guessing all the woman of his \"harem\" were their former lovers he did the same thing at the end of this chapter with Ayami on BF (except he didn't go mad but moved to escape when the chance arised) That's my guess though! (Thinking the shared senses allows him to control the girls to get them to act as he wants, the other girls were already insane by this point! Ayami still has some of her sanity as she looks \"Winded\" after BF punches the old man and is trying to carry her out!)"},{"id":2556628,"gallery_id":404503,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1653790047,"body":"Your summary of that other title... sounds as fucked up as Junji Ito's \"Honored Ancestors\" although that one is obviously just weird and not ntr ^^;; | Agreed about him possibly being made heir. It's not just the torture, keeping him in the library made it seems like they want him to inherit the knowledge about the cult. But a grim thing about the ending of this chapter is page 5. When Ayami first entered the tower, he saw in a cell, two men are fucking, which is why she hurried in worry her boyfriend will also lost his mind like that. "},{"id":2556495,"gallery_id":404503,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653785523,"body":"I know I'm adding more comments! But looking at this one again. I wonder, can the old man induce some form of mind control with that shared senses? if so that would explain the GF behavior abit and means her acting like a typical \"NTR Stolen Girl turned Bitch\" wasn't fully her choice, but because of the manipulations likely believes those were her true thoughts! I'm not a fan of NTR of this caliber (more Reverse NTR where the Girl is the stealer of men), but when they have an interesting story. I can dig it! Calling it now that the BF will be the new \"Head Guy\" (Have to wonder what that shit of the guy fucking the other guy was about?)"},{"id":2556483,"gallery_id":404503,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653785052,"body":"\"Continued from last post\" And yeah by the time HER son brings in a new girl. She knows what fate has in store for them. But instead is so broken and brainwashed she only has semi happiness cause it means she can finally have sex with her husband...even though she's breaking her son when he finds out just like what happened with her husband (The father/brother and grandfather even stated the son wouldn't leave after being horrified because he was just like his father, would come back and embrace cuckhood! Even make a deal with his father EXACTLY like what he did with his own father before to get his wife back!) and Before that story there was one where the guy wanted his Mother and in exchange tricked some poor girl into marrying him so he could hand her off easily to his father and neighbors as their new toy, and the worst thing, it's hinted it happened with the Mother as well! Showing the new girl her \"fate\" to have a son who will fall in love with her and her him Cycle continues! "},{"id":2556473,"gallery_id":404503,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653784791,"body":"But this story reminds me of a fucked up one where a guy discovered he was from a long line of Men who cuckhold their sons (even worse his dad was actually his older brother and his grandfather their father) by their sons falling in love with a girl in deep debt! Father blackmails the girl until she falls and she has his child! A deal is the son finds a new woman for the father to fuck in order to get his woman back, their MARRIED, but the man is turned into a cuckhold who watches his \"father\" fucking his wife and grandmother and raises his son in this case \"nephew\" as his son. With the story ending with the new son/nephew now grown up bringing  a woman he wants to help with the indication the cycle will begin anew. The fucked up thing is the couple STILL love each other, but the guy is a fucked in the head cuckhold and the wife a sex slave who has been trained to see nothing wrong with fucking her father/grandfather/brother in law cause \"he owns her!\" and neither does her husband"},{"id":2556460,"gallery_id":404503,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1653784370,"body":"@minminazusa That was my thoughts as well! What was the deal with keeping BF imprisoned and torturing him like that? At first it would look like it's just to keep the Girl under control with a hostage. My belief was BF was the real target all along and all of this was just ritual to make him the old man's \"heir!\" you know the classic, \"make him feel despair, strike me down with all his hate\" shit! Or worse, it's a melding ritual thing! The old man is a legion of others who were \"combined\" and the BF was next in line. But the issue was he still loved his GF which was why they did the NTR shit to make him fall out of love with her and have hatred in his heart to make the fusion easier! I dislike NTR, but now I'm curious on what happens next even if I don't understand a thing LOL! Which someone would give a summary down here! "},{"id":2556387,"gallery_id":404503,"poster":{"id":2709273,"username":"Khitish","slug":"khitish","avatar_url":"avatars/2709273.png?_=fe8d5dfc5b7f1d6c","is_superuser":false,"is_staff":false},"post_date":1653779639,"body":"Please release the English and colorized version"},{"id":2552964,"gallery_id":404503,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1653647429,"body":"There must be something there though. He is imprisoned in the place where the old guy used to be imprisoned by the villagers. Inside, there are still records of his research about women which the boyfriend should've been able to learn from. If the bad guys are leaving him with chance to level up like that, then there should be something more to it. In the end, the warden (who used to be the girl who brings food to him, and ends up getting enslaved) said she wants the boyfriend to enter a cell with her father. A suspicion is, the research includes impregnating women, but the old man told Ayami, the girlfriend, he can't impregnate women, in exchange he can make them feel his pleasure. So it might have something to do with that part. "},{"id":2552045,"gallery_id":404503,"poster":{"id":4572120,"username":"311498921","slug":"311498921","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1653621755,"body":"我需要汉化     "},{"id":2551491,"gallery_id":404503,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1653595457,"body":"bitch will be always bitch "},{"id":2551478,"gallery_id":404503,"poster":{"id":3436005,"username":"quanbe","slug":"quanbe","avatar_url":"avatars/3436005.png?_=63b5f4b7ed24d5e2","is_superuser":false,"is_staff":false},"post_date":1653594819,"body":"the dude should have escaped alone lmao the girl is already a street whore and will betray him for thoses old fart bastards cocks "},{"id":2551357,"gallery_id":404503,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1653588355,"body":"Ok at least home boy got his dick wet, sucked off and slug the old bastard "}]