[{"id":2558389,"gallery_id":404911,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1653871262,"body":"So, from the beginning, Kasumi, the heroine, already got a lot of things she's unsatisfied with. She's known as that gloomy girl, and people doesn't even hide it when badmouthing her. Kentaro, who is her first boyfriend, said she's cute, but he asks her to keep it a secret just for him. Yet, even though they often have sex, she's never satisfied. Ryouhei, her new boyfriend, instead asks her to show her cuteness to the world, and she actually enjoys the feeling. People now praise her instead of treating her like a leper. She also changes her image more when Ryouhei asks her. The teacher, actually had noticed her charm even before the two boys. His dick might be smaller than her 2nd boyfriend, but the situation and how he treat her is enough to cover the difference. The two boyfriends abandoned her after the live stream. "},{"id":2558379,"gallery_id":404911,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1653870712,"body":"@BuckShotnut74: These are reuploads. Irodori released revised version. Part 1 (#216471) from Ryouhei (the friend) PoV. Part 1.5 (#245781) of Kasumi sending photo of her masturbating when the guys are in dining. This one is Part 2 (#404911) telling the story from Kasumi's PoV. Part 2.5 (#344432) just another filler episode of Kasumi having sex with her new boyfriend. Part 3 (#265113) Kenta the boyfriend try to take her back by using sex toys, but ends up getting caught by teacher and got suspended from school. Part 4 (#298433) is her with the teacher. The ending says \"to be continued\", but still no sequel released. Irodori only released a compilation version. (https://www.dmm.co.jp/dc/doujin/-/detail/=/cid=d_201278/) and another series not uploaded here yet. This series also got AV movie adaptation."},{"id":2558352,"gallery_id":404911,"poster":{"id":4074945,"username":"BuckShotnut74","slug":"buckshotnut74","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1653869037,"body":"What a slutty bitch she is, and the part where she past right by the mc like he dont exist was so fucked up. At the end tho he found out and looks like he is on revenge mode hope its another chapter soon"},{"id":2558247,"gallery_id":404911,"poster":{"id":3390991,"username":"scooptiwoop","slug":"scooptiwoop","avatar_url":"avatars/3390991.png?_=5a5608d0f4bb4344","is_superuser":false,"is_staff":false},"post_date":1653863040,"body":"ugh that is not what i expected but well, he just dated a bitch who's obsessed with sex, no more. the same thing happened to me smh, and i guess the guy just made the wrong decision just at the start"}]