[{"id":2636035,"gallery_id":405476,"poster":{"id":81905,"username":"Exploding Ovaries","slug":"exploding-ovaries","avatar_url":"avatars/81905.png?_=aad3c52817215707","is_superuser":false,"is_staff":false},"post_date":1657510679,"body":"Imagine a guy cumming his 🥜 needs sometime to recover. otherwise it would hurt to furiously try to forcefully produce cum again now that his nut is drained.\n\nNow imagine her ovaries but the breaks that stop her ovaries from being overstimulating and over ovulating are broken due to the effects of the 7 ovulation pills. Her ovaries unable to stop the rhythmic tensing, and squeezing of her ovaries while she ovulates hundreds and thousands of her limited eggs she was suppose to release over her lifetime. The immature eggs substituting her mature ones not ideally to be released to release until it mature age. \n\nTHE long period of pleasure and ecstacy in between each orgasm she had that normally accompanied each ovulation became shorter, faster and erratic, with each egg being released she could feel her ovaries tiring as it struggled to squeeze the last remaining eggs out. The pleasure soon turning into pain as her ovaries continuously cramped and squeezed the last drop of her ovary juice"},{"id":2635971,"gallery_id":405476,"poster":{"id":81905,"username":"Exploding Ovaries","slug":"exploding-ovaries","avatar_url":"avatars/81905.png?_=aad3c52817215707","is_superuser":false,"is_staff":false},"post_date":1657508127,"body":"Only for the brain to helplessly forcefully  send signals to the tired and drained ovaries to divert the remaining energy from repairing the gaping hole in  the outer lining of the ovaries after her last ovulation ripped through them like thin paper, but to sacrifice her future ovaries lifespan and accelerate her menopause and dry out and bleed her barren ovaries permanently in her young teenage years."},{"id":2635956,"gallery_id":405476,"poster":{"id":81905,"username":"Exploding Ovaries","slug":"exploding-ovaries","avatar_url":"avatars/81905.png?_=aad3c52817215707","is_superuser":false,"is_staff":false},"post_date":1657507487,"body":"I gotta say as a female reader that was so hot. Imagining myself being forcefully fed ovulation pills against my will, without my consent and knowledge turns me on so much. I wish that was me being breeded.\n\nI imagine that shady pill was probably not safe or approved for clinical use. The Dr. gave it to her anyway knowing how harsh it would be on her body and ovaries. Imagine the morning after pill but instead of flushing the fertilized ovum out of her womb to prevent a pregnancy like intended it would do the opposite, by immediately stimulating her weak recovering ovaries to forcefully awaken them into overdrive and produce eggs when it would normally be physically impossible for any female to ovulate after birth for at least a few weeks to a month.\n\nMy ovaries are tense and throbbing thinking about it. 1 ovulation pill was enough but she was given 7 and all at once. imagine both her moist ovaries twitching desperately trying to not squeeze all its warm and slippery ovulation juice. "},{"id":2576395,"gallery_id":405476,"poster":{"id":3407609,"username":"Jun24","slug":"jun24","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654663425,"body":"Lanang goblok."},{"id":2574678,"gallery_id":405476,"poster":{"id":3479608,"username":"Cheesycake","slug":"cheesycake","avatar_url":"avatars/3479608.png?_=6eefe272c34b5041","is_superuser":false,"is_staff":false},"post_date":1654582476,"body":"I'd envy Erika if she woke up at least, fucking boring to fuck a corpse all the time, still eehh, it was cruel and wrong so 7.5/10 "},{"id":2568600,"gallery_id":405476,"poster":{"id":2193199,"username":"ImTired","slug":"imtired","avatar_url":"avatars/2193199.png?_=480a3803a7cc9d44","is_superuser":false,"is_staff":false},"post_date":1654315289,"body":"@AnimeUsername, But it is ntr. The first part is tagged ntr, it's just the second part is not. It's weird that some works aren't tagged if they are sequels. This happens a lot with \"mind control\" doujin, where the first doujin is tagged correctly, but the ones that come after it for some reason won't be tagged fully anymore. "},{"id":2567916,"gallery_id":405476,"poster":{"id":734349,"username":"Zajoker","slug":"zajoker","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654280571,"body":"Fuckin trash "},{"id":2567680,"gallery_id":405476,"poster":{"id":2731048,"username":"AnimeUsername","slug":"animeusername","avatar_url":"avatars/2731048.png?_=959a391ab4f0ab6b","is_superuser":false,"is_staff":false},"post_date":1654272564,"body":"Cuz its not ntr lol"},{"id":2567676,"gallery_id":405476,"poster":{"id":4040237,"username":"Critic of sorts","slug":"critic-of-sorts","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654272503,"body":"Peak degen"},{"id":2567667,"gallery_id":405476,"poster":{"id":2456585,"username":"asunaxkirito143","slug":"asunaxkirito143","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654272260,"body":"Lacks the NTR tag"}]