[{"id":2637795,"gallery_id":405646,"poster":{"id":2812512,"username":"LoliconScholar","slug":"loliconscholar","avatar_url":"avatars/2812512.png?_=18f333a0baa604de","is_superuser":false,"is_staff":false},"post_date":1657595952,"body":"Erotic         "},{"id":2573964,"gallery_id":405646,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1654553965,"body":"@minminazusa Yeah I agree with you on the multi-girls part! Two (as in the one fucking and getting fucked) is the best I tolerate as I do notice a dip in quality even with the best one because the artists has more to work on (and the best art, always requires more time and focus! So trying doing that when you have multiple more factors then if it was just two characters on screen!) as you mentioned with the panels! Plot is less hurt then the art and panels! The better the detail, the more effective the porn/hentai we the viewer get off from it (Plot just \"sets the mood\"). And yeah hope this one continues and gets completed! (And translated)  "},{"id":2571931,"gallery_id":405646,"poster":{"id":5133924,"username":"nunsense777","slug":"nunsense777","avatar_url":"avatars/5133924.png?_=9d4734cdcf78ce41","is_superuser":false,"is_staff":false},"post_date":1654474156,"body":"YOOOO NUNS"},{"id":2571324,"gallery_id":405646,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1654441008,"body":"The pendant, the “Sign of Vual” is described as bringing friendship to enemy (might mistranslate the words). From this episode alone, it seems like most of the girls are just still not used to boys in their school, and him being the only one made it sticks out even more. Honestly, the main perpetrator is Seira, and the other girls just follow her. Arisa is more like the type who do whatever she likes, but won’t bother spending time just to make him suffer (although she also doesn’t care if her action would make him suffer). Hope this one did well, and maybe get a compiled edition. | Talking about multi-girls gangbang, for me it’s not about the plot, but paneling. I’d rather author spend long time to show details of a girl drowned in pleasure, rather than only giving 1-2 pages to each because they need to show as much girls as possible in limited page counts. :P"},{"id":2571182,"gallery_id":405646,"poster":{"id":631960,"username":"Larchid","slug":"larchid","avatar_url":"avatars/631960.png?_=8ba11f1a08356e53","is_superuser":false,"is_staff":false},"post_date":1654435401,"body":"Wow what the heck?! Shindou does a nun hentai. Am absorbed af now"},{"id":2570767,"gallery_id":405646,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1654414633,"body":"Betting it's going the way of that hypnotize story shindou made (that still needs translating, Hate when hentai artists make a series, then get bored and put them on long \"indefinite\" hiatus to do something else. FINISH YOUR WORK DAMMIT) the one where the Mind control was more \"unleashing feelings that were already there\" instead of brainwashing. In this case, The three females are all tsundere to MC only in the WORSE side of Tsun! (Where their completely bitchy to MC without the dere! They like him, they just are so full of themselves that they do bitchy things in their attempt to deny it! Like Seira wanting him removed because she likes him, but her elitist mindset makes her try to remove him so she can deny those feelings, and Arisa is just doing the classic \"bully the person I like cause I don't know how to HANDLE being nice to them and think bullying will work out!) I mean in the Oni one, wish he just made those girls a spin off with their own human male, then side characters!"},{"id":2570760,"gallery_id":405646,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1654414231,"body":"Thanks everyone! Yeesh the classic \"every girl is a bitch\" in the all-girl school turned co-ed to the single male occupant just to justify him having to do \"the thing\" as they want to remove him for very petty reasons (have to otherwise he won't feel justified) This plot is too recycled and I agree with you minminazusa, it gets boring when these's stories devolve into gangbang where the MC seems to be \"the only male in existence\" feel it should just have the three (the sister nun, I'm sure her BS petty reason to justify MC \"MC sexing her\" will be she wanted the Co-ed to fail, hence his bullying was ignored in hopes he'd do something for her to expel him, hence she was following around to catch him doing something she can expel him for and she was happy to catch him...making her the next victim feel justified, I'm sure she was masturbating to the sex with Arisa just to make her a hypocrite) and end with a single sequel at best, three at the least! Too many bog down the experience"},{"id":2570679,"gallery_id":405646,"poster":{"id":2069022,"username":"Aguacate","slug":"aguacate","avatar_url":"avatars/2069022.png?_=f7308a58855643d4","is_superuser":false,"is_staff":false},"post_date":1654410370,"body":"Great work from Shindou"},{"id":2570296,"gallery_id":405646,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1654393202,"body":"Thanks. :) | Adding more details. At the end, he knew that pendant is dangerous, but weighing against him getting bullied for the whole three years, he’d take the devil’s offer. The sister calls him a few days later, so he probably had done more in the mean time. | I hope it focus only on the two girls though, rather than making it a harem gangbang with the whole school. Hates gangbang hentai, there’s not enough page for each girl because author need to cover every one of them in a single session in the final chapter. The product description in DL Site said sequel will be released within this year. "},{"id":2570248,"gallery_id":405646,"poster":{"id":641961,"username":"Atang","slug":"atang","avatar_url":"avatars/641961.png?_=450a0c44c6bab036","is_superuser":false,"is_staff":false},"post_date":1654390519,"body":"@minminazusa artist's twitter https://twitter.com/phoooooooooo"},{"id":2570213,"gallery_id":405646,"poster":{"id":4460116,"username":"Alsx","slug":"alsx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654389032,"body":"englis hehe ;)\n"},{"id":2570178,"gallery_id":405646,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1654387714,"body":"Seira see him as inferior and wants to chase him out of school, which made him snap off as she’s insulting his family. In Arisa’s case, she told him to jack off for her to get pocket money (she plan to sell the account after it got enough followers) at cost of leaving him with digital tattoo. The pendant can rewrite the target’s perception, although it doesn’t seem like he had any control. The first time, he’s not even sure what happened. In Arisa’s case, he’s scared as she’s trying to livestream it, luckily the signal is bad. At the end, the sister spotted him and told him he’ll be expelled for indecent conduct. Hope the story can continue though. Feels like the expression is familiar, especially in p16. Anyone know the artist’s Twitter?"},{"id":2570152,"gallery_id":405646,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1654386776,"body":"More or less. It’s the usual all-girls school just turned co-ed and there’s only one male who passed the entrance setting, but as minority, he got bullied. The main perpetrators are Seira (the director’s daughter, the queen there) and Arisa (a famous model and influencer, the leader). Hiroto, the MC, bears with it because his mother is so happy he can attend that school (she idolized the school) and worked hard to pay for him as a single mother. That’s why he snaps off in p16, after Seira told him she want the poor single parent boy to leave the school. As for the pendant, he found it while organizing books in the library (got told to do the job as he didn’t have any after school activity anyway)."},{"id":2569721,"gallery_id":405646,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1654365513,"body":"Anyone want to be kind to this one and give a summary of this story? (I get it's the classic male bully victim gets mind control ability or device and turns the tables on his female bully's, but I'd like a better understanding of the plot especially the end of this one if anyone knows! Thank You)"}]