[{"id":2570248,"gallery_id":405646,"poster":{"id":641961,"username":"Atang","slug":"atang","avatar_url":"avatars/641961.png?_=450a0c44c6bab036","is_superuser":false,"is_staff":false},"post_date":1654390519,"body":"@minminazusa artist's twitter https://twitter.com/phoooooooooo"},{"id":2570213,"gallery_id":405646,"poster":{"id":4460116,"username":"Alsx","slug":"alsx","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654389032,"body":"englis hehe ;)\n"},{"id":2570178,"gallery_id":405646,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1654387714,"body":"Seira see him as inferior and wants to chase him out of school, which made him snap off as she’s insulting his family. In Arisa’s case, she told him to jack off for her to get pocket money (she plan to sell the account after it got enough followers) at cost of leaving him with digital tattoo. The pendant can rewrite the target’s perception, although it doesn’t seem like he had any control. The first time, he’s not even sure what happened. In Arisa’s case, he’s scared as she’s trying to livestream it, luckily the signal is bad. At the end, the sister spotted him and told him he’ll be expelled for indecent conduct. Hope the story can continue though. Feels like the expression is familiar, especially in p16. Anyone know the artist’s Twitter?"},{"id":2570152,"gallery_id":405646,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1654386776,"body":"More or less. It’s the usual all-girls school just turned co-ed and there’s only one male who passed the entrance setting, but as minority, he got bullied. The main perpetrators are Seira (the director’s daughter, the queen there) and Arisa (a famous model and influencer, the leader). Hiroto, the MC, bears with it because his mother is so happy he can attend that school (she idolized the school) and worked hard to pay for him as a single mother. That’s why he snaps off in p16, after Seira told him she want the poor single parent boy to leave the school. As for the pendant, he found it while organizing books in the library (got told to do the job as he didn’t have any after school activity anyway)."},{"id":2569721,"gallery_id":405646,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1654365513,"body":"Anyone want to be kind to this one and give a summary of this story? (I get it's the classic male bully victim gets mind control ability or device and turns the tables on his female bully's, but I'd like a better understanding of the plot especially the end of this one if anyone knows! Thank You)"}]