[{"id":2599924,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655789890,"body":"@DrinksandDame yea that would be the fastest but at the same time the ntr of it gets it is what would make me regret reading it but that doesn’t apply if I’m just spoiled but thanks for answering my questions if I got any more I’ll let you know also before I check your pasteboard I think I wanna wait for a couple more chapters just in case and yes I have been checking my his manga every now and then for info lol "},{"id":2597130,"gallery_id":405963,"poster":{"id":1321776,"username":"confused?","slug":"confused","avatar_url":"avatars/1321776.png","is_superuser":false,"is_staff":false},"post_date":1655652834,"body":"The battle was fun to read"},{"id":2596558,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1655623578,"body":"@anonymous_never-watchhentai my character list is on every single Itaiamai summary I have in my pastebin. Just click the latest one and it's literally the first thing you get to read. Anyway, sorry for assuming your English proficiency. Your questions are oftentimes a bit hard to understand so that gave me an impression that you don't speak much English. Also, I don't think I am in any position to say anything about your choice to not read this doujin yet but tbh, I don't think you have much to lose at this point if you just read it anyway. You've probably been checking on this series more often than an average reader would and you seem to be very interested in the story anyway. So might as well read the whole thing, understand the story better, and join the discussions with it. Like, I don't mind answering your questions every time, but the easiest and fastest way for you to get your answers is to just read the story. But yeah, you do you."},{"id":2596298,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655613013,"body":"@DrinksandDame I don’t struggle with English as for my main reason is I don’t want to read this yet on the of chance it’s ntr and for your list I can’t seem to be able to open it even if I search it up but yu already help me ( tsumugi kissed Anna mole girl or the one we see in chP 6! 2 mami is the girl we seen tease mc ok and heika is the one with the mask the one with short uh I think I’ll go with light colored hair or the one we see in pg 12 right kise is that ntr guy we see and I already know chief boy chP 3(head maybe)5(the naked picture) and the director chp4 a quick sex maybe she said I think he was teaching her new poses or some idk but that’s all right "},{"id":2596152,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1655607058,"body":"@anonymous_never-watchhentai You seem to be having hard time digesting things here and there about this topic, so just to be sure that you fully get what Ive been telling you, I made this for you. CHECK THIS OUT: https://imgur.com/a/vR1ohd5 I highly suggest that you read the whole story again from Ch1. That way, hopefully you will be able to get a better grasp of the characters and the story as a whole. But maybe the reason why youre struggling a lot in the first place is because you're English isn't that good. If that's the case, then I think you should just read the English translated version since that'll will definitely be easier for you to read that than my long summaries. Unfortunately, I don't think I've written my summaries well enough for it to be an easy read for people who struggles with English. "},{"id":2596068,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1655602512,"body":"@anonymous_never-watchhentai Mami's last name is Kaminushi.  You would already know this if you're reading my characters list btw. Suma-Sensei calls her by her last name but his boyfriend calls her Mami. Karin has two friends: the one is Anna, the blackhaired girl with a mole under her left eye, and the other is Heika, a tall shorthaired big boobed girl who we often see wearing a Jason mask. \n"},{"id":2595715,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655578381,"body":"Oh you right I thought mami was kissed but it was haruno,Anna that was "},{"id":2595707,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655578173,"body":"Ok so haruno is Anna chP 6 character and mami is the girl in this chPs and I take it heika is the one we see in page 12 is that correct then what’s mamis last name "},{"id":2592484,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1655415040,"body":"@anonymous_never-watchhentai I think you're confusing a lot of stuff here. Anna's last name is Haruno. Some people call her by her last name, some by first name. I just use her first name in my summary since we don't know Heika's last name yet and they appear together very often. You can check all of the characters' full names by reading my character list. I also think you're confusing Anna with Mami simply because they both have black hair. You can distinguish one from the other by looking at their faces. Anna has a mole under her left eye, Mami doesn't. Page 12 shows both of them in one page and I assume you also misunderstood what's happening here since you thought they're just one person. I explained this scene a bit in the afterword of my summary so feel free to check it out."},{"id":2592198,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655400422,"body":"Also the girl from chapter 6 is called haruno but haruno what "},{"id":2592088,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655395228,"body":"@DrinksandDame well someone called her anna in chP 11 tho "},{"id":2588084,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1655202325,"body":"@anonymous_never-watchhentai check my list of characters. I put a description there that says Mami is Ryuu's girfriend and together they had teased Sensei many times now. She is not Anna. Anna is Karin's friend. Heika is the other tall short haired female friend of Karin. Yes, she talked to sensei back in Chapter 6."},{"id":2587706,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655183516,"body":"Mami is Anna and Karin knew tsutsumi had a crush on Anna "},{"id":2581338,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654901626,"body":"Also who is Heika is she by any chance the girl that tells mc to calm down in chp6! When he had those delusions??"},{"id":2581287,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654898777,"body":"Btw is mami also known as anna "},{"id":2581084,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654888248,"body":"@jeonsann if it’s ok with you I’d love you hear everything you’ve thought of this like you’ve always commented ignore what anyone says they are your opinion also for anyone reading this correct me if I’m wrong read this in the comments somewhere down there but ( tsutsumi seems to have a crush on Anna right the girl that we see always having sex with boyfriend If so why did she Karin in her then kissed her "},{"id":2580920,"gallery_id":405963,"poster":{"id":2572141,"username":"anonymous_never-watchhentai","slug":"anonymous_never-watchhentai","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654882438,"body":"@wifey027 hopefully it’s not him and that your wrong "},{"id":2576766,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654681992,"body":"@jeonsann Hey cmon dude. I don't think you're stupid or anything like that. All you did was just give an impression that you don't like this work since you kept ranting about it whenever you feel like it. And so I simply find it incomprehensible that you're still devotedly reading every new chapter (and even go as far as checking out the raws) despite your dislike for it. Tbh, many people do this so I ain't singling you out here. I just so happen to notice how consistent your ranting is for this series. My intention isn't to stop you from sharing your thoughts and theories for this doujin. In fact, now that it seems like you don't necessarily dislike this series (correct me if Im wrong), the best takeaway from what Im saying here is to be more aware of how your words paint an image of yourself from now on. Shutting up is definitely an option but just being careful is more than enough if done right. "},{"id":2576567,"gallery_id":405963,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1654671947,"body":"@drinksanddame Thanks for the input. I guess I'm too stupid and annoying for people here. I'll stop commenting and keep it to myself. "},{"id":2576113,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654652852,"body":"@jeonsann excuse me for being rude but you consistently reading this series monthly only to never skip on ranting about it is what I think is beyond comprehension. Like, I get it if you actually like this series but youre just the type of guy who only focuses on the negatives when commenting. But in case that you don't like this work at all, dropping this is definitely the most comprehensible action to take. Otherwise, then the conclusion here would be that people just normally do things that are incomprehensible, so maybe you know, Karin probably just did that there too."},{"id":2576097,"gallery_id":405963,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654652425,"body":"Here's my prediction. When Kise peep on Karin and sensei having sex. He will blackmail Karin threatening her to expose her relationship with sensei. Karin will beg Kise to don't tell everyone. Kise will say something like \"only if you become my cum dumpster I'll agree to it\". I hope Karin will tell sensei about it. If not Karin will agree to Kise then making excuses like \"having sex with him doesn't make my heart race, so its no cheating\" same excuse when Kise kiss and grope her boob and he tell sensei about it lol."},{"id":2576059,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654651410,"body":"@jeonsann today was a big exception because normally Karin would go to Sensei's place to fuck in the morning but she couldn't today. Added by the fact that another guy touched his lips, she was yearning for Sensei harder than usual so they risked getting caught there. Or at least, that's how Im seeing it. I hope I managed to deliver my point well. As for the groping, it's already clear that she mistook it to have come from Sensei. She told sensei about it but he assumed that she was simply referring to the holding hands. Nevertheless in her mind, she has it confirmed that it was Sensei who groped her thus, she has no reason to get mad at it."},{"id":2576050,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654651025,"body":"@jeonsann not sure if this would make it somewhere within your comprehension but from how I look at it, if Tsutsumi hadn't been there to catch them that close to each other, it could likely be that she wouldve reacted more about that kiss. Of course, that doesn't change the fact that she didn't think of that kiss as anything other than an accident. But since Tsutsumi walked into them, making a big scene about it would definitely cause trouble for sensei which back in the previous chapter, she kinda sweared to avoid. They still have illicit relationship as a secret, so their agreed consensus was to lay low. --"},{"id":2576033,"gallery_id":405963,"poster":{"id":5328263,"username":"JosephXL","slug":"josephxl","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654650505,"body":"If this turns into NTR I'll just stop reading. I'm not really that invested to be mad enough if it does but I feel like it'll be waste because it's kinda interesting to see the mc working thru his insecurities and seeing the fl in positions wondering if something is actually happening. If it's NTR it'll just be another generic NTR hentai but if not there's potential to dive deeper into his mind but this is a hentai so I'm not expecting much. "},{"id":2576023,"gallery_id":405963,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1654650062,"body":"And I can't stress this enough, the fact that Karin didn't even get mad at Kise for groping and kissing her is beyond my comprehension"},{"id":2575978,"gallery_id":405963,"poster":{"id":4810312,"username":"RambleTop","slug":"rambletop","avatar_url":"avatars/4810312.png?_=683c3c91cc94033a","is_superuser":false,"is_staff":false},"post_date":1654648283,"body":"Ohhhhh, so we are going towards the blackmail/ntr route. The kid is gonna use this as a way to fuck her now by threatening to expose her relationship with the sensei."},{"id":2575928,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654646751,"body":"@xevry Oh now that you mentioned it, iirc a trap character was shown very late into the story but was already mentioned a bit in previous chapters. I don't know how to feel about that tbh. I feel like he wasn't really that relevant to the story esp since he literally only had like 2-3 chapters of screentime, not that Hinamix was really much of a plot-driven work in the first place. So it's hard to say that a similar plot twist would happen to Tsutsumi. Also, Ryohzoh started Hinamix around 6 years ago but his next work after that, Rarefure, didn't feature anything like it. But yeah, who knows. I personally can't see it happening here but I could be wrong. "},{"id":2575738,"gallery_id":405963,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654635713,"body":"@DrinksandDame Makes sense, but the reason I brought it up is because Ryoh-zoh has actually done it once before. His other work \"Hinamix\" has a running mystery throughout the entire series about what happened to \"Kawashita-san.\" Everyone talks about her as a girl and 1 of the male characters had a huge crush on her. In the last chapter, she shows up, and reveals herself as a boy. And I bought the chapter on DLsite for $1.50. Idk how to export the images though from DLsite, otherwise I’d upload the chapter myself."},{"id":2575293,"gallery_id":405963,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1654616089,"body":"The only ones getting cucked are us viewers waiting for the story to progress."},{"id":2575157,"gallery_id":405963,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654608237,"body":"Yeah, i would believe she's just naive and dumb but the past works of this author proved me wrong. We also never really got her own pov since the beginning of the story, another fact."},{"id":2575138,"gallery_id":405963,"poster":{"id":3436005,"username":"quanbe","slug":"quanbe","avatar_url":"avatars/3436005.png?_=63b5f4b7ed24d5e2","is_superuser":false,"is_staff":false},"post_date":1654607238,"body":"NTR will happen at 100 % this author really love to make big serie with 20 vanilla sex chapter and late in the serie after a lot a of build up MC Get NTR'D hard by other dude who target the FMC . and it's already implied FMC doesn't mind getting deep french kiss by some other dude lmao she doesn't even get angry after what's the dude as done + maybe she really did cheat on him in some of the previous chapter like the one where mc is talking to her on the phone ...... "},{"id":2575066,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654601932,"body":"@xevry I wouldn't really expect that to happen unfortunately. In general, I don't think I've seen any works that introduce an androgenous character, establish the gender to the readers, then reveal later on that it's actually the opposite. I think it's pretty much established that he's a guy since Kise sees him as a rival, and similarly Anna also once suspected him of trying to go for Karin back in Chapter 9. Unless their school allows girls to wear male uniform regularly and the author goes to deliberately provide us that info, I just don't think it's possible. Btw, where did you find the remaining pages?"},{"id":2575046,"gallery_id":405963,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1654600303,"body":"Can't wait for the part where Kusokise blackmailed Karin into having sex with him. Saw it miles away from ch 10. "},{"id":2575045,"gallery_id":405963,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654600302,"body":"@xevry damn the spy might be Kise that fucker will definitely blackmail Karin. Hope Karin will just deny it cause no evidence lol."},{"id":2575041,"gallery_id":405963,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654600157,"body":"At this rate of the story, if there's really an ntr that will happen. I guess it'll be on chapter 18-20 like on rarefure. So author quit the teasing I've had enough give us the stuff asap."},{"id":2575033,"gallery_id":405963,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654599860,"body":"@DrinksandDame thanks for the translation. I thought Tsutsumi is into Karin but turn out he's into Anna that's a nice twist. Kise might become a stalker of Karin lol. Its a matter of time before he'll know the relationship of Karin and Sensei. Knowing his obsession on Karin, he will definitely use it to his advantage."},{"id":2575028,"gallery_id":405963,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654599603,"body":"And cause it’s far down, there’s 12 missing pages, all of it is a sex scene between FMC and MC. Ending with a cliffhanger of both of them hear something and turn to look at the window/ curtains, but ignore it. It then has a zoom in on their curtains, implying someone is spying on them having sex."},{"id":2575025,"gallery_id":405963,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654599381,"body":"@DrinksandDame So what are the chances Tsutsumi is actually a reverse-trap, and is a female dressed as a male? They’re drawn in a very feminine way, and Ryoh-zoh loves putting Yuri stuff in most of their works."},{"id":2574997,"gallery_id":405963,"poster":{"id":4109049,"username":"Iska_IX","slug":"iska_ix","avatar_url":"avatars/4109049.png?_=f3d3e52e1b1c137a","is_superuser":false,"is_staff":false},"post_date":1654597868,"body":"So this fucker is literally just turning into a full on stalker rapist"},{"id":2574992,"gallery_id":405963,"poster":{"id":4841333,"username":"ThiccChristmasCakeEnjoyer","slug":"thiccchristmascakeenjoyer","avatar_url":"avatars/4841333.png?_=0723c7394c4725f5","is_superuser":false,"is_staff":false},"post_date":1654597457,"body":"Similar to gacha as in, the percentage to get that unit is low but we still try to roll hoping to get it. In ntr, to get good ending is also low but we still read it anyway, still some authors do make different version of their stories to please both sides. For authors, ntr and drama is probably the easiest cash cow with shitty logic. Look at domestic kanojo, Nisekoi etc. It's popular mainstream obviously gonna be popular in hentai too like Karami Zakari."},{"id":2574985,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654596823,"body":"It might be quite a wait until we get to read the full chapter so for now, here's a SUMMARY for what we got so far: https://pastebin.com/QeYy7WaW          I will update this the moment I can but I think it's just gonna be a couple few pages and most of it would be a sex scene. I still have to talk about that short scene with Mami. This chapter went wild with that Tsutsumi revelation though. That came out of left field."},{"id":2574984,"gallery_id":405963,"poster":{"id":4841333,"username":"ThiccChristmasCakeEnjoyer","slug":"thiccchristmascakeenjoyer","avatar_url":"avatars/4841333.png?_=0723c7394c4725f5","is_superuser":false,"is_staff":false},"post_date":1654596814,"body":"@Fix your website, lazy admin Let me join in the discussion too. I hate ntr but I sorta get it why people like it so much. For me ntr is pretty much glorified drama. You as a reader anticipate whether this character will stay faithful or just another cheating slut (we all know the answer), some of the ntr characters even have this common stubborn personality. I noticed most ntr is a series and that 'breaking down' the characters from being good to fallen characters are addicting to people. Similar to gacha, are we finally getting that unit or not."},{"id":2574981,"gallery_id":405963,"poster":{"id":1037380,"username":"sonofshiva","slug":"sonofshiva","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654596622,"body":"Most of the time on this site for me now is either looking for new NTR or the old one that I might have miss. Nothing other than that lol, but it’s really bad because there’s not enough new NTR manga for me anymore. Most of them is just bullshit raping, fucking whores and brain dead gangbang with no story, no thrilling hidden sex or anything what so ever. Mannnn, this one supposed to be the number one NTR for very long time now and the author decided that he doesn’t fucking want to do NTR anymoreee. Fuck him man, if he could just made a playback of all of what happened to the FMC in the past and make all of those scenes to be realllll NTR then it would be heavennn for NTR lovers like me. I could dir from happiness and fapping for too hard and yet here I am counting everyday to the release of another new chapter and this bullshit is all I get T.T . Fuck do I have to do now, back to fapping to all those teasing scenes of no actual NTR with the power of imagination? Seriously fuck this!!!"},{"id":2574968,"gallery_id":405963,"poster":{"id":1037380,"username":"sonofshiva","slug":"sonofshiva","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654595645,"body":"@ Fix your website, lazy admin\nIt is because I never feel attached to the MC of a fapping materials, I never feel him, I never care about him nor any of the characters in the story, what I care about is the plot, the art, the scenes. Like what you said about horror movies, I love them too but I never see things in the POV of the MC nor the killer, I enjoy them as an audience who doesn’t involve in any of the stuff like a bystander . But it’s another story if it’s any other media that I consume beside fapping, it’s a big fuck NO NTR, I stay far fucking away from that shit because I do feel for the MC when it comes to normal entertainment that’s not purely for the libido loll. "},{"id":2574963,"gallery_id":405963,"poster":{"id":1037380,"username":"sonofshiva","slug":"sonofshiva","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654595160,"body":"@ Fix your website, lazy admin\nFor someone like me. 99% of hentai I have in my favourite on this site is NTR. You can say that I read exclusively NTR hentai and most of the time I don’t even bother reading other genre at all. I can say that I read them for the thrill and excitement from all the hidden sex and the struggle of the Female protagonist fighting herself and the guys who force her when she can’t decide if she actually want to cheat or not. Most of the time if an NTR lack one of the two element, it’s automatically a bad NTR for me. If it has both 2 elements then it’s considered one of the best in the hall of fame of NTR hentai for me. The first time I experience NTR is from Berserk, I actually hated sooo much. But idk why later on the more I hated it the more I wanna read it lol. And no I never read or watch or accept even a tiny bit of NTR stuff on any other than the type of media that’s not used for fapping."},{"id":2574946,"gallery_id":405963,"poster":{"id":1037380,"username":"sonofshiva","slug":"sonofshiva","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654594190,"body":"Man god damn! I bet you guys 100% it’s the MC in the last page. So we’re still not getting any NTR yetttt. Damn it! At this point idk if this series is ever gonna get actual NTR at all or maybe it’s just gonna be teasing till the end guys! Mannn, I was so hype for this chapter and this series overall to be one of the best NTR series out there and here it is, still disappointment. I don’t think real NTR gonna happen anytime soon, if it does then I don’t think we gonna have to wait at least another year for it to actually happen. So disappointed, sigh..  An author who’s famous for his NTR works now does teasing both vanilla lovers and NTR lovers, fucking hell. "},{"id":2574929,"gallery_id":405963,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1654593739,"body":"For my \"vanilla side\", I like them to sooth the very bitterness that causes me to watch NTR in the first place, for when I get too sick of hating everything, I go read some wholesome stuff to calm myself down from my own annoying thoughts."},{"id":2574902,"gallery_id":405963,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1654592386,"body":"@Fix your website, lazy admin Oh I can give you some neat insight as a weirdo who likes both NTR and vanilla equally.  I like NTR cause I am a bitter loser in RL who did actually get NTR'd for real. My bitterness at that made desire the same pain upon others, so for some reason I latched onto cheating type porn as a silly way of imaginary \"revenge\". It is dumb yeah."},{"id":2574792,"gallery_id":405963,"poster":{"id":73642,"username":"Fix your website, lazy admin","slug":"fix-your-website-lazy-admin","avatar_url":"avatars/73642.png?_=6294bf803e66a9e1","is_superuser":false,"is_staff":false},"post_date":1654587155,"body":"I have a hypothesis as to why people like NTR. Just like when you play horror movies or watch tense movies, it makes you feel something you just can't experience anywhere else. Being scared isn't funny but we watch and play horror movies and games anyway for what they make us feel. Then why not read NTR, which is essentially the NSFW version of young girls' favorite romance stories? I rest my case. "},{"id":2574737,"gallery_id":405963,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654584885,"body":"So while it's nice to get a separate upload for the raw chapters, this one specifically is incomplete so I won't post a summary here just yet. Let's wait til the new Comic Ananga release is uploaded."},{"id":2574715,"gallery_id":405963,"poster":{"id":5162612,"username":"StrainedQ","slug":"strainedq","avatar_url":"avatars/5162612.png?_=97ad892d956abd50","is_superuser":false,"is_staff":false},"post_date":1654584004,"body":"What is going on in last page?"},{"id":2574690,"gallery_id":405963,"poster":{"id":1587832,"username":"elzenpai","slug":"elzenpai","avatar_url":"avatars/1587832.png?_=e04a48f62ae09d24","is_superuser":false,"is_staff":false},"post_date":1654583212,"body":"We are more close to the real deal boiiissss"},{"id":2574646,"gallery_id":405963,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654581220,"body":"@the_index I think it will become an ntr later on cause there's 2 dudes after Karin. Kise is getting more desperate, and he saw Karin going in sensei house. I wonder what will he do on that info hmm blackmail maybe. Tsutsumi fucking french kiss Mami cause he thought its Karin after getting kicked lol."},{"id":2574638,"gallery_id":405963,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654580859,"body":"Lol Tsutsumi thought Mami is Karin after kicking his head. So its seems like both Kise and Tsutsumi are after Karin eh. Sensei what will you do. Protect Karin at all cost."},{"id":2574637,"gallery_id":405963,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1654580842,"body":"@the_index dont be optimistic dude."},{"id":2574636,"gallery_id":405963,"poster":{"id":5187796,"username":"the_index","slug":"the_index","avatar_url":"avatars/5187796.png?_=cdf5c83d83e82a4f","is_superuser":false,"is_staff":false},"post_date":1654580793,"body":"to be honest with all of u I'm 100% sure this will be a vanilla and all of us were tricked by this author "},{"id":2574628,"gallery_id":405963,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654580489,"body":"Aight a little progress in the story. See u next month fellas."},{"id":2574611,"gallery_id":405963,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1654580017,"body":"I don't get why Amuro didnt even get angry at that trash for kissing and groping her."},{"id":2574608,"gallery_id":405963,"poster":{"id":3863908,"username":"Radhian","slug":"radhian","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654579914,"body":"Yup they're good at making our heads overthink, I read once it ended happily ;)"},{"id":2574604,"gallery_id":405963,"poster":{"id":879506,"username":"jeonsann","slug":"jeonsann","avatar_url":"avatars/879506.png?_=9f6053f624e5ed0b","is_superuser":false,"is_staff":false},"post_date":1654579858,"body":"imma isekai myself and kill Kise"},{"id":2574602,"gallery_id":405963,"poster":{"id":2936916,"username":"Rserpens","slug":"rserpens","avatar_url":"avatars/2936916.png?_=de74b206ff80163e","is_superuser":false,"is_staff":false},"post_date":1654579768,"body":"Alright, who the fuck uploaded this incomplete and why the fuck."},{"id":2574598,"gallery_id":405963,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654579652,"body":"@nhcasual Nah, that was someone else, I'm donrandom on EH. I just really love Ryoh-zoh's art/ works. "},{"id":2574591,"gallery_id":405963,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1654579453,"body":"@xevry You the same person I replied to in EH earlier? Well anyway, thanks for the info on more or less what's missing, hopefully the rest is uploaded soon."},{"id":2574581,"gallery_id":405963,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654579203,"body":"Missing pages are just a sex scene between the MC and FMC, no full on NTR yet. Last page is a close up of the curtains, implying someone is watching, but we don't actually see anyone yet. "},{"id":2574574,"gallery_id":405963,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654578755,"body":"For anyone wondering how incomplete this is, it's missing 12 pages. DMM lists this chapter as having 33 pages, idk why this was uploaded incomplete. "}]