[{"id":2579176,"gallery_id":406127,"poster":{"id":3381808,"username":"itsuka_rinne","slug":"itsuka_rinne","avatar_url":"avatars/3381808.png?_=187660e9cf54be06","is_superuser":false,"is_staff":false},"post_date":1654795521,"body":"Oh ffs just get on with the ntr already jesus. This artist is the one that makes me extremely paranoid about hentai to the point that I always make sure to see the ending and all the possible sequel to a hentai fk"},{"id":2578845,"gallery_id":406127,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654780309,"body":"@Wifey027 I think whoever tagged this as yuri, just assumed Tsutsumi was a girl by their looks, no confirmation yet lol. "},{"id":2578841,"gallery_id":406127,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654780169,"body":"@DrinksandDame Interesting, I guess we’ll see soon enough what gender they actually are. I’m a sucker for yuri stuff, and Ryoh-zoh usually puts at least 1 yuri scene in every one of his works. So even if Tsutsumi is a male, I’m hopeful an actual yuri scene will happen before this series ends."},{"id":2578754,"gallery_id":406127,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654775282,"body":"Imagine the face of Kise while peeping on Karin and sensei have sex lmao. This one has Yuri tag so Tsutsumi female confirmed? Lol"},{"id":2578725,"gallery_id":406127,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654773014,"body":"@xevry Oh since you're here, I forgot to mention about the title of this chapter which might be relevant to your question last time. This chapter's title is \"Watashi wa Kokohaku suru\" which means \"I confesses\" or \"I will confess\". One would normally assume that this refers to Tsutsumi but thing is, he doesn't use Watashi (a feminine-neutral pronoun) to refer to himself but rather uses Ore (very masculine). So this could definitely mean many things like: the title could be referring to Anna(?) or someone else, but one could also think that this hints about Tsutsumi being a girl. This aint much of strong hint tbh, but it's something at least."},{"id":2578712,"gallery_id":406127,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654772436,"body":"@Azenn I have yet to use pastebin for my summaries back then so for the first 7 chapters I simply provided summaries in the nhentai comments directly. You can check the raw uploads for the first 4 chapters ( Chapter 4 only had a chinese upload so I put my summary there instead) and the rest from there I put it in the Comic Ananga's. But tbh, my summaries for those werent as detailed as the one from now but yeah, feel free to read them. I actually thought of reposting them in my pastebin but it's kinda pointless now since there's the Eng version already. You know what, maybe I'll just write my review/analysis for those chapters instead and also point out some errors in the Eng ver that needs some discussing."},{"id":2578664,"gallery_id":406127,"poster":{"id":3750123,"username":"xevry","slug":"xevry","avatar_url":"avatars/3750123.png?_=6f2e9a3eee5eda34","is_superuser":false,"is_staff":false},"post_date":1654769007,"body":"@DrinksandDame I've noticed Ryoh-zoh likes connecting his stories in the same universe a lot. His other works: \"Love to Like/ Love to Like EZR,\" \"Better Girls,\" \"GKGT,\" and \"Hinamix\" all are in the same universe. They all have cameos that connects them together from each story. "},{"id":2578492,"gallery_id":406127,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1654760118,"body":"Seriously though it may not even be Kise it could be Mami or even Miss Hori, yeah it's a bit of a stretch but not impossible. My money is on Kise failing then it will be Chefs turn but he'll fail as well. Im not sure how but Suma will believe she actually cheated then he will fuck Mami then Miss Hori and then finally he will fuck Karin's friend Heika and that's when he will get caught and Karin will become a pornstar."},{"id":2578483,"gallery_id":406127,"poster":{"id":4474371,"username":"GoogleMeBitch","slug":"googlemebitch","avatar_url":"avatars/4474371.png?_=b5e68c168bf523e2","is_superuser":false,"is_staff":false},"post_date":1654759722,"body":"@Renellin YES! It's already NTR because Kise is peeping through the curtains fappin while crying lol."},{"id":2578415,"gallery_id":406127,"poster":{"id":4923896,"username":"Renellin","slug":"renellin","avatar_url":"avatars/4923896.png?_=576a9fa8ad10f5a8","is_superuser":false,"is_staff":false},"post_date":1654756519,"body":"So is this ntr or not?"},{"id":2578403,"gallery_id":406127,"poster":{"id":116222,"username":"halloween25","slug":"halloween25","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654756075,"body":"ahh, so im guessing that he will blackmail the fmc to become his sexfriend now.."},{"id":2578373,"gallery_id":406127,"poster":{"id":1053889,"username":"morningrain","slug":"morningrain","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654754752,"body":"another Rarefure?? lul"},{"id":2578346,"gallery_id":406127,"poster":{"id":8583,"username":"Azenn","slug":"azenn","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654753347,"body":"@DrinksandDame I agree that such little cameos/easter eggs are really cool. It kind of builds/expands the world that the author is writing, giving us a different perspective to ongoing/past/future events as well. Also in Rarefure, they never showed the teacher. So this is a pleasant revelation--to think that Suma sensei was actually the teacher of all those characters. Also interesting that given Manami was supposed to be the most popular? (correct me if I'm wrong) in the school, for these bunch of male classmates like Kise they only have eyes for Karin. Interesting dynamics."},{"id":2578334,"gallery_id":406127,"poster":{"id":8583,"username":"Azenn","slug":"azenn","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654752827,"body":"@DrinksandDame Also I just searched again for the Manami cameo and I think I was a bit hasty in assuming it was Manami. It's the 1st page of Ch 6. When I first read it, I thought that back view of the char Yuuki and Karen were talking to looked like Manami. Also cos both were talking to that char, I kinda made the link there. So far they mainly interacted with each other in their cameos or individually interacted with the class. So for both them to be talking to one char, I thought it was likely to be from Rarefure too. But indeed, I guess we can't confirm from what we are shown. "},{"id":2578320,"gallery_id":406127,"poster":{"id":8583,"username":"Azenn","slug":"azenn","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654752535,"body":"@DrinksandDame Oh yes, I noticed that magazine of Houra as well! Forgot to mention it. Also yea you did mention in your Rarefure intro summary but I forgot about it... I can't find your summary for Ch 5 though? In your pastebin folder i only see from Ch 8 onwards. Don't think you mentioned it in your \"story so far\" summary, unless my eyes are failing me. I would be interested to read your summaries for Ch1-7 if there is cos' I think it gives insight to the context and details I might've missed, as well as any mistranslations. "},{"id":2578306,"gallery_id":406127,"poster":{"id":24542,"username":"umbigaum","slug":"umbigaum","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654751767,"body":"this must be a bait, i bet the artist is setting up a yuri distraction to make ppl forget he mostly known for NTR and then screw everyone with the ntr"},{"id":2578278,"gallery_id":406127,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654750157,"body":"@Azenn Ah, yes. I've mentioned it a bit before in my summary for Chapter 5 where the girls from Rarefure first appeared as cameo. I also talked about it in my Rarefure summary intro. Both stories actually are set in the same universe, in the same school, and even in the same class. Basically, the Rarefure gang are also Suma Sensei's students. Speaking of cameos, there was a cameo from the future (sorta like an easter egg, I guess) in Rarefure where MC had a sexy magazine of Houra as an AV model. That chapter came out like years before Itaiamai even started its serialization. Cool stuff. Btw, can you tell me what chapter did Manami had a cameo? I've only seen the two couples but not her so I theorized that she broke off from the group or she's simply in a different class."},{"id":2578276,"gallery_id":406127,"poster":{"id":2463074,"username":"Sonarin迫","slug":"sonarinpo","avatar_url":"avatars/2463074.png?_=da2510a806f45bd8","is_superuser":false,"is_staff":false},"post_date":1654750028,"body":"Fk ryoh-zoh"},{"id":2578248,"gallery_id":406127,"poster":{"id":8583,"username":"Azenn","slug":"azenn","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654748151,"body":"@DrinksandDame This may not be anything significant to the story by the end, but do you think the setting/world of Itaiamai is the same as Rarefure?   The uniforms look similar with the ribbon, just that this one has winter uniforms with the blazer but in Rarefure its the summer version of it. Also I keep seeing the subtle repeated insertion of the same background characters that look identical to those in Rarefure, including Yuuki (FMC) and Karen (tanned), with another back view looking like Manami (brunette). Would love to hear your thoughts."},{"id":2578232,"gallery_id":406127,"poster":{"id":2984029,"username":"KeitoNagare","slug":"keitonagare","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654747557,"body":"Just WHAT THE FUCK WE WAIT THE FUCKING CHAPTER FOR ANOTHER SHIT CHAPTER? I MEAN THE TWIST ARE FUCKUNG ANNOYING LOL CAN'T WAIT TO SEE THE NTR FOR REAL."},{"id":2578113,"gallery_id":406127,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1654742927,"body":"Stop posting your cringe ass comments to the their twitters in English about how you hate ntr or don't want ntr. You're reading this on a pirated site so stfu and they don't care."},{"id":2578026,"gallery_id":406127,"poster":{"id":3947606,"username":"doughman68","slug":"doughman68","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654738048,"body":"I wanna say it's another switch but to be honest I don't have faith in ntr artist to not put ntr on the 12th chapter "},{"id":2577951,"gallery_id":406127,"poster":{"id":864322,"username":"wifey027","slug":"wifey027","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654734484,"body":"So blackmail next chapter? Hope when Kise try to blackmail Karin she'll text it to sensei asap. Then sensei will rush to the scene punching Kise on the face then they will elope somewhere. If not Karin will then just submit to Kise desire become his sex slave. Making excuses like \"having sex with him doesn't make my heart race so its not cheating\". Same excuse that she say to sensei when Kise kiss and grope her lol. But yeah knowing the author he will make story longer. Milking the shit out of this then when he get bored he'll then next add the NTR like in Rarefure. See you next month."},{"id":2577945,"gallery_id":406127,"poster":{"id":2750885,"username":"glad1985","slug":"glad1985","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1654734098,"body":"@紫の猫 for now the whole story is based on the gimmick of being NTR bait/hinting NTR. The whole point of this series till now is that in almost every chapter there is a strong \"hint\"/\"bait\". Even this chapter, her stance of \"it wasn't a kiss, because it didn't make my heart race\" is like staple NTR trope of \"even if he takes my body, my heart still belongs to by partner\"."},{"id":2577934,"gallery_id":406127,"poster":{"id":2686247,"username":"DrinksandDame","slug":"drinksanddame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654733476,"body":"Full chapter is out and here's an updated summary for it https://pastebin.com/QeYy7WaW It was pretty much all sex scenes that were missing from the earlier incomplete uploaded so most of the new texts I added were for my afterword."},{"id":2577846,"gallery_id":406127,"poster":{"id":4627450,"username":"紫の猫","slug":"zi-nomao","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654729665,"body":"Now there will be blackmail. Next chapter, definitely, will be NTR. What's the point in adding delusions to make it seem like sensei is in the wrong when in the end he gets NTR'd for real, thus proving him (and his delusions) correct? "},{"id":2577844,"gallery_id":406127,"poster":{"id":3510043,"username":"imlnwgame","slug":"imlnwgame","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1654729393,"body":"Let me guess, that stalker guy will blackmail her to have sex, then the other glasses dude that mistook kissed the another girl will join in a gangbang with stalker and in the end she's becoming true slut who ditches Sensei."},{"id":2577797,"gallery_id":406127,"poster":{"id":4645015,"username":"clguzman20","slug":"clguzman20","avatar_url":"avatars/4645015.png?_=02b1790d8f1c7462","is_superuser":false,"is_staff":false},"post_date":1654727457,"body":"here comes the blackmail."},{"id":2577793,"gallery_id":406127,"poster":{"id":4724925,"username":"nhcasual","slug":"nhcasual","avatar_url":"avatars/4724925.png?_=7e50b3620e94a829","is_superuser":false,"is_staff":false},"post_date":1654727353,"body":"You know it almost seems like MC himself is becoming a NTR villain with how demented he keeps getting. Maybe the twist will be that his madness will scare her away from him?"},{"id":2577783,"gallery_id":406127,"poster":{"id":3853848,"username":"Lalmirchs","slug":"lalmirchs","avatar_url":"avatars/3853848.png?_=844797a91dde08af","is_superuser":false,"is_staff":false},"post_date":1654726961,"body":"How come we haven’t seen sensei delusions in a while? Guess this situation with his stalker is going to invoke them again ig(?)"},{"id":2577748,"gallery_id":406127,"poster":{"id":3896388,"username":"Codevine","slug":"codevine","avatar_url":"avatars/3896388.png?_=1a41eeccf6eb9bc7","is_superuser":false,"is_staff":false},"post_date":1654725219,"body":"guess that douche gonna start blackmail her into having sex with him then she will see him better in sex than her boyfriend and then she'll have a change of heart \nsigh same old same old NTR again and again booooooring"},{"id":2577726,"gallery_id":406127,"poster":{"id":104978,"username":"NeutrinoPeace","slug":"neutrinopeace","avatar_url":"avatars/104978.png?_=27b1418d011385f2","is_superuser":false,"is_staff":false},"post_date":1654723889,"body":"oh shit here it comes"}]