[{"id":2580036,"gallery_id":406255,"poster":{"id":586503,"username":"A V E P A R T H E","slug":"a-v-e-p-a-r-t-h-e","avatar_url":"avatars/586503.png?_=65c064993ceae15d","is_superuser":false,"is_staff":false},"post_date":1654837731,"body":"I have to agree with the guy below me. At this point, my guess is that due to NTR's popularity, many artists jump into the trainwreck that is this genre expecting to get some profit; sad to say, many of these artists only shine in one aspect, while being utterly mediocre at the other. They are artists, not writers, so what best way to quickly make some NTR doujins than to copy and paste a template?\nEven though I don't see the overall appeal of NTR, it's the story that offputs me more than the actual genre; stories that evoke emotion, whether rage or \"wholesomeness\" are the true golden Ars. Alas, any writing-skill is practically useless if you know how to draw \"sexy anime girls\" lmao."},{"id":2579772,"gallery_id":406255,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1654824468,"body":"Wow, this one really didn't do anything different did it! Just followed every NTR trope in the \"Perverted Blackmailing Coach\" trope! From fucking and isolating her for so long that when she finally has sex with her BF she stupidly sees outlasting him as \"being inadequate\" and goes right back to the asshole with him grinning his expected shit eating smile because he knew the girl was too stupid to realize his ploy! And ending with the phone call while fucking bit! Nothing was new here! And the fact there was a Part 2 I have to guess this was parody of the two part NTR that can be done in ONE read through! The annoying thing is once again, not tagging NTR for blacklists! Still wondering if they actually LIKE the Vanillafag vs NTRcuck wars in the comment section when they do this (on purpose as it's happening to frequently to be coincidence)  "},{"id":2579760,"gallery_id":406255,"poster":{"id":2603002,"username":"Botan Is Unbreakable","slug":"botan-is-unbreakable","avatar_url":"avatars/2603002.png?_=8a361c88841ec284","is_superuser":false,"is_staff":false},"post_date":1654823971,"body":"Where's part 1?"}]