[{"id":2584962,"gallery_id":406635,"poster":{"id":287305,"username":"keelman","slug":"keelman","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655060779,"body":"Well she got the happier ending because the \"boyfriend\" (Sana's tutor) was a cheating bastard manchild who didn't care about women (he slept with others too in case you didn't watch the chapters) he hated getting cockblocked he raped her in the toilets right in front of some dude just as he raped Sana in front of her and as he left he wanted to destroy Mina and Sana for his own amusement! Mina got a happier ending because she decided to grow up quit that relationship on her own terms instead of staying a slut and confess her part in things knowing fully well Sana would not want to see her ever again! And remember we haven't seen Sana's ending yet! Would be pretty heartless on the authors part I know she is not the favorite girl in the popularity poll but still give her something good as well! Would be an interesting twist if the guy Mina is together with right now leaves her but for entirely different reasons in Sana's ending!"},{"id":2584938,"gallery_id":406635,"poster":{"id":4480917,"username":"LOLwhatyouexpect","slug":"lolwhatyouexpect","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1655059821,"body":"The thot that slept with her friends boyfriend gets a happy ending? "},{"id":2584637,"gallery_id":406635,"poster":{"id":538346,"username":"Jeff Boltaga","slug":"jeff-boltaga","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655049221,"body":"Wow for real? That was Minase? Hell ye happy that she got a good ending\n"},{"id":2584536,"gallery_id":406635,"poster":{"id":287305,"username":"keelman","slug":"keelman","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655046608,"body":"It's nice that Satsuki Minase our \"hero\" from the stories Lovers, Lovers 2 and Turn got somewhat of a happy ending (basically us not treating her like that douchebag with his great physique) but I wish we would have seen what happened to her friend Sana... oh well I hope she gets her happy ending too (well at least something like a Tae Kojima x Kei Kurono treatment)"}]