[{"id":2588802,"gallery_id":406999,"poster":{"id":5039825,"username":"soloman32","slug":"soloman32","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655242836,"body":"man the story is dumb and is so cringe and doesn't make any sense like how the One single sex can make woman to the NTR guy and no the author likes to put the MC small penis however in anime they said its big like wow and how the fuck does people like these do they have Cheating fitch or what ??? and not just that but also how the fuck these people support these thing I don't understand and by the way i agree with you Mr. lordcellofEarth9 "},{"id":2588776,"gallery_id":406999,"poster":{"id":179265,"username":"mammom","slug":"mammom","avatar_url":"avatars/179265.png?_=9eadf7c22a924d40","is_superuser":false,"is_staff":false},"post_date":1655241891,"body":"the art and plot are degenerte trash, the autor should be ashamed for delivering something so mediocre like that"},{"id":2588732,"gallery_id":406999,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1655239187,"body":"I think what annoys me is all the racism (black guy huge cocks and being ugly as sin, You keep being racist NTR Japanese artists! Well I think it's understandable! You have to have some huge misogyny to be able to write the dialogue and make the girls super sluts! My grip I think with NTR is when they go to official stuff and play off the belief the waifu's in it like this one, just have to get a cock in them ONCE by someone not the MC and instantly they're personalities changed! I'd say it's magic, but since they never make that clear, it's obvious it's the writer pulling a \"diabolus ex Machina\" to make it work! NTR honestly is bottom tier writing because it LIVES off of contrivances for the plot to happen! Not all as their are a few that make sense! But their rare as hell because \"thinking a plot is too hard\" for something that's a quick cash grab for the rest! Seriously Reverse NTR has better writing! With the few bad ones just coping NTR but switching the gender's so aren't real! "},{"id":2588724,"gallery_id":406999,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1655238821,"body":"Wow, this guy is just unoriginal, and the fact he continues to even make NTR for Highschool DxD in the same way as the last just shows this guy is never really going to change his style or do something original with his NTR! I'm not talking about \"putting bread around a turd\" original shit either. Just something more original then \"cock brainwashes the girl without any indication on how that is\" (AKA no magic or science involved, just playing the \"so-unoriginal\" all girls are bitches) while making a canon character who's cock size is already known (Shirou from FSN and Kirito from SAO, but I forget that NTR lovers HATE Harem protagonists, hence why their so popular to get NTR I guess, cause the pathetic NTR fan is really the small dick loser and has to desperately claim \"their the big dick stealer,\" I have to wonder if they like being called \"Fat and Ugly\" then! I notice their quiet with that shit unless the stealer is handsome! Then you really know their lying on who they viewpoint as "}]