[{"id":2590898,"gallery_id":407136,"poster":{"id":4821581,"username":"saberblade131","slug":"saberblade131","avatar_url":"avatars/4821581.png?_=78bb0347a0135c4e","is_superuser":false,"is_staff":false},"post_date":1655341386,"body":"@Uppast4 I will continue to upload the rest (hopefully it doesn’t get taken down like the four chapter) I hope you can continue to do the mini translations."},{"id":2590729,"gallery_id":407136,"poster":{"id":1664848,"username":"Ⱥɾìҽʂ","slug":"arichs","avatar_url":"avatars/1664848.png","is_superuser":false,"is_staff":false},"post_date":1655330855,"body":"(bs ending for the 4 ED aka permanent swapped) she decides to go for old youhei(now in black hair senpai body) after realising the truth that a swap happened and continous the consental abuse and rough sex. Or Youhei ends up stealing the fmc even with black hair senpai body(double the ntr, double L for actual senpai) which though total bs ending would be kinda lols."},{"id":2590716,"gallery_id":407136,"poster":{"id":1664848,"username":"Ⱥɾìҽʂ","slug":"arichs","avatar_url":"avatars/1664848.png","is_superuser":false,"is_staff":false},"post_date":1655330052,"body":"4 ending possible: Let me guess, (1st ED) they will swap back again after she fells for the now gentle(body swapped) blonde douche in real sense and gets further broken later after getting confused about her true feeling Aka the ntr tag in play. Either that or (2nd ED) the now swapped blond dude(black hair senpai) tells her later about the swap...she notices the change and rechange then goes with black hair senpai after he returns to his old body with some drama in breakin up with actual blond douche(youhei) aka happy ending or (3rd ED) the new rn blonde(swapped as senpai) gets influenced by the fmc rough sex fetish. ~Two ways this can go~....one when they rewapped back to their true self fmc breaks up with her old bf and goes with now balanced rough sex and gentle outside black hair senpai or (4th ED) if they're permanent swapped now she decides to stay with blonde bf(new) realising she likes the \"new\" him. Youhei stuck in black hair senpai's body in coma or no coma forever."},{"id":2590429,"gallery_id":407136,"poster":{"id":1168713,"username":"Uppast4","slug":"uppast4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655316836,"body":"Ch6 more cute time together. It opens with them spooning and Earu asking \"Are you awake yet? Because I really need to go to the bathroom... ^^\"\". She goes to leave for work and he kisses her, says goodbye, and she's all flustered. Senpai also then goes out and is annoyed that Yohei's body is so popular with the girls he bumps into. Red haired Risa is waiting at their workplace to talk to Earu, and she says sorry she told Senpai about how Earu's living situation was bad, and how that caused Senpai to go to Earu's house. Earu did not know Senpai went to her house it seems, only that Yohei was in a bad accident. She says to friend not to worry, but page 22 ends with her muttering to herself \"hmm so Senpai came to my house when Risa told him to.\" pg 23, \"But when I called you for help (all those years ago), you just ignored me.\" Senpai goes to see his own body, still in coma. He calls Yohei's name but no response. Last page, someone asks to come in, he recognises the voice, and that's end."},{"id":2590414,"gallery_id":407136,"poster":{"id":1168713,"username":"Uppast4","slug":"uppast4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655316261,"body":"Ch5, Senpai in Yohei body is recovered and he and Earu spend cute lovely dovey time together. At one point he smashes the table and shouts because of she says \"Sorry, the cuts will heal soon and I'll be able to go back to (escort) work.\" He gets angry and says she doesn't need to do it anymore and goes to lie down to process situation. She thinks he is going to abandon her, so is all \"gomenasai gomenasai\" and is eventually calmed down with a hug. He gets hard, gets a blowy, and they have sex... But at the last panel she asks why he's not strangling her, because he's allowed to and it'll make her feel better too. Senpai is shocked. "},{"id":2590409,"gallery_id":407136,"poster":{"id":1168713,"username":"Uppast4","slug":"uppast4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655316124,"body":"Ch3 is more simple. Two scenes to show how scumbag Yohei is - two girls want to hang with him after seeing him on the street; they end up battered and abused and he takes their money. Earu comes back late, she gets a cut above her eye from a thrown ash tray, abuses her, rapes her. Cut to Senpai fantasy about love dovey sex. He meets a friend. Then calls escort, but this time gets Red hair friend of Earu. He says that it's so nice to see her so happy, but picks up on the red hair's hesitancy. After he asks, she tells him life for Earu is really bad.\n\nCh4 (missing) is probably Senpai going to Earu's house, challenging Yohei, and they both get in a bad fight or accident. Senpai wakes up in Yohei's body, but Senpai's body is still in coma. \n\n"},{"id":2590394,"gallery_id":407136,"poster":{"id":1168713,"username":"Uppast4","slug":"uppast4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655315639,"body":"Ch2 begins with Yohei and Earu having sex. She is being strangled and it appears painful. He gets a call and leaves her alone - no after are :'(.  Cut to Senpai he is reminiscing about Earu, how she used to be shy. One time she showed him cigarette burn marks on her back... She says it doesn't happen all the time. Afterwards she wanted his Line address. Senpai gets into university? Or something worth celebrating. He calls his mom. Then thinks he wants to tell Earu. Instead of sex she gives him massage and they talk. He talks about the cigarette moment and she shows that she is healed. He is kind to her, and they enjoy time together. Afterwards she takes cab home but gets out to meet Yohei. He takes all her cash. Her red haired friend (also an escort) sees it, is worried about Earu, but Earu denys any issue. "},{"id":2590387,"gallery_id":407136,"poster":{"id":1168713,"username":"Uppast4","slug":"uppast4","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655315258,"body":"Not NTR.\n\nCh1 begins with main beta character (Senpai) body swapping into blond douchebag (Yohei). This happens in the not available chapter 4 I believe. Girl is named \"Eno Asuka\", but her friends call her \"Earu\" (pronounced eh-ah-ru). \n\nCh1 - Senpai is lonely boi so calls an escort. Meets girl, turns out she is someone from junior high. He was in year 9, she year 8. They spend their time talking and he wants to be friends again. Page 22 she says \"Why do you want to talk with me now, after all this time? Why didn't you help me back then...?\" After that she goes back home and we find out she's in a fucked situation with Yohei selling her out. Very abusive relationship but she appears to be actually happy at times. Really messed up. "},{"id":2590019,"gallery_id":407136,"poster":{"id":3093375,"username":"Alien3.0C","slug":"alien3-0c","avatar_url":"avatars/3093375.png?_=ce3cf82778d109df","is_superuser":false,"is_staff":false},"post_date":1655296200,"body":"fuck ntr  "}]