[{"id":2590904,"gallery_id":407249,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1655341568,"body":"Not much sympathy for the husband. Himari and Takuya's marriage has grow cold. That's when Gouda, the bald guy who claimed to be a lawyer, came blackmailing her with a photo of her with a guy entering hotel (it's just her class reunion). She's innocent, but he keep pushing. Eventually, Himari starts accepting him too, as Gouda actually cared enough about her compared to her husband. Like, he only do sex for her like routine to make her believe he still loves her, because he need someone to do the houseworks. No feeling, just finish the business and leave. When her husband is out for work out of town, Gouda asks her to put on wig and play as another girl. That's when they met the husband (he's not out of town) and just got appointment cancelled by his sex buddy. When Gouda offered him to play with his girl, the husband even said she's better than his wife. She let out her voice, and he still didn't recognize her. That's when she decided, fuck it, she's going to have fun on her own. "},{"id":2590897,"gallery_id":407249,"poster":{"id":1587832,"username":"elzenpai","slug":"elzenpai","avatar_url":"avatars/1587832.png?_=e04a48f62ae09d24","is_superuser":false,"is_staff":false},"post_date":1655341356,"body":"The final is so fcking xD the author have his fun drawing it jajaja"},{"id":2590867,"gallery_id":407249,"poster":{"id":3657044,"username":"ZGundam64","slug":"zgundam64","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655339587,"body":"He could use the GPS on her phone to find her location and bring the police with him."},{"id":2590864,"gallery_id":407249,"poster":{"id":3362182,"username":"crazycom","slug":"crazycom","avatar_url":"avatars/3362182.png?_=808ad670a99b9bdf","is_superuser":false,"is_staff":false},"post_date":1655339307,"body":"Retard bitch retard husband"}]