[{"id":2628070,"gallery_id":407250,"poster":{"id":4277004,"username":"softouch","slug":"softouch","avatar_url":"avatars/4277004.png?_=fdc98b5e77c65313","is_superuser":false,"is_staff":false},"post_date":1657148143,"body":"I'm not sure the guy below did read the story or not. It's clearly stated that the husband is tired of his wife and has been consistently finding other chicks outside to fuck. Hence he hasn't been touching nor noticing his wife for a long time. She intends for him to notice her when he was fucking the disguised wife but he was too into \"I'm fucking another girl\" and ignored her. That's why the bald guy in the end was telling the husband to fuckoff because with such a hot and sexy wife, he rather go and find other girls outside. This is one ntr that the husband fully deserves to be ntr in the end."},{"id":2590866,"gallery_id":407250,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1655339562,"body":"Bad tagging AGAIN! Also this is likely the worst type of NTR yet! The husband was made so stupid and dense it takes away and form of realism (especially the part where he didn't even recognize his wife till it was pushed in his face in the end! I'm guessing this is parody at the levels of dense the guy getting his woman taken for him NOT to have noticed till it was shown in his face! Not feeling for the guy he was dumb! But I dislike such unrealistic characterization because I have to ask how the two got married in the first place if he's THIS level of bad husband &amp; lover\" It's like the writer hit him with  ALL the BS tropes! Like \"Sleeping like a rock\" not noticing his wife's behavior! ETC! Will say that \"WHAT, My wife cheated on me\" face at the end was pretty funny!)"},{"id":2590834,"gallery_id":407250,"poster":{"id":1026069,"username":"tmta12","slug":"tmta12","avatar_url":"avatars/1026069.png?_=b59357b24cddf411","is_superuser":false,"is_staff":false},"post_date":1655337438,"body":"不对老婆好点活该被牛"}]