[{"id":2648282,"gallery_id":407470,"poster":{"id":1391199,"username":"zspecter","slug":"zspecter","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658100633,"body":"@H_san I think you meant \"177013 \".\nBut the game isn't really that bad, since you have multiple endings, meaning that you can avoid the \"bad\" ending. Of course, you can go full ntr if you want.\nAnyway, even the \"best\" route has its \"ups and downs\", and the swinging is unavoidable, since this is the main theme of the story, so, it will feel like ntr sometimes, for both couples...\nAlso, this story is almost exactly to the \"good route\" you can take in the game, but after the swapping, the author tried a somewhat \"original\" route using different scenes from the game, but with completely different context."},{"id":2642839,"gallery_id":407470,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1657829473,"body":"@zspecter yo thanks for the explanation. and geez ur dedicated. xd and the trash are trash i won't bother with this shit. i do rather repeat 117013 than play a game about twisted slut who already a lost cause. "},{"id":2603947,"gallery_id":407470,"poster":{"id":1391199,"username":"zspecter","slug":"zspecter","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1656003202,"body":"@Yemsc search  for: \"Ore no Kanojo wa Taninbou ga Ki ni Naru You Desu\"\nI doesn't have english translation, I used some programs to translate the game but its a pain in the ass, and it doesn't work all the time, so, I only used it a few times. With that said, its easy to play the game and jump from one route to another because of the \"flow system\", which allow you to know where you are, which routes are available, which ones you already did and which ones are left, and you can just jump back and forth anytime without getting lost.\nYou can also play the game in the pov of the FMC, in all the routes as well, you just need to unlock that route with the mc first."},{"id":2601910,"gallery_id":407470,"poster":{"id":2950760,"username":"Yemsc","slug":"yemsc","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655884111,"body":"@zspecter Can u tell me whats the name of the game? "},{"id":2600860,"gallery_id":407470,"poster":{"id":1391199,"username":"zspecter","slug":"zspecter","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655834577,"body":"The thing is, this is based on the game, but this is basically some kind of \"original\" ending, although it actually uses some \"scenes\" from the game, also, it's using some scenes from the game, but with a different context, especially the end scene...\nJust keep in mind that the games has various endings, all are bad/ntr ending but one, which is the happy/swapping ending. I recommend playing the game if you can, just dont expect some kind of \"chad ending\"."},{"id":2600849,"gallery_id":407470,"poster":{"id":1391199,"username":"zspecter","slug":"zspecter","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655834102,"body":"pt2: After the soft swap happens, FMC loved it but wasn't enough, she ask for them to do a full swap, MC again \"doesn't like\" it but accept it, I say \"doesn't like\", because at this point, the FMC notices that the MC actually got very hard and cum when he saw her playing with another man's dick. Well, they do the swap, MC cum just by seeing his GF being penetrated and fucked, but guess what, he gets hard right after because he actually hates and like it at the same time, they \"happly\" have their orgy, but after that, the real bullshit start, since the FMC goes and fuck the glasses guy behind MC back and record it, she show that to the MC, he gets hard, they fuck, and since MC has no stamina, he goes on a date with her, trying to please her so she won't stop loving him. But its not enough, so, she goes to glasses guy again, the end..."},{"id":2600837,"gallery_id":407470,"poster":{"id":1391199,"username":"zspecter","slug":"zspecter","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655833371,"body":"@H_san Basically he finds her masturbating and she notices him, she say that she will service him if he doesn't speak about what he saw to anyone, MC actually has a crush on her, but instead of saying that he's not going to tell anyone, he stay silent and the fun starts. The reason why she did this to the MC is because she's a pervert, and a huge one. later they find MC\"s friend fucking that other chick, FMC gets horny and they also finally fuck. At this point MC know she's a pervert,  but accepts her the way she is. Later on FMC wants  spice things up and has the brilliant idea to have a group sex, while each couple watch the other one, this is where the bullshit start, and while they dont even touch each other, FMC get very excited in doing so, especially after she saw the Glasses guy dick, whi is thinner but longer than the MC. Well, after that, she has de idea/desire to go a soft swap, the MC \"doesn't like\" it, but since, like you said, he's afraid of losing her, he accepts it."},{"id":2598187,"gallery_id":407470,"poster":{"id":4046737,"username":"leoNh","slug":"leonh","avatar_url":"avatars/4046737.png?_=89ad0a1f79801e13","is_superuser":false,"is_staff":false},"post_date":1655703694,"body":"Fvk am I watching man. My dick lose its strength and I'm not in the mood 😂.\nNeed revenge story👆."},{"id":2597563,"gallery_id":407470,"poster":{"id":3127376,"username":"H_san","slug":"h_san","avatar_url":"avatars/3127376.png?_=9c797e263dadf9b6","is_superuser":false,"is_staff":false},"post_date":1655675604,"body":"if u love ur girl never swing kids. well it's the obvious u won't swing if u love her like never. unless ur a  cuck. well this is bs. and in this case she's a bitch like any other. well i don't understand wt's going on tho. maybe mc afraid to say no thinking he'll get full time cucked? well he's already a cuck in any case. "},{"id":2594305,"gallery_id":407470,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1655511725,"body":"The MC looks like sprite in novel game. Nearly same pose, angle, expression with slight variations, reused in all the panels. "},{"id":2594112,"gallery_id":407470,"poster":{"id":1112909,"username":"81980085","slug":"81980085","avatar_url":"avatars/1112909.png","is_superuser":false,"is_staff":false},"post_date":1655501287,"body":"媽的，我來分析作者的心理。肯定是以前受了某種創傷，所以現在反過來噁心所有讀者。"},{"id":2594010,"gallery_id":407470,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1655494729,"body":"first com bitch will be always bitch "}]