[{"id":2594298,"gallery_id":407443,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1655511452,"body":"6th story: Matching answer after five years. Mitsuru the MC found his childhood friend Arisa who missed the last train after party. He invited her in since he had promised she can count on him in trouble. Back then, she had confessed to him, which he rejected because he only see her as his sister. She asks him to wash her, and found other man's cum inside her. She asks him to clean her and they had lots of sex. On the bed, they talked again about the confession back then. When they're younger, it feels like the difference of their age is too big, so he thought it's better to treat her like a little sister. But now when they're adults, it doesn't bother him as much. Instead, He feels like he had to keep her by his side. | Favourite is those two stories. Would love more non-sex romantic scene between the couple, but ero novel probably can do that better. "},{"id":2594283,"gallery_id":407443,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1655510954,"body":"1st story: Nickname. During school trip, the guys do dick measuring thing in the bath. Unexpectedly, the class' otaku, Komine Shunta got the biggest. Since then, Sekine, the boss in the class affectionately calls him Magnum. The girl is Harima Reina, the only disciplinary committee member in their school. She also got nicknamed for her big boobs. Reina invited him for a sharing, after all they both got embarrassing nickname. The real thing though, she's really curious about sex, and she wants to see how is the biggest guy in their class. After that, both entered a relationship where both casually have sex with each other, even kissing. Until one day, Reina said Sekine confessed to her. Shunta thought his part is done, after all the only thing he do with her is sex. He even suggested she tried having sex with Sekine, but she totally got no interest. They had sex again, and Shunta feels strange to know, he's the only person to have sex and know this side of her."}]