[{"id":2612649,"gallery_id":408080,"poster":{"id":5230170,"username":"Ethereal302","slug":"ethereal302","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1656413826,"body":"Very nice story and art"},{"id":2603704,"gallery_id":408080,"poster":{"id":3363847,"username":"zombieadd","slug":"zombieadd","avatar_url":"avatars/3363847.png?_=87136af99411069a","is_superuser":false,"is_staff":false},"post_date":1655989254,"body":"@minminazusa: Nice explanation/summary and thank you. I agree with you and do also hope there'd be a sequel. Art is very well done too."},{"id":2602839,"gallery_id":408080,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1655941714,"body":"Ah, this is the author of fucking ghost sister (post #398849)"},{"id":2602834,"gallery_id":408080,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1655941579,"body":"The characters. Miyako (the black haired girl) and her boyfriend Haruki got request from her best friend Kana to do swapping. Kana’s relationship hasn’t been going well lately and she’s desperate to keep it from falling apart to suggest swapping. Kana has been Miyako’s first and best friend, she also introduced Haruki, her childhood friend who is now Miyako’s boyfriend. Yuuya, Kana’s boyfriend, helped Miyako to get her first orgasm. Miyako always worried about being frigid because sex never felt good, neither does masturbating. After the swapping, Yuuya left his number to Miyako.| Seeing Kana did have it with Haruki, it’s probably compatibility rather than Haruki being the typical NTR small dick boy. Want to see the relationship gets complicated if there are sequel, like how they start to grow fond of the other’s partner more (for example, Yuuya also enjoys sex with Miyako more, and Kana being actually interested in Haruki)."}]