[{"id":2631227,"gallery_id":410001,"poster":{"id":4366914,"username":"a guy with free time","slug":"a-guy-with-free-time","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1657275303,"body":"wow common sense in an H I can't believe it"},{"id":2631191,"gallery_id":410001,"poster":{"id":4848133,"username":"ColiMan","slug":"coliman","avatar_url":"avatars/4848133.png?_=b168cab3cfcc6b81","is_superuser":false,"is_staff":false},"post_date":1657273434,"body":"finally a fightback this artists take a realistic too serious"},{"id":2630875,"gallery_id":410001,"poster":{"id":1587832,"username":"elzenpai","slug":"elzenpai","avatar_url":"avatars/1587832.png?_=e04a48f62ae09d24","is_superuser":false,"is_staff":false},"post_date":1657260185,"body":"You don’t see this kind of doujin so often, 10/10"},{"id":2630842,"gallery_id":410001,"poster":{"id":5223956,"username":"Pumba12","slug":"pumba12","avatar_url":"avatars/5223956.png?_=52b6886e9d9761a0","is_superuser":false,"is_staff":false},"post_date":1657258830,"body":"lol uno reverse card"},{"id":2630824,"gallery_id":410001,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1657258149,"body":"But seeing how it's in the house! I have to guess the picture was more along the lines of \"reveal his blackmail\" and she'll give that picture TO THE COPS! Rape and Trespassing! Seriously I'm now noticing with camera's being easier to get for such households and harder to located if placed right! You'd think the raping blackmailer would PREFER not to rape his victim at their home! Nope have to have that dopamine Alpha fix of fucking another man's women in their home and bed! I'm betting he blackmailed her with \"who will your husband believe\" and she mirrored his words with \"who do you think her husband AND the police will believe, a fat sketchy looking bastard caught on camera fucking her or the obvious victim who will press charges against him and who's husband will see him as some man who forced his way in and raped his wife! I'm sure it all humiliated him that he'll never get it up again because of the trauma and humiliation! A worthy reward for rapists scum LOL!"},{"id":2630816,"gallery_id":410001,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1657257827,"body":"HAHAHAHA Always good to see the \"reverse Blackmail\" trope get used! This is similar to another doujin where the asshole overestimated his ability to control the woman he was blackmailing and got reverse blackmailed in the process! In this one, the man gets sexually humilated and blackmailed to scurry off in a corner, out of sight and mind crying about how the \"Mean Lady humiliated him and he can't even get revenge cause she'll ruin HIM if he does\"...missing the fact she's in the picture as well, but then I did see a blackmail NTR where all the guy had was the girl's \"ponytail\" in the shot and nothing else and it still worked, so whatever! In the other one, the girl turned the guy into a beta simp incel slave! Forced to watch her perversions in silent like a cuck! And in a moral degeneration! The asshole lost control over the girl and got reduced to her cuck slave! Even put the collar he put on her when he corrupted on him to signfy the switching of the Master/Slave roles"}]