[{"id":2638508,"gallery_id":410589,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1657630988,"body":"This part got some unanswered things. Apparently, Ryousuke had knocked a woman before, and she threatened to sue him if he doesn't marry her. So, he almost divorced Chisato and that's the last straw for her. She thought it will always be fine, he will always keep her because there's no other woman who can tolerate him like she is. Yet, he's about to throw her away because another woman is pregnant. But there's no further explanation of what happened with this woman. "},{"id":2638456,"gallery_id":410589,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1657628105,"body":"Her mother came, asking for a family meeting with Chisato's parents too. The topic is of course about divorce. Ryousuke finally understand the anxiety of the girls who are afraid of being casted away by him before because Chisato doesn't say anything to defend her. That night, Chisato suggested something Ryousuke had always refused, sex with penetration. After that, she finally accepted the pleasure of feeling loved by someone, unlike when he was just fucking girls for his own pleasure. A year past. Ryousuke is still a shut in who can't go out on her own. Well, in the final page, Chisato asks her, if she is happy. "},{"id":2638453,"gallery_id":410589,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1657627884,"body":"After the rape, Ryousuke became a shut in. Chisato suggested her to quit job. She told Ryousuke, those men also risked their own life, so they're not going to actually leak that video. Then, Chisato became the breadwinner, as well as taking the lead in their sex life. Ryousuke became more dependent on her. A thing she worried about is because gender change syndrome usually ends with divorce, but she still believe Chisato love her for who she is rather than her gender. The sex also made him feel loved, rather than like those men. Because her acting like man invite uncomfortable look from people around (such as lashing out in restaurant before, or the guy hitting on her, or people looking at her on the street), she also starts acting more like a girl outside home, like changing her speech, or thinking about how to dress."}]