[{"id":2638097,"gallery_id":410538,"poster":{"id":4986456,"username":"U.P.R.Y.","slug":"u-p-r-y","avatar_url":"avatars/4986456.png?_=865ef9b1db51128f","is_superuser":false,"is_staff":false},"post_date":1657610410,"body":"Yeah C100, i thought he was going to make this a comemorative doujin but no"},{"id":2637797,"gallery_id":410538,"poster":{"id":2722605,"username":"Dazzling_Order","slug":"dazzling_order","avatar_url":"avatars/2722605.png","is_superuser":false,"is_staff":false},"post_date":1657596087,"body":"C100 already?!\n"},{"id":2637737,"gallery_id":410538,"poster":{"id":5195055,"username":"8325","slug":"8325","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1657592741,"body":"@R@t43rN0tsay I agree, the meme itself was funny for a while but it was just that, a meme, there is no record of Astolfo having an above average sized dick. In addition to the fact that the plot of how each of his doujins happens is absurd, there were servants who could easily kill him by snapping their fingers, they become sexual slaves from one moment to the next. which only makes him absurd, including servants who have no romantic interest in him like BB, kiara, kyihoime, raikou, etc, etc, etc. In short this author is lousy and should redraw from scratch instead of copying himself likewise to get the shit doujin out every week"},{"id":2637578,"gallery_id":410538,"poster":{"id":4286303,"username":"R@t43rN0tsay","slug":"r-t43rn0tsay","avatar_url":"avatars/4286303.png?_=84633647e1af875f","is_superuser":false,"is_staff":false},"post_date":1657585558,"body":"Not only that but Ankoman is just beating a VERY dead horse with how he make Astolfo have a huge ass dick because of that one man that cosplayed as Astolfo and revealed that he had a huge ass dick, it’s a dead meme within the fandom that Ankoman is just desperately clinging on to"},{"id":2637482,"gallery_id":410538,"poster":{"id":5195055,"username":"8325","slug":"8325","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1657579889,"body":"another shitty doujinshi, deforming a good character like astolfo and turning him into this ridiculous fuckboy attempt, in addition to reusing the same old images just changing their faces, maybe if you took longer to make your doujishis you could do something of quality in shit place ever"}]