[{"id":2650385,"gallery_id":411150,"poster":{"id":3130131,"username":"TyZler","slug":"tyzler","avatar_url":"avatars/3130131.png?_=e0cb37432348eafe","is_superuser":false,"is_staff":false},"post_date":1658184874,"body":"@minminazusa thx my dude "},{"id":2647119,"gallery_id":411150,"poster":{"id":4109049,"username":"Iska_IX","slug":"iska_ix","avatar_url":"avatars/4109049.png?_=f3d3e52e1b1c137a","is_superuser":false,"is_staff":false},"post_date":1658045551,"body":"I always think that I’ve read all the good vanilla doujinshi out there but I always end up adding another to favorites minutes after. It’s honest kind of ridiculous when I think about it, 27 pages in my favorites section of straight vanilla Doujinshi with mostly blonde/white haired waifu. Blonde Supremacy!!!\n\nnhentai really need to give up the option to publish groups of Doujinshi on our profiles."},{"id":2646405,"gallery_id":411150,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1658015381,"body":"The age gap is probably 4-6 years at least. Ringo and Kei are stepsister from their parents' marriage. At first, Ringo doesn't like him because her image of boys are creature who did things she doesn't like, such as flipping her skirt. But when Kei helped her, that gives her a new impression and for years she found herself not interested with other boys while she compare them to her brother. It's only recently though, that she finally realized she's in love. Her friend told her siblings like them can get married, so she planned on seducing him. Later, after the horror movie, she finally confessed she likes him, and how her seducing him is not just prank. He also admitted he loves her. After sex, they talk about when he begin to love her. It's last year, when a colleague said she's cute, then he realized he's feeling jealous, as a man who doesn't want anyone else to touch his woman. "},{"id":2645506,"gallery_id":411150,"poster":{"id":4825280,"username":"minminazusa","slug":"minminazusa","avatar_url":"avatars/4825280.png?_=2c643b9f9af2b709","is_superuser":false,"is_staff":false},"post_date":1657970180,"body":"Does this artist got alternate name for non-H works? The style he draw the expression, felt like seen that somewhere else. "}]