[{"id":2655969,"gallery_id":411616,"poster":{"id":1411428,"username":"SuperCerati","slug":"supercerati","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658440853,"body":"If you are reading this comment your dick will be shortened by 4 inches within 5 years. To undo this curse you need to copy this and paste it on 5 other manga. i'm so, so sorry, please forgive me. I Know this may be seem nonsense but not gonna risk"},{"id":2653666,"gallery_id":411616,"poster":{"id":3604898,"username":"schneexue","slug":"schneexue","avatar_url":"avatars/3604898.png?_=233d4c41b43f0c16","is_superuser":false,"is_staff":false},"post_date":1658327164,"body":"第挺真实的，两个故事都"},{"id":2653623,"gallery_id":411616,"poster":{"id":4104682,"username":"大隻佬","slug":"da-zhi-lao","avatar_url":"avatars/4104682.png?_=4798c8947d16862c","is_superuser":false,"is_staff":false},"post_date":1658323995,"body":"雖然是中文，但我他媽的看不懂在講什麼"},{"id":2652291,"gallery_id":411616,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1658264542,"body":"2nd story seems not as fun she's just a whore and not fit for marriage"},{"id":2652273,"gallery_id":411616,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1658263930,"body":"First story is basically the husband is too perfect at everything. He can do housework cook clean and earns more than her. She can't do any of these and she feels insecure and lonely which explains why she gets mad they can't have a baby (only thing she is useful for since he does everything). She's a PoS and gets angry when she can't do shit and blames him for working too hard and making her lonely (she quit her job btw and even before she quit she never paid for anything and he still gave her an allowance+she had her own pay). She cheats cus she's lonely that's basically it and talks shit about his manhood to the other guys. They divorce but she wants to get back. Parents admit they didn't like her but thought she was emotional support (they saw she was useles at housework) so didn't say anything."}]