[{"id":2659507,"gallery_id":411909,"poster":{"id":5405646,"username":"Jiko1901","slug":"jiko1901","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658619543,"body":"Yuya my man🔥🔥🔥way to go bruh 👍💪"},{"id":2659330,"gallery_id":411909,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658609794,"body":"@Blankroom it's why the girl has to take a few levels in her IQ and common sense going down and her self-entitlement that the writer is hinting 'she secretly has\" going up! She's comparing her recent virgin BF to a guy who's likely fucked like a monkey for way longer! That's where what I mentioned come in, because otherwise she would rightfully see him as the rapist he is. But then she never should have been alone or moved away from him in the first place! I figure the idea was she was thinking about the sex they witness and \"how it would feel\" feeling guilty AFTERWARDS which made it easier to gaslight her! The idea is to isolate her and have her have no faith in other ESPECIALLY her lover that she stupidly becomes a puppet, foolishly believing she can always stop, but he knows she won't...till he dumps her or sells her off! She finally realizes her folly when she's ruined and too late, it's why the BS \"Happy Endings\" in NTR like this with you being told \"Don't think too hard on it!\""},{"id":2659322,"gallery_id":411909,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658609529,"body":"@Pumba12 Sadly that's a NTR Logic Trope! The writers leave it open ended to leave it up to the imagination! Open endings are pretty lazy when you think about em! The likely scenario is asshole is gloating about \"getting his girl\" she likely felt regret the moment she finally got off her sex high and he \"Gaslighted her into keeping it their little secret!\" And knowing NTR Logic, he's counting on BF breaking up with her without telling her about the picture and being quiet about it while he swoops in and grabs her while she's in the pits of despair for being dumped, adding her to his collection, because in NTR, everything is made for connivence of the NTR ASSHOLE! The chance to rape/fuck the girl, her being quiet/easily manipulated and the guy being a wimp, dense or all the above till he's abandoned while he gets no comeuppance. AS much as NTR Lovers claim Vanilla is similar, NTR is meant to give bad vibes from it unlike Vanilla, so it CAN'T rely on the same thing over and over again!"},{"id":2657058,"gallery_id":411909,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658492196,"body":"part 2......"},{"id":2657041,"gallery_id":411909,"poster":{"id":5223956,"username":"Pumba12","slug":"pumba12","avatar_url":"avatars/5223956.png?_=52b6886e9d9761a0","is_superuser":false,"is_staff":false},"post_date":1658490642,"body":"generic ntr the girl wants sex thats all the ntr guy is always the better one with sex and the mc who comes to know the truth about it by watching a video lol. after that the end nothing else wtf atleast show us that they broke up why make it half asses story. just make something else will you. give us reverse ntr where a girl steals a guy and is better at sex."},{"id":2657000,"gallery_id":411909,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1658487622,"body":"Man the virgin being bad at sex is so weird in NTR. Why can't they make the girl cum it's like they've never had sex before or something that's why they always lose to the chuds dick smh "},{"id":2656954,"gallery_id":411909,"poster":{"id":488615,"username":"rocksatori","slug":"rocksatori","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658483960,"body":"I'm still surprised that Unian continues to sell when his stories are shit..... I know that the genre has certain rules in which it is not so strict in terms of history or justifying the reasons for blackmail, but Unian doesn't even try in creating a context since their girls easily give themselves over to the blackmailer and become sex-obsessed bitches..... for that reason it is not strange that even the Chinese think a lot before translating their works about how bad they are"},{"id":2656755,"gallery_id":411909,"poster":{"id":1587832,"username":"elzenpai","slug":"elzenpai","avatar_url":"avatars/1587832.png?_=e04a48f62ae09d24","is_superuser":false,"is_staff":false},"post_date":1658473854,"body":"It’s look like the “couple” that are fcking in the tree are a cameo from another series of the author xD #389094"},{"id":2656722,"gallery_id":411909,"poster":{"id":1587832,"username":"elzenpai","slug":"elzenpai","avatar_url":"avatars/1587832.png?_=e04a48f62ae09d24","is_superuser":false,"is_staff":false},"post_date":1658472847,"body":"Most normal thing, fuck a random guy that you just meet xD"},{"id":2656684,"gallery_id":411909,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658471708,"body":"When u want a good fuck, not a bf."},{"id":2656662,"gallery_id":411909,"poster":{"id":3520886,"username":"DATABASE","slug":"database","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658470871,"body":"first com bitch always bitch"}]