[{"id":2659307,"gallery_id":412007,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658608506,"body":"Frankly no, knowing NTR logic, he's still shown \"moping\" and she worked there before so BS that they just \"ran into each other!\" It's the simply \"Former hoe running into her ex to gloat on how much better off she is without him!\" all to needlessly taunt him for the \"crime\" of not \"satisfying her like her new man!\" Wouldn't be surprised if she passive aggressively insults him on how he's still working that \"dinky job\" while she's likely whoring around for her \"Alpha Chad\" and still get boned by him!.... Of course it's free game on the epilogue after however! So logic is after this he gets a wake up call, stops bitching, betters himself and moves off that job like she did and finds a better girl! \"Chad\" likes parenthood for all but a year before abandoning the hoe! And next time MC sees his ex, she's working at the store again while eying him! Knowing he came to gloat like she did to him prior! But can say nothing because the whoring is not enough and she needs that job! so \"Loser Wins!\""},{"id":2658225,"gallery_id":412007,"poster":{"id":4598680,"username":"Pakito-","slug":"pakito","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658552152,"body":"Phew that last page, the loser wins i guess "},{"id":2658102,"gallery_id":412007,"poster":{"id":5223956,"username":"Pumba12","slug":"pumba12","avatar_url":"avatars/5223956.png?_=52b6886e9d9761a0","is_superuser":false,"is_staff":false},"post_date":1658546373,"body":"Ohh well he got saved from a slut"},{"id":2657896,"gallery_id":412007,"poster":{"id":1674198,"username":"Blankroom","slug":"blankroom","avatar_url":"avatars/1674198.png?_=8864db100bc6d34f","is_superuser":false,"is_staff":false},"post_date":1658536555,"body":"yeah she has mental problems or something and she made him crazy right?"},{"id":2657884,"gallery_id":412007,"poster":{"id":2408988,"username":"Sgt. Morningwood","slug":"sgt-morningwood","avatar_url":"avatars/2408988.png?_=79dc690bab62f983","is_superuser":false,"is_staff":false},"post_date":1658535565,"body":"Where is the \"first come bitch will bitch\" or something like that"}]