[{"id":2669876,"gallery_id":412178,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1659090857,"body":"@Annalbelle69 oh don't worry... I know alllll about the green stuff my man 👌👌👌and also know exactly what you mean about the whole body orgasim thing while high. I see you also mention fappig while drinking in your about but personally I've never found that very pleasant. You ever try reading hentai while tripping out on a classic psychedelic like LSD shrooms or mescaline though? Shit's pretty fun, monster girl hentai is really cool to read while tripping."},{"id":2669598,"gallery_id":412178,"poster":{"id":4925452,"username":"Annalbelle69","slug":"annalbelle69","avatar_url":"avatars/4925452.png?_=6a4a7e02cc2c722a","is_superuser":false,"is_staff":false},"post_date":1659078250,"body":"@L0lic0пwizard - Spending too much time slowly stroking my cock while staring at pint sized loli babes getting their small anuses stretched to the absolute limit by big fat cocks really changes one's tastes to an extreme degree. You have no idea how hot it is to me when I see girls so damn young and inexperienced get their soft slimy guts get pounded by a grown men with massive cocks in hentai. And don't even get me started on the gaping. I smoke weed before having some \"me time\" looking at these doujins and I shit you not, when I finally start shooting ropes staring at a loli's well used, abused, loosened gaping asshole, my entire body goes through complete and utter bliss as opposed to just my cock and balls during a non high jerk off sesh. You have to experiment with the green stuff dude. The pleasure is too good to pass up on, that being said just don't do hard drugs. That shit with will only harm you. "},{"id":2668023,"gallery_id":412178,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1658995094,"body":"@Annalbelle69 hmm... that's a pretty good point actually. What is the secret to your wisdom sir? "},{"id":2666779,"gallery_id":412178,"poster":{"id":4925452,"username":"Annalbelle69","slug":"annalbelle69","avatar_url":"avatars/4925452.png?_=6a4a7e02cc2c722a","is_superuser":false,"is_staff":false},"post_date":1658944687,"body":"@L0lic0пwizard - That's a little hypocritical coming from a real alien like yourself mister. It ain't that bad, just ignore the speech bubbles and all of a sudden it's not that bad. It's simple but hot in my opinion. "},{"id":2660955,"gallery_id":412178,"poster":{"id":1784655,"username":"rohan121","slug":"rohan121","avatar_url":"avatars/1784655.png?_=7816edddc36999f4","is_superuser":false,"is_staff":false},"post_date":1658671842,"body":"Nice wincest"},{"id":2660850,"gallery_id":412178,"poster":{"id":2167955,"username":"Kilokii","slug":"kilokii","avatar_url":"avatars/2167955.png?_=45cb5d8ce4043024","is_superuser":false,"is_staff":false},"post_date":1658668057,"body":"nHentai needs a 'slut' or 'non-virgin' tag so people aren't in for surprises like this when they find out the girl goes around fucking other men."},{"id":2660559,"gallery_id":412178,"poster":{"id":4292432,"username":"L0lic0пwizard","slug":"l0lic0pwizard","avatar_url":"avatars/4292432.png?_=ba9c2d59ac2636d2","is_superuser":false,"is_staff":false},"post_date":1658655742,"body":"This whole thing felt slightly off... like it was made by an alien or someone who's never actually read a hentai before."}]