[{"id":2664185,"gallery_id":412335,"poster":{"id":5093237,"username":"windyn't","slug":"windyn-t","avatar_url":"avatars/5093237.png?_=904f494f8239bb57","is_superuser":false,"is_staff":false},"post_date":1658817313,"body":"@K.L Maizer and girl keeps fucking. Girl doesn't like it but he infused mana into his semen so yeah. Anyways Maizer lets girl go to school with the condition of no contact with other men. Klaus is bullying Alice (protagonist of otome can use light magic). Girl stood up because she's similar with Martin. Klaus fell in love ig because he's a priest and hasn't been in contact with women very much. Klaus gave a letter to girl thats from Martin. its about congratulating the engagement and that she should forget about him. Klaus actually went to the Mobuji village to do priest shit and met martin. He ate his sweets, girl got excited and touched his hand. Maizer ripped klaus hand and reveal that alice and him we're bussiness partners "},{"id":2664169,"gallery_id":412335,"poster":{"id":1483800,"username":"Pukanmee","slug":"pukanmee","avatar_url":"avatars/1483800.png","is_superuser":false,"is_staff":false},"post_date":1658816471,"body":"This is amazing "},{"id":2664167,"gallery_id":412335,"poster":{"id":5093237,"username":"windyn't","slug":"windyn-t","avatar_url":"avatars/5093237.png?_=904f494f8239bb57","is_superuser":false,"is_staff":false},"post_date":1658816258,"body":"@K.L girl becomes a villainess in an otome game. She wanted to pursue a side character called Martin, so she wanted to annul the engagement. Makes Zain (black haired prince) accidentally fell in love with her. Also makes Maizer fall in love, because she was different and would call him out for killing. Girl tells Maizer about Martin, Maizer proceeds to burn Mobuji village village next to where Martins lives (Macaroni village) to \"prevent plague\" thats ch 1"},{"id":2664155,"gallery_id":412335,"poster":{"id":5093237,"username":"windyn't","slug":"windyn-t","avatar_url":"avatars/5093237.png?_=904f494f8239bb57","is_superuser":false,"is_staff":false},"post_date":1658815751,"body":"Too much sex we need more plot :// 5/10"},{"id":2663916,"gallery_id":412335,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658805957,"body":"@Monkeyking123 Till they put a limit on how many posts one can put down, I'll do as I please :) The extra was more me relating ALOT of familiarity this yandere hentai is pretty much showing with ALOT of Otome \"Reincarnated as a Villainess\" stories flooding manga and Manhua/Manhwa! It also remind me of another chapter hentai on this sight of Isekai! Woman get's isekai, is spineless and helpless (You know the \"Incel's perfect woman\" type LOL Not calling anyone Incel here before anyone \"get's offended!\") that she ends up clinging to a powerful, but out of his mind younger man who keeps calling her \"Big Sister\" and saying weird shit! Interesting Hentai, it's why this one got me writing the \"essay's\" (Blame that on the word counter forcing me to have to make multiple posts! Also to the guy below with the \"Theory\" .....\"No...SHHH He is legend!\""},{"id":2663751,"gallery_id":412335,"poster":{"id":1599028,"username":"Lolipussyistight♡","slug":"lolipussyistight","avatar_url":"avatars/1599028.png?_=eb15c9b48ed379b9","is_superuser":false,"is_staff":false},"post_date":1658799384,"body":"It’s just a theory a hentai theory "},{"id":2663660,"gallery_id":412335,"poster":{"id":680472,"username":"Monkeyking123","slug":"monkeyking123","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658796004,"body":"Wow the guy below me really obsessed with this hentai, he literally write an essays in porn website"},{"id":2663603,"gallery_id":412335,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658792973,"body":"I'm thinking the Prince might have also been reincarnated similar to Lily, as these's stories occasionally has a reincarnator reincarnate as one of the love interests who decides to save and make the Villainess \"his\". But damn is the writer making alot of pot shots! The Mob she planned to cling to being treated as \"irrelevant\" because well...he's a \"MOB\" LOL (Not really NTR since really, she never loved the guy, he was just a safe option to avoid her bad ends) and Prince Charmless only loved her in a \"Your mine, don't you get that\" fashion once he realized she wasn't One Dimensional like the rest! (Or he's Gerald from Destruction Flag Otome who decided FUCK IT, locked Katarina in a tower and decided \"anyone else who looks at what's mine funny get's it!...Let's be real if Gerald did that, it's be open war with him and Mary, the OTHER yandere who'd likely do this to Katarina! Only thing stopping them is slight common sense...well Gerald anyway, Mary is likely to full on BLOW IT ALL UP!) "},{"id":2663600,"gallery_id":412335,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658792650,"body":"Su Luxia ALSO takes shots at \"Male Protagonists\" like the Murderous Yandere Prince when they show up! Reminding that she's a moral person even when she's delivering vicious revenge! She will NEVER hurt or put into harm's way innocent bystanders or drag them into her plans as a casualty! She will NEVER ignore abusers of power or criminals! Even if their not the main target (s), she will even go out of her way to help unknowns if a part of her plan ends up or is about to drag them into trouble they didn't deserve (like a criminal angered by a THoT she destroyed planned on harming said THoT's other victims because she was two timing him AND them at once and had a thing with harming EVERYONE INVOLVED! She moved to ruin him quickly to PROTECT those other men as they were victims! And the THoT she destroyed needed to suffer her fate worse then death rather then die! And she will NEVER ignore Rapists! Likely came from the fact SHE use to be a fodder who suffered the fate of her clients!)"},{"id":2663591,"gallery_id":412335,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658792224,"body":"He easily recognizes her by the fact the character she's always incarnated as in each story ALWAYS has her name (Su Luxia) and they suffer a \"character change\" (Their meant to be cannon fodder or villainess in the stories, meant to be \"Vanquished\" for the main couple of the story! Her job is to change those girls fate as their spirits pay with their existence to get revenge against those who hurt them! As alot of the settings are Otome or bad romance stories that give the main \"power couple\" ALOT of BS hand waves and excuses to justify alot of boorish behavior! One part of the fun is Su Luxia DECONSTRUCTING alot of the ideas of these's \"toxic romances\" (like the Romeo and Juliet \"different races\" romances, or the \"Our love can survive Poverty because we're both too use to living in luxury, wealth and authority and even \"I love my criminal husband who murdered my family and abuses me\" brain dead \"FMC\" she had to convince \"didn't have to suffer that or love monsters!\")"},{"id":2663583,"gallery_id":412335,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658791877,"body":"The first chapter implies he's aware he's a fictional character! (Noting how he can just kill and maim as he wishes and no one stops him!), and I think the \"negative points with Lily\" is the Otome game's \"SYSTEM\" viewing his words and aggression at her as him \"hating her\" because well, \"aggressive yandere's act as though they hate you, their Object of Affection/OoA\" when it's \"pudd'n from Billy and Mandy's Love Bunny's \"definition of Love\" (In that it hurts!). He reminds me of a character from Cheating Men must die, who the FMC discovers is self-aware he's a book character and hates his situation, falling in love with the FMC when she takes possession of the Villainess of the story, his \"CF\" who died because \"the story demanded he save the heroine over her!\" revealing he loved the FMC because she wasn't a one-note character like everyone in the story was! FMC unlike the MC in this was able to escape him...too bad he escaped his world eventually and started stalking her in other arcs!"},{"id":2663563,"gallery_id":412335,"poster":{"id":4355240,"username":"heyegghead","slug":"heyegghead","avatar_url":"avatars/4355240.png?_=e611fe7e365de6bd","is_superuser":false,"is_staff":false},"post_date":1658790576,"body":"Amazing More please"},{"id":2663432,"gallery_id":412335,"poster":{"id":3199663,"username":"harmonygirl23","slug":"harmonygirl23","avatar_url":"avatars/3199663.png?_=4e07f0fc696e8488","is_superuser":false,"is_staff":false},"post_date":1658783121,"body":"author go in hell with such \"happy ending\" trolling cinic scumbag"},{"id":2663297,"gallery_id":412335,"poster":{"id":3147941,"username":"franz941","slug":"franz941","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658774603,"body":"How is this not on popular? the art is good and has a nice parody of the genre as a plot."},{"id":2663172,"gallery_id":412335,"poster":{"id":1396784,"username":"by-ad","slug":"by-ad","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1658767726,"body":"This shit doujin should be at popular section ngl. reversed yandere. hope for continue!!!!"},{"id":2663138,"gallery_id":412335,"poster":{"id":1035561,"username":"Anisence","slug":"anisence","avatar_url":"avatars/1035561.png?_=e7253d1e9e2d133c","is_superuser":false,"is_staff":false},"post_date":1658765207,"body":"The prince is hot i wouldn't mind marrying him "},{"id":2662995,"gallery_id":412335,"poster":{"id":1784655,"username":"rohan121","slug":"rohan121","avatar_url":"avatars/1784655.png?_=7816edddc36999f4","is_superuser":false,"is_staff":false},"post_date":1658760012,"body":"I noticed this lacked the netorare tag unlike ch1"},{"id":2662898,"gallery_id":412335,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658756295,"body":"Fun part is (check out the first one, might have to look at the artist if you have NTR blacklisted as it's been tagged NTR!) his profile at the end of that lists him as being aware of his \"Never be punished\" status and hating it! He can kill a man, and no one will care! Frankly I think he's self aware that he's a Otome character! He raped Lily (MC) as a \"test\" and is now obsessed with her (The other love interest is also so as well, but is well \"A virgin Second Male Lead\", so of course his response is to do \"everything but tell the \"object of his affection\" how he feels as the artist makes fun of his \"Incel behavior\" which I kind of have to agree with LOL) basically, she fucked up the plot by going off the rails but instead of \"Bakarina\" hijinks! Instead it reminds me of \"Cheating Men must Die\" crazy shit "},{"id":2662889,"gallery_id":412335,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658755825,"body":"I mean even in the manhua/manhwa (Chinese/Korean Manga) versions of these's stories! Those \"Prince\" characters who are the \"main love interests\" are \"butcher anyone who pisses me off crazy I have mommy issues\" crazy when you think on it! Fans (including myself) have made fun of the fact the writers rinse and repeat the character (even a meme out there where they all have the same hair color, black or blonde, all look \"scowling all the time!\" WOULD kill the MC villainess, are played off as \"misunderstood\", have MOMMY ISSUES their likely taking out on the Villainess MC, which goes both ways in \"I hate my mom and wish she was alive so I could kill her\" and \"I love mommy and want to fuck her! DAMN YOU DAD I'LL KILL YOU\" crazy obsession! Funny enough the Second Male Lead that compete's is actually stable nice guy...who the villainess will dump in the end to go with the guy likely to kill her if he gets bored, or abuse her when he feels like it! \"All Girls love Bad Boys\" trope) "},{"id":2662882,"gallery_id":412335,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1658755515,"body":"@K.L. Not that hard to sum up! It's the typical \"Reborn as a Villainess\" story! MC is reborn as the Villainess of an Otome game, tries to break the rules to save herself from the bad end by breaking her engagement with the Prince to marry a commoner Mob, but Prince is yandere for her instead and well, does what Yandere do when they're Love Interest tries to leave them! \"Rape em to take out their frustration!\" He's a deconstruction of \"Ruin your life\" Prince love interest in these's series who are all types of creepy \"red flag in real life\" types! In this case, the Prince is the \"you don't leave me, I leave you\" type! (Like \"I'm the Villainess so I'm Taming the Last Boss\" the Prince went nuts when SHE dumped him for his brother, so to have his cake and eat it, he planned to rape her to force marriage and get the heroine who is a Green Tea bitch, basically force her to do the work and be his, while loving the Heroine! This is what happens if his type were to succeed then fail basically!)"},{"id":2662836,"gallery_id":412335,"poster":{"id":2540233,"username":"Yuu0311","slug":"yuu0311","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1658753910,"body":"Please I want that story from third panel no matter how much fucked up it is…"},{"id":2662782,"gallery_id":412335,"poster":{"id":209402,"username":"K.L","slug":"k-l","avatar_url":"avatars/209402.png?_=930dd1662d86d95e","is_superuser":false,"is_staff":false},"post_date":1658751571,"body":"Can someone please sum up about the plot, I'm interested but having a headache right now."},{"id":2662754,"gallery_id":412335,"poster":{"id":3995705,"username":"TechnicalApple","slug":"technicalapple","avatar_url":"avatars/3995705.png?_=bfe640d21f3e8aad","is_superuser":false,"is_staff":false},"post_date":1658749869,"body":"Wow… nice, super nice! "}]