[{"id":2205706,"gallery_id":43410,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1639839761,"body":"Catch me in the astral realm be there or be queer you gnomes"},{"id":2205703,"gallery_id":43410,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1639839601,"body":"Shattering examples they are yas yas she can jump out into the blue ocean from the 5 thousand years of oppression the 5 thousand yard stare of the animals 5 thousand of them 3 3 3 the animals are all in this room underground waiting and planning for the day they are released. Somewhere in France there is this thing in the basement of an abandoned house in the countryside its made of cast iron and sometimes it dissappears and reappears it's not a normal thing its special it's there because it's where it needed to be for its purpose what is its purpose? Mind control time moves backwards the divine spiritual inverted and warped unchecked by the correction of mad forces equalizing."},{"id":2205668,"gallery_id":43410,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1639838520,"body":"You can do some things but other things you cannot do. Lies. \"Don't stick the fork in the toaster\". The polish people. An empty tin of creamed corn. There is some deeper meaning, hidden secrets, as I type they elude me but if I stop... let's see... no... we won't write that... other things you cannot do. "},{"id":2205654,"gallery_id":43410,"poster":{"id":4881713,"username":"toaster man","slug":"toaster-man","avatar_url":"avatars/4881713.png?_=626fb98f763f545e","is_superuser":false,"is_staff":false},"post_date":1639838173,"body":"Shoving pineapples and you are pregnant from a goat the homeless man yells at the passing cat the woman with the long hair is 5 inches of steel bar reinforcing that the prisoner had sharpened into a point on the concrete slab he stabs at the pigeons with the plastic fork but alas his fumbling attempts to get a bird to cook over the small pile of burning trash are ill-conceived and fruitless"}]