[{"id":1434819,"gallery_id":47037,"poster":{"id":1571575,"username":"Aldyn","slug":"aldyn","avatar_url":"avatars/1571575.png?_=6b1988a6df0a01d5","is_superuser":false,"is_staff":false},"post_date":1609023104,"body":"4 years later, I have to agree with Troncol. It's not even that I hate NTR as a concept. I just hate to see the same kind of protagonist in the same kind of situation displaying the same kind of reaction. I don't remember the last time I read a NTR where the guy didn't get a raging boner at seeing his girl fucking another guy. It's not even disturbing, sad or messed up. It's just annoying."},{"id":1206245,"gallery_id":47037,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1599902235,"body":"The thought process of the siblings makes no sense whatsoever. Mindbreaking the girl and then drugging, raping the boy while forcing him to watch his crush get violated by the brother/teacher sounds more like a recipe for suicide than anything else. And this would've been better served with an extra page or two showing what happens when they see each other again, though with the way the boy kinda ignored her on the phone at the end, it probably wouldn't be a pleasant sight. Nagare's NTR stories always tend to either have the dumbest endings or ends before the actual conflict is resolved(fully expecting this to happen with Kaname Date, too), which is kind of annoying."},{"id":1083079,"gallery_id":47037,"poster":{"id":322251,"username":"gman32","slug":"gman32","avatar_url":"avatars/322251.png?_=637d5f5fdf9d385f","is_superuser":false,"is_staff":false},"post_date":1594960816,"body":"So these two dipshit \"match makers\" thought that the only way to get these two to confess their love for each other, was to NTR the guy? What kind of idiots and shithead writers would even THINK that would work? This quite literally is one of the worst written hentai I've ever laid my eyes on."},{"id":740003,"gallery_id":47037,"poster":{"id":1086657,"username":"Khamsin.Kinzaa","slug":"khamsin-kinzaa","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1543008523,"body":"This Story is too a bit rush or short like a Oneshot if the author make it altist two or three chapters or even make it 40 pages enough to make detailed and a great story.... well as for me my opinion in this story well if i were the guy it will only make me traumatized for what happened after that incident i'll confront my childhoodfriend for what i witness then maybe i changed school to forgot that incident then start a new life find a new girl which is a innocent and a virgin... why a virgin b'coz to prevent a triggerfor what happen been traumatized for a slutty girl"},{"id":739991,"gallery_id":47037,"poster":{"id":1086657,"username":"Khamsin.Kinzaa","slug":"khamsin-kinzaa","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1543007742,"body":"metroid which site beside this has another translation are you referring at? i check all the it's all the same translation"},{"id":121702,"gallery_id":47037,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1495408774,"body":"This is a special work  since it came out when ntr wasnt as popular as now and the story was  widely discussed at the time.   There is actually a second and better translation but its not on nhentai."},{"id":90163,"gallery_id":47037,"poster":{"id":242744,"username":"jonnyboy","slug":"jonnyboy","avatar_url":"avatars/242744.png","is_superuser":false,"is_staff":false},"post_date":1486284383,"body":"@Troncol  I agree."},{"id":69939,"gallery_id":47037,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1477953865,"body":"Another story of a guy finding out the girl he likes has been stolen away and turned into a sex-crazed bitch. &lt;sigh&gt;. Must the male lead ALWAYS sorrowfully accept this turn of events? Can't he just ONCE get angry, kick some ass, fuck the weak-minded bitch senseless and then move on with his life? Because this degree of pathetic gets on my nerves after five or six stories..."}]