[{"id":862517,"gallery_id":48710,"poster":{"id":1149732,"username":"greenstar","slug":"greenstar","avatar_url":"avatars/1149732.png","is_superuser":false,"is_staff":false},"post_date":1554143164,"body":"this sucks "},{"id":143700,"gallery_id":48710,"poster":{"id":1164458,"username":"z player","slug":"z-player","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1500743890,"body":"cái địt mẹ thằng nào viết truyện khốn nạn thế lồn mẹ nó"},{"id":82192,"gallery_id":48710,"poster":{"id":687355,"username":"?h7M0iqA3","slug":"h7m0iqa3","avatar_url":"avatars/687355.png","is_superuser":false,"is_staff":false},"post_date":1483413974,"body":"The foreplay here is awesome and way superior that most other porn in all forms. What males do in most porn is urinating unto women's faces, and for the intense penis scenes these men end up being mere sloths. Very often it's women who do the actual work. This dounjinshi is one of the few honorable exceptions where the man is the one who does the work and does a semi-credible story of pleasing a woman.  A rational person knows these porn scenes are the total exception, but they are a minority.\r\n\r\nThe funny things is that these stories are feared by most people of all times and places, extramarital sex: parents about their teenagers and couples about their partners. We wouldn't be here if it were that easy and by \"we\" it also means women! Their porn is flat out displayed in the bookshelves at wal-mart. It's just not graphic, that's all it needs to go public."},{"id":81622,"gallery_id":48710,"poster":{"id":687355,"username":"?h7M0iqA3","slug":"h7m0iqa3","avatar_url":"avatars/687355.png","is_superuser":false,"is_staff":false},"post_date":1483240508,"body":"Right what that hypocrite scum deserved. Tomoya Okazaki, helping and working hard for you son long as you wear skirt and be pretty, otherwise stay away. He was a jerk to men, yet at the end he was one more wimp scared of sex and women."}]