[{"id":2286160,"gallery_id":60528,"poster":{"id":3180468,"username":"Kyle dungo","slug":"kyle-dungo","avatar_url":"avatars/3180468.png?_=e5cdc7f85ed95b14","is_superuser":false,"is_staff":false},"post_date":1643035458,"body":"@firstroll999 ilove ur theory dude\nit took me 15 mins to finish it"},{"id":2286130,"gallery_id":60528,"poster":{"id":3180468,"username":"Kyle dungo","slug":"kyle-dungo","avatar_url":"avatars/3180468.png?_=e5cdc7f85ed95b14","is_superuser":false,"is_staff":false},"post_date":1643034478,"body":"Me.        "},{"id":2259855,"gallery_id":60528,"poster":{"id":4820501,"username":"justSaying","slug":"justsaying","avatar_url":"avatars/4820501.png?_=35c2ebf5c4c4d6d5","is_superuser":false,"is_staff":false},"post_date":1642004883,"body":"fucking kek all the routes are here"},{"id":2215144,"gallery_id":60528,"poster":{"id":4501220,"username":"JesterTheClown","slug":"jestertheclown","avatar_url":"avatars/4501220.png?_=28283499018505e3","is_superuser":false,"is_staff":false},"post_date":1640244656,"body":"What the fūck is the tuna empire tag?"},{"id":2204438,"gallery_id":60528,"poster":{"id":3724507,"username":"horn e","slug":"horn-e","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639782053,"body":"@firstroll999 i read all of your theory and i could say I'm impressed, you went out of your way to wrote a 3 hours long essay for nothing. Most of your points made sense and are good (especially the 4th wall breaking thing), i really like the idea that the plot was done by the hands of eldritch gods and that they invade his dream making him insane and you really can tell shit went insane when he and his mother had tea in the rain"},{"id":2204414,"gallery_id":60528,"poster":{"id":3724507,"username":"horn e","slug":"horn-e","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1639780926,"body":"I'm never doing drugs again"},{"id":1987041,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630483649,"body":"That’s all the theory I have, this hentai took me 4 hours to read through, 3 more hours to wrote the analysis on. It was a fun ride. Art is superb, story is very inviting for theory crafter like me. I wouldn’t say it’s a perfect theory, there surely a lot of hole I wasn’t cover at all. This hentai is 7 years old, probably not a lot of reader will go to comment section, but if you do please share your theory and question. This piece of art really fun to solve around. New interpretation always welcome. \n\nI haven’t use my brain cpu this much since Black Souls II and I really appreciate it.\n\n9/10 I wish the artist make more this weird supernatural hentai, horror and doujin make the best combination to jerk off to."},{"id":1987025,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630483047,"body":"For the very last scene of them and sister eldritch monster, she is one of all the old god’s personality manifested in the real world through Rokorou dream. After all of them banged you can se Hitomi curse him while trying to take him to escape again, but this time it’s too late, the mother (probably strongest avatar of the old one) stop them but some how got interrupted by the sister. She’s one of the personality that the old god took (actually steal from real sister who now locked in the dungeon) her jealousy on Hitomi and the mother personality drive her man so she try to keep them for only herself. That where the think sister personality is crossing the so she tell Nanase to crush the girl the her truck for punishment. Don’t worry she don’t actually die, just demanifestation back to the mansion). Now since real Rokurou already accept them again the show is over. They order Nanaze to bright real Rokurou and Hitomi back to the mansion so they can ‘love’ their lover for eternity. (11)"},{"id":1987009,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630482476,"body":"This suggest that the urge of dominating stem from himself, this dark feeling probably why the old god interested in him and engrave themself to his dream when they met at the beach in the first place. What they actually do just manipulate his dream, hallucinate his sensation then give a few push to make him turn in to dominance rape monster. So their goal now is to bring him back to that stage. The more he dive back into his old masked self the stronger their connection become, and at the end he accept the old god back to him again so the sequence of him fuck all of them at the same time start. This is a sign of the dream become powerful enough until reality breaking down, in 17th chapter is where he fuck all the manifestation of the old god. At the point Rokurou summon them into real word by his side, no need to possess Nanaze or Hitomi at all. (10)"},{"id":1986990,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630481937,"body":"After that it just a sake of the old god put on the show for her audience (other old god/us) she keep mating to real Rokurou through Nanaze and Hitomi body, one interesting fact is she never let dream Hitomi mating with Rokurou in real body, every time except the last scene it’s alway the god pretending to be Hitomi while let Rokorou fuck her in Nanaze body. I do believe this is come from pure jealousy that after all he been through his original mind still love Hitomi instead of them, therefore they will not let the, fuck easily. (The verse about love and mating that the glasses girl read probably tell that the old god does love Rokurou so much, but since it is godlike abomination live probably over millions years what they think of love could be different than us, in this case their love presented in form of endless breeding). You can seen real Rokurou start to turn crazy in mating more and more at one point he even have the expression his masked self while  fucking Hitomi. (9)"},{"id":1986978,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630481324,"body":"I think about the detective girl a lot. Her present is very out of place and I do think that it is the way of the artist tell us about the real world, for what we know she probably in America or Europe while contacted to the old god (without knowing they are not human). In term of narrative it confirm two information; first is that the theater and the god manifestation physically located in the real world (which strengthen by Nanaze word in the last chapter of first book that her present is not a dream) and another fact that there are an organization trying to get to the real Rokurou too. Whether they want to use him to control the god or just do it for the sake of secure contain and protect it doesn’t matter much. I actually think Nanaze alone is more than enough to bring real MC back to mansion. So I think they just hire the detective to lure the organization out and after gangbang department of SCP foundation do their job, the old god just send Nanaze to kill them all at one. (8)"},{"id":1986956,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630480533,"body":"For now the connection between their dream and Rokurou wasn’t strengthen so they use Nanaze body as a vessel. By manipulate real Rokurou perception they make his see Nanaze as other girl who is one of the old god’s personality avatar into her. When ever MC fuck a girl in the first book, it just him fucking Nanaze who got possessed by old one entity. So you never see him fuck more than one girl at one except in the very last chapter (even hotter if you imagine he fuck Nanaze in her emotionless boring face while he hallucinated, thinking he fucking other girl and she just serve him and going with it). Sometime you can see him fuck other girl while Nanaze watching, that is the god possessing Hitomi real body and use her as a vessel, since Hitomi in the dream already weaken they can highjack her body easily. (7)"},{"id":1986939,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630479860,"body":"They torture dream Hitomi until she spill the location of real Rokurou out. Then the eldritch god send Nanaze to the location, there they found memory loss Rokurou with real world Hitomi so they decided to recall his memory back, and since they don’t really think any human can stop them so they turn the memory regain story of Rokurou in to a play for other old god to enjoy (The old god in this matter can be interpret as literally other god in the story or representative of us the reader who is higher dimension entity who watch this fuck up story as a sexual entertainment, as same as the old god who own the MC. You can even see the artist low key sarcastically insult himself and us as the detective girl out right say it such a shitty porno we jerking our cock to). The real Rokurou location probably at some isolated island, Nanaze have the responsibility to set all the scene up so she appear as narrator/backstage of the theater. (6)"},{"id":1986925,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630479062,"body":"This is were Nanaze come in, as we seen in the scene that she kill entire agent crew with weapon and all other Nanaze body under the mansion. It save to say that she’s not a human, instead an experimented biological life form of the old one (It also have a hit that she capable of performing instant teleportation too). Since the eldritch horror cannot leave the mansion they create something to do the job for them, Nanaze is either artificial human they handmade or probably the god’s daughter with monster Rokurou. Still the creation process does get rough, so hundreds of defected Nanaze corpses got dump under the mansion, the one we see probably only well functioned. She she low key work like a dream router and can leave the house, they use her as an assistance to execute the plan of bringing real Rokurou back. For those monster lock down in the basement they are probably be the god’s children with insect (masked) MC(5)"},{"id":1986828,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630474680,"body":"The old god cannot do any thing with out it’s main his dream, so they use the original girls as a dream holder and put them in the dungeon under the mansion, with enough power, it manage to destroy the barrier between dream and reality, therefore they can manifest themself into real world but still weakly connected to Rokurou dream world. However the eldricth abomination cannot leave the mansion to find Rokurou themself since they can’t leave the host far (all the girl living as live stock under the mansion) so they did several things to set up the plan. But first they decided to create their own version on Rokurou as a temporary substitution, that come the huge insect that have its head like Roukurou mask in the basement (It represent the form them want human Rokurou to be/How they see Rokurou in there monstrous eyes) . There plan was to torture dream Hitomi until she tell them the real Rokurou location. While having fun with their toy they also keep mating to monster Rokurou. (4)"},{"id":1986818,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630474091,"body":"He rape and turn all of the original girl into his slave, start with his real mother (the mother on the theater is one of the old god avatar who rewatch the real event with joy). There plan to changing him to ‘perfect husband/breeder’ grow was closer to reality but never complete since deep down he still love Hitomi and wish to only be with her (what the sister in eldritch form said tell us that Hitomi herself know full well about this). This make all avatar of the old one hate her so much and use her in the dream world as a sex toy. Everything seems fine for the abomination until Hitomi decided to push Rokurou from the cliff to save him in one Christmas. The incident make Rokurou forgot about all of the event, therefore the old god cannot connect to him anymore. After that Hitomi take memory loss Rokuro to leave in the island far away from the old one hand. He physical body mange to escape but herself in the dream already own by them so keep got torment in the dream eternally (3)"},{"id":1986801,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630473376,"body":"The theory (con.) \n\nAfter he got parasite by eldrith abomination it slowly change his soul through the dream. As the book in second encounter with glasses girl stated, the host dream will start bending, he cannot distinct about present, past, nor future. Since them Rokurou slowly change into psycho, his small feeling of wanting to dominate everyone become stronger until come can control himself no more. The first victim is Hitomi, a girl who he love but never confess. After he turned he rape Hitomi and turn her into slave. As you can see in the diary his face got cross out because whoever did the deed wasn’t him anymore but it is a monster he had became. \n\nWhen he finish turning real world Hitomi into his slave, he put on the mask (physically representation of his mind turning into monster by those parasitic old god who enjoy breeding with him eternally) then begin his quest to enslave all the girls in the real world. (2)"},{"id":1986790,"gallery_id":60528,"poster":{"id":4356415,"username":"firstroll999","slug":"firstroll999","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1630472711,"body":"I have a theory on this story.\n\n***This hentai is no coma shit, it’s Lovecraftian Horror***\n\n:cautions, English is not my primary language and this is a long dive down. My grammar might torment your soul before the fucking story:\n\nI read the story back and forth 4 - 5 times and found that there’re multiple keys information that support this theory, the most important is the sister’s dialogue from first chapter mention she and Rokurou met each other at the beach (A lot of eldrith abomination come from the sea, the sister even transform into one) and the message that glasses girl read to him in second book. (Concept of them implanting themself into Roukuro mind, living in his dreamscape)\n\nIf you similar to concept of dream worlds in Bloodborne it will help on understanding the picture.\n\nRokurou probably a normal guy that hide his darker side of wanting to rape/dominate every one in his mind, he wasn’t did anything disturbing yet until the old one engraved into him. \n\n(1)"},{"id":1383777,"gallery_id":60528,"poster":{"id":3764812,"username":"0alexfinch","slug":"0alexfinch","avatar_url":"avatars/3764812.png?_=2206ec5df25bdb94","is_superuser":false,"is_staff":false},"post_date":1607112536,"body":"can someone clarify the plot"},{"id":1255077,"gallery_id":60528,"poster":{"id":2164954,"username":"aite","slug":"aite","avatar_url":"avatars/2164954.png?_=a4bbbcaad74852fd","is_superuser":false,"is_staff":false},"post_date":1601950558,"body":"啊这  禁止套娃      "},{"id":828123,"gallery_id":60528,"poster":{"id":1923629,"username":"nopor27","slug":"nopor27","avatar_url":"avatars/1923629.png?_=566ad211bc26427d","is_superuser":false,"is_staff":false},"post_date":1551066585,"body":"https://nhentai.net/g/57715/ part 1"},{"id":435964,"gallery_id":60528,"poster":{"id":1256445,"username":"feydude","slug":"feydude","avatar_url":"avatars/1256445.png","is_superuser":false,"is_staff":false},"post_date":1524786742,"body":"I have no idea what the fuck i just read from vol 1 and 2, but theres lots of good art"},{"id":380669,"gallery_id":60528,"poster":{"id":1543026,"username":"shadowhh17","slug":"shadowhh17","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1520006959,"body":"I need a 3rd vol. The art is just the best I've seen!"},{"id":322894,"gallery_id":60528,"poster":{"id":1433038,"username":"butt boy","slug":"butt-boy","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1510686598,"body":"What the hell did i just read"},{"id":304903,"gallery_id":60528,"poster":{"id":1114616,"username":"polarpwn","slug":"polarpwn","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1506907847,"body":"What a mindfuck!"},{"id":167971,"gallery_id":60528,"poster":{"id":577348,"username":"AgentTed","slug":"agentted","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1505974362,"body":"This is retarded.  "},{"id":164964,"gallery_id":60528,"poster":{"id":1342869,"username":"Rock&Guts","slug":"rock-guts","avatar_url":"avatars/1342869.png","is_superuser":false,"is_staff":false},"post_date":1505382069,"body":"I need ............................clarity?"},{"id":96473,"gallery_id":60528,"poster":{"id":781431,"username":"rayquixote","slug":"rayquixote","avatar_url":"avatars/781431.png","is_superuser":false,"is_staff":false},"post_date":1488607295,"body":"omg page 180"},{"id":70214,"gallery_id":60528,"poster":{"id":777746,"username":"iandy914","slug":"iandy914","avatar_url":"avatars/777746.png","is_superuser":false,"is_staff":false},"post_date":1478116018,"body":"twisted. damn."}]