[{"id":811166,"gallery_id":67750,"poster":{"id":1103835,"username":"「Islam Mind Control」","slug":"islam-mind-control","avatar_url":"avatars/1103835.png","is_superuser":false,"is_staff":false},"post_date":1549611626,"body":"early on set Alzheimer's in adults. Take your black hairy fingers off your keyboard, and never talk about the human species again, you mockery of our supposed shared ancestor.. No amount of olive oil and wheat flour slabbed on your face every morning will make you white. It's about as delusional of an idea as your daydreams of European heritage. You nigger. You make Bolivia look like a beacon of civilisation. You are the Baltimore of South America. Go fertilise the pampas with you and your families corpses, its the best you can hope for in life. For the first time in your life, nigger, you have a job making food for beings vastly superior to yourself. Uruguayan cattle. Coincidentally, it would be the first time an Argentinian \"man\" provided for a family. Die, Diego. No one would miss you. Except for Australian Aboriginals, who now would have no one to make them look good."},{"id":811161,"gallery_id":67750,"poster":{"id":1103835,"username":"「Islam Mind Control」","slug":"islam-mind-control","avatar_url":"avatars/1103835.png","is_superuser":false,"is_staff":false},"post_date":1549611505,"body":"You subhuman baboon. You literal nigger. How dare you speak, you swarthy jungle monkey. How dare you open your big lipped, rim encrusted, menthol cigarette smelling mouth? You are human trash, Diego Tyrone LeShawn de Maradona. Universally despised, derided and mocked. Your nationality and skin tone offers no hope to the world that South America can ever prosper. Crawl back in to the Brazilian jungle you came out of, you literal orangutan. I hope you decide to sail your grandfathers skip to the Falklands and rape some sheep, as is in the negroes nature. It would still be the whitest pussy you ever had. Give Nigel and Robert a chance for some target practice, your sole use to the world. Argentinians obsession with a few windswept islands in the Atlantic is hilarious but sad. Coincidentally its the only worthwhile contribution Argentina has made to the medical field. The MUH LAS MALVINAS sentiment in the average negro Argentinian is both an early warning sign of autism in children, and"},{"id":663360,"gallery_id":67750,"poster":{"id":1122903,"username":"LKLKLK2","slug":"lklklk2","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1534831381,"body":"Narcasism at its finest"}]