[{"id":2601837,"gallery_id":76055,"poster":{"id":4539503,"username":"Rudiferme","slug":"rudiferme","avatar_url":"avatars/4539503.png?_=04ba1eb28777dbe8","is_superuser":false,"is_staff":false},"post_date":1655881060,"body":"Okay- Imma rant cos I'm not satisfied. Spoilers tho. So in Higurashi, the same method of deception via reader's assumption was done. We're shown A then C. Therefore we assume A happened then C but we assume its A then B. but by omitting information, a logical event B occurred inbetween. The difference in Higurashi and Fraction is that this doesn't make much logical sense. Now- if I were Kago, how would I re-write the scene to make sense while abiding by Kago's rules? There's several methods off the top of my head. I'll just list one: Trick the reader based on time. We are shown Ryoko dies then Hayami dies. But if we distorted time, the chronological sequence could be Hayami dies first, then Ryoko is killed. Let's say- January 1st pg 59, Ryoko tells MC about stalker Hayami. (Ryoko hasn't died yet) January 1st, night. Ryoko texts MC 'Help'. January 2nd pg 76. MC finds it weird that Ryoko hasn't come to work. He suspects Hayami. He calls him out. He pushes him on a train track. (1)"},{"id":2601831,"gallery_id":76055,"poster":{"id":4539503,"username":"Rudiferme","slug":"rudiferme","avatar_url":"avatars/4539503.png?_=04ba1eb28777dbe8","is_superuser":false,"is_staff":false},"post_date":1655880904,"body":"Hayami is cut in half by a train. MC is half- asleep and forgets he killed him. January 3rd MC tells Ryoko he killed Hayami. January 4th Hayami punches his card at work. Ryoko and others say- they saw Hayami at work. MC assumes he has lost his mind when it's really Ryoko creating alibis for MC. January 4th-pg 62 MC kills Ryoko. For time deception, pg 51 could provide logical inconsistencies in time stamps to allow the reader to deduce the sequence of events. For instance, we are first shown the death of Yuriko. We assume it took place before pg 11 but in reality, it took place after the death of Hayami. IF the manga said 'I killed 5 people' in pg 11. Let's say the date given in pg 51 Yuriko died was August 25. But in pg 11, the time stamp shows July 25. Therefore, an unseen 5th kill of Hayami took place that we assumed was the 5th girl Yuriko because of the distortion of time period. (2)"},{"id":2601822,"gallery_id":76055,"poster":{"id":4539503,"username":"Rudiferme","slug":"rudiferme","avatar_url":"avatars/4539503.png?_=04ba1eb28777dbe8","is_superuser":false,"is_staff":false},"post_date":1655880488,"body":"We are seen the blood in pg 11 and assume it's the blood of his brother when it's really the blood of Hayami. So the order would be. 1. Ryoko tells MC about stalker Hayami. 2. Hayami is killed. 3. Yuriko is killed. 4. Pg 51 Ryoko deduction. 5. MC tells Ryoko about being the murderer. 6. Ryoko covers for MC with alibis. 6. Ryoko is killed. Yep- this seems plausible. Another possibility revolves around Ryoko being a second killer who killed Hayami and wants to kill MC next, hence why she deceives him about a stalker Hayami to lure him but Ryoko dies instead. Ryoko creates alibis for Hayami still being alive to distort the time of death of Hayami. Howdunnit can be anything. I remember watching a TV show once. The victim was chopped in half in the middle of the street. Solution was- victim drove at a high speed. Crashed. Flung at high speed toward a sharp signboard. Body gets decapitated. Literally anything works for bullshit Howdunnits. It's the whodunnit that matters most in mysteries(3)"},{"id":2272819,"gallery_id":76055,"poster":{"id":3337748,"username":"SuCCulent","slug":"succulent","avatar_url":"avatars/3337748.png?_=c42a7c06bc97ce1a","is_superuser":false,"is_staff":false},"post_date":1642522791,"body":"The first part was amazingly-written"},{"id":1858586,"gallery_id":76055,"poster":{"id":3840658,"username":"Dip1🦇$यु","slug":"dip1-y","avatar_url":"avatars/3840658.png?_=939a2b2af792210b","is_superuser":false,"is_staff":false},"post_date":1625730380,"body":"This is amazing!🔥✨🔥✨👍"},{"id":1026109,"gallery_id":76055,"poster":{"id":808478,"username":"PrettyPettanko","slug":"prettypettanko","avatar_url":"avatars/808478.png?_=71e4b25940e579f6","is_superuser":false,"is_staff":false},"post_date":1592804161,"body":"Damn this was good!!!  "},{"id":440281,"gallery_id":76055,"poster":{"id":1459983,"username":"JoeSecksa","slug":"joesecksa","avatar_url":"avatars/1459983.png","is_superuser":false,"is_staff":false},"post_date":1525498420,"body":"Fellas, pay attention to the story and what the mangaka is saying about perspective and page 101 will wreck your shit, this is godly."},{"id":24650,"gallery_id":76055,"poster":{"id":123640,"username":"darirad","slug":"darirad","avatar_url":"avatars/123640.png","is_superuser":false,"is_staff":false},"post_date":1441810851,"body":"this is art"}]