[{"id":2135881,"gallery_id":78210,"poster":{"id":4377184,"username":"KazuyaStarlite","slug":"kazuyastarlite","avatar_url":"avatars/4377184.png?_=cd0b920d2e83815f","is_superuser":false,"is_staff":false},"post_date":1636560293,"body":"Page 7 always crack me up lmao"},{"id":1117383,"gallery_id":78210,"poster":{"id":3107783,"username":"Pervert God Ryo","slug":"pervert-god-ryo","avatar_url":"avatars/3107783.png","is_superuser":false,"is_staff":false},"post_date":1596286440,"body":"She is one of the favourites of mine from 'THE WORLD GOD ONLY KNOWS'. She is the sexiest of them all. Very happy to find and read it!!!😍"},{"id":1065635,"gallery_id":78210,"poster":{"id":2042975,"username":"BlackCat03","slug":"blackcat03","avatar_url":"avatars/2042975.png?_=4b3d7e6f53960535","is_superuser":false,"is_staff":false},"post_date":1594267610,"body":"The hidden scene"},{"id":947137,"gallery_id":78210,"poster":{"id":1220716,"username":"TCC","slug":"tcc","avatar_url":"avatars/1220716.png","is_superuser":false,"is_staff":false},"post_date":1561055579,"body":"It has been 3 and a half years since I fapped to this one. Those years when I was still a neopyhte to doujins, I quickly search for the parodies of a female character of an anime I have watched. This brings back the feelings of my past self, when I was also cheering for Kasuga in TWGOK. Now I have realized I am now quite older, this hits me the reality that sooner or later, I will also be changing my self. My happiness back then was to enjoy watching anime and sht. Now, merely rest and sleep would be my anti-stress pill. Adulthood slowly devours by former self. Where change is the only constant thing, this world is surely cruel. But on the brighter side, I get to witness many valuable things in life, moments that I have to treasure. Sure, the future is harsh, but having none of it would be worse. Oh well, this comment is turned from a nostalgia appreciation to a life lesson. "},{"id":683817,"gallery_id":78210,"poster":{"id":633570,"username":"playcool92","slug":"playcool92","avatar_url":"avatars/633570.png","is_superuser":false,"is_staff":false},"post_date":1536656472,"body":"Damm, this doujin is the best, really reminds me of her, it is sad that most of the girls dont get that much focus later on, specially Kasuga that always was extremely adorable.\nNow one get this, ah such a nice girl just a cute and hot doujin &lt;3"},{"id":125670,"gallery_id":78210,"poster":{"id":279818,"username":"TheHalberdier","slug":"thehalberdier","avatar_url":"avatars/279818.png","is_superuser":false,"is_staff":false},"post_date":1496389807,"body":"I always felt that Kasuga was the 2nd best girl. I always liked Haqua best because she had a more complex personality. But then when I read something like this, that is actually in line with how Kasuga would act, my opinion of her improves."}]