[{"id":2502583,"gallery_id":78226,"poster":{"id":4726437,"username":"carpedm0///0","slug":"carpedm0-0","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1651661797,"body":"what is this trashy take @Foxriver12"},{"id":2265509,"gallery_id":78226,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1642216043,"body":"And you have to stop believing that men like experienced girls in bed. Because it just means that you're second to a lot of other men, that you're more likely to get diseases, that she's going to be constantly judging your performance, that she potentially has low self-esteem and a sex addiction that could encourage her to cheat on you out of lust, that she's certainly had many relationships before yours and that she's not a reliable person in love. Not to mention the vagina that once dilated is sometimes like a puddle of water, so much she has accumulated miles of cock. So very wide. "},{"id":2265506,"gallery_id":78226,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1642215686,"body":"whose happiness depends on the opinion of others, when they don't even respect the foundations of his relationship. No nobility. And the mangy dog that pretends to be her friend, while secretly coveting her body, is just a little snake that loves the feeling of power over an inexperienced and weak person, who will do anything to tempt and pervert her. Stimulating it by bringing events subtly, in order to raise the temperature enough to allow itself to give bold and opportunistic directives. In short, two scumbags who are not worthy of being loved, just future animals reincarnated. This kind of relationship, usually ends very differently. After the act, the girl understands the deception and what her \"friend\" pushed her to do \"supposedly for altruism\" and loses all self-esteem. As for the boy, he will potentially be beaten violently, like Oda Nobutaka in \"Btoom\" and that would be justified. Besides the girl's friends are also sluts, there is no miracle possible."},{"id":2265501,"gallery_id":78226,"poster":{"id":3885567,"username":"Foxriver12","slug":"foxriver12","avatar_url":"avatars/3885567.png?_=3040106ace6f180a","is_superuser":false,"is_staff":false},"post_date":1642215498,"body":"One more proof that friendship between men and women is crap. The value of things doesn't exist anymore. It's very honorable to think that the memory of your first time was with anyone, in any way. In a gym, without a reliable commitment, without true love, for the sole benefit of your lustful curiosity and primal instincts, manipulated by a childhood friend of whom you seemed to have a low opinion, making you a hypocrite. Accepting the advice of a loser who only had superficial relationships and only wanted to take advantage of your weakness and nativity like any disgusting seducer, to dirty you and satisfy his petty fantasies, while claiming that it was for the good of your partner, while he only encourages you to betray him and sink into indignity, perdition. An eternal shame engraved in his history. In short, it's just the ultimate easy slut, who doesn't control her hormones, who is a slave to lust and curiosity, who is ultra influencable and "},{"id":835111,"gallery_id":78226,"poster":{"id":431251,"username":"sotenisaze","slug":"sotenisaze","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1551694660,"body":"dam this grandfather likes the reverse netorare where the third party is not a scum(fking her w/o the use of blackmail)"},{"id":389598,"gallery_id":78226,"poster":{"id":1204924,"username":"Enanan","slug":"enanan","avatar_url":"avatars/1204924.png?_=065a50d0171b4425","is_superuser":false,"is_staff":false},"post_date":1521444368,"body":"god i wish that were me"},{"id":377406,"gallery_id":78226,"poster":{"id":1400370,"username":"starfox1234","slug":"starfox1234","avatar_url":"avatars/1400370.png?_=8fe9415a33f35edc","is_superuser":false,"is_staff":false},"post_date":1519742570,"body":"Good ol netori "},{"id":234559,"gallery_id":78226,"poster":{"id":52357,"username":"Pegasus80","slug":"pegasus80","avatar_url":"avatars/52357.png","is_superuser":false,"is_staff":false},"post_date":1506487641,"body":"Diría mas que ntr, esto fue infidelidad, ya que ella misma busco tener sexo con el otro chico."},{"id":107880,"gallery_id":78226,"poster":{"id":732603,"username":"Tristan182","slug":"tristan182","avatar_url":"avatars/732603.png?_=eedd23ca5af4c68b","is_superuser":false,"is_staff":false},"post_date":1491496871,"body":"Hentai logic in a nutshell xD"},{"id":96099,"gallery_id":78226,"poster":{"id":609194,"username":"LegendX","slug":"legendx","avatar_url":"avatars/609194.png","is_superuser":false,"is_staff":false},"post_date":1488493786,"body":"Strange I don't know why buy I was rooting for mr.steal your girl. It's obvious that they got better chemistry and he's not being the usual blackmail or force type he's only complying with her request nothing more."},{"id":67347,"gallery_id":78226,"poster":{"id":447330,"username":"TammyT","slug":"tammyt","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1476636994,"body":"One of my favourites. ;)"},{"id":64974,"gallery_id":78226,"poster":{"id":771763,"username":"vanillafan","slug":"vanillafan","avatar_url":"avatars/771763.png","is_superuser":false,"is_staff":false},"post_date":1475393683,"body":"why not practice sex with you know... the one you're already dating?   -__-"},{"id":64689,"gallery_id":78226,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1475277506,"body":"I usually like my Coelacanth mangas, but frankly, this one gave me a bad aftertaste (I feel bad for her boyfriend, he did nothing wrong :-( He even tried making an advance, but she chose the other guy)... The sex is good (oral, vaginal, sexual tension building up until nothing but the bodily needs matter), but the story relies on its female heroine being totally dumb and lying to herself..."},{"id":55565,"gallery_id":78226,"poster":{"id":111269,"username":"poinky","slug":"poinky","avatar_url":"avatars/111269.png","is_superuser":false,"is_staff":false},"post_date":1470060565,"body":"Well that was bitter sweet"}]