[{"id":1155753,"gallery_id":78960,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1597793431,"body":"They should do one where the main dude goes out with a girl but does not have sex with her one bit. When she cheats like a normal ntr and the guy finds out, he encourages her to cheat with other guys and get pregnant. Then after she has been pregnant for a while tell her \"I'm sorry its just no working out for us...I think we should break up...\" then move on. End of the day, the guy didn't even touch her but she destroyed herself. GG"},{"id":124952,"gallery_id":78960,"poster":{"id":1168107,"username":"getmeoutehere7382","slug":"getmeoutehere7382","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1496254220,"body":"NTR fetish?is that even a word?"},{"id":111745,"gallery_id":78960,"poster":{"id":976271,"username":"CC EMIYA","slug":"cc-emiya","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1492544778,"body":"\n\nI usually don't mind NTR but it turns out pretty shitty when you make the guy accept to raise a baby that isn't even his and he also has to support both the woman and the baby financially while the real father don't do anything and the girl keeps being a cheap whore who fucks other men,if that shit happened to you in real life,I seriously doubt that you would like the situation or be turned on by it.....\n\n*Sigh* Why don't the NTR authors try to be a little bit original an make the MC beat the shit out of the guy(and in this case and some others, the girl too) and just dump the bitch or make him go crazy and kill everyone? but nope, they prefer to followed the generic route... Of course this hentai doesn't have just bad points, the art is good, but that's it."},{"id":42959,"gallery_id":78960,"poster":{"id":204542,"username":"The Mighty Trump is Alright","slug":"the-mighty-trump-is-alright","avatar_url":"avatars/204542.png","is_superuser":false,"is_staff":false},"post_date":1461197711,"body":"Welp, shes happy...right?"}]