[{"id":2670534,"gallery_id":79655,"poster":{"id":5014665,"username":"hentai sets you free","slug":"hentai-sets-you-free","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1659125686,"body":"Read my comments from the bottom up, there's a character limit I had to navigate, so otherwise you'll get mixed up."},{"id":2670531,"gallery_id":79655,"poster":{"id":5014665,"username":"hentai sets you free","slug":"hentai-sets-you-free","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1659125550,"body":"Lastly, and this one isn't vanilla, consider skipping it even here in the comments, this one has kidnapping, rape, and another twist which I won't spoil. Actually you probably won't bother translating it, so it is \"she was kidnapped and raped for weeks, but then she was abandoned for another two weeks. She survived by eating a person.\" Yikes.\n\nAnd annoyingly, nhentai anti-spam is making me wait a whole 2 minutes before commenting this."},{"id":2670529,"gallery_id":79655,"poster":{"id":5014665,"username":"hentai sets you free","slug":"hentai-sets-you-free","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1659125420,"body":"Correction, #7 and #8 are actually 3rd and 2!d from last, I got the order wrong. Bite me, I'm on mobile. Well the real #7 is a salaryman coming back to his hometown for a festival. His friends try to set him up by hitting on a cute girl so he can save the day, but the cute girl beats the shit outta them and makes him stick with her during the festival (and I quote: 'or I can stab you'). This leads to that, they bang, and at the end he has to lie that he remembered who she was so she doesn't kill him. He is subjugated.\nreal #8 is a training manga artist who's likely going to debut soon and leave his cute sensei. \"I don't want to leave you,\" \"If you leave me I'll quit drawing entirely, I wonder if I'll ever fit back in,\" \"maybe you can be my assistant wherever I am hired...\" At the end, he's saying to his agent that he slept in on the day of the press release, sorry, and he makes a comment about how his wife influenced his style. Cute, happy ending.\nThen we reach the one I'd said was #7."},{"id":2670524,"gallery_id":79655,"poster":{"id":5014665,"username":"hentai sets you free","slug":"hentai-sets-you-free","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1659124968,"body":"[continued] And that one has a happy ever after photo. [Wait, I messed up, this will be out of order!] #7 is another girl getting love advice (but she has a crush), and getting similar advice. The difference is that the advisor here is wrong. So she imagines the sex they'll have, and then is surprised when he asks her to go to the amusement park with her. ofc she says yes.\n#8? Aliens. She's an alien who is trying to collect a sperm sample for artificial insemination, but seeing that contact is imminent doing things without permission is a no go. She manages to get a sample after badgering him and explaining things, but then he says \"you promised me a reward, you don't get to leave yet\" and they go at it. Fast forward six years when contact is officially made and the TV mentions a \"proof of friendship\" between the aliens and humans, and he sees a little girl with an awful sense of style that he recognizes. Ms. Alien walks up behind them, \"that's our daughter\". "},{"id":2670515,"gallery_id":79655,"poster":{"id":5014665,"username":"hentai sets you free","slug":"hentai-sets-you-free","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1659124446,"body":"While it's not translations, I used a little Google-fu and turns out all of them are fairly vanilla. Except for the last one. I didn't translate the first two, but #3 is \"guy with magical foresight powers foresees the sex that he's about to have with this girl who likes him, while at a drinking party with her.\" #4 is a \"happy birthday\" ;) from two sisters. #5 is another case of two sisters, but the story is that the guy was like \"when I come back from college I'll marry one of you\" but they all can't decide so ... (And the lecture hall scene is talking about how Japan wasn't ready for polagamy legalization when it happened, 10 years ago, lol)   #6 is about a romantically unlucky girl who just got dumped, her hugely \"successful\" roommate who advises her that \"the secret is sex/fucking\" and that the childhood friend who often teases her at her job is likely her last shot at love. So she lies about her apartment being destroyed, and having nowhere to go, gets in his place, ... "}]