[{"id":1507946,"gallery_id":81254,"poster":{"id":3687431,"username":"Tacitus Kilgore","slug":"tacitus-kilgore","avatar_url":"avatars/3687431.png?_=51c5617053b6ed6d","is_superuser":false,"is_staff":false},"post_date":1610870215,"body":"I hate this too but mmmm, the rant :3"},{"id":1507940,"gallery_id":81254,"poster":{"id":3687431,"username":"Tacitus Kilgore","slug":"tacitus-kilgore","avatar_url":"avatars/3687431.png?_=51c5617053b6ed6d","is_superuser":false,"is_staff":false},"post_date":1610870095,"body":"Mmmm, long rant comments :3"},{"id":1198309,"gallery_id":81254,"poster":{"id":2564825,"username":"BZo1480","slug":"bzo1480","avatar_url":"avatars/2564825.png?_=3ff4cbfcb1167fd4","is_superuser":false,"is_staff":false},"post_date":1599528084,"body":" She's very much lying and knows it, but I think she's lying to herself. The fact that Haru gave her the silent treatment the entire time and then didn't do anything to stop her from trying to seduce him like he did earlier on the porch shows that, IMO, his love for her is pretty much dead and even having sex with her won't bring it back. What Onee-san  says about love and claiming that it's the truth feels like she's trying to convince herself that it's the truth, but her tears give away that she doesn't believe it deep down and she knows her relationship with Haru is damaged and probably can't be repaired."},{"id":879996,"gallery_id":81254,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1555744977,"body":"To most people sex is a very intimate action thats reserved for special people not an animal instinct. A very important aspect of love is Sacrifice, so when she says she loves that guy I don’t know how she can show him that he is loved. If I were the guy and I truly loved her, I would simply have a platonic relationship with the girl for a while until she changes her attitude towards sex. Her commitment to doing so will prove it."},{"id":141313,"gallery_id":81254,"poster":{"id":609194,"username":"LegendX","slug":"legendx","avatar_url":"avatars/609194.png","is_superuser":false,"is_staff":false},"post_date":1500219121,"body":"Now that I think about it rather then a one shot this story feels like it's a sequel to another story going with hentai logic she was probably raped, mindbroken  and became a sex addict previously to this story."},{"id":141312,"gallery_id":81254,"poster":{"id":609194,"username":"LegendX","slug":"legendx","avatar_url":"avatars/609194.png","is_superuser":false,"is_staff":false},"post_date":1500218950,"body":"Been awhile since I read this one still feel bad for the male. In the end she has tears in her eye's while making excuses about boredom to the mc which shows that she knows what she's doing is bogus."},{"id":134350,"gallery_id":81254,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1498620296,"body":"There are two different points of view in this story. From her pov what she does is nothing special, from his point of view what she does heartbroke him (he loves her) and left him disappointed. Reminds me of another story."}]