[{"id":2229871,"gallery_id":81668,"poster":{"id":1863847,"username":"orokaana","slug":"orokaana","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1640796528,"body":"i dont know why i feel unhappy with chinami story, i dont even fazed after reading the most fucked up NTRs but\n\nchinami, konushi, kano bana... same things happens and i felt the same\n\nis it because the girl dont go full degenerate and the main male have good compassion? i have read camellia and im fascinated with strong girl, these girls love pleasure but they dont lost themselves entirely and their loved ones doesnt give up, it just missed camellia because she doesnt have love interest\n\nmaybe im just jealous"},{"id":1655723,"gallery_id":81668,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1617362817,"body":"Rereading the story, Chinami is a little hard to pin down. She accepts a date with the captain but stands him up because she wants to be with Kazuya. I mean she invites him in, makes him take a shower, and purposefully walks in on him in the shower. Then she willingly has sex with the team, I guess she’s feeling bad for standing up the captain and also wants Kazuya on the team. Then she gets caught. It’s weird how she gets everything to go her way with Kazuya just by ordering him, there’s never a moment where she has to reckon with her choices. It’s a long series of chapters so felt they could have had that in there. But other than that, this is a great read, love how weirdly wholesome it was, and the senpai and team members supporting them in the end lol."},{"id":1655706,"gallery_id":81668,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1617361540,"body":"At first, the fourth story where Haruka has sex with Jyunko rubbed me the wrong way. The whole time she’s talking about having had sex with Mitsuo in graphic detail, her sister’s boyfriend. But then instant karma where Jyunko gets easily taken away by the sister. That had me rolling in stitches. If not for that ending, I’d have disliked the story but now I really enjoyed it."},{"id":1655698,"gallery_id":81668,"poster":{"id":3419092,"username":"zikakuto","slug":"zikakuto","avatar_url":"avatars/3419092.png?_=447dcb06b77e5440","is_superuser":false,"is_staff":false},"post_date":1617361274,"body":"I know what you mean. Some chapters and pages look great. I noticed how often in many hentai tankouban the first few chapters are the best in terms of art, but the later and final chapters have an evident dip in quality."},{"id":64685,"gallery_id":81668,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1475275941,"body":"Graphically, I’m at a loss, there are some pages that look amateurish, while some other pages look truly masterful and show real knowledge of good and arousing drawing art. I didn’t think I’d see those two syles mix like that in a single manga... O_o"},{"id":64684,"gallery_id":81668,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1475275195,"body":"Why when they call a girl an idol in hentai do they mean cumdump? O_o"}]