[{"id":674136,"gallery_id":86066,"poster":{"id":1716081,"username":"FireLips","slug":"firelips","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1535886328,"body":"So even takeda sensei accept that shit, well for me I going to see aki sensei in a more vanilla situation! \nhttps://nhentai.net/g/243700/172/"},{"id":674122,"gallery_id":86066,"poster":{"id":1716081,"username":"FireLips","slug":"firelips","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1535884165,"body":"It is exciting but I can't accept Aki sensei treat like that, fallen to Cum dumpster!! I admitly hate that doujinshi, even if it is my guilty shit pleasure!! Nobody except me had comments that Chapt, it show should how much people dislike those type of unreal situation even if that fat guy had supposly mind control power. Well actually Maken ki is shit so no fans at all. But i still like some girls in it. "},{"id":674110,"gallery_id":86066,"poster":{"id":1716081,"username":"FireLips","slug":"firelips","avatar_url":"avatars/blank.png","is_superuser":false,"is_staff":false},"post_date":1535883041,"body":"I enjoy Aki getting fucked by some random guys, it is so exciting and frustating. The authors drawing is so erotic for both the doujinshi and anime/manga. But the anime is so shit, I didn't watch it, only the fan service part but I can see how shit it is. I am in love with Aki so actually seeing her becoming slut to dicks make me so enraged. Especially when a ugly guy has the power to make her slut. Make sense story wise but I would have prefer a pretty boy so I could imagine me more. To bad that the author is maybe a fat ugly man. So enraged that true autbor can't put sex scene, seriously who care about fan service?? I want to see the Mc bangs the girls, especially Aki sensei, I mean it could had 2 twice, damn it is so enraging! Seriously aki at 12 is bae, we only saw her like 30s but she has already big breasts, Would had smashed her at 12!! How could she still stay a virgin?? I mean actually every girls in it is approximatly virgin. They are made for the Mc, which is why it is shit."}]