[{"id":2263244,"gallery_id":96871,"poster":{"id":3423516,"username":"user_A_exist","slug":"user_a_exist","avatar_url":"avatars/3423516.png?_=abb022accdee2e90","is_superuser":false,"is_staff":false},"post_date":1642126255,"body":"Owkwkwkwk happy ending ndasmu cok 🤣"},{"id":2211216,"gallery_id":96871,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1640099898,"body":"Also to the old commenter that thinks the idiot Male MC will go for lolis once Yandere Flatty get's pregnant! No I don't think so, even if pregnant, I doubt her bust size will get any bigger to noticeable (have you seen how this artist draws pregnant flat chest's!) so naw. If Yandere smart she'll start getting him to forget the Female MC till he only sees any breast size past (I see if the two have a daughter and she gets \"lucky\" in the bust department in puberty his \"PTSD\" kicking in and him treating her like shit till she \"reduces their sizes\" like a nutjob! Seeing that Yandere is filthy rich! It shouldn't be hard to do....or force) I will say love the degeneration for the Female MC, she might have recovered if Male MC wasn't a huge naive idiot (which she was right to call him at the end) and thought with his head over his emotions....but nope, he thought 100% with his emotions and it burned im hard (thinking after a year of NC after that, she would want him back....SERIOUSLY?)"},{"id":2211204,"gallery_id":96871,"poster":{"id":1595243,"username":"LordCellofEarth9","slug":"lordcellofearth9","avatar_url":"avatars/1595243.png","is_superuser":false,"is_staff":false},"post_date":1640099524,"body":"I'll say this \"Evil always wins.... because Good is dumb!\" Seriously the only reason everything bad happened to the Male MC and Female MC was because they didn't care to think of the consequences of their actions (Female MC never concluding for a smart girl that all those \"recordings\" would come back to bite her in the ass! And Male MC for being a dumbass, such as why Flatty even had that DVD and showed him, or why he assumed after what he did and what I guessed a year of NC with Female MC that she would still be the innocent girl he remembered and would take him back! I'm sure she was made aware he was coming and wanted to hurt him as much as he hurt her! I'd assume the \"ring money\" amount was larger then that and she lied just to hurt him more). Good story none the less, largely cause it showed NTR logic at it's worse and that's not a bad thing since the point seems to be that Evil only one cause \"good was literally stupid\" as NTR logic only works because of that! LOL"},{"id":2087105,"gallery_id":96871,"poster":{"id":1740560,"username":"mayday69","slug":"mayday69","avatar_url":"avatars/1740560.png","is_superuser":false,"is_staff":false},"post_date":1634452844,"body":"Satisfyingly vanilla story for the content. Love flat yandere girls, wish it showed her slowly seducing MC while the hoe ruined herself "},{"id":1617616,"gallery_id":96871,"poster":{"id":3840658,"username":"Dip1🦇$यु","slug":"dip1-y","avatar_url":"avatars/3840658.png?_=939a2b2af792210b","is_superuser":false,"is_staff":false},"post_date":1615704340,"body":"\"good guys lose,and bad guys win\" sounds like कलयुग। \nM9raL of the story- \"Trust\" is importance jhuf hbgg hxh wuw \n(If the boy had trusted her girl then shE wouldn't have turned into a 🐖 slut."},{"id":1260567,"gallery_id":96871,"poster":{"id":1277167,"username":"KingMarkus22","slug":"kingmarkus22","avatar_url":"avatars/1277167.png?_=c9750dc2b98d16ac","is_superuser":false,"is_staff":false},"post_date":1602214664,"body":"Also would have been better if Yandere chick got her comeuppance in some ways like once she got pregnant her tits got big and he flashed back to her"},{"id":1260562,"gallery_id":96871,"poster":{"id":1277167,"username":"KingMarkus22","slug":"kingmarkus22","avatar_url":"avatars/1277167.png?_=c9750dc2b98d16ac","is_superuser":false,"is_staff":false},"post_date":1602214503,"body":"If there’s one thing I like it’s a good story. And this was good we got the story from all sides, we got the slow descent, all with a conclusion, and a lesson at the end. Sometimes good guys don’t win and life is shit, ten out of ten would read again.  P.S. love the Emergence ending with her old self at the end. Perfect!"},{"id":1161830,"gallery_id":96871,"poster":{"id":2935291,"username":"fenga","slug":"fenga","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1598000954,"body":"This is one hell of a story of moral degeneration, and  ゆりゆり comment had a very deep statement about the whole story that the powerful has the power to get they want and everyone will had lick their boots and joy life as it is which they did.  \"So for now, I guess it's a happy ending\" he said. I would say \"It's a fucked up happy ending.\" if I was there.  Jesus Chirst I going a sleep now,  Good Fucking Night. "},{"id":977206,"gallery_id":96871,"poster":{"id":2270091,"username":"G_800","slug":"g_800","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1563336511,"body":"Good for her, I guess? It's like anti-NTR, like a similar feeling but no one character to vent at. You want to think the guy coerced her. But, it seemed like she couldn't slide into her new life fast enough. Also, why did she like she like drinking pee so much? \n\n😆 when the guy pulls a yuuko face on pg. 73"},{"id":956548,"gallery_id":96871,"poster":{"id":1951013,"username":"Kantus12","slug":"kantus12","avatar_url":"avatars/1951013.png","is_superuser":false,"is_staff":false},"post_date":1561774518,"body":"moral of the history \nsettle for the flat cheated yandere, you will be ok \n"},{"id":937733,"gallery_id":96871,"poster":{"id":1723381,"username":"Akisina Ketchup","slug":"akisina-ketchup","avatar_url":"avatars/1723381.png","is_superuser":false,"is_staff":false},"post_date":1560358725,"body":"Good ending... To yandere"},{"id":802062,"gallery_id":96871,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1548800942,"body":"@ゆりゆり You are full of shit  that you spit everywhere from that asshole of yours passes for your mouth  faggot cocksucker lol"},{"id":740705,"gallery_id":96871,"poster":{"id":1924963,"username":"radslam","slug":"radslam","avatar_url":"avatars/1924963.png","is_superuser":false,"is_staff":false},"post_date":1543085164,"body":"Adorable story, nothing like childhood friends being in love at the end of a long journey."},{"id":665055,"gallery_id":96871,"poster":{"id":1352063,"username":"Casandraelf","slug":"casandraelf","avatar_url":"avatars/1352063.png","is_superuser":false,"is_staff":false},"post_date":1535001959,"body":"i like to think that reiko's plan worked a bit too well and, as soon as she filled out from having takayuki's kid, he instantly lost interest in her and either started diddling their kid or began molesting little girls because she broke him that bad"},{"id":385979,"gallery_id":96871,"poster":{"id":1577937,"username":"CleanFreak","slug":"cleanfreak","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1520839873,"body":"THIS FUCKING BIIIITCH!!!"},{"id":337959,"gallery_id":96871,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1513963689,"body":"@佐倉ほむら Were u born as moron or have u perfected being one in ur lifetime?"},{"id":337813,"gallery_id":96871,"poster":{"id":70104,"username":"Euphorism","slug":"euphorism","avatar_url":"avatars/70104.png","is_superuser":false,"is_staff":false},"post_date":1513927105,"body":"That was awesome!"},{"id":311500,"gallery_id":96871,"poster":{"id":1383040,"username":"DendyGamer","slug":"dendygamer","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1508254585,"body":"Shit. Dont like this."},{"id":101753,"gallery_id":96871,"poster":{"id":433530,"username":"NTR4lyfe","slug":"ntr4lyfe","avatar_url":"avatars/433530.png?_=d44a7275c7bc5feb","is_superuser":false,"is_staff":false},"post_date":1490411829,"body":"\"Haha, Life sure is crazy. The good guys lose, and the bad guys win. But it looks like she's happy at least. So for now, I guess it's a happy ending!\" Word. That's something to live by. \"Right\" is not a might that anybody can freely wield and expect things to change. It's always been \"might makes right\". History have shown and proven it, time and time again. Change and good/bad things doesn't just simply fall upon your lap. You gotta go out and make, take, and grasp it for yourself. Those in power that utilizes, takes advantage, or even downright abuse their might makes all the rules, while the people who are below will always be held down by it. But sometimes it don't matter for the people at the bottom. As long as they \"happily\" live out their lives, right? The pursuit of \"happiness\", \"love\", and the \"dream\". Even if it was perpetual lies spun by those in power and those who tried to deny their own pitiful existence/fate with something more grandeur just waiting around the corner."},{"id":66570,"gallery_id":96871,"poster":{"id":294541,"username":"zenzen77","slug":"zenzen77","avatar_url":"avatars/294541.png","is_superuser":false,"is_staff":false},"post_date":1476261891,"body":"Wha t. The. Shit......."}]