[{"id":2316085,"gallery_id":97084,"poster":{"id":4130110,"username":"Imperial Commissar","slug":"imperial-commissar","avatar_url":"avatars/4130110.png?_=87703ba0156e0181","is_superuser":false,"is_staff":false},"post_date":1644178524,"body":"“Bro helps another Bro out by exposing a Hoe.”"},{"id":2316080,"gallery_id":97084,"poster":{"id":4130110,"username":"Imperial Commissar","slug":"imperial-commissar","avatar_url":"avatars/4130110.png?_=87703ba0156e0181","is_superuser":false,"is_staff":false},"post_date":1644178373,"body":"This doesn’t even feel like NTR anymore, I applaud the Jock and the MC. The Jock enforced how things are and the MC accepted it and understood how it was, she’s not a girl he deserves (literally) and the Jock helped a bro out to show him that she’s not a real one. The Jock is a real G and the MC is a realist. I rate this Doujin a 10/10 for having bro code."},{"id":2308161,"gallery_id":97084,"poster":{"id":3585505,"username":"Purple@mesty","slug":"purple-mesty","avatar_url":"avatars/3585505.png?_=934f3c360576954a","is_superuser":false,"is_staff":false},"post_date":1643859958,"body":"From readin it, I feel like the jock invited him to a reality check. He knows what they're doin and why, so I feel like he doesn't want a love to be tarnished or somethin. They all went on with their lifes and the mc is now wiser and will know when real love knocks at his door i guess. I think the girl had the same ideal here, hence her reaction. Love and lust can walk hand in hand, and still are polar opposites. Why am I takin this too seriously in the first place"},{"id":1906431,"gallery_id":97084,"poster":{"id":3588418,"username":"Stck","slug":"stck","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1627565820,"body":"This feels like half a story. It seems like the FMC actually likes the MC (she cums harder from his cock than anyone elses amd acts differently towards him) but shes trying to push him away because she feels like shes a whore. (Her reaction when he sees her is as if she didnt want him to see her that way, and she tells him not to come back because shes ashamed). It would be fun to have a sequel where they fuck more. "},{"id":806994,"gallery_id":97084,"poster":{"id":1645547,"username":"Gojii","slug":"gojii","avatar_url":"avatars/1645547.png","is_superuser":false,"is_staff":false},"post_date":1549230746,"body":"I approve of the MC not being attached to this literal thot. This is in the too mild for my over the top tastes and too degen for my vanilla tastes. Not a fan of this half-assed shit."},{"id":802068,"gallery_id":97084,"poster":{"id":237705,"username":"Metroid old account","slug":"metroid-old-account","avatar_url":"avatars/237705.png","is_superuser":false,"is_staff":false},"post_date":1548801736,"body":"@definitionofinsanity Vanillafag who likes to spew bullshit from his asshole that passes for his mouth has been detected. Stay butthurt vanillafag bitch  lol"},{"id":735262,"gallery_id":97084,"poster":{"id":1643367,"username":"ReapHoarse","slug":"reaphoarse","avatar_url":"avatars/1643367.png","is_superuser":false,"is_staff":false},"post_date":1542452076,"body":"Ohohoho! An MC that participates a gangbang, then ditches the girl."},{"id":713188,"gallery_id":97084,"poster":{"id":318770,"username":"EyesButNoRutherford","slug":"eyesbutnorutherford","avatar_url":"avatars/318770.png","is_superuser":false,"is_staff":false},"post_date":1539819836,"body":"So many people asking for a sequel. this story does not need one."},{"id":323494,"gallery_id":97084,"poster":{"id":567523,"username":"Hentailicker94","slug":"hentailicker94","avatar_url":"avatars/567523.png","is_superuser":false,"is_staff":false},"post_date":1510805060,"body":"That was a bit sad. Yeah, we really needed a sequel to see the real reason behind this. ^^"},{"id":304531,"gallery_id":97084,"poster":{"id":1322709,"username":"BJDMJ","slug":"bjdmj","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1506840880,"body":"This needs a sequel. At least the mc is not a beta cuck."},{"id":166709,"gallery_id":97084,"poster":{"id":759740,"username":"KaynemPro","slug":"kaynempro","avatar_url":"avatars/pastamania.png","is_superuser":false,"is_staff":false},"post_date":1505707116,"body":"I like this, not some shitty male MC who still digs and accepts her girl when she clearly is a SLUT before, during, and after they started dating. FUCK YOU NTR FAGGOTS"},{"id":158547,"gallery_id":97084,"poster":{"id":919504,"username":"zeph tinder","slug":"zeph-tinder","avatar_url":"avatars/919504.png?_=c99ba03cb444ff1d","is_superuser":false,"is_staff":false},"post_date":1503946885,"body":"nice choice, boyo... but it really is true: most of our likes are just the desire to fuck once or twice."},{"id":154616,"gallery_id":97084,"poster":{"id":971589,"username":"ArmpitEnjoyer","slug":"armpitenjoyer","avatar_url":"avatars/971589.png","is_superuser":false,"is_staff":false},"post_date":1503130325,"body":"Good choice my man "},{"id":135226,"gallery_id":97084,"poster":{"id":769254,"username":"definitionofinsanity","slug":"definitionofinsanity","avatar_url":"avatars/769254.png","is_superuser":false,"is_staff":false},"post_date":1498824729,"body":"Troncol actually brings up a good point. This was a deconstruction of netorare, really. Instead of a descent into depravity, degeneracy and lust it's basically a netorare cockblock - neto-chemo for the cancer that is that genre. And what's interesting is that the girl seems interested in the MC but knew that because she was such a huge slut that it could never work out (or she didn't want to put him through that). Her tsundere attitude and panic during the sex came across more of \"Not like this/I didn't want you to find out\" than disdain or disgust. Kinda a downer ending in a way, but because of the unconventional ending (and the murder of netorare vibes in its crib), I'm digging this manga."},{"id":132979,"gallery_id":97084,"poster":{"id":609194,"username":"LegendX","slug":"legendx","avatar_url":"avatars/609194.png","is_superuser":false,"is_staff":false},"post_date":1498292952,"body":"Hmm the way I see it this one's a bit sub. Mc does like the girl and from a few panels  it seems the girl also has interest in mc for some reason who knows maybe he's the first guy that's actually confessed to her instead of sleeping with her or something. Anyways after the confession she looks back and after the sex she tells him not to come back. Why? Because he the one person she doesn't want to see her like that this is even more obvious when she tries to struggle when she realizes he's there. Even in the end the guy has to lie to himself to get over her but in the end he's still stuck thinking about her and what she's doing."},{"id":102795,"gallery_id":97084,"poster":{"id":983834,"username":"Yato.abcdefg","slug":"yato-abcdefg","avatar_url":"avatars/983834.png","is_superuser":false,"is_staff":false},"post_date":1490602680,"body":"It would be really nice if this was a vanilla story :("},{"id":95024,"gallery_id":97084,"poster":{"id":1004563,"username":"Hentai97","slug":"hentai97","avatar_url":"avatars/1004563.png","is_superuser":false,"is_staff":false},"post_date":1488109104,"body":"Cant believe i actually got a lesson from a hentai !!\r\nActually love the fact that the netorare element was somewhat destroyed and the boy did not remain infatuated with her."},{"id":93448,"gallery_id":97084,"poster":{"id":43428,"username":"AkitoH","slug":"akitoh","avatar_url":"avatars/43428.png","is_superuser":false,"is_staff":false},"post_date":1487484874,"body":"Of all the ones I read by Umezawa today, this one was so bittersweet. I get where the MC is coming from in this case. \"Falling for\" a slut is a difficult thing to process, especially when you don't even realize. At least he got closure in the end. Even has a good lesson coming out of it. What we think to be love often times is just lust and nothing more. Her rejection seemed very hypocritical though. All of them are there to satisfy their needs, so what makes him so different that she has to push him away and tell him to not come back? What about him pisses her off so much? Why do I have so many questions off of a hentai one-shot? Find out on the next episode of Dragon Ball ZEEEEE (I had to....I'm sorry)"},{"id":93323,"gallery_id":97084,"poster":{"id":714946,"username":"Troncol","slug":"troncol","avatar_url":"avatars/714946.png","is_superuser":false,"is_staff":false},"post_date":1487447484,"body":"If anything, I would consider this a deconstruction of netorare. The guy likes the girl but finds out she's a slut f*cking tons of other guys. But it's not like she's mind broken or the guys are malicious: they're all f*cking in mutual agreement because they're enjoying themselves. The guy also realizes that he never really loved the girl, but was just sexually attracted to her. He has the opportunity to go back to her, but decides it isn't worth his time and let it go of his affection gracefully..."},{"id":72206,"gallery_id":97084,"poster":{"id":491385,"username":"Ketchup","slug":"ketchup","avatar_url":"avatars/491385.png","is_superuser":false,"is_staff":false},"post_date":1479126876,"body":"lol nice story"},{"id":63382,"gallery_id":97084,"poster":{"id":732603,"username":"Tristan182","slug":"tristan182","avatar_url":"avatars/732603.png?_=eedd23ca5af4c68b","is_superuser":false,"is_staff":false},"post_date":1474531657,"body":"Well at least he got over her slutty ass :D"},{"id":51067,"gallery_id":97084,"poster":{"id":489211,"username":"perverted man","slug":"perverted-man","avatar_url":"avatars/489211.png","is_superuser":false,"is_staff":false},"post_date":1467615387,"body":"That a tough way to get over your first love bro, tough way indeed."},{"id":37910,"gallery_id":97084,"poster":{"id":148259,"username":"Pocketknife","slug":"pocketknife","avatar_url":"avatars/148259.png?_=87bb450aaab5b93e","is_superuser":false,"is_staff":false},"post_date":1454656745,"body":"Kinda suck for the guy, but I couldn't n blame her to has huge sexual desire."}]