[{"id":2102971,"gallery_id":99030,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1635110955,"body":"I know that I should post this on MAL, reddit or some other site but instead I‘m posting this on my beloved hentai site on an long forgotten doujinshi of NGE, so that this little rampage of inner fellings I had after watching the final can go lost in random. Afterall, it‘s nonsense. "},{"id":2102959,"gallery_id":99030,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1635110229,"body":"The same goes for all those other media of entertainment as well. Star wars or harry potter or what ever ain't your life, go outside and see the world interact with others. Become an adult. Become an adult. Kaji, Kaworu are adults, therfore they die a premature death. Mari isn't an adult but she's able to make the transition. In the end the characters are even paired with there counterparts. To show that they reached adulthood. I thank the staff behind the new Rebuild-Series, you made four awesome movies but also transported a massage to the audiance. A massage of hope, strenght and the courage to finally reach adulthood and take responsibility for yourself and others. I never thought it could be possible after the third movie but NGE ascended over itself. Saraba Neon Genesis Evangelion, and now move forward."},{"id":2102949,"gallery_id":99030,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1635109832,"body":"The message of NGE is highly positive but instead the only wanted parts the drama. The massage of NGE is it to move on, instead the characters remain eternally 14 years old. The used a series that was clearly anti-escapistic in nature to flee into an other world. They looked upon it's surface but not under it's layers. The last ending of the final is therfore a ending directly directed at us the watchers and fans. The symbols, battles and mystics signs doesn't matter. They're only requisites in a movie production. It's just an anime, only an anime. It's not our lives. It entertains us, it helps us and it gives us advises but it's only a mixture of colour and paper and animation, produced by others."},{"id":2102946,"gallery_id":99030,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1635109624,"body":"Ironicly NGE became over the decades one of the prime speciesism of such escapism. Thousends of doujinshi, manga, commercials... NGE is one of the most servely commercialisated anime serie of our times. Still, we always struggle to get further. We long for a Happy Endless and retelling of the old story. But we wouldn't go further. What happens with Shinji, Rei, Asuka and Co after all those events. How is the world developing. How did other people experience the events? No instead we are in an endless cycle of shipping and debats \"Who is best girl\" and \"And what does that mean, it's so deep\". Not as a franchaise or series (afterall it had a conclusion – twice) but as message, NGE failed."},{"id":2102940,"gallery_id":99030,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1635109424,"body":"It's no wonder that with such a toxic mindset escapism flourishes. Perpetual infantilism is praised and duplicate. Especially in the isekai-genre, where it's propaged that it's better to die and be reborn into your sweet childhood and teen years than facing your problems in the real world. When you have hit rock bottom it's unlikely that you will ever rise up again, still you can take responsibility, try your best and enjoy your surrounding. Series like \"Welcome to the NHK\" have became a rariety. Instead we have season for season 8 shows that tell us the bright stories of isekai and how nice it is to never grow up and be forever a child or teen."},{"id":2102930,"gallery_id":99030,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1635109133,"body":"But not only anime but also other forms of entertainment are transforming more and more into a kaleidoskop of escapism. Infantilism is on the rise. Childhood and teen years have to be cherished but we all have leave our crib and grow up to be adults (I mean adulthood as spiritual concept and not the mere biological process). Our fates can be happy, sad, depressing or just hollow but it's a step we all have to take. Formely adulthood was praised as something importent, that you need to obtain in order to became a full person. Often portrayed in anime shows, by characters who looked older, tried to behave like grown-ups and other things. But currently we have left that goal. We are contemplating adulthood as a mere stream of suffering, problems and responsibility. "},{"id":2102918,"gallery_id":99030,"poster":{"id":3358169,"username":"Feuerteufel","slug":"feuerteufel","avatar_url":"avatars/3358169.png?_=e59dd767624caeb1","is_superuser":false,"is_staff":false},"post_date":1635108727,"body":"NGE is the Star Wars or Harry Potter of anime. Overhyped, -interpreted and -exhilarated like literally no other anime series and still it manages to deliver. To deliver a massage. The first ending delivered a message of self love, self-awareness and reflection. The second one was way more nihilistic in tone and addressed the inability of the fans to accept a happy ending. The last one mixed all those different endings and gave them a new spin. A spin made for our current world. We don't run away anymore from our problems, no, we hide from them in our sweet little fantasy worlds. As time passes we increasingly became a society of escapism. And anime has became a very strong source of escapism."}]